{"East Harbor Seafood Palace": [], "Yun Nan Flavor Garden": [], "Grand Sichuan House": [["Rob A.", "This is the best Chinese food in Bay Ridge.This is not the same old Americanized fast food that you'll find everywhere. It's different and higher quality. I won't claim that it's authentic as I am not the expert on what that would be, but it's quality ingredients, and good flavor. A lot of spice. (This place also makes that General Tso fast food crap, but it isn't as good here as other restaurants so maybe go somewhere else if you just want sesame chicken).I've tried a good amount of the menu here. My favorite dishes include the Dan Dan noodles, and the soup dumplings in red oil. Anything in that red oil is going to be good. I'll generally start with those and then add to the order. The pork belly and cucumber with garlic is pretty popular here as well.Price wise this place is pretty good too. The problem is that stuff is so delicious that I tend to order a lot and it adds up quickly. So while the prices are in line with the rest of the neighborhood, I always end up spending more here (the reviewer that called these manhattan prices was way off base)."], ["Catwoman Y.", "Wanted to have Chinese food, we went there last Saturday coz it seems it has the highest review in that neighborhood . But as a Chinese, i can tell you the truth, the Chinese food not authentic at all! It's just home made dishes, put whatever veggies or materials as they want, quite disappointing. My bf as an American, felt the food was suck as well. Plus the price is the same as in ManhattanThe owner and waiters were wrapping some fortune cookies at a table in dinning area, talking loud.Worst Chinese food had in \"restaurant\" in the city! The food not worth the price!"], ["Patrick D.", "There isn't a better a Sichuan restaurant in the NYC & surrounding area.Been eating here for 10+ years - consistently awesome."], ["Amanda H.", "Some friends and I didn't feel like waiting in line at Mister Hot Pot or one of the Sunset Park dim sum places, so opted for sichuan instead. So glad we did. It seems like they do a lot of takeout and delivery orders, so seating wasn't a problem, and we didn't feel rushed. Everything we ordered was delicious -- I would absolutely recommend the soft shell crab. The photos look intimidating, but despite the overload of chilis, it was the perfect amount of tingly, numbing spice. Aside from that, everything was solid -- the eggplant in garlic sauce was a personal favorite (though one friend thought it was on the mushy side). The dining room is pretty bland, but the staff was quick and friendly. Overall, great experience."], ["Christine C.", "Solid Szechuan food in Bay Bridge! The place may look unassuming, but if you want authentic Szechuan, this place is it. Most of the dishes are flavorful and spicy so make sure you can handle the heat. the Dan Dan noodles are the best and probably cheapest thing on the menu. The mapo tofu is also great and always a favorite. I tried the whole fish with garlic and scallions last time and it was a good, milder counterpart to the other spicy dishes. Consistently delicious!On a side note, it's always very hot inside the restaurant so if you tend to overheat, wear a t-shirt!"], ["Fan V.", "I finally got the chance to try Grand Sichuan after all of the reviews/advertisements I saw. I had an order of Dan Dan noodles, spicy soft shell crab, and shrimp dumplings in red oil. My favorite, which I would order again was their soft shell crab dish although it was drenched in oil (fried then sautéed). The noodles & dumplings were just okay. Slightly bland, surprisingly, since they're known for their spicy dishes. One thing, I really like about this place is they DO NOT overload on peppercorn like other Sichuan restaurants. I'm rating this place 3.5 stars because I wasn't too pleased with their shrimp dumplings & Dan Dan noodles. Service was acceptable although they told us we couldn't spilt the bill between two cards. (Strange b/c it was a decent amount). Would I return? Most definitely. Next time I will try one of their spicy hot pot fish dish."], ["Julie T.", "Very good food & service I think what is a more authentic Chinese menu than others but I'm sorry; I still prefer 86 Noodles, which also has a much nicer atmosphere."], ["Sol C.", "Grand Sichuan House serves some damn good food. Delicious, in fact. We ordered a whole lot and each dish was perfection.For appetizers, we tried the wontons in red oil, the Chengdu dumplings in red oil, and the Sichuan dan dan noodles. Both wontons and dumplings were slippery and juicy covered in the spicy oil and the noodles were perfect - just a slight coating of heat mixed with starchy noodles, minced pork and some greens.For entrees, we had the fantastic cumin lamb, served over a bed of cooked onions and cilantro. So much flavor. We also had the green beans with minced pork, which was better than any green bean dish I've had at a Chinese restaurant before. It was nice too because both the lamb and the green beans were not spicy, which we were thrilled about because our third entree - the mapo tofu - was spicy as hell and needed to be balanced out. Don't get me wrong, though, we loved the tofu too but definitely ask for a whole lot of rice with it!Fantastic food plus good, quick service and a relatively inexpensive bill at the end of the night. What is not to love?"], ["George L.", "This place is a hole in the wall or a mom and pop restaurant but damn those it bring the quality and taste you would not expect. I wish this place was more famous but then again I like it because it is unknown to so many. However, if you are looking for some spicy food and you are in the area then head over to Grand Sichuan House for some awesome food.I went there with a few friends and we ordered the Spicy Cumin Lamb, Spicy Wontons, Dan Dan Noodles, and the Dry Sauteed Pig Intestine. Wow was I surprised but every single dish. The spicy wonton which they leave in their homemade spicy chili oil with garlic and some unknown spices left me wanting more. The spicy cumin lamb was delicious and I felt myself coming back for more every single time. I was sad when we finished it as quickly as we did. They had to keep the menu out of my hand from ordering another one. The Dry Sauteed Pig Intestine was by far the best dish of the day. They know how to clean and cook it well where it is crispy, salty, and spicy all in one. Reminding me so much of a cross between bacon and a chorizo. The Dan Dan Noodles were good and I can see why people love it so much. There was a nice coating of minced meat and spices that left me wanting more and more until it was all done.My only regret about this place is why I did not order more dishes to try. I was not disappointed and actually want to try all their dishes now. Please come here ASAP if you love spicy food and are not afraid to try new flavors and dishes.Recommendation:Dan Dan NoodlesDry Sauteed Pig IntestineSpicy Cumin LambSpicy Wonton"], ["Marisa L.", "Pretty good, although I could understand being deterred by the Ghetto menu and the decor. Dan Dan was good, interesting and different spices but salty. The spicy dumplings were also cry oily and salty. The best thing we ordered was the orange chicken and the wonton soup was a good flavor."], ["Warren N.", "Best Chinese spot in the area, hands down.I feel lucky to have this restaurant around the corner from me. If you're looking to have more of a variety of options, 8th avenue in sunset park has some great Asian restaurants. But in terms of Szechuan, this beats all.I ordered the Dan Dan noodles which was one of the best I've had. The soup dumplings were average at best, however, so I would go somewhere else if you're looking to mainly eat the soup dumplings.The guizhou chicken has been my go-to order every time I've stopped by and I recommend it to everyone. The reason I don't go as often as I do is mainly due to the price. The small dishes/appetizers are fairly cheap, but it's the entrees that are a bit pricey ($13-$25). It may not be as bad for some people, but I think it's relatively high for the area its in.Enjoy :)"], ["Bella C.", "For those that love spicy food, this place is heaven. The most true authentic Sichuan cuisine you can get on this side of the globe, when order do not go by the English translation. When in doubt check it out (with your server and the pics on the menu). If this is your first time to try true Sichuan, do explore and take the chance. After all, what is life without a little risk?"], ["Jaclyn L.", "Ohh Man!  This place is BANGING!!!! Looks are deceiving, especially when walking by it on the street, but do go inside and dine in, like we did, to really appreciate this good, authentic Chinese cuisine place!When in doubt, I usually look around and see what everyone else is ordering, but there was no doubts in my mind as to what we were going to order.Appetizer: The Dan Dan noodles, Wonton with Red OilMain Event: Pork & Crab Soup Dumplings (two separate orders)Dan Dan Noodles, as I was told, was to make me spit fire, but this was more like a sputter.  They had a nice kick to them, but made me yearn for a little more.  Perhaps next time, I would ask them to kick it up a notch.Wonton in Red Oil was really a nice surprise!  Make sure you stir the wontons around in the oil so they sop it all up, and then let them sit a bit.  The bite you will have will be more flavorful and addicting.  You'll not want to share these; it's a guarantee.Now, the soup dumplings - they were good!  Which was my favorite?  The pork for sure; they had more of that amazing broth that I was looking for when I bit into them.  They were cooked fast, unlike some other places, and there a one-bite treat.  They are filling, so don't over order.Great prices, great service, great food!  Glad to have you in the neighborhood!"], ["A M.", "Ate here tonight with my two sons and husband.  From the outside the place looks like a regular take or play but I came here after reading yelp reviews after my favorite Szechuan place closed. I was craving some serious spice. Place wasn't fancy which I like. They had a high chair for my youngest which was nice.  We ordered the aromatic spicy fish, the salt and pepper shrimp, the dry sautéed string beans with minced pork and for the kids a steamed chicken and broccoli. The fish was deliciously spicy. I would have preferred all fish but my husband liked having the tofu and veggies too. The spice was great. Couldn't feel my lips after a while which I love! The salt and pepper shrimp was so light and airy and simply delicious. The string beans were a lil salty but also great. I found a replacement Szechuan spot!We will be for sure!!!!!"], ["Anita T.", "Reasonably priced and pretty good food. Not much parking here so prepare to walk a few blocks. Located right off the 278 and before entering Staten Island. Recommendations: Spicy fish fillet / shui Zhu Yu - served hotspot style with tons of chili pepper! Flavorful broth but dangerously spicyChengdu spicy dumplings - you get about 6-7. Good dumplings with simple hot oilSpicy chicken with stir fried capsicum ( under the authentic Szechuan cooking section) - delicious and my favorite but more peppers than chicken pieces! Cold noodle - good sesame sauce noodles but just ok compared to other places, a little sweet.  Decent serving size for a 5 person group.  Soup Dumplings -- Unfortunately, definitely not their strong suit.  It was around $8 and NOT JUICY at all, seemed somewhat dry or maybe reheated.  Wouldn't waste time/ money getting them here but it's a Szechuan place, not a Shanghainese place, so I don't consider that to be their specialty.  Overall, good Szechuan place on par with flushing and Chinatown."], ["Jeannie C.", "Consistently good food.  Every time I go there, i try something new, and I've never been disappointed.  Dan dan mien is good here but I think they need to drain the water out more.  The best I've had so far are the chicken dishes.  The service could be better too...they're not very friendly..."], ["Maeve O.", "As far as delivery/takeout goes, this is the best Chinese food I've had in bay ridge-hands down. I think the easiest way to explain is that it's Chinese food that doesn't make you feel sick / bloated after eating. It's like they DIDN'T use the cheapest, most horrible ingredients available (WHUT!), using fresh ingredients instead. The Sichuan Dan Dan noodles are redonkulous and authentic (Sichuan = spicy). The string beans with pork is my fave. OH YEAH, the soup dumplings. The soup dumplings!!Their hours are a little weird for me, I usually have an early lunch and a really late dinner, so I miss them sometimes. Seamless orders are always delivered within or before the timeframe estimate. Glad you're around, Grand Sichuan House!"], ["Jason H.", "Great food, generous portions and reasonably priced! Came here with a few friends because we were all craving Sichuan food. I can't even start with favorites because every dish we got was very tasty and delicious. I highly recommend getting the cucumber wrapped with sliced pork in garlic paste.  Great appetizer to start with, it's light and flavorful even though it's not spicy. The beef tripe and chengdu aromatic fish is also a must. If you don't like fish you can get it with beef which is equally as good. We'll definitely be back for some more spicy goodness!"], ["Nicole A.", "So- after ordering from here a few more times their \"timely\" manner has been much much much better. The lady who answers the phone is never Uber friendly but whatever. Their food is very good and sometimes the specials are on the rather large side. Food is- for the most part- authentic. Will keep ordering from them."], ["Simon W.", "The food is definitely good and will go again. It's not as spicy as the other sichuan places."], ["Lex X.", "I've been to Grand Sichuan House almost 20 times since I last posted about it.  This place remains a terrific restaurant.  Rather than rehas my earlier reviews I'm going to list some of our favorites and post pictures if I have them.Sichuan wonton w Red oilSichuan spicy Dan Dan noodle Spicy Sichuan Cold Noodle - farm7.staticflickr.com/6…Chengdu spicy Dumpling - farm6.staticflickr.com/5…Boneless spare Ribs (A friend ordered this and I thought to myself \"Totally inauthentic.\"  Then I tred them and though \"Authenticity can sometimes be overrated.\"  They were great.)Duck with green beans - farm4.staticflickr.com/3…Braised Chili Beef - farm8.staticflickr.com/7…Stir this!  There's a sprinkling of very hot pepper on the top of this dish which needs to be mixed in.Beef w. Cumin Flavor - farm3.staticflickr.com/2…Like crispy like spicy beef french friesCumin Lamb Chicken w. spicy capsicum - farm6.staticflickr.com/5…Doubled Cooked PorkGuizhou Spicy ChickenSautéed Dry Bean Curd and Celery and pork - farm3.staticflickr.com/2…An old favorite that I first had at Spicy & Tasty in Queens.  Who knew that bean curd could taste so good?  The secret is to sautee it until it's very firm and mix it with pork so it picks up the pork's flavor.  Terrific.Cured Pork w. Garlic Shoots - farm7.staticflickr.com/6…Sautéed Fresh Sliced Pork - farm8.staticflickr.com/7…Lamb with scallion - farm8.staticflickr.com/7…Delicate but fully flavored.  A periennial favorite.Green beans with minced pork - farm6.staticflickr.com/5…Broccoli w. Garlic Sauce - farm8.staticflickr.com/7…Even the pickled cabbage is good. - farm9.staticflickr.com/8…"], ["Hannah C.", "I went into this place once about a year ago because I was in the area, grabbed some noodle soup take-out and brought it home. It was really good, but since it's a couple train stops away from me I kinda forgot it was there.I went back a few weeks ago for dinner and could not believe how good everything on the menu looked! I ordered sichuan wontons in hot oil and they were so addictive. I ordered a stewed beef noodle soup which was amazing. Also I'm so happy to find out that they have hot pot. I really can't wait to go back, definitely a hidden gem in Bay Ridge!Also -- Great portions and great prices!"], ["Cherry S.", "This place has delicious, and most importantly, clean-tasting food.Get the Guizhou Spicy Chicken.  Yummers...!"], ["Linh L.", "Was craving for some spice and did some research on yelp! Found this place and decided to take a drive over there. Got lucky with parking and ordered a whole bunch of food to take home for family dinner!! The ladies were really nice and accommodated to our level of spiciness as i told them not everyone at home can handle spicy. We ordered the soup dumplings which were good, thicker skin so they dont pop easily! Spicy wontons, both shrimp and pork were very good! Dan dan noodles were good too! The double cooked pork was okay because the meat appeared kind of dry. Their ma po tofu was very good, but wished they put more minced beef in it. Hot and sour soup was awesome--which is a plus since its hard to find places that make good hot and sour soup. Overall, great food! I will come back to eat next time!!"], ["Patricia C.", "I like this place a lot.... It's got so many interesting dishes - way better than the standard \"chicken with broccoli combo\" or whatever. The Dan Dan noodles are delicious - the spice level is perfect.  Their soup dumplings and the Sichuan wonton in red oil are also really good choices. I wasn't crazy about this pork dish I got - thrice cooked pork or something like that - it was lots of veggies and very little sliced pork. I can't wait to try the mahpo tofu... It's gotten great reviews!"], ["Qian J.", "The high rating on this place all come from several people. It's made up. Horrible restaurant !I want to put 0 star if there's a choice! There's too much red pepper! No meat at all! Have to dig in for little tiny pieces of meat! Never come back! Not like the picture post here! Don't go to this place! It's horrible! By the way I never review a restaurant here, this place is so horrible that deserves my first review!"], ["Jenn C.", "Delivery took an hour, food was meh. Not sure I'd order from them again. Having a difficult time finding decent Chinese food in Ft. Hamilton/Bay Ridge."], ["Prateek M.", "Amazing Food!"], ["ImaYesfa N.", "Pretty good.  Ordered take out tonight and even though i ordered simple things like the chow fun and the generals chicken, they were both piping hot but lacking in some flavor.  Also they told me that they cannot omit the MSG because its already im the premade sauces.  Also had some dumplings that were good but again quite plain. They do offer brown rice which is nice."], ["Joe B.", "I had high hopes for this delivery after all the positive Yelp reviews.  I can say that it fell well short of my expectations.  We ordered  Sichuan Wonton Soup, Vegetable, Pork or Chicken Fried Rice, Vegetable, Pork or Chicken Lo Mein, Chicken with Mixed Vegetables, Beef with Mixed Vegetables, and Shredded Pork with Garlic Sauce.I will say that if you are strapped for cash it would serve the purpose of a meal.  I would personally rather have a sandwich than order from here again."], ["Myra C.", "I was craving good Chinese food and I found it. Normally my sister says she just orders from this place but we went on a little adventure to the restaurant. It's small and the walls are painted bright colors that blind you as you walk in. Also your typical Chinese restaurant decor. But don't judge a book by it's cover. The waitresses/owner was incredibly friendly. A little awkward moment when the waitress mistook me for Chinese and started speaking to me in Chinese...They have the option of American Chinese and authentic, which is really nice. I got the pork soup dumplings, which were delicious, even though there was a lack of soup. They seemed fresh and had a great ratio of meat-dumpling skin ratio. I also ordered chicken fried rice, which was amazing. It wasn't too greasy and had depth in flavor. Excellent service. The waitress was really great about re-filling my water."], ["Rjm N.", "Don't let the unassuming storefront fool you.  On the outside it looks like any other Chinese restaurant, but the food here is anything but ordinary.  I've lived in Bay Ridge for 10 years and I have passed this restaurant thousands of times and never once did it catch my eye.  Luckily I asked someone that works nearby where they ordered lunch and this place was highly recommended.  This is the real deal, authentic Sichuan goodness, spicy, flavorful, fresh, and addictive.  Don't expect the cheap prices you might be accustomed to from Chinese restaurants because this is something much much better.  Favorites are Dan Dan Noodle, Guizhou Spicy Chicken, Beef with Cumin Flavor.  I like to mix the noodles with the chicken in a large bowl and eat until I roll over and fall asleep. Have a look at all the great photos here on Yelp for more suggestions."], ["Alely S.", "I ordered a lunch special, Bak Choy, hot and spicy with Mixed Vegetables from Seamless. My order came without the mixed vegetables and no hot and spicy. All I got was flavorless Bak Choy with brown rice.  I called them to tell them I didn't get my mixed vegetables that I added to my meal, she said they can't add mixed vegetables to my Bak Choy and seamless shouldn't have the option button to add mixed vegetables and then hung up me!!! Very bad customer service and flavorless food. I do not recommend!!!"], ["Bridget T.", "Just read the following Health Inspection review from May 18, 2015.....EWWW!!a816-restaurantinspectio…Sanitary Violations1) Food, food preparation area, food storage area, area used by employees or patrons, contaminated by sewage or liquid waste.2) Evidence of mice or live mice present in facility's food and/or non-food areas.3) Live roaches present in facility's food and/or non-food areas.4) Food not protected from potential source of contamination during storage, preparation, transportation, display or service.5) Facility not vermin proof. Harborage or conditions conducive to attracting vermin to the premises and/or allowing vermin to exist.6) Pesticide use not in accordance with label or applicable laws. Prohibited chemical used/stored. Open bait station used.7) Food contact surface not properly maintained.8) Plumbing not properly installed or maintained; anti-siphonage or backflow prevention device not provided where required; equipment or floor not properly drained; sewage disposal system in disrepair or not functioning properly.9) Non-food contact surface improperly constructed. Unacceptable material used. Non-food contact surface or equipment improperly maintained and/or not properly sealed, raised, spaced or movable to allow accessibility for cleaning on all sides, above and underneath the unit."], ["Mike C.", "My go-to place for Sichuan food. Very spicy and delicious. I usually order the spicy chicken, ma po tofu, and the fish fillet in chili oil. If you have been here but haven't tried the fish fillet in chili oil, you must!"], ["Lawrence R.", "Oh, my God! The Chengdu spicy and aromatic fish! Absolutely delicious...and I got 5, count 'em...five meals from the one order! I love this place!"], ["Ivana P.", "This is my go to place. I was trying to find something local after I became disappointed with chopstix. Never dined in, always order out. I must have ordered from this place at least 10 times by now and everything I've tried is amazing. Everything is really flavorful and spiced. They don't hold back on the spicy factor either, which I really like! They're decently priced as well, while giving generous portions. Definitely recommend it to try if you're looking for a new Chinese restaurant."], ["Ashley A.", "The food here is excellent; authentic and american menus are both really good. This is my \"go to\" place for Chinese food. The food isn't oily and has good flavor. The portions are a little small but its better quality than what you would get elsewhere."], ["Sandro C.", "Man, this is my favorite place ever.After discovering it next to an OTB parlor years ago, I've been sure to get my Sichuan fix cured here at least once a month.Staples include:Scallion Pancakes (Crispy, almost croissant like flakiness, very thin and delicate)Wontons in Chile Oil (Great wontons, super tasty when dipped in the chile oil)Cucumber with GarlicChong Qing Spicy ChickenCumin LambCumin BeefSpicy & Aromatic Soft Shell CrabDouble cooked porkChives with Minced PorkDuck with Spring GingerSmoked Tea DuckSpicy & Aromatic fish (it comes in a HUGE metal bowl with peanuts, tofu, cabbage and more)I love this restaurant so much that we rented it out for my rehearsal dinner. Their americanized Chinese food is also spot on."], ["Cheng Z.", "The food was really nice. I like all of our orders! One of the best Sichuan food. Love it."]], "China Express": [["Julez G.", "The prices are good, but the food is meh. The chicken fried rice only has onions and unseasoned chicken in it. Nothing else. Wtf?"], ["Luis B.", "For chinese delivery you can't get any better. Ordered many times always fast and good. I've order from all the other local spots and have been disappointed and gotten sick."], ["Milan W.", "I order delivery from this spot...they are quick and the food is great...I mostly order the shrimp and broccoli and the sweet and sour chicken...the shrimp are large and cooked perfectly...great experiences with them thus far..."], ["Ned M.", "On point food right here.Orange chicken is crack.Hot sour soup - superb.Pork fried rice - damn good.Delivery dude - very friendly.Phone lady - same."], ["Lxq Z.", "The new item from their menu named Mongolian beef or chicken are awesome .No. 1 Chinese food in Williamsburg fresh and tasty in good price!!!"], ["Lyz M.", "By far the best Chinese food in Bushwick.  The boneless spare ribs were crispy and lean and the chicken and broccoli was to fantastic and fresh. The delivery was quick and friendly."], ["Carolyn H.", "A solid 5 stars delivery place. Food at China Express is probably better and cheaper than any fancy restaurants in Williamsburg/Bushwick/Asian food hell.  It's also not super salty, sweet and heart-burn ready like the rest of the Americanized Chinese take-out places. The lady that answers the phone is very efficient., which is exactly what I want when I have to order food on the phone (and not online). This place is totally worth talking on the phone for 30 seconds."], ["Taylor R.", "I love China express! I am a big fan of Chinese food. I used to be addicted to Chinese musician, until I realized the place is filthy and disgusting. So I started ordering from here. Food is way better, friendly delivery guys, and the place is clean. Oh and did I mention it is ridiculously cheap?! This is exactly what nyc Chinese delivery should be and more!"], ["Kostya M.", "This is our new go to Chinese delivery spot. The food was delicious, service was prompt, and the prices were very reasonable.We ordered quite a feast and the total was just $35, we were satisfied with everything that was delivered! Here are some of the items we ordered:-Egg rolls - holy crap, these were amazing I wish we had ordered more.-Sweet and Sour chicken - served with the sauce on the side, usually something I don't like but their chicken was tender and the sauce was perfect-Orange chicken - My favorite dish we ordered super tender and seasoned with small pieces of orange in the sauce. so good!-Pork fried rice - again, so good! Juicy little pork bits in very good rice cooked just right-Hot and sour soup - my girlfriend loved it, saved a lot and it heated up very well-Sesame chicken - almost as good as the orange chicken, just as tender. down to personal preference-Dumplings were devoured before I could try one, that must be a good sign!Plus all the portions were generous, we had extra steamed rice, and so many packets of sauce (if you like them). I wasn't sure if the small portion was enough food, and it ended up being the perfect portion size. I'd highly recommend China Express if you're feeling like a Chinese feast at reasonable prices!"], ["K E.", "This place is so delicious! I expect take-out Chinese to be super greasy. I also expect for most places to have a single, tasteless bean curd option for vegetarians. China Express is definitely the exception! They have multiple vegetarian options and everything is freshly prepared. You even get a choice of white or brown rice. My personal favorites are the General Tso Bean Curd and Veggie Lo Mein. I love the Scallion Pancakes too - they're light and fluffy, very little grease, and come with the delectable brown sauce. The pricing here is out of this world to boot! $5.25 lunch specials everyday! You can eat-in or take-out... definitely more of a take-out environment but the restaurant does have a few booths and a counter with stools. They recently renovated and everything is new and very clean. Staff is amazing, fast delivery... can't say enough positive things! p.s Cash only!"], ["Bert B.", "Believe the hype. The prices are low and the food is fresh. The real game changer for me was the dumplings. Most Chinese delivery places give you very soggy dumplings. This restaurant on the other hand has the best I've EVER HAD."], ["Antonio G.", "Best chinese food of Brooklyn.Period."], ["Frank L.", "First off, it was hard to find places open during Hurricane Sandy, let alone places that delivered. We were so happy to find China Express, which had both things covered.We ordered sweet and sour soup, sweet and sour chicken, and kung pao beef.The size small sweet and sour soup was a little bigger than I expected. I add the chili sauce, which gave it a nice kick. The soup was super hot, which was good. I would rather wait a little to let food cool than have to reheat it. it had plenty of stuff in it-- it wasn't just broth. I would definitely get it again if I visit NY again.The small sweet and sour with white rice was the kind I don't like, where the chicken and sauce come seperate. Normally I don't like this kind, but this one was really good. Usually when they come seperate, the chicken is super greasy, but this chicken was fried well; no excess oil.My wife got the kung pao beef, which turned out to be chicken, and pork fried rice. Initially she was disappointed, but once she started eating it she enjoyed it. It also came with a pork egg roll, which I ate, dipping it into the sweet and sour chicken sauce. This is a great place to get food from. We both ate to our fill, and there was more than half the food left. Our total came to $13.50 before tip, which I thought was a phenomenal price. My wife ordered, and she thought the lady said it was $30, so it was a pleasant surprise for us."], ["Rye Y.", "Whhaaaaaat?! I went way out of my to go here based on the stellar reviews and it was totally disgusting. Everything about the food was bad. Overcooked everything, really bad quality meat, gloppy flavorless sauces. It was cheap, yes, but not worth going back to ever again."], ["Melisa D.", "Best chinese food in the area! Clean place, friendly workers, and they have fast delivery.  Food is always fresh and tasty. Try the chicken and eggplant, one of my favorite dishes."], ["Geneva C.", "This is one of the best Chinese Restraunts in Brooklyn...Kam kau need a class and lesson on cooking all over there food is gross now.Im happy I found this spot.The Lomein is great.And the shrimp fried rice and the sesame chicken and shrimp..."], ["Augie V.", "I enjoyed my brief time at China Expresss.  I ordered a Mongolian beef.  It had the little pepper beside it on the menu but it wasn't that spicy.  It fact it was pretty sweet.  So if I could turn back the hands of time I would grab one of their hot sauce bottles behind the counter.  It's a very big portion with a side of white rice.  I purchased a can of Diet Pepsi as well.  I know the aspartame is going to kill me but I did it anyway.  I'm so ashamed."], ["Mallory M.", "I have lived in Williamsburg for 4 years now and have not been able to find a good Chinese place in the hood.. until now. This place is legit. The reviews are too. Believe them. I've had the dumplings, the fried rice, chow fun, lo mein.. it's all amazing. Especially the dumplings!!! Such a game changer. The prices are low, delivery is quick (even to me - I live almost in Greenpoint) and again - THE DUMPLINGS. A++"], ["Bang R.", "Yummi food, low price and excellent service! Only thing: please put a better english speaking lady on the phone! The one you have barely understands and gets annoyed easily lol"], ["D O.", "It is amazing inexpensive Chinese food. It is the best in BK because believe me.... my boyfriend and I have been looking. They deliver to burg and they are soooo affordable. The general tso bean curd is amazing. really tasty. and crispy. my boyfriend has tried everything else and yes!! we will order from here all the time. the lunch special is only $5.25."]], "Xi'an Famous Foods": [["Jessica Y.", "I ordered myself the lamb burger and a tea from here. I've tried the other location by St. Marks and I think the tea tastes slightly different. The lamb burger was pretty tasty. It is spicy and very oily, so it's definitely a messy meal. The first bite, I only tasted the spiciness and not really the actual meat, and because of that thought it was too overpowering. But after a few more bites, I really did get to enjoy the flavor of the lamb. I wouldn't take the burger to go, mainly because the bread comes out pretty crispy and within 10 minutes, it will quickly get soft.This is a great quick place to stop by and get cheap asian food. The line isn't as crazy as the other ones, so the wait is very minimal."], ["Marc S.", "While this is one of my favorite spots to visit (I regularly trek 40 minutes from my place to visit this noodle spot),  I keep getting shoddy service. Out of the last four visits I had, three of the last visits the person preparing the meal get my order wrong.  Let me also say: my order is simple. I order soup and I ask for it to be extra spicy.  The last three visits I've gotten regular.  Not spicy at all.  Today my wife and I made the trip to green point and took our meals all the way back home and we were both disappointed.  I hope they read this and pay more attention to the tickets as they come up.  We were the only people in there today so it's not like they were busy.  They have exceptional food, but it's very easy to slip into bring an unexceptional restaurant when you're staff doesn't care.  I'm probably going to remind them while their preparing it from now on.Disappointed."], ["Valerie C.", "I was disappointed by my meal here  as I had heard great things about all of their locations before. I got spicy lamb dumplings in broth. The broth was half oil, as you can see in my photo. It was floating everywhere. The lamb meat in the dumplings just wasn't that tasty at all and it was sort of pink in places which creeped me out. The dumpling itself (or the skin of it) was super thick and just felt like a large blob of flour or whatever they are made out of. Quality of food wasn't good. Wouldn't go back despite the low prices."], ["David L.", "Awesome, delicious food! Miserable, condescending, patronizing, mocking, shaming, insulting, awful-awful service... I've been going to XFF for nearly a decade, before they expanded, when they were a just little stall in a dirty basement, and I would rather spend a couple hours going to the original location than have to deal with this miserable woman and this miserable man ever again -- what a pair of jerks! Thankfully, there are locations in Manhattan, so I can just avoid these bilious, loathsome, vile trolls."], ["Gordon C.", "By now you've heard all of the hype and hubbub surrounding Xi'an Famous Foods. It's all 100% true, including the ridiculously long line during peak times. We were fortunate enough to beat the rush this time. And while we waited for our food to be freshly prepared, we noticed just how greasy the tabletops were. Who cares? This is how they keep their cost down, right?Look, you're going to get a heaping plate/bowl of freshly hand drawn noodles, tossed in some wicked chili oil. I really love the texture of the noodles, you can't beat it! As I was chewing away, I started wondering what their noodles would taste like if prepared with a bolognese or even an alfredo. I don't think you could go wrong either way, but nothing beats the cumin lamb!"], ["Marina S.", "Came here on the opening day, and it was fantastic! I had the Pork Zha Jiang noodles (not spicy version) and they were everything I could have hoped for. Sauce was awesome and the cucumber was just the right amount of refreshing.My friend got the Spicy Cumin Lamb noodles and they were HOT. I have an extremely low tolerance for spice, but even a drop of the sauce had my mouth on fire.In any case, I'll definitely be returning now that this location is open in Greenpoint!"], ["Matt L.", "I live in Queens but was pleasantly surprised to see the bright window lit up with Xi'an on my to a Williamsburg bar.It's much cleaner and kind of just nicer than the Flushing food dungeon, and the prices seemed to reflect that because I was surprised about how much more it was. But, given their reputation and how much money is in the area, fine.Unfortunately, the food was not as good as Queens either. The noodles were good but not superlative, and the lamb was simply not hot. The spice level was fine -- I just felt like I was eating old food that was made many hours ago. Disappointing.At the end of the meal, given how much fancier the ambiance was, I wouldn't have thought it would have been too much trouble to give me a glass of water to wash the tepid garlic sauce down my throat and off my breath before seeing my friends.I was instead told though that they don't stock cups, so I couldn't have any. I'd already paid for a tea, I guess I should have saved that cup. Still, I can't endorse patronizing places that can't provide water, so I'll be withholding future business and an extra star until they fix that. Not providing water is truly penny-wise, customer foolish. And there's nothing that can wash that taste off now.I don't yelp often but it was really disappointing."], ["Yan W.", "I really hate to disagree with the \"famous chefs \"out there, but unfortunately this establishment was just good and not necessarily great.  I ordered the lamb noodles in broth and the Lamb burger, and I'll be honest, the noodles were a little bit of a disappointment. Here's why. First, the broth was okay but not really spicy enough to my liking.  I also had to add a little bit of vinegar to get it to taste. I know they are selling the fact that the noodles are handmade.  However, because this is a chain I feel that the noodles were sloppily made. It felt like the person making the noodles did not even try to make them somewhat equal sized. I would get one noodle that was as large as a napkin, and then the noodle a small is fettuccine. The highlight of my meal was the Lamberger. It was perfectly flavored.I also tried my friends cold skin noodle and that was perfect.  I also enjoy the tea that they had on hand in the chiller all of them were very good."], ["Charles D.", "What are you doing? You should be here eating spicy cumin lamb and criticizing me for yelping while eating. It's outrageous. Whatever you think will save you from this winter, you are wrong. Only Xi'an will strike the cold from your bones and save you from death's cold embrace."], ["Mr F G And Ms M S.", "We love Xi'an! It's spicy, it's oily, it has so much flavor. It's absolutely delicious! If you love spicy food, you'll love the food here. Normally we go to their original location in Flushing. For some reason the food in this location taste somewhat different than the one in Flushing. We're not saying it's bad. It's just slightly different. It's not as spicy. They definitely tone down the spice here. Well, it's still pretty damn good though. We got the cold skin noodles, the cucumber salad, & the spicy n' tingly beef noodles. The portion is pretty much the same like every other Xi'an. The service is good. The guy who took our order was polite. All total, we spent about $22 with a can of soda & a bottle of water. We really like spicy food. If you can handle spicy food just like us, ask them to make it very spicy. This place also takes credit card with a $5 minimum order. The place looks clean. The food is good. Definitely worth stopping by!"], ["Missy R.", "FIRST. The guy at the register was kinda rude.I got the spicy beef noodles N2 (i think) it tasted okay. Nothing special. My brother hyped the food too much for me. This place is just not my cup of tea."], ["James I.", "Can't even begin. Can't even. Five stars to the family. Liangpi, Jason and crew have delivered incredible products birthed out of the unique flavorings and offerings the Silk Road bestowed upon Xi'an. What does that mean? Spices and flavor profiles that have been mixed across cultures to create otherworldly dishes of comfort food. Lamb dumplings? Gamely nuggets of ground lamb along with sweet vinegar, star anise, fennel and cloves offer a slap to yo mouth that your grandma only wishes she knew how to deliver.I've been on a quest to try all of the dishes and I am just over half way there. If I had to choose a fav, it would be the pork burger + dumpling combo. But do hit up the oxtail soup on a cold winter night. And do hit up the spicy lamb cumin noodles on a hot summer day to experience nirvana. Also start sentences with \"but\" & \"and\". Buckwheat cold noodles? Classic. Get at it folks. This joint is top tier comfort."], ["Mia T.", "Great veggie dumplings-3 stars because the use styrofoam plates and disposal plastic everything. I really wish they would become just a little environmentally friendly."], ["Sarah S.", "Mind blowing! I always eat here every time I'm in Brooklyn. I always order the same thing, Ox tail noodles. My husband orders the spicy beef noodles. Both are amazingly delicious! Their teas are also great. The first time we ate here I couldn't believe how good it was and as we were leaving I saw a picture of Anthony Bourdain on the wall and thought \"ah that makes sense\". Definitely eat here! I'll be back soon!"], ["Priti R.", "If you haven't been to one before, do yourself a favor and go. The noodles are so chewy and delicious- extremely filling as well! So inexpensive - we ordered 2 appetizers and a plate of noodles for $16. And, this location takes cards! The staff is great, and it's right off the B43 or the G."], ["Kelly D.", "I stopped by here for dinner a few days ago before heading to a late night event in Greenpoint.  The restaurant was not too busy so finding a seat was not a problem.  All of the indoor seating was along the walls in a counter style format.  There is a garden in the back with picnic tables to use in nicer weather.  Ordering was quick and simple.  I ordered N1 - the cumin lamb noodles.  The lamb was tender and flavorful.  The strength of the cumin and other spices was just right as it did have a kick to it, but did not require a drink after every bite.  The noodles resemble chow fun noodles, but are slightly thicker and less slimy.  The texture of the noodles was similar to that of the outside of a dumpling.  The right amount of sauce clung to the noodles as I was able to get the flavor without feeling that it was too oily.  I liked the chrysanthemum iced tea.  The chrysanthemum flavor was strong and it was not too sweet.  Price was inexpensive since the majority of dishes were under $10 with the burgers only being around $3.  Will be back to try more dishes."], ["Carol B.", "I love this location of Xi'an Famous Foods. The staff is friendly and they always ask the level of spiciness that you want your dish. Now I can eat pretty much anything here without fear of it being too spicy!My menu favorites are the stewed pork burger, spicy cumin lamb burger, pork \"zha jiang\" hand-ripped noodles and the stewed pork hand-ripped noodles in soup. All are delicious! As they advise, you should plan on eating your noodles there (or else they'll be all clumped together by the time you get home). Luckily, this location of Xi'an has plenty of seating and counter space, so chances are there will be room for you to enjoy your eats.Service is relatively fast and the fridge is always stocked with refreshing iced tea (perfect for balancing those spicy flavors)!I'll be visiting this location of Xi'an over and over again!"], ["Alexis R.", "I have to agree with the other Yelpers who have found this location's food to taste different (and inferior) to other locations. They're always out of certain items, which they do post, but they don't seem able to keep up because they're always out of others by the time I order. I recently swapped my usual cold skin noodles (supply depleted since the afternoon but signage hadn't been updated by dinner time) for the spicy hot oil noodles. And while the hot oil is a key ingredient in that dish, so much had been added that the noodles were gloppy, slimy, and nearly inedible. I've had this dish before and even the spices seemed off, or maybe they were just drowned in oil. It's still one of the better Chinese restaurants in the area, but not on par with other locations. Definitely not worth a special trip, and that last order was one I definitely regret.The redheaded lady cashier does work very quickly to get people's orders through and I was astounded that one of the cooks yelled at her for ignoring take out orders when she was clearly bussing trays left around the restaurant. Not cool, man."], ["Kerry M.", "Wow! Hands down best Asian food ever. Small space but fast friendly service. Worth the walk. We had lamb burgers-amazing. Chrysanthemum tea was so refreshing. Cilantro salad was perfect. Everything was delicious. Would highly recommend."], ["Cook B.", "Man I love this place. I come here for lunch at least once a week and always make a point to take friends here. A1 is one of my favorites, and they have pretty much the best vegetable dumplings around.I heard that they once had a seitan sandwich on the menu. I'd love to try that, I really hope they bring it back."]], "China Restaurant": [], "Kai Feng Fu": [], "East Wind Snack Shop": [], "C And Y Chinese": [], "Lucky Eight": [["Wailana W.", "Came here for the first time to try something different from the usual Manhattan Chinatown places so yelped this highly rated place.  It's better than expected.  The waitress was funny in a strange way, leaning into me and whispering her answers as if to give me the inside scoop on the dishes I wanted to order.  Had the roast pig, Chinese squash with sliced fish and seafood fried noodles.  Not sure if these dishes are actually translated exactly this way in English on the menu because I ordered their equivalent in Chinese.  If you read Chinese, this is what the dishes are: 火肉,勝瓜班腩，海鮮炒麵. Initially, the \"half lean half fatty\" (the better way to have) roast pig was tasty, the crispy skin better than any lechon kawali I've ever had. The pieces were cut in more manageable bites but as you ate the meat with the equal portion of fat, it seemed the pork became less appealing as our brains were comprehending the amount of fat we were consuming.  We opted out of ordering rice with our meal, the new trendy thing to try stay healthy and because we also ordered noodles.  (Yeah but who are we fooling-we missed our white rice!).   Maybe if we had rice we would feel less guilty as rice seems to temper the richness of pure pork fat.  If you order the roast pork, order a bowl of rice and share it so you have some hot, fluffy stuff to offset the saltiness and fatty parts.  Less onerous to eat was the seafood fried noodles.  It was perfectly done with a generous portion of shrimp, scallop and squid over thin noodles fried crispy revealing their soft undersides.  The sauce was just the right amount and not corn starch glop like some places.  There were the right number of stems of Chinese vegetables on the plate, not the usual large \"trees\" which would overwhelm this simple noodle dish.  In Hawaii they would call this cake noodle but the noodles used here were much more delicate.  Last but not least was the Chinese squash with sliced fish.  The squash is like a large okra and often translated as Chinese okra turning some people off, but it's actually not slimey as you would imagine.  It's slightly sweet and hard to explain, refreshing.  Each bite is crunchy like a quickly sautéed squash should be but the insides retained a fresh succulence.  The fish, my food expert friend thinks is grouper or sea bass.  The meaty slices were fried in a tasty batter and stir fried with the squash and lightly sautéed onions.  Some places would throw in some \"cloud ears\", a black edible fungus but this place did not and I didn't miss it.  This dish is light but substantial and the original reason we were looking for a new Chinese restaurant to try.  They succeeded to win us over.  The gratuitous red bean dessert soup with black rice and sliced oranges were a perfect ending touch to this satisfying meal.  Oh, need to add that that our teapot was refilled by other waiters quickly giving them extra points for attentiveness.  The cost was just $40 for all this goodness!  Worth the trek if you don't live in the 8th Avenue Brooklyn Chinatown area.  Afterwards, scout out some boba or sago for dessert in this dynamic Chinese neighborhood if you have room!"], ["Elizabeth N.", "This place can be packed on a weekend night so make sure you have a reservation. We were seated in one of the many lower level rooms. Tables and seats in this restaurant are cramped. Servers are decent and fast. Ordered a bunch of things and most were pretty good. Portions here are very, very small compared to other places like East Harbor, which are huge! However this place is pretty cheap so I guess it works out. Order more dishes than you normally would in a different restaurant. Some of the dishes that were supposed to come out crispy, were not! Like their shrimp with mayo, fried squid or peking pork chops. Their lobster, fresh fish and vegetables were cooked well! Hit or miss on the dishes."], ["Leo L.", "Lucky Eight is ok.I am very familiar with Brooklyn's Chinatown, I visit often and I am always on the hunt for hidden gems. I have 2 favorite restaurants in Brooklyn's Chinatown, but Lucky eight is not one of them. I have been on the hunt for a good spot on 8th Ave that serves good roast duck, noodle soup shops, etc., but this is very hard to find. I had visited Lucky eight in hopes to find good roast duck spot locally in Brooklyn instead of traveling to Manhattans Chinatown. Luck eight's Roast duck was ok but they did not serve it over rice, which I love.Let me explain, many restaurants in Manhattans Chinatown offer Roast Duck, Roast Pork, Ribs, or chicken (3 Meats) over rice, and many times with a fried egg and vegetable on the side for under $5.00, this is the type of quick and inexpensive dish that I am looking for in Brooklyn Chinatown, but never seem to find.Lucky eight does serve Roast duck but only offer the to option to purchase Half or the Whole Duck and not over rice, which is good eats in my opinion.Now back to my experience at Luck eight, I was hoping that this was a Duck over rice spot but they didn't offer this option, nor plates as such, the only option that they offer on their menu is a dish of 3 meats, roast Duck, Roast Pork and Roast Pig for about $20, with no rice or vegetables, i don't want all this meat and I definitely didn't want to spend $20 on just one dish, i just want something quick, good and inexpensive, Lucky eight's duck is ok but they do not offer options.I will just stick with my Roast duck and noodle shops in Manhattans Chinatown.Peace."], ["Anthony P.", "Great spot to pick up some roast pork or duck over rice for lunch.  Haven't sat down to eat yet but it is on my agenda."], ["Holly C.", "The beef chow fun was okay here, but I really liked the other options with rice dishes/combos. I've heard that the roast bbq items are very good. I had a beef rice dish with spicy radish and green beans? Everyone was friendly there, and I would go back to try other dishes. The place is clean and brightly lit, and it's convenient to get to. Parking could sometimes be a problem though in the area."], ["Kevin Z.", "Great place to have a cheap meal as well as for those fancy family meal. Of course this place is that chinese restaurant that you order a simple meal w/ rice and eat it up then go. for me it's a little different. We have our family gathering here many times and spend several birthday here with their basement rooms. The food is delicious. Great for a change of scenery if you are in the area and definitely ask for their specialty dish."], ["Tracy Q.", "Mixed thoughts here.Soup was eh.Young chow fried rice amaze balls.Peking pork chops were on the money.our waitress was super high strong, and had difficulty communicating in English.The spare ribs which I thought would be banging were served cold and had zero taste.The B rating I noticed after we ate did not instill a lot of confidence in me."], ["Sharon T.", "I'm not usually one to go all the way to Brooklyn for food, but Lucky 8 does wonders.. Lucky Eight is literally a hidden treasure, cheap-looking restaurant but the food here is one of the best Chinese in New York, no doubt about that (I'm indirectly throwing Flushing & Chinatown in there). Making the extra effort is quite worth it because it is quite a walk from the subway (at least for me) and is almost at the dead end of where all the markets, stores and bakeries are. My family and I have gone out for dinner here a few times and their food and service never seems to disappoint me. The people here are super laid-back and fun and to talk to. Somehow, I love their lo mein even though there is barely anything in there. Just plain noodles soaked in soy sauce. Their Young Chow fried rice is either a hit or miss, sometimes overcooked with too much water but when it's a hit, you'll never go anywhere for fried rice again; they add all the good stuff like barbecued pork, shrimp, peas and ham--can't ask for anymore!Also, get the steak--pure, Chinese-style steak at its best! Another great dish is the Hong Kong Style lobster. They actually have live seafood tanks in front so seafood is guaranteed fresh but I totally recommend getting this if you're in a group. Their \"special\" Pride of Lucky Eight is actually not great. For a Canto restaurant, this actually tasted like something you would find in the northern part of China. The heavy fried fish smell was really, really bad and it felt like they dropped a whole canister of salt on it. As always, super long, exhausting lines, kind of on par with the Serendipity 3 wait but so worth it once you're seated."], ["Courtney Z.", "After reading the reviews I was curious to see how good their Chinese food is. My family went here for an early mother's day dinner and ordered #13 Singapore Dungeness crab: $41/2.25lb crab with shell, #8 lucky eight stir fry: $16, half order of garlic fried chicken $17, purple veggie on soup $12, three bowls of rice $2.75.At first when we walked in there was a glaring C rating, which made us all reluctant to go in but it was late so we decided to give it a try. The place is a typical Chinese food set-up, strangely there was no waiters around. It was really hard to get their attention to order or to get napkins. Unlike usual restaurants I been to, there was no soup to start with but there are peanuts to munch on. The head waiter or the manager took our order and was very knowledgeable and descriptive of the food on the menu. The food came promptly.The food was all very flavorful, so rice is a must-have. One thing to note, while eating I noticed it was all very salty and water was desperately needed."], ["Vida O.", "My favorite Chinese restaurant in this Brooklyn Chinatown. These dishes remind me of Grandma's cooking and the flavors are on point. Some of my favorites Are the pork intestines and razor clams. Shrimp with walnuts and all the seafood dishes are so good. And to top your meal off you will receive a complimentary Chinese dessert soup! It's clean compare to the other restaurants and the decor is nice and perfect for gatherings."], ["Mike C.", "One of my favorite places to eat on 8th avenue. This restaurant separates itself from most Chinese restaurants in the neighborhood through providing unique dishes and quality food. They have a good selection of seafood dishes at great prices. The restaurant can quickly get packed, but I'd say it's worth the wait."], ["Qin Z.", "pride of lucky eight is delicious , other food is good too. good service cheap prices"], ["Francisco L.", "The 3 star rating is due to its inconsistency. There are times that the dishes are well prepared. And sometimes the dishes are just normal or just meh."], ["Michelle L.", "Don't let the first floor tight area fool you! There's a lower level with lots of space!*Review based on dinner food only*Basically all Chinese restaurants serve the same dishes with just small alterations in flavor.  This is my favorite place to go for family dinners.  I'm not sure if it's just me but my lips are pretty sensitive.  Whenever the food has MSG my lips gets dried as I'm eating the food and I would constantly need to apply lip balm.  With this place, I can finish the entire meal without having dried lips!  (For those who know me, my lip balm and I never part.)Their \"GING THO GWUAT\" which is sweet and sour fried pork chops.  Here, they make it pretty well.  Flavors are just right.  Other places that I've tried either had too much vinegar or it was too sweet.  Here, the pork chops are fried nicely, they're not soggy like elsewhere.I can really go on and go about their food.  Overall, their food is a lot tastier than other places.  You can taste the \"WOK HAY\" loll sorry can't really translate that one... I think... it means they use the right about of fire? or they tossed the food in the wok really well?? LOLL Some dishes that I highly recommend:GING THO GWUAT -- sweet and sour fried pork chopsGUM WONG SHEUNG DON CHOW FAN -- egg fried rice mixed with golden raisins, scallions, salted fish, dried shrimp... very flavorful!SEE CHIEL OWW TAY GWUAT -- pan fry beef chops with black pepper sauceSHEUN YUN HEUNG GAI -- garlic chicken with fried garlic flakes (half or whole)Must try their crab, I do not know the name of it but it's just one big crab with eggy spicy orangy sauce served with mini buns, OMG dip the buns into the sauce!!! so yummy!The food are served quickly, nice and fresh.  Service is decent.   They change your plates ocassionally, give you wet napkins when needed.  Servers do value customer opinions.  You sit comfortably on the first floor or downstairs but I prefer downstairs epseically when you have a large party.  They take reservations."], ["Wilson D.", "Very disappointed at this place. Found a ROACH in their dish of roasted peanuts after I ate more than half of the plate. When the waitress came to bring me my main dish, I pointed it out to her politely. She takes a look at the plate, picks it up, and has the nerve to say to me \"I assume you don't want this anymore\" and walked away. (I kid you not, those were her exact words)She did not even say sorry or showed that she was sorry. This was just unacceptable in any restaurant. At least APOLOGIZE FOR HAVING A ROACH IN YOUR FOOD.wtf?!"], ["Kenny C.", "Not bad, but also not the greatest. It's easy enough to get a table for lunch (even on the weekend if you're early enough), and the service is adequate. The food isn't anything to write home about though. The crispy pork tasted a little stale, and the roast pork wasn't the greatest cut of meat. We also had stir fried spicy pig necks, which were tasty but the texture may not be for everyone.Another plus is the free soup that's decent and not juts overloaded with MSG. It's also really cheap! The lunch special has dishes with rice for $5.50!"], ["Lesie H.", "Favorite place of a friend, so we checked this place out. They only gave us a lunch special menu (noodle soups!); we asked for a full menu.1. Octopus appetizer - cold and chewy.2. Shrimp balls appetizer - crunchy and sweet dipping sauce.3. Scallop shrimp paste with beans - scallops are huge! Salty...4. Deep fried eggplants with shrimp - Crispy, hot, oily and salty....I have to say the decor is nice. Service is standard and the food is overall... very salty. Not really for my taste. Maybe we'll order less salty dishes next time? Verdict: needs more rice!"], ["Ari B.", "I don't normally hand out five star reviews, but Lucky Eight sure deserved it.The food here is amazing. Whether it's duck, chicken, beef, pork, fish, or anything else, every dish we had tried was delicious and left us feeling no regrets.The crispy pork was really delicious. The duck was scrumptious. The fish was fresh and succulent. And for those that care, even though it's not a big deal either way for me, the staff speaks pretty good English.I think I may have found my new favorite Chinese restaurant."], ["Coty S.", "Have you ever eaten at a Chinese restaurant and felt like you were getting the best quality vegetables available in the market?  I know, this was a first for me as well!  Just watching the staff cutting the green beans and snow peas, I wanted to ask where they got them from because they looked so fresh.  I have never seen produce that fresh on the street or in any expensive stores.  And, that is the produce you can expect to eat at Lucky Eight.From the outside, it looks like a whole-in-the-wall place with a BBQ take-away counter in the front.  But, once you enter the interior is still small but very clean and more updated than you would expect.  We did order an appetizer of the roast pork, it was decent but nothing amazing here.  The items to order here are seafood and vegetables.  They do have a photo menu for clueless *looking* folks like me.  The photos do help when you want to see how the eel and conch dishes are actually prepared, to see if they are minced or what.  There are some creative fusion items like Japanese BBQ Eel.  Which they were sold out of on our visit.  We opted for the steamed fish on top of eggplant with \"tofu egg custard.\"  The tofu was sliced and silky with chopped garlic oil drizzled over the top.  Overall, this dish was healthy and light, but not as flavorful as you would assume.My favorite was Fried Fish Cakes with chopped Gai Lan.  There was a strong ginger and garlic flavor and the gai lan was cooked perfectly, crunchy and not soggy.  I am used to eating Korean fish cakes, which are often loaded with gluten and fillers- but, these fish cakes were something new and totally different to me.  There were large pieces of fish, garlic, and scallion in every bite and it actually tasted like fish!  By far something crave-worthy and worth another visit back.Next time we will order more vegetable dishes and noodle dishes. It was hard not to run up to the table that the staff was trimming the vegetables at, grab a handful and shove it into my purse, and take off running out the door."], ["La La J.", "Definitely a traditional Chinese restaurant serving food for the hood peeps. Don't know what all the fuss is about over this place. The prices were high, the decor was non existent and the service was brusque. Food was fine but  small portions for what you paid. I don't believe rice came with any of our main dishes. Sweet and sour chicken cost about 15 bucks (say whaaaat). Tasted fine but dayum - that's expensive. Especially considering there might be at least 20 similar restaurants within a 10 block radius, many serving the same stuff but much larger portions. I also thought they closed relatively early for a weeknight. They didn't throw us out around 9p but we certainly were on the business end of a stare down when the place started clearing out LOL.  So while I didn't find a roach in my peanuts like another reviewer, this is not a 'destination' restaurant for me.  It was just ok."], ["Anh P.", "My family and I came here for dinner on a Sunday evening. The restaurant was crowded, but there was no wait ... we were seated in the basement which was actually quiet enough for us to have a conversation. We ordered: E Fu noodles with mushrooms, fishcakes with Chinese broccoli, fried garlic chicken, pan fried flounder and orange beef with broccoli. For 5 people, we were only able to eat half of each dish and the rest we packed to go. The fried garlic chicken was crispy and flavorful, but very salty! The orange beef was gingery and sweet, similar to Chinese food take out (but better). The pan fried flounder was my favorite, the fish was crunchy and not too greasy, it was topped with chunks of fish meat and sauteed bok choy, mushrooms, carrots and chives. The food was delicious and a great value. The service was attentive, but not pushy. We'll definitely be back!"], ["Pauline E.", "Honestly after being a customer for so long  at this restaurant it has disappointed me and my family today. I ordered the main 3 dishes like I always would have and today the fish is weird, now I'm not a chef so I can't differentiate between fishes. But my dad knows a lot about his food and he stated after a bite that that's a different kind of fish. So we told the waiter and he said with a smart comment that \"if it's not the type of fish you ordered then I don't know what it would be\"- meaning it had to be the type of fish we ordered. And my sister was choking on the bones because this fish had larger bones that wasn't eatable. & my dad told them once again so they took it to the back kitchen but they refused to change it . Another waiter came and my dad told him and he even agreed that it wasn't the kind of fish we ordered . & apologized. Iknow it wasn't his fault. But he wasn't rude like the other waitress. Now my dad isn't one to really complain about anything but it was for the safety of us- because my sister is young & she was told for that type of fish she can just swallow the bones because it's soft After we were done eating, my dad went to the front & complained once again & they insisted that it was the type of fish we had ordered but my dad knows that it's not the right one from experience and especially since he eats there all the time. & adding on to that he was rude about saying my dad doesn't know what he's talking about. But either way my dad is generous so he gave a $5 tip for only 3$ people even after being mad about it. Never coming again. CANT EVEN OWE UP TO THE DIFFERENT FISH THEY GIVE US. We weerent asking for money or another dish just a simple apology would have been fine ! & insulting my dad saying he doesn't know what the kinds of fish is. Crappy restaurant, they quality in food is going down hill & charged us a lot for abs. Shit"], ["Adam M.", "I am REALLY feeling Brooklyn's Chinatown...In general I dig it a lot more then Manhattan's....and the old Manhattan one is shrinking...while this one seems to be growing.  While we were wandering we noticed many restaurants completely empty.....however...this place was PACKED.   I mean PACKED..with a line..kids running around everywhere...I'm sure the fact it was Chinese New Year weekend was a big factor....but this was definitely THE place to be that night lol  and a LOT of Chinese people which is always a good sign.The atmosphere wasnt anything fancy.  Window display, HUGE tanks of fresh seafood, lots of yummy looking things around.  Tables for small groups plus big round family tables with lazy susans on them.  The place was very loud.  It seemed plenty clean enough for me..I didn't see any bugs except for the large insect-like shellfish in the tanks...which are more then excellent to me. heheWe sat down and got the menus and the menus pretty much are food porn picture books with prices lol.  We settled on wonton soup,  a fresh lobster w/ gingner and scallions and yung chow fried rice.The food came pretty quick.  The soups were good.  The wonton's were very delicate and sweet.  Yum  The Lobster was great..we saw them fish it out and carry it into the back, and it was cooked perfectly.  The meat was nice and tender, and it was pretty meaty.  The sauce was a little more scallion then ginger (I'm used to it being more ginger)..it was very good though.  The rice was good, nice and moist..the little chunks of rib in it were really good...Id def like to try their ribs next time (they looked so good in the window!).I noticed many Chinese people eating this black, VERY thick/gelatinous soup...seemingly for desert...I am curious as to what this is.The service was better then Manhattan chinatown.  They were quick with plates and friendly and understood/spoke some English well.We'll be back.  My boy was majorly into the lobster, this chinatown style thing is a sentimental thing for him from growing up....it is a great comfort food fix.  I'd love to explore more into their menu ...as well as check out more of the neighborhood in general :)"], ["Mei-ye J.", "Small crowded little place in Brooklyn. Was here July 4th weekend in 2010 with some of my homies. We ordered a variety of eats including stir fried noodles, noodle soups, and rice dishes.Everything was yummy and fairly priced. Service was quick as usual. If I'm in town and not sure where to eat I'd definitely hit this place up again."], ["Vivian H.", "Excellent food :) Preferential service :( Authentic HK-style cusine :)My BF and I are a mixed couple and he being Caucasian looking earned us the \"expensive\" foreigner menu. I was not happy, and so to make the waiter aware of my frustration, I made him bring me a \"chinese\" menu. So...heads up, if you go here and you have other than East-Asian looking peeps with you, make sure you ask for the \"chinese\" menu. The reason being? Its alot cheaper and also has authentic dishes. Not that the \"expensive\" menu didn't have authentic dishes, but it was way pricey! Anyhow...in the end, we had lots of leftovers, and I wanted him to pack the rice up too, and he wanted to charge me for that. Is that the policy? Does anyone know?"], ["Kelvin W.", "This Cantonese joint handily beats any place in Manhattan Chinatown in terms of price and quality and is one of the cleaner, brighter establishments on 8th Avenue.  The restaurant offers many options and has a helpful picture menu.  The seafood and vegetable dishes here are excellent and a bit creative in a few cases.  The food is best experienced family-style.Some of the more delicious dishes that I tried a few months ago and that I can still recall include -fried eggplant/fish cakeslobster with scallions and gingere-fu noodles with mushroomsfried anchovies (or a similarly sized fish)Portion sizes varied from dish to dish, but the pictures in the menu do reflect actual sizes.  A few of the dishes (the fried ones) were sodium-rich.  Eight to nine dishes, including a noodle and a fried rice dish, were enough to feed my party of 10 and we each paid about $11 in total.  It wasn't cheap for a Chinese place, but the food and décor were worth the premium."], ["Mitch K.", "food is great, authentic and delicious HK style chinese food. got there after 5, so the roast pork was done for the day.The honey lamb chops are amazing. the pan fried flounder is really good, just make sure you dont mind picking out fish bones. staff is efficient and friendly. the menu is mostly in chinese but there are tons of pictures so you'll be just fine."], ["Juan J.", "This is my favorite Cantonese restaurant on 8th Ave. Although I wish they offer Dim Sum on the weekends, because I just know they will do a kick ass job at it as well. The food is FRESH. The seafood dish will mostly likely be fresh catch from the sinks displayed at the entrance of the restaurant. My non-Chinese friend was a bit grossed out when the waiter walked over to our table to show us our pick of the fish, but seafood is all about freshness!! The roasted duck and chicken are also the best in this neighborhood. The line can be long and the restaurant can be super loud (which is what you get when you put more than 3 Chinese in a room). Again, that also indicates this place is adored by the locals......"], ["Tinya C.", "Heck if I exactly know what my A. ordered for the table (he's usually the one that orders all the food at Chinese restaurants), but oh man, was it good. I've been to quite a few Chinese restaurants, and this one is memorable.We started out with some sort of garlic chicken, and there was nothing about this dish that wasn't good. The skin was perfect, the meat was perfect, the sauce was perfect.... so delicious.At the suggestion of the waiter, we also got crabs. They were huge, and the amount of fat in the crab was a hit with everyone at the table. I kept coming back to this dish throughout dinner... my camera was greasy by end of dinner. Eh hem. The slices of pork neck tossed with vegetables was served in a beggar's bowl, which brought back memories to many at the table. It was yummy - C. has made a vow to come back and re-order this exact dish.By the time I remembered there was a dish of scallops sitting on the table (I was busy picking at crab), they were all gone. Seriously. I guess they were good...We had a dish of eggplant as well. I'm not a huge fan of eggplant, but it was alright to everyone else at the table.The dish of fatty beef (the name of the entree literally has \"fatty beef\" in it in Cantonese) was one of my favorites. They use the type of beef you find in Japanese beef bowls or in shabu-shabu. It was soooo good (and fatty). Mmmm.A basket of Chinese-style fish sticks was ordered for the kids. They came with a mayo-wasabi dip. Since I don't like wasabi, I just ate the fish sticks plain. The coating was actually pretty good, but it's only good hot. When I grabbed a second one a little later on, definitely did not taste as good as when it first arrived.The steamed egg whites with chicken were alright. It went very well with rice, and we were all somewhat amazed at how many egg whites would be needed to make this (think probably nearly a whole quart of egg whites). We all agreed that our mutual loving relative made this better at home though.Our last dish was a plate of ong choi, and they sautéed it perfectly here. It's the one dish I didn't snap a photo of that night... I was busy peeling myself off a food wall that I hit.With any Chinese restaurant of decent authenticity, you get oranges at the end of your meal, if not tong shui. I usually don't like the red bean tong shui most places carry, but the have black rice in the rendition here. I love black rice. It was delicious.The only problem with this place is that it's somewhat small, and it gets pretty packed. We got lucky... we called ahead and made reservations, and managed to snag a table in our own private room downstairs."], ["Valery C.", "This is excellent Cantonese that's also very consistent in quality.  Preparations are solid across the menu, whether its the rich casseroles, greens that hit the right balance of crisp and tender, tart vinegar spare ribs, or a fave, the \"pride of lucky 8,\"  a medley of vegetables and squid that is a wealth of textures and flavors.  Barbequed meats for takeout (especially the pork) are among the best in Brooklyn, and they have the takeout lines to show for it.  They have a popular build-a-noodle-soup lunch special that I've yet to try but have heard good things about.  Relatively small restaurant, although they do have a lower level.  Make reservations if you're going with a large group, especially for wkend dinners.  Decor is non-descript.  Serviceable English is spoken by waitstaff, who are efficient with no frills.  Very reasonably priced."], ["Kenny F.", "Note: This review is based off of and only about take out lunches from here.I've been here for lunch several times and the quality of food has been consistent (not necessarily a good thing in this case).  I get my food to go so I can't really comment on decor or service (it looks pretty decent in terms of decor though).This is one of many Chinese restaurants on 8th Ave with roast duck, pork, etc hanging behind the window.  However, it was highly rated on yelp so I decided to give it a try.Food: First time I came here for lunch, I ordered the Pork-chop Peking style (aka sweet and sour pork chop).  It was pretty tasty.  I thought it was a bit small but it was enough to be satisfying so I couldn't really complain (although it's a bit more expensive than their competitors').  Since I love roast duck and roast pork, I decided to give it a go with both of them over rice.  For the duck, I ended up with mostly boney pieces, and what little meat I got was pretty bland.  Even the vegetables were kind of bland (and there were a lot more vegetables than meat but that's common practice in these types of restaurants nowadays).  I decided to be nice and write it off as an off day and try again later.  A couple weeks later, I came back and tried the roast duck and roast pork in noodle soup, one of my favorite dishes.  And it was horribly bland.  The soup tasted like boiled vegetable water and was so bland that it made the roast duck and pork taste even more bland, which I didn't think was possible.  The vegetables in the soup were completely tasteless.  I had to force myself to finish it and needless to say I was very disappointed.  Fast forward another couple weeks and I decided to give the roast duck and pork in noodle soup one more try, hoping for a different result and...  I got the same tasteless result.Most of the high ratings seem to be based off of their dinner which I haven't had the chance to try, but with the consistent bland and tasteless roast dishes I've had for lunch, combined with the fact that Lucky Eight also happens to be slightly more expensive than their competitors, I'm not sure I want to try having dinner here.  The only reason why it doesn't get one star from me is because the first dish I had was decent, but definitely not good enough to come back again for.  At least definitely not for their roast duck or roast pork."], ["Lucie T.", "Finally a good cantonese spot in BK chinatown!Went for dinner, we had the ginger scallion lobster, house fried rice, shrimp with walnuts and pea shoots veggies stir fried as well as chicken with dried mushrooms and ginger.Fried rice - had better, but still very good and had bits of bacon in it so big plusLobster - good enoughShrimps - very delicious and crispy and freshchicken dish - amazing and meat just so tender and had a wonderful aromasnow pea shoots - very crunchy and good tasting.always a plus when you get the warm red been soup with clear tapioca as a final dot on the meal.Very courteous service, attentive and awesome tea.  not too strong.  very nice decor and very clean.  definitely my favorite dinner or lunch place on 8th avenue here on out."], ["Ilene E.", "The roast pork is good. (They actually thinly slice it) The chicken is good. Basically whatever is hanging that advertised towards the glass window outside to the public is worth tasting. It's a really small dining area. Wouldn't sit and eat there due to the fact that it's extremely loud and crowded. There's always a line for the take-out which I get my weekly fix from."], ["Jonathan A.", "Went last night.  We ate:1) Shredded duck and leek soup - YUM!!2) Hot & sour soup - BEST EVER3) Lobster - Hong Kong Bay-Style - really good4) Clam braised noodles - WOW5) Mixed mushrooms - AMAZINGGreat service, decor, prices.  A cut above and a much more unique then any Chinatown competition...Brooklyn or otherwise."], ["Heather S.", "Stopped in here late last night for some quality Chinese food. Wasn't feeling super hungry so I opted for a cheap meal - the baby shrimp and egg over rice. Plenty of small (not baby) shrimp and the scallion/egg sauce was delicious. Can't wait to come back here and try the garlic chicken. Service was friendly and they served up my order in less than 5 minutes, which was great considering that at 10:15pm on a Tuesday the place was pretty full. ------*Love* that it's Michelin recommended.*Hate* that it has a B rating."], ["Jess K.", "We live in the neighborhood and this is where we take friends & family when they visit. It's not *super* cheap, which is why I'm rating it A-OK, but I'm definitely a fan. Maybe it's because I'm unemployed, but most of the entrees are between $12-$20 and if you want to order more than one thing, it's a bit pricey. But there are a few specials that have changed my life, they're so good, namely #51 (I think, or maybe it's #54; I have a problem remembering numbers) the shrimp w/ walnuts and snow peas. It comes in this amazing, sweet-but-not-cloying honey sauce, that balances the veggies nicely. The shrimp comes out perfectly each time. Also, last time we were there we ordered the half a garlic chicken, from the chicken list on the back of the menu, and it was amazing. Oh, another huge plus is their standard Chinese Restaurant soups honestly taste, look, and smell homemade-- seriously, won ton soup and hot & sour soup that is so different than the usual bowlfuls, and so hearty and delicious, I'm thinking they make it. Definitely blew our minds. I'll get the hot & sour soup each time now."], ["Martin C.", "I am a very picky eater when it comes to my favorite dishes; I come from a family of foodies, with my uncle being a chef and my mom being a seafood trader that supplies restaurants (meaning that we always had fresh seafood in the house). As a native New Yorker, I've tried dozens of Chinese restaurants all over the city, always ordering my favorite dish every time - Sichuan Style Dry-fried String Beans () - to try to find the best, and no place comes close to Lucky Eight. They always have the freshest vegetables, and their foods are always cooked to perfection.The service is good, prices are cheap... Despite their modest exterior, this is the place to be if you're looking for the best Chinese food in Brooklyn."], ["Fixilator C.", "If this is one of the best Chinese restaurants in NYC, as some here have posted (paid shills?), that's just sad. Admittedly, did not try too many things, but what we had was pretty horrible. Ok, the duck app was fine. But the noodles with spicy tofu sauce was unbelievable bland; not just not spicy, but completely tasteless. And from the amount included n the dish, you'd have thought that tofu was a precious as foie gras. How they could manage to screw up such a simple dish is pretty amazing. And the eggplant entree was equally unimpressive. Nearly tasteless, slimy... ugh. I'm one extra star because of the huuuuge portions. The place was pretty packed on a Saturday at 7:00pm, and we were the only non-Asian customers the whole night. I guess it's possible that we ordered the wrong items, but... all I know is I dragged a friend here all the way from north Brooklyn (hour train ride) and I was embarrassed. And if they made them bland because were were not Chinese, that's no excuse. Never going back to Unfortunate Eight."], ["tiffanie n.", "I love this place!  I especially like the awning, it has a picture of Bruce Lee on it..haha pretty cool. The food here is pretty amazing.  We ordered a bunch of stuff but the only things i can remember is the fried tofu with shrimp in it, mayo shrimp with walnuts and some other tofu dish with meat. I highly recommend all these dishes.My only gripe about this place is the waitresses/waiters don't seem like they have much patience for anyone."], ["Stacy T.", "Lucky I came here!I had something not on the menu, thanks to going with a real Chinese person. (Yes, I am a fake Chinese person, ABC.) We got squab garnished with some salt and lemon the side. The squab is expensive $12 for one with not that much meat. However, it is a good try for those who have never experienced it. The skin is super crispy and the meat is flavorful, somewhat of a cross between a duck and a chicken. Be sure to dip in the salt ( I know it looks like a lot, but dab it.)  and also to squeeze the life out of that lemon! I also ordered Pride of Lucky 8, which is their signature dish. It is basically a medley of veggies and abalone - it includes some fried garlic strips, some shiitake mushrooms, scallions, and some leek. Since there are so many different ingredients, each bite is a different flavor - some taste super fresh, others are a little saltier, and some with more seafood - it's a surprise every time! The other thing I ordered was a pan-fried flounder dish. The fleshy part of the flounder is separated from the bones. The fleshy part is stir fried and laid on a bed of leafy vegetables. The bones are then deep fried and become a crunchy treat that you can eat. A great contrast to the stir fried fleshy part. This was a unique dish and also worth a try if you want to experience something different. My only complaint is that some of the veggies were not thoroughly washed and had some sand/soil in the stalk crevices. During dinner they give you complimentary oranges and a sweet soup. The oranges are your regular ol' oranges. The soup was awesome! It had some Chinese herbs in it which I don't know the names of. It tasted like a syrupy soup, try it! Overall, this is a traditional restaurant, but is definitely also a modern one - they really spice up traditional dishes and make it unique. Worth it to try authentic Chinese cuisine. Also, you don't need to know Chinese at all. Most to all of the dishes have English accompanied with the Chinese AND they have PICTURES! Yey!"]], "Wing Cheong Restaurant": [["Spencer Kiernan M.", "If you want delicious cheap Chinese food, this is clearly your haven. Every time I order a meal there, it ends up turning into two meals due to the massive amount they give you. And all of that is for under $10, which is wonderful. I try to order different items every time I am there, and I've been consistently pleased with every order.They aren't trying to reinvent the wheel here. They've got all the typical menu items you'll want when you are looking to get Chinese food. And they do it well. The staff is always friendly and the wait is not very long. This is a place I plan on frequenting from here on in. If you're in the neighborhood, Wing Cheong is definitely worth checking out."], ["Jessie E.", "Really really wanted to love this place. Ladies at the counter were sooooo nice. Ordered crab Rangoon, which were decent. But the rib tips and fried dumplings were grisly and full of mystery meat. I ate a bit and THREW AWAY the leftovers immediately. Thinking about them made me feel a lil ill. I was hoping this would be my greasy neighborhood Chinese American spot. Alas :-(("], ["Tanya R.", "I eat at Wing Cheong because it's one of the only Chinese restaurants still popping after the midnight hour on a weeknight. Food is good but I haven't tried any of the \"Chef's Specialties.\" I order the hood basics here-chicken wings, fried rice, boneless ribs, more fried rice. The people who run this place are friendly with a good sense of humor. Wing Cheong doesn't deliver."], ["Vera W.", "been eating here for years. honestly tasty well done food . finally"], ["Roland H.", "Best Chinese food in the heart of bedford StuyvesantWith the two friendliest ladies that know what you want as soon as you walk though the door. Also the food is very very good!!!"], ["Alexander K.", "By far, the best Chinese food I've had in Bed-Stuy.  It truly hits all the bases for a NYC chinese takeout place.  They do all the basic American Chinese takeout dishes very well, from fried rice to dumplings to spare ribs.  It's very inexpensive for the portions you get.  And, the service is extremely friendly for Bed-Stuy and quick."], ["Miss K.", "The Crispy Eggplant. Hands down my favorite take out meal of all time."], ["Tim P.", "Wow. What can I say about this AMAZINGLY delicious bed-stuy cheap Chinese place? First off - it's cheap. Like REALLY cheap. Secondly, their portions are HUGE. Like - I don't really want to know why/how they can afford to charge so little for such huge portions. My first month living in NY was in bed-stuy and this was a regular staple of mine. Really delish for that cheap chinese itch you need to scratch."], ["Mina L.", "The meals are cheap, delicious and bountiful. They have a lot to offer and they're so friendly. 4 meals there equal about $20 with a free can of soda. 1 entree is enough for 2 people and it costs $5. I get takeout from there everytime I'm hanging out with friends. Cash only."], ["Cameron M.", "Surprise. Actual authentic Chinese dishes in BedStuy! It seems the establishment is intent on adding more 'Home Style' dishes as well. No Chinese broccoli yet, but I (and you) should ask for it!  For now, I'd go for the Ma Pao Tofu, the eggplant, and perhaps the scallion pancakes if you're staying in. They're best if you don't carry them home in a box where they'll get soggy."], ["Andrea N.", "Good. Real good. I like the General Tso chicken a lot. The noodles not so much. Fried rice was surprisingly yummy too."], ["Alon H.", "As someone who likes traditional Chinese food, this place is the best example of \"American Style\" Chinese food that I have been to. The food is fresh, properly done,  and well priced.  The service is fantastic, especially considering the sometimes inebriated state of the clientele. For those who do not like \"American Style\" food I recommend asking the staff as there are a few dishes (mapo doufu, spicy eggplant) done in the Chinese home-style way."], ["Toni S.", "This place is our go-to place in our neighborhood.  Not only do they have good food (not sure if they use MSG or not, but usually when MSG is present I feel heavy in the chest after I eat it as I'm a bit allergic, and I never have this feeling with Wing Cheong), but the service is impeccable! They remember you every time you go in, it's pretty impressive.  They never take names or anything, but when you go in they know which order is yours and what drink and type of rice you want.  It's like magic!  :)  Oh and it's a lot of food for not that much money.  We usually get 3-4 large dishes for about $25.  You can't really beat that!"], ["Lemonjelly L.", "Tasty cheap eats available late night, from super nice people.A late arrival into JFK after not eating all day, a cab ride to Brooklyn, I'm hangry. That's hungry to the point of being angry. My friend suggests Wing Cheong even though he ate the food there just the night before. Veggie dumplings - steamed - are good. Scallion pancakes, good. The roast pork with snow peas (#89?) has more veg in it than snow peas, so bonus.We also got an item pictured on the wall, fish with tofu and vegetables. It could use a little hot sauce to zip things up a bit, luckily there's an ample portion of that provided in our bag. Our two main dishes come with rice: brown or white is available. We get the brown. That's a bonus in my book as well.For being nearly 1 am, everyone's in the good mood, including the numerous other customers who come in ravenously requesting the fried wings, and then breaking out into acapella song. The woman behind the counter is smiling the whole time.So much food, and heaps left over. All for $20. Take-away only."], ["Mark B.", "Way above average! This is not your typical \"cheap\" Chinese takeout place. For starters, you are greeted very friendly and with a smile. If you're unsure, she'll give you suggestions that are honest and on point. The prices are very affordable. They have the staple menu as everywhere else, but the quality is above any cheap place I've been. But don't stop there. The best items aren't on the menu, but handwritten on the walls. There's a special soup menu, various house-made dumplings, and much more. So, if you're hungry and in Bed-Stuy, look for the hanging lit-up sign on Fulton!"], ["Andrew S.", "Good food - their cream cheese wantons were really good! I'd return if I'm in the area."], ["Ephraim G.", "Good food, good prices, and nice people. What more can you ask for?"], ["A W.", "The great thing about this place is not the typical \"American style\" Chinese food, but the items that are not on the printed menu that you can order.  The authentic udon noodle soup, tofu dishes are very good, and for the price a great choice!  Definitely a hidden gem in the hood!"], ["David P.", "Quick and good food, good service, good prices.  It's a blessing to have them in the neighborhood and an easy 5 minute walk from my apartment."], ["Kooky R.", "As far as non-Chinatown/American-style Chinese food goes, this place is surprisingly excellent. The chow fun is the only thing I'd definitely not order again -- way too salty and kind of mushy. The boneless spareribs were good, if a little gristly. Hot and sour soup's a little heavier/oilier than I'd prefer, but not bad when it saves me a trip to Mott Street. The dumplings are doughier than I like, but my husband loves them that way, so I guess that's up to you. The sesame chicken, beef with broccoli, and sauteed string beans have all been really tasty and with vegetables that haven't been cooked to death. The crab rangoon (on their menu as \"Cheese Wonton\") is nearly perfect: crisp, fresh, not too greasy. Plus? Ridiculously huge portion sizes and super friendly staff. I don't know how the other Chinese places on Fulton can stay open compared to this place.Addendum: My husband was all \"dude, you were so mean to Wing Cheong!\" I thought it was pretty fair/accurate but lemme just emphasize AGAIN, it is really good. Seriously."]], "Chance Asian Bistro & Bar": [["Eileen E.", "My family and I were visiting from VA and my son in law suggested Chance. What a great choice! Our waiter, sorry I forgot his name, was super friendly from the beginning. My granddaughter was making conversation with him and he really was attentive. I enjoyed my mango mijito...both of them. The rest of my party also enjoyed their drinks as well...smiles all around. We all enjoyed our entrées and really didn't have room for dessert but was given an ice cream sampler which the green tea was delish! Definitely will make this our go to spot when we come back to NY. I would of given 5 stars but towards the end of the meal, the restaurant got busy and our server got busy and less attentive. Overall visit was  pleasant."], ["Jonathan E.", "In some games of chance, such as Roulette, you can try and hit on some long-odds with a big reward, or play much safer and simply bet on red/black, with 50/50 results.My adventuresome date & I were going to try sushi place nearby, with expected results, but she thought this place sounded more unique.  So we detoured.First of all, it's got a modern vibe and the staff are friendly.  The pan-Asian dinner menu is quite ambitious.  In general, this sometimes works and but other times it results in a lack of focus.  How would things go?Firstly, we were served an amuse bouche of their Thai mussels, which were bursting with flavor and had some nice heat.  I'd be happy to have an entire meal of these.The next app was a crispy chicken pancake, which was somewhat lacking in chicken, but served with an incredible dipping curry.  The latter was so delish that my future potential ex wife frantically searched for a spoon to scape the the remainders.  I gave her permission to lick the bowl... and she did.  Nice! Then our entrees arrived.  I had pan fried noodles with veggies and shrimp.  She had a yellow curry & veggies.  Both were big and chock full of ingredients.  In my case, however, the spiciness level discussed was never attained, and the overall combination of ingredients was muddled.  The individual ingredients were fine, and clearly Asian, but it had no home country.So overall, a mixed bag.  Sometimes, if randomly picking, the ball lands a tasty result and other times it was a push.  No losses here, but I think the key is finding your fave items and sticking to those."], ["Nikolai S.", "Walked by this place a million times but never actually got anything.  Finally one night I wanted something different so I got take out, and I was very pleasantly surprised.  I'm usually turned off by places that have generic asian dishs all over the menu, but what I got here was top notch.  The orange beef was nice and tangy, and the miso cod was really flavorable.  Hot and sour soup was great as well.I've ordered from this place 1/2 dozen times now over the past couple of weeks and have been really happy every time.  Some day I'll try them in person."], ["Melissa D.", "I love Chance, I save it for when I have a craving for mangos shrimp and sangria!!! The service is on point!!! Staff are very attentive. Food is amazing!!"], ["Iryna G.", "Amazing place! Excellent drinks, great food! We went there twice. First time we had a great service: our waiter was very attentive, fast and on top of things, but second time around we had a different waiter, who seems to be lucking a lot of skills. We tried dim sum, lychee martini, sea bass, spring roll. Everything was fresh and delicious! I'm definitely coming back. I didn't give 5 stars just because WOOHOO and as good as it gets, according to my understanding of dining, more applies to the fancy upscale restaurants with $$$$. Otherwise I will give it a 5!"], ["Vanessa S.", "This place is under rated. So I over rated. In actuality it is probably a 4. Great happy hour  and great potstickers with an abundance of varieties!!! The manager Katie is amazing and remembers everyone's name and preference!  We have been coming for years and never had a bad experience. The decor, lighting and music are pleasing. Can't say enough about this place!!!"], ["L A.", "Didn't east there but the drinks were out of this world! The bartender, a blonde friendly mixologist  named Aline, is simply superb. Best bartender on Smith St. hands down.Sunday Specials: $5 Martinis, $5 Mojitos, etc... prep for the hazards of Monday Morning at the office for about $20. Can't be beat!"], ["Kimoralee K.", "Two flavored jumbo shrimp !! Is a must , the $8 lunch special is not that bad for the potions you get !!!!"], ["Chris B.", "I love this place.  If you're looking for a really great happy hour during the week with awesome drinks and really good food, amazing service then go here.  It's great to bring a date or go in by yourself.  The crowd is laid back, talkative and really cool.  The music is usually the kind you want to bob your head to so it's a fun experience.  The best is the servers, sooo nice and they really care about your time there.  The bartenders know what they are doing and are really nice as well.  The food is always fresh and a great price.  I strongly recommend this place year round.  They do have outside seating during the summer months."], ["Lars H.", "Chance serves better dim sum than most places in Chinatown. The orange chicken called \"Chance chicken\" is a party, the happy hour is a great deal, the staff is very friendly and efficient and the decor surpasses that of every other casual Chinese inspired restaurant in the city. A really great place with well composed dishes!"], ["Nelly G.", "A hidden gem!  The place has delicious food , great atmosphere and awesome drinks. Love there duck lettuce wrap, chicken satay, baked seafood and the numerous range of dumplings.They have 2 desserts that are a must (green tea crepe and warm chocolate cake)"], ["Lina M.", "Excellent food, very clean, nice ambience! The staff is very friendly and attentive. They have very good sangrias-and in big portions. However, if you're planning to come there on a weekend and with more than a party of 4-reserve fast and in advance!"], ["Maritza S.", "My Buddy and I saw the place and it looked nice so we decided to check out the menu and it looked good, with a nice array of different foods... The waiter we got was really nice and I guess took really good care of us since the restaurant was empty... I have a very strong stomach and I can eat anything -including bugs (lol) and I hate to say this- the BBQ duck made me sick! I was throwing up all night... it was awful!!! I felt awful!! I know it wasn't anything else because I didn't really eat all day was it really duck? Luckily I took a picture of it because I thought it tasted so good---You be the judge! I'm sure this place is great but I didn't get a chance to experience that since it left a bad taste in my mouth! (Gross! I know!) Not Good eats!"], ["Austin A.", "We come here several times a year...birthdays, NYE, saturday nights, etc.  I love that there's so many selections and a great drink menu.  I didnt know martinis went with asian cuisine so well before coming here.  And homemade ice cream!"], ["Cathia L.", "Had a lovely date here, the food is pretty good and the drinks hit the spot. It's in a nice intimate setting, not too packed on a week night. The music in the background is decent, yet you can still herself to have a conversation. I would absolutely come back for dinner and drinks. And to try the other Dim Sum boxes along with their cocktails."], ["T R.", "So love this place been here twice the staff is great, food is excellent and service!! Cant wait to go back the Lobster claws are calling my name !! Never been on weekend, afterwork isn't overly busy in which i enjoy!"], ["Peter D.", "I have really, REALLY low expectations when it comes to bento-box-type lunch specials. But I keep ordering them, because they always sound like a good deal. I suppose I've just been hoping that one of them will turn out to be like Chance Cuisine. I'm so glad I've finally found you. The miso soup (chosen over wonton and hot & sour) is delicious and sprinkled with mushrooms. The salad was fresh and contained COLORFUL greens, not just white iceberg lettuce and an equally pale slice of tomato.The pork dumplings tasted as though they were recently made, instead of plucked out of a soggy vat of yesterday's leftovers. The rice was perfect, and my ginger chicken entree (although it looked like 1,000 other mediocre dishes at Asian restaurants across the city) was actually tender, flavorful, and full of crisp, well-cooked vegetables. And it was even slightly edged out by my counterpart's fabulous black pepper duck. Best of all, for only $7-$9, this is an incredible amount of food. We ordered dim sum to supplement the meal, and despite it being of surprisingly decent quality as well, it was completely unnecessary."], ["Adam P.", "think there chicken witht he orange peel sauce is really good. I dont really like asian food but kinda like this place."], ["Peter K.", "So how did I a guy who works in the city and lives in LI end up in brooklyn?Who knows?  My friends dragged me out here.  But this place is a little gem.  The atmosphere is modern and cozy.  Cozy is a code word for small.  Either way I didn't mind.  Me and my friends sat at the bar and just ordered from there.We sampled a huge variety of food.  This is easily explained because 3 of us ordered off a pre fix menu.  We ordered miso lobster dumpling, shrimp shumai, on top of the pre fixed apps of scallop, foie gras, and I forget the third.  The plates were small, but tasty.  Was it the best ever?  No but for the price it was great value.  I know this is a Asian fusion place, but I got the filet mignon as my main course.  This was the highlight of my meal.  Perfectly medium rare and pre sliced no less.  (less work for me!)On top of all this they had $10 macallan 12 on the rocks!  Not skimpy portions either.  You would expect a trendy place in brooklyn to cost more.It's just tough to give it 5 stars because I like to eat and the portions were not consistent with the prices.  Other than that I would recommend this place if you're ever in town."], ["Kimmi C.", "Went to Chance last night with family. The food was soooooo good that I am planning on going back tonight for take out."]], "Golden Fried Dumpling": [["Monique H.", "Extra star for being super close to my apartment.I only order the steamed pork dumplings and I think they're pretty great.  You can sit outside and they'll flag you when your order is complete.  Super cheap and easy."], ["Linda S.", "So this is more like a 3.5 - the extra half point is for how damned cheap it is and for how much I like unpretentious small businesses. But for the quality of the dumplings themselves and the offerings, it's not worth the 4+ star reviews that everyone seems to giving them. This is NOT Prosperity Dumpling. However, they do make all the dumplings completely from scratch, and deserve hard-earned credit for that. My favorite order is the boiled chive and pork dumplings and juicy little buns. IMO most of the soups (except the sha cha beef soup) are flavorless. I wouldn't bother with the hot and sour soup, but the wonton soup is pretty nice. Note that the wonton soup is  fuzhou-style - meaning it's many pieces of seasoned pork wrapped in thin noodle wrappers. Service is very fast and perfunctory in a heart-warmingly aggressive Chinese way - in other words not for the n00b. The cashier will expect you to remember your order # because that's what s/he'll be shouting loud enough to hear from 30ft outside the shop doors when your order is ready. Be prepared. It's also crowded during lunch hours - on some days the line snakes around the shop. Cash only."], ["Yna B.", "I think the main reason this place averages 4 stars is because of how cheap the dumplings are (and really everything else). If you've had your fair share of truly delicious dumplings, this definitely won't satisfy your palate. On the other hand, if you wanted something cheap, fast, and easy, this is definitely the place to go to. It's very very close to where I work so when I'm broke and hungry, this is where I go. This place is tiny and during the lunch hour rush it gets pretty packed inside."], ["Anthony P.", "I tried the dumplings a few times and now the juicey little buns.  I think they are barely even decent and I've never even finished all of them which is unprecedented for me. Won't be back and I don't recommend. Even the roast pork buns that you can find at any Chinese bakery are terrible. Wow"], ["Leila L.", "We came here after donating blood nearby,  Yelp reviews made us think this was like East Broadway, Chinatown dumplings quality!  Sadly, it was nothing like it.  The service is minimal, and the food came quick.  The \"restaurant\" is small and dingy and very hot.  Luckily, there are city benches right in front that anyone can use to sit and eat.  We ordered dumpling, both steamed and fried, and the sa cha beef noodles.  The fried dumplings were mostly skin and not enough filling.  The steamed dumplings had more fillings but not enough taste.  The noodles were bland and beef minimal.  Overall, this is a cheap spot for a quick eat in this area, but if this area wasn't so expensive, this type of dumpling quality would never survive."], ["Sol C.", "Let me begin by saying that you should come here if you are in need of a cheap meal. See my photograph to fully grasp how much food I was able to buy with 11 dollars. That aspect was quite remarkable. However, the rest.....I went to order some take-out on a Wednesday night around 6:30 pm. A few people were also waiting for take-out but there was no line. I waited for about 7 minutes for my food.The pork bun was my least favorite of the three dishes I tried. Compared to others I have had in Chinatown, this bun was dry and the meat inside was mostly fat and gristle. Quite terrible and unappetizing! They actually ended up not being eaten and thrown away.I also tried the sa cha beef noodle soup because so many people recommended it on yelp. It was okay. I was surprised by what a large portion it was for ~$5. A big bowl of broth with noodles, veggies and three pieces of meat. However, the meat had a lot of fat on it and the broth was spicy but otherwise flavorless - if that makes any sense. Somehow it was so bland. I added quote a bit of soy sauce and hoisin sauce once I got it home.However, I also had the boiled pork dumplings and thought these were pretty tasty. I would possibly return but just for the dumplings. I would definitely not order the bun or noodles ever again."], ["Erin M.", "Decent dumplings and pork buns. What will bring me back is how quick they are how CHEAP they are. I got 5 fried dumplings, 3 pork buns, and peanut noodles all for $6. And I couldn't even finish it all for lunch so the noodles wound up being leftover for the next day. So $6 for lunch for 2 days is absolutely fab. Although the noodles were sub par and I wouldn't get them again. Basically didn't have much going on. The flavors weren't there."], ["Drex H.", "Fantastic hole in the wall and relatively authentic Chinese food in Downtown Brooklyn.  It is a much better alternative to the bulletproof Chinese spots that litter the landscape. For the uninitiated, bulletproof Chinese spots are fast food Chinese takeout restaurants with bulletproof glass in between the customer and the restaurant staff.  The menus are always very Americanized and greasy.This is no such place.  The fried dumplings can get a bit crunchy if they have been left out too long.  They cook them, then place them in plastic containers under a heat source to stay warm.  I recommend the steamed dumplings, especially the chicken or the shrimp.  They also have lo mein and a fantastic spicy beef and vegetable soup which will give life to all eaters during the winter.  The inside of the restaurant is cramped and old looking.  Its not dirty, but its not an ideal sit down spot.  However outside the city recently constructed a wooden patio next to the curb with benches and small picnic tables.  Its a perfect spot to grub on your dumplings or noodles.  GFD is worth a try for cheap, quick and delicious eats in downtown BK."], ["Craig Z.", "My vegetable sandwich had kind of a soggy bread, limp shredded carrots, and like two little piece of cucumber.  It was cheap, but I felt like I got what I paid for.  Pan fried buns were tasty, but not very fresh.  I came in at the end of the day though, so maybe the experience would be better earlier in the day."], ["Gina K.", "I think this place is the definition of a hole in the wall. Located next to a church(?) on a random empty street, it could be hard to see. Look for a red awning!Definitely order:roast pork bun (the single, big one)usually, buns are meant to be dipped in soy sauce of some sort. This one contains wonderfully flavorful marinated roast pork and can be eaten alone. I was happily surprised.Sa Cha Beef Noodle SoupThe beef is so tender, spicy and melt in your mouth thin.I wish there were 10 more pieces!The vegetables add a nice crunch to the chewy noodles. It's honestly not that spicy, but I have a high spice tolerance..Pork and chive boiled dumplings (10 pieces)I don't know what the dumpling wrappers are made of.. But they are scrumptious and addicting. It's chewy but melt in your mouth.Super quick service! Everything came out in 3 minutes, packed perfectly to-go.Yeah, the employees are kind of intimidating, but they're not rude. (Not going to lie... I decided what to order outside so they wouldn't stare me down)."], ["Carolina S.", "Greasy and cheap dumplings! This is literally a hole in the wall. It's a tight squeeze in the place during lunch. I'm pescatarian so 8 fried dumplings are $5.25. When I got to the office, my dumplings were huge, fluffy and glistened in grease. And when I took a nibble there was definitely a fare amount of shrimp. It has been hours and I am still stuffed. My friend ordered two orders of pork dumplings, chicken noodles and a side of rice...all for 8 bucks! A lot cheaper if you eat meat. She definitely got two meals out of this one purchase. I will be coming back to try the noodles. Asian comfort food but not an every day treat. There are tables, if you don't mind people's butts in you face while you eat. And definitely bring cash. Fast service. Cheap eats!"], ["Patty C.", "Super fast prepared food for a really cheap price.I ordered the black bean paste with meat in noodles and pork dumplings.The noodles were mediocre at best. The amount of paste sauce and meat was too little with an overdose of excess veggie toppings.The dumplings were alright but the pork size was small yet again. This is the type of restaurant where they care more about quantity than quality."], ["Lucky M.", "Multi-gender bathroom with a sign. single stall with a lock on the door, but gender-friendly if you're hip to a person in a skirt or pants on the door.#letmypeoplepee"], ["Letty C.", "This is a quick spot for a cheap lunch. It's a hole in the wall if you sneeze you will walk right by it.Seriously.I had the boiled shrimp dumplings, they were tender and  seasoned a definite must have if you visit. I wanted more, but the soup was bland and lacked content and character..meat, tofu, noodles.. wth...The setting is totally dull, dingy, dimly lit, and generic.....a true dive. My food was served on Styrofoam plates, which maybe nostalgic for a quick bite, but seriously I'd rather eat at my cubicle back at the office.This place is not the second coming , it's not great, it's  just okay, but nothing spectacular. The food is cheap and in this city where almost everything is extremely over priced...cheap has its appeal... I get that.Oh and there's wonderful seating provided by the city located right outside the restaurant.Go two blocks over to J Street take the F train to the Lower East Side of Manhattan and buy into to some ambience....no seriously get some chopsticks, sit down and relax, but if you only have an hour and you have to get back to the office to answer emails then this is the spot."], ["Nilsa L.", "I've tried the Vanessa and Prosperity dumplings, so when I know this is around my office, I had to try it. The dumplings are pretty good considering it's not a typical Asian-concentrated area. for $3.50, you get ten dumplings which is slightly more expensive than, say, Vanessa. I also tried the black bean sauce noodles. It was meh. It's edible, but not something I'd order again. This is definitely a cheap place to get some lunch especially for some dumpling fix. Will be trying their sesame pancakes next time! So glad to have this place around me while I'm around for a while!"], ["Y. D.", "My first time here was on a cold night. It was very close to their closing time so the place was practically empty. We placed our orders, paid and in 2 minutes we were out. The fried pork and chive dumplings were not bad, just okay. Nothing to really write about. If your are in the area and want some cheap eats, it's the perfect place."], ["Elizabeth W.", "Went there for their pork and cabbage dumplings!!! So fresh and delicious. the price is very affordable and they have outdoor seating cuz inside seating is a very small area.. I also enjoy their beef noodle soup, dumpling noodle soup, fried pork buns, sesame pancake with beef and fried rice.. the only downfall is CASH ONLY so be prepared when they decline to take cards. Awesome lil hole in the wall that reminds me of my grandma's home made dumplings...:-)"], ["Linh L.", "My coworker brought me here to pick up lunch one day.. Im used to gettin my fried dumplings from 8th ave, the 40 something st one that everybody goes to. So i was kind of excited to hear theres one near here.I ordered the fried dumplings and took it out to eat. I was disappointed because their fried dumpling was fried and then left there so it pretty much tasted like hard sogged up dumplings. The skin was so thick so there was barely any meat inside. Their hot sauce also did not taste like the regular hot sauce they serve w dumplings. Although it was cheap.. It wasnt good. The other dumpling house i goto on 8th ave usually fries the dumpling right when u order and steams the dumpling right when u order so its fresh. I wont be coming back again."], ["Jive O.", "The inside is pretty old but I don't really care since its considerably cheap Chinese food.Well priced items and they obviously specialize in Chinese dumplings. Was disappointed with the fried ones cos the skin was too hard. That's because the ones we had were pre fried awhile back and left to cool and we ordered it was warmed up that's why the skins hard, if done fresh in sure it would've been better.The cooked/broiled dumplings were good that's why I think they still deserve the 3 stars.Had the sesame paste noodle and that was pretty good too with crunchy fresh bean sprout."], ["Grace L.", "The dumplings are great! Very well-done, and affordable. Everything else on the menu is also affordable-- I have tried the vegetable fried rice and peanut noodles, however, and both were overly greasy and with no other substantial ingredients other than the grains. You have to speak to her in Chinese to ask for hot sauce, otherwise she won't give it to you and will charge you when you ask after placing your order. Cash only. I can't imagine eating in the restaurant as it's cramped, hot, and not that clean -order and take to go to fully enjoy your experience."], ["Michael C.", "Quite a nice find here in downtown Brooklyn. Pretty much identical to the famous Prosperity Dumplings in LES if you know that place. Although I have to admit the wait seems to be less here but the place is smaller as well. But during your first visit best to just get the dumplings to go to avoid having to fight for a spot to sit down. They do seem to offer more noodle selections though but this being my first visit of course I went for dumplings and sesame pancakes.The dumplings were definitely well worth the price and tasted very freshly made. I had more expectation out of the sesame pancakes however I felt it was pretty dry and lacked sauce that Prosperity would add in their version. But for the price you pay $3.5 for 10 boiled dumplings they're still worth it despite they raised the price it seems sometime earlier this year.If you have a chance definitely give this place a try. I do think it gets pretty crowded though so definitely be ready for some wait especially during lunch time."], ["chris l.", "Came here 3 days in a row.  Stayed at a nearby hotel and found a diamond in a rough! They serve pretty amazing dumplings!  Their noodle is pretty good as well.  A true hole in a wall of great food with a bargain!"], ["Katie H.", "The lady who takes the orders scares me. They shout a lot. They all mean business. And don't you dare forget your order number. But boy, do I respect them and their dumpling-making skills. This little spot right on Duffield can easily be missed. It's way too small for the amount of customers that come during lunchtime. But the food is always worth it. I've seen various prices from older reviews (costs obv change with time). But to-date, the dumplings are as follows:-Chive & Pork = $1.25 for (5)-Sesame Pancake (plain) = $1.00-Pork Wonton Soup small/large = $2.00/$3.50I've never been disappointed. The food here is cheapppp and really delicious. My dumplings are always fried/steamed (depending on my mood) to perfection. It's piping hot and even withstands the 10 minute walk back to work. I wish they delivered but you can't have everything in life, right?"], ["Darwin G.", "The dumplings here were barely edible. When I ordered then, they were already packaged in a container. They were fried, and then steaming for who knows how long.When served to me, they were rubbery and the filling was spilling out. The filling also was bland."], ["Jimmy K.", "The location is a no man land at the moment. And the food does not worth the trip. The dumplings are just like any of those you can find in a corner takeouts. The pan fired buns have funny taste in the meat. I could not even finish what I ordered. Not because I was full. I just could not. The only good thing there are the outdoor tables and chairs. But they look like they are installed by the city not the shop. A big disappointment. :("], ["Suanne L.", "Golden Fried Dumpling sits on quiet Duffield - I've walked by it a million times but was never hungry enough to stop and order. But after several recommendations from friends, I had to go and try it out. TL;DR - The prices are cheap, the flavors are good. The boiled dumplings are the way to go and they tend to be small. Golden Fried Dumpling really specializes in shui jiao - thinner skinned, *boiled* dumplings. These dumplings tend to \"shrink,\"  pulling the skins closer to their meaty centers. They aren't as juicy. Golden Dumpling also chooses not to fill the dumplings to capacity, leaving lots of air pockets of wasted umami potential. Each dumpling can be eaten in a single bite. They are served with a small container of soy based dipping sauce, which amps up the flavor. Golden Fried Dumpling uses the same shui jiao dumplings to pan fry, but as described below, aren't as satisfying and tend to be greasy.Prosperity focuses on guo tie/wo tiep, pan fried, thick skin dumplings that fill with the meaty juices of the fillings as they cook. Some people call them potstickers. The dough is more toothsome, and can be crispy on one side. They usually take me two bites per dumpling and I feel that they have more meat. Wo tiep is what I make at home and I personally find them more satisfying.So while you still get a lot of food for $5, if you're a Chinatown regular this place may not be worth it. Get the boiled instead of the fried and save yourself the oily mess that will come your way. I have yet to try the noodle soups, but based on the quality of the dumplings, they're probably solid and cheap. The location is a bit dingy, with sticky floors and awkward table layout. But food is served quick and its perfect for a quick 20 minute lunch run."], ["Justice T.", "Straight-forward, cheap, and tasty food here. Grab a menu when you walk in and know what you're ordering when you get to the front of the line. I recommend the boiled shrimp dumplings, pork and chive dumplings, and Sha Cha beef noodles. Sure, you can get better quality dumplings and noodles if you head to Chinatown or Flushing, but if you work in the area it's a great spot for a quick fix."], ["Kari T.", "The food here is frighteningly inexpensive.  As a result we ordered too much food - two dishes is plenty per person.  The food is pretty tasty and very popular, as evidenced by the line outside.  I'm not sure I'd be running back due to the limited choices, but it was a great spot to get some quick food during a Fulton Mall shopping extravaganza.#1 Chive and Pork Fried Dumplings - Yum! 5 for $1.25!!#10 Roast Pork Pan Fried Buns - Tasty! 3 for $1.25#11 Little Juicy Buns - same as #10 without the delicious crispy crust on the bottom. (May have given me the wrong item) 6 for $2.50#13 Sesame Pancake - not that interesting but a huge carb hit for only $1.#22 Noodles with Peanut Sauce - needed salt, seemed like a dish for toddlers - very plain.  For $2.50 I'm not sure what I was expecting."], ["Miguel S.", "The only redeeming part about coming to this place were the dumplings. They were very well prepared and tasted great.  I also ordered the supposed spicy soup (the guy warned us about the heat), but it was flavorless and barely had any heat.  The meat in the soup was also very bland and the noodles meh. Don't order the soup.The service was also not great.  We ate inside, and the young guy at the counter gave us what looked like two or three toilet paper square sized sheets for napkins. When we asked for a bowl so my buddy and I could share the soup, the guy asked for 25 cents for the crappy container.  It was extremely weird.This place is cash only, so bring some money with."], ["Jeffrey T.", "Yes!!!  Awesome 'hole-in-the-wall' with very low prices.No decor or mood in this joint. It's a kitchen with an area by the door for you to stand and order while somehow a couple people are squeezed into table.Why would I want to come here you ask?GREAT VALUEDELICIOUS DUMPLINGSTip: go all out and try the $5 shrimp dumplings, they're awesome"], ["Michelle Y.", "Legit mom and pop dumpling spot smack in the middle of nowhere. Chinatown prices. In addition to fried and steamed regular dumplings, they also have big roast pork buns and little juicy buns. Everything you can buy fully cooked to consume immediately or stock-up frozen styles for easy dinners at home. Flavor and texture are not groundbreaking but considering the price, it's pretty good.There are maybe 5 tables you can eat at but the decor is nothing to write home about."], ["Aleksey K.", "The reviews made this place seem amazing. It's not amazing , it's just good. The prices are good, and the food is good if you get a fresh batch, sometimes you get a batch that was sitting in a storage box that's heated and those batches don't taste as good as te fresh ones. Nevertheless for the price is a great bite. Check it out."], ["Ryan H.", "I rarely review and even more rarely give a bad one, but this place sucked. The pan fried pork dumplings were cold and the skin was thick. The sesame pancake was tough and tasted like it was sitting out and  the roast pork buns just nothing. They tasted like nothing. Even the Coke I got want cold! Go to Chinatown and try China North Dumpling. So much better than this crap meal I just ate. Literally typing after I finished my last bite. That's how disappointed I was."], ["Kevin Z.", "Maybe I came here on a down day but still you serve me some nasty dumpling. Compare with those in the city, you guys are way way behind. The noodle soup is a disappointment as well. You can't call that chinese food. Seriously I have issue with you guys. You are lucky I was hungry and cold. The soup warm me up and the dumpling kept me going for a few hours.Nothing really special here unless you are some tourist or hungry soul."], ["Shawn A.", "If you're looking for something quick and cheap, this is a good spot. Paid $7 and got 10 dumplings and a pretty good portion of vegetable fried rice which in my opinion was the best part of my order. Overall, good small hole in the wall spot."], ["Amir K.", "Ah this place has gone a bit downhill. The pan fried dumplings were almost inedible from sitting out too long and the sha cha noodles had one piece of meat. It's not the worst place for a dumpling stop but barely average at best unfortunately. I'll try the shrimp boiled dumplings if I ever come back."], ["Karim K.", "Can someone please tell me, what is so special about this place?Was in the mood for Chinese on Friday night and came across this place after filtering my search to \"Most Reviewed\". I got there and was handed a little menu by the gentleman behind the counter. I realized this place wasn't for me after every item I read ended or started with \"Pork\" ( I don't eat pork).Long story short, I ordered the shrimp and vegetable dumplings. Ten minutes later, I was handed a greasy Styrofoam container with the most unappetizing and unsavory thing I've ever had! Bland and greasy would be the best way to describe what I was served. I mean, they should've just handed me a bottle of oil when I walked in and said \"here you go, here is a sample of what you're about to order, drink it\".Never again."], ["Trevor B.", "Bomb dumplings. Quick service. CHEAP. Classic example of a good \"hole in the wall\" establishment."], ["Rick J.", "Been coming here for lunch the last three years. The food if fresh and well made. I love the steamed shrimp dumplings. The fried rice and noodles are also excellent. I would give it a fifth star if there weren't communication issues from time to time. It can also get crowded with the MetroTech office folks and nearby students."], ["Bethany W.", "These dumplings are incredible, i've had all their varieties... fried, steamed, pork and chive, pork and cabbage and you absolutely cannot go wrong. You will also be amazed at how much food you can get for $5..... or better yet $10 is a full meal for 2 people- and i'm no bird.Simply amazing and delicious"]], "Yaso Tangbao": [["Sarah C.", "Definitely the best Shanghainese restaurant in town. Reminds me of my hometown... Strongly recommend! (Typically I do not write such long review, trust me... I just can't help...)Tip: you will be more surprised by dishes other than the soup dumplingsA friend recommended it to me, so I went with my bf (we both grew up in Shanghai). And it turned out to be a surprisingly great experience. We ordered soup dumplings, meat ball noodle soup, sweet&sour short ribs and the tomato soup.Pros:1. The most authentic Shanghainese restaurant I've ever been in the US. No complaint about the soup dumplings (the chef used to be the executive chef at Joes' Shanghai and the owner came from Nanxiang - the soup dumpling town) Skin is thin and it contains the right amount of soup instead of overloading it. (Many ppl thought the more soup the better, while for the real Xiaolongbao, you should never have too much of it!)2. The real deal comes from the other items on the menu, everything that we ordered are top-notch in terms of food quality. I would say the food is great even by a Shanghainese's standard. Meatball is my bf's favorite and the short rib is the must-get as well.3. The store setting provides a very cozy feeling. I am a big fan of the exposed wall and the picnic-style table&chair. And there is even a show-room for you to see how the soup dumplings are made! (I remember I've seen this setting before, hmm...)4. People here are super friendly!Cons:1. Unfortunately, they only have roughly 30 items on their menu and I want more!! (Fast-casual, yea I know...)2. Can you please open your next location at UWS? Seriously, I would die if I can go grab a noodle soup everyday =PNice work YT. We will come back again!"], ["Stuart B.", "The neighborhood is changing for the better.  This newly opened little gem just opened up and it's definitely a breath of fresh air.  This is a definite Chinatown style restaurant with more authentic food than you would get at the majority of places around town.  An added bonus for it being in downtown Brooklyn which has a bunch of Americanized places.You can get real soup dumplings here.  And I especially liked that they weren't completely loaded (i.e. no burning hot soup all over the place after biting)I also tried their veggies over pan fried noodles.  Also amazing.  This will be my go to place during the cold winter months since it's close to where I work."], ["La Dame C.", "While I am normally wary of Chinese restaurants due to their use of MSG - and its consequential migraines - Yaso was a good surprise. The portions are very big and filling. Good quality meat. The chicken is clean cut chicken with no nerves. On different occasions, I've tried the chicken curry on rice and eggs, the pan fried buns, and the braised pork meat balls soup. All three were very good and filling. You could split in half one order and feel just fine. The appetizers are conspicuous too, and they may make up a meal. It is reasonable priced. They do not serve tea or coffee...just soda and water. I like to take out because my house is very close and I do not feel like always drinking soda.Service is very nice and the menu is easy to navigate. They offer few items, but they are cooked great."], ["Peter D.", "Soup dumplings have come to Downtown Brooklyn, and seeing as how I live a very short walk away, this is dangerous to my health. Because soup dumplings combine two of my favorite things in the world (soup and dumplings).As far as I can tell, Yaso Tangbao is a godsend. The place is clean and comfortable, as well as one of few places in this part of the 'hood that I actually don't mind sitting and eating. The xiao long bao (soup dumplings to you whiteys*) are on point, the mapo doufu (tofu to you whiteys) is delicious, if a bit salty, and the counter service is pretty friendly.I have a few minor complaints, but they are nothing that can't be fixed or overlooked in the face of delicious soup dumplings:1. The soup spoons provided are disposable, flimsy things. If we're eating here, why not provide some real spoons, and reduce some of the waste?**2. The soup spoons are also too small. They can't properly hold an entire dumpling, which led to my dominant female overlord (wife to you whiteys) clumsily losing some deliciousness onto the nice wooden tables. This is unforgivable, and I have since begun divorce proceedings. 3. The eggs on top of the mapo doufu were seriously overcooked. Keep the eggs runny, people. A runny egg makes everything better.4. There's no alcohol. There should always be alcohol. This includes the bar mitzvah I was forced to attend over the weekend. I don't care if they are still children in the eyes of the \"law,\" Judaism says that kid is a man now. At least let me drink to that, even if he isn't into whiskey just yet. ___________*I know I may look like a whitey, but that just shows how much you know.**I spent my weekend hugging trees (against their will)."], ["Summer X.", "really nice and authentic place for shanghainese food. The environment is pretty good compare to most chinese restaurant in the US. The food is also good. Steam buns are fresh and delicious, always best paired with chinese vinegar. Soup is hot and tasty. Wish there be more branches in manhattan."], ["Sol C.", "Have been so excited for the opening of Yaso Tangbao and apparently I am not the only one - went on a Monday around 12:30 pm and most tables were full. They specialize in shanghainese street food.This review is for takeout only. My order only took about 5-7 minutes, so they are quick, even with lots of other people waiting. I tried the mapo doufu (tofu) over rice. It consists of ground pork mixed with soft pieces of tofu in a sauce, served over rice and topped with two fried eggs (yolks were hard, sadly). It was tasty and a generous portion.I also tried one of their \"bites\" - the shaoxing wine chicken or \"drunken chicken.\" I've never had this dish before so maybe I just need to acquire a taste for it but I felt it was mainly fat and bone, making it hard to eat and slightly unappealing. I will absolutely be back for dinner so that I can dine in and try their soup dumplings (dine in only). They have specials going all through october (my lunch was 10% off) so I definitely recommend heading over and giving them a try!"], ["Yael I.", "Very good restaurant! Been there for the first time today, really enjoyed the vegetable soup with noodles, crab dumplings and cury noodles.Well decorated, clean, very good vibe .Highly recommended!"], ["Brian L.", "Overpriced Shanghainese food at its best. Crab pork xiao long baosFlushing - $6.95 for 6-8Yaso - $6.75 for 4Braised beef soup noodlesFlushing - $5.95Yaso - $11.50Bottom line... It's pricey but the food is decent. The soup dumplings are freshly made and they do taste good. Not a bad place to eat given the limited options in the area."], ["Amanda H.", "Vibe: cozyDecor/seating: mostly picnic style bench seatingHave been looking for good soup dumplings around the neighborhood after moving here a few months back, and was pleasantly surprised by this place! Loved the soup dumplings.Also ordered the braised beef noodles, which were decent but not as great as the dumplings.Lived in Asia for a while and now I've found my new favorite spot in the neighborhood! Reminds me of home."], ["Leo Y.", "I expected something that is really triditional and more from this so call Shanghai street food...I order the braised beef noodle soup and the beef is good as it suppose to taste. However...the noodle...like come on guys... spaghetti noodle???  That just made it really un-edible...you got a room full of workers... why not have hand pulled noodle? The soup...like really? It is just white radish and pork bone... where is all those other ingredients to boost up the flavor? Overall the price for this dish is to high. I guess this is one of those place that get the hype in the beginning and then it will soon vanish into thin air."], ["Penelope C.", "Soup dumplings in Downtown Brooklyn. Close to where I live! They're quite flavorful and have appropriately thin skins. They're more expensive than in the Chinatowns, but that's what you get for being in this neighborhood.The khao fu--gluten with mushrooms, peanuts, etc., was really good and unobtainable in any place around here. We've also had the braised beef noodle soup--great flavor and beef, but the noodles are a little character-less. I've been waiting for a REAL Chinese  (of any region) restaurant to show up in this area, and my patience has been rewarded.You order at the counter and sit at the bench/table things they've got going on. A perfunctory selection of cold drinks and I haven't even noticed if there's tea."], ["Lizz H.", "My husband and I had been eagerly awaiting the opening of this place and were not disappointed! I often miss the simple street foods of China which I've been lucky enough to experience in my travels for work. This place brought me right back there. The soup dumplings were wonderful as was the mapo tofu over rice, wine chicken and garlic cucumbers. These are definitely authentic dishes and many Americans will likely be put off by the texture of the steamed \"wine chicken\", served chilled but for anyone who knows what to expect, it's a very solid dish and is delicious!The menu is temporary for their soft opening and I'm greatly looking forward to their more extensive menu, especially in the soup dumpling category!t"], ["Eric W.", "Great new Shanghainese restaurant with excellent soup dumplings. They are every bit as good as those at Joe Shanghai (where the chef is from) but without the wait for a table. I also really enjoyed the hot and sour soup. I didn't have one but my friends really liked the drink selection.It's a nice, sleek interior and there is plenty of seating. Highly recommend."], ["Bettina E.", "After walking by this multiple times hoping for it to open (there's a severe lack of good Asian food in our immediate area, and definitely no xiao long bao within a 3 mile radius), we finally got to try it!We arrived a little after 7pm on a Monday night, and all the tables were full. We ordered the xiao long bao (soup dumplings), pork potstickers, the fried chicken fillet noodle soup and the pork mapo doufu. The cashiers were very friendly, and were taking orders on iPads - I really appreciate when establishments use modern technology. Service was quick, we barely had time to check out the very visible soup dumpling prep station of the kitchen and sit down, and they were calling our order number.Now for the food - being huge xiao long bao aficionados, we were impressed with Yaso Tangbao's version - very savory, fresh, and the wrapper wasn't too thick. We polished that off really quickly, and are thrilled that we don't need to make the trek to Chinatown anymore to get our fix! The pork mapo doufu with the two fried eggs on top was delicious and our next favorite. The fried chicken fillet noodle soup was a little weird but good. Unfortunately, we greatly disliked the pork potstickers - we could barely taste the pork, it tasted just like sticky rice. The xiao long bao and mapo doufu more than made up for it though!Overall, we are very impressed with the service, food, cleanliness, and will definitely be back. So happy to have this in our neighborhood!"], ["Angela W.", "Comparable prices to Chinatown, definitely fills the hole of authentic chinese food in the area! Xiaolong bao are great, juicy, though just a little bit more skin at the top than I'm used to. Garlic cucumbers are nice, salty, and vinegary, (almost) just as good as the ones my shanghainese dad made at home!Update: just added the sweet and sour pork ribs and a bowl of rice to my lunch, ribs are great! Rice is, well, good ol' rice."], ["JJ L.", "The best soup dumplings。Like, seriously the bomb。Get the wine chicken。Ok but seriously. The best soup dumplings I've had in NY so far. Seriously. Make your way down here. The dumpling skin isn't thick like the ones in Manhattan. Get the wine chicken too. Yes."], ["TIFFANY C.", "I've eaten most of the items on the menu.  Unfortunately there are no other real Chinese food options in this neighborhood which is why they can charge highway robbery prices.  The food is okay compared to the Chinese-American places in the area.  However, they are overcharging for tiny portions.  The good soup dumplings in Chinatown charge about $4.95 for 8 pieces.  Here they charge $5.35 for 4 pieces, more than double what you should pay!  I get that there are no other options but at least give 6 pieces just to be fair.Cucumber salad @ $5, complete rip off! They give only a few pieces, less than half of a small cucumber cut up and it was very over salted.  Wine chicken - again, the portion was tiny and over salted - steer clear from this.  Sweet & sour pork ribs - came in a tiny order of 4-5 small pieces, basically 2 normal ribs cut into half.  Noodles - I've had the beef and braised meat ball for $12.  Again, in a normal Chinese noodle shop, this bowl of noodles would have been much larger and about half the price.  The noodles tasted okay but one bowl isn't enough for an adult.  If you are going to charge $12, at least let the customer walk out feeling slightly full!  Noodles don't cost that much so adding 15-20% would make a big impact on whether someone is going to return to the place. Curry Crispy Noodle - the taste was very average, would not recommend, and portion is too small for one adult.  Mapo Tofu rice - the taste was okay, but again, for $10.00 I expected more food especially since it's mostly inexpensive tofu!  Definitely not enough to fill a person.  Basically between 3 adults, we had to spend $75 to feel full.  This seems like a rip off for a chipotle style chinese fast food place.  The food tastes okay and is pretty authentic but be prepared to spend about $20 pp in order to feel satisfied.  I am very disappointed since this is one of the few more authentic offerings in this neighborhood but they are too cheap to give a little more in order for their customers to walk out satisfied.  A few extra noodles, tofu, cucumber, or rice would not even affect their bottom line much but they are overcharging purely because they feel they can get away with it!  I like the food here but will not be returning until they tweak the portions to match the price or unless they drop the price to match their portion size."], ["Bob T.", "Ordered the wrong dish. Menu is placed on the side of the Wall partially behind the counter. Very confusing. Be careful when you order. I ended up handing back my uneaten food for them to trash."], ["Jeremiah S.", "This place was okay. The prices are reasonable, and it's a great location, but I found the food to be just okay. I had the soup dumplings, the crab pork dumplings, and vegetables over crispy noodles. The meat in the pork dumplings was delicious, but the soup inside was so-so. Crab pork dumplings were good. Again, meat was great, but soup was nothing to rave about. Would probably not come back."], ["Jamy D.", "So good. Eat here. Or don't, and leave some space for me to sit lol.Typically I'll read or watch an episode while I eat, but I can't do that to the braised beef noodle from Yaso Tangbao. I respect it too much. The noodles and broth alone are amazing. As for the beef, it's like they served me every cut I typically have to brawl my family for at dinner. Also, the soup dumplings are great, just prep for the 20 minute wait."], ["Cynthia V.", "I had the soup dumplings a couple weeks ago and then today I tried the braised pork meatballs over rice with eggs. The soup dumplings were very good, although I do feel like an order is pretty expensive compared to other places I've been in Flushing and Manhattan. The meatballs over rice with eggs were very good, and I splurged and got some of the chili oil (which I don't actually think should be an upcharge item) and it was delicious, although it brought my lunch cost to $14. The pork meatballs were perfectly cooked and flavorful. The eggs were a little overdone, but nothing to freak out about. Overall, I will visit again, as everything on the menu looks amazing, but this spot is too expensive for more than once a week. Check it out, it has great food and is very approachable for anyone not familiar with Chinese food (not me, but most of my coworkers)."], ["MtPleasantChica ..", "Great Shanghai soup dumplings! The mapo tofu, however, came out a bit strange. It was served over rice and barely had any sauce. The sauce it did have was not spicy (having traveled through China, I like my mapo HOT). It came with a fried egg on top, which was a bit overdone. Overall, clean and friendly service / ambiance!"], ["Kristen H.", "Loved this place. Went with a group and ordered practically everything on the menu--plus multiple courses of the soup dumplings. Everything was great and the staff was very friendly. Excited to have this place in the hood. Definitely a great spot for takeout!"], ["Brian M.", "Excellent dumplings, soups, etc! The place is very clean and nothing seems like too small of a detail for them to excel at. Recyclable paper containers for takeout, very nice interior and everything is fresh. You can watch them making dumplings in the kitchen while you wait for your food. And the food... wow! The dumplings are to die for and the noodle soups are unbelievably good.  Soups that contain meat, like the meatball or spicy pork are especially good because the meat is always tender and succulent - never chewy and tough.  I can't say enough about Yaso.  Its definitely worth the trip."], ["Sarah M.", "You would think for a new place on the block, that this place would try to please all your needs. Unfortunately that is not the case. I came into the restaurant to get a seat 10 mins before they closed after calling ahead and they wouldn't seat us. Totally bullshit. When you close at 10, you close at 10 and not 10 mins before. I hope the manager reads this and tells his staff to not leave the job early. Was so turned off will not go back to try it. Cutting corners isn't the way to do business in NYC. There's a million other places to try. Take note!"], ["Matthew R.", "Big fan of Soup Dumplings and other similar fare, this wasn't anything great. The curry chicken in pan fried noodles was tasty but meager portions. For $10 and mostly vegetables, next time I'll pass.The soup dumplings were nothing special. They are heavy on the sesame oil. With Chinatown a mile away, spend the extra 10 minutes on the subway or a car and go to one of the local spots on Pell Street"], ["Nikki C.", "Surprised to see so many reviews already considering that they've only been open for a week. To be honest I expected a long wait, bad food and disorganization since YT is so new. But these reviews well deserved. They're running a pretty smooth operation as far as I can see. Prices were affordable and it took less than five minutes to receive my order. The food? I was pleasantly surprised by both the authenticity and quality. I couldn't be happier to have a proper Asian joint in Downtown Brooklyn. Welcome to the 'hood, Yaso Tangbao."], ["Wesley H.", "nice solid shanghainese restaurant in an interesting location in downtown brooklyn. the soup dumplings are probably the best item on their menu and their noodles are pretty decent too. minor ding - the plastic chinese spoons detract from the experience of the dumplings a bit."], ["AJ K.", "Truly an offbeat location, but the food is wonderful and apparently authentic. Soup dumplings the meatballs even the cucumber salad are all recommended."], ["Olivia L.", "If you like authentic steam dumplings, this is where you need to be. The skin is thin, meat filling is juicy and with rich hot soup oozing into my mouth. Just like the way it is in Shanghai. Other street foods are great addition to the menu. The curry chicken is surprisingly tasty! Tender, juicy and flavorful. Travelled all the way from Manhattan over and worth it! Much better than joe's Shanghai."], ["Christina C.", "Stopped in for lunch during the soft opening and got the pork rice and soup dumplings--both excellent (though some of the soup seemed to have leaked from the dumplings). The dumplings came with a delicious vinegar. Portions were generous and the service was quick. Will be back."], ["Dom M.", "Really great place. A change from the other restaurants around here. They should add restaurants like this around here. Up the place even more. Great service"], ["Mike R.", "Overpriced. The xiao long baos price are double compare to the ones in Chinatown, and the taste really cant' compare with Joe's shanghai, really nothing to raved about if you have tried shanghainese food in other places."], ["Vicki V.", "The ribs were sweet and feel apart in my mouth.   A surprise find in the neighborhood, it's part of the creeping gentrification."], ["Angela W.", "My friend sent me here she was raving about it I value her opinion so I turned up for lunch. I had 4 dumplings - and a small soup. Both dishes were okay nothing to rave about and expensive for what I got. My main problem was with the staff: snooty- I asked how big the various dishes were and what they were and neither of the two women I asked were helpful - it's as if I should know even though this restaurant has only been open for a few weeks - I felt like I was bothering them. I work on Willoughby and my co workers were excited when I came into the office with the bag but they were all unimpressed by what I revealed. Shame because Downtown Brooklyn's lunch choices are so boring this place could have been the light I was looking for. I was put off by the people behind the counter making the dumplings were not wearing gloves. I won't be back."], ["J L.", "I am a big fan of shanghainese food and really want to love this place but disappointed after my first try today. I waited about 5 minutes on line not knowing what they have until I got to the cashier and quickly read through a one page menu printed on a plain A4 paper. Their hot and sour soup is $4 served cold in a tiny paper bowl next to the cashier and it's $8 for 6 cold, non-juicy and easily break dumplings...I would rather take a one stop train ride to Chinatown."], ["T J.", "I work in the area, so how excited was I for these place to open.  Waited for a while for the crowds to die down. (I'm pretty sure it won't)( This place was a hole in the hole, I think Asian City.  I was jumping up and down when I saw the sign go up.  Shanghai Street Food.  Trumpets playing, Confetti in the air, hooray.  Finally got a taste,  didn't even bother to take pics, so excited.  One of my pet peeves, paying for bad food.  This was a huge disappointment.  I work a block away, dumplings was not even warm.  I was suspicious when they said food would be ready in 5 minutes.  But what do I know, I don't run a restaurant.  Crab/Pork dumplings - Costco frozen dumplings taste better than this.  How do you have dried dumplings, with no juice.  Isn't that why it's call soup dumplings.  Yes, I stand behind that statement.  Look at other Yelpers' pic, so small.  Don't get me wrong, it's edible, but 4 for $6.75, ever time after this, I'll walk down 2 short blocks and have Golden Fried Dumpling at 192 Duffield St.  Four dumplings for a dollar, 10 for 3.00 for boiled. They have so much more flavor.   Also got the Braised Beef noodle soup,  We were tasting the noodles, tasted like Ronzonni spaghetti,  Hey, Hey, that's what everyone at the office concluded.  So I'm not making this up to be a jerk.  Most of the pieces of beef that everyone had was extremely chewy, not in the good way.  The broth was missing everything, what you might asks? FLAVOR.   Another yelper wrote that the E. chef is from Joe Shanghai.  I find that extremely hard to believe, and if this is true, that's very unfortunate.  (Boss Man, no need to reply here, Y.T. will be successful regardless of my opinion.)"], ["Brandon C.", "This place is excellent. Fresh and delicious food with standard favorites and Shanghai specials. It's the real deal."], ["Nina K.", "Great soup dumpling. I had mapo tofu- it came with a fried egg which was fried to death! So tough that I had hard time biting off. The hot and sour soup was too small in portion for $3.50 price tag. Loved the paper container. Will definitely eat again for lunch!!"]], "Szechuan Garden": [], "M Shanghai Bistro & Garden": [["Max C.", "M. Shangai is convenient, consistent, and always quite empty for lunch, which I love.  I've had everything on the menu, and it's all good, but if you want a great order, get the steamed juicy dumplings, salt and pepper shrimp, and rice cakes with shredded pork. Nothing to scream about, but it always hits the spot!  If you have an issue with the pricing, you can go over to Jackson Heights and visit Tashi, a Nepalese food cart right off the 7 that sells dumplings for a quarter of the price and equally delicious."], ["Samrita V.", "This place is GREAT for vegetarians! I was pleasantly surprised by how many options they had. The portions are very comfortable as well. The staff is also very accommodating! and the bartenders are great.Would def recommend the DUMPLINGS......yummmmmmmmmm"], ["Misha T.", "Chicken and spinach soup was pretty weak. Noodles were too soft and the flavor felt lacking.XLB were... I don't know, ok? Ish? They did indeed have soup in them but stuck together making it hard to pry out individuals without tearing them open. The soup was kinda greasy too."], ["C. Spencer B.", "The delivery guy leave the front door to my apartment building open every time he comes. If you politely ask him to close it on the way out he leaves it gaping. I think he's insane."], ["Jon S.", "One of my favorite take out Chinese spots in the area. Obsessed w the chicken with chili pepper and Mongolian beef...two awesome dishes. Stay away from the noodles...not a fan. I think the goal here is finding the dishes you love and sticking to them; I've found that it's hit or miss with a lot of their dishes, but the hits are awesome.  Solid space if you want to eat there."], ["Nalina S.", "I come here specifically for the soup dumplings---they are divine. The restaurant really relaxed and cozy, so I find myself unwinding here after a few drinks in the neighborhood. The veggie dumplings are also pretty solid. Overall the food is decent, but I haven't really tried too many things because I always have to leave room for the soup dumplings (which surprisingly fill you up!)."], ["Jaci H.", "I come here all the time and I've come to the conclusion that the only thing really amazing here are the soup dumplings.  I think the restaurant is cute, with nice staff and decent decor.  It's usually a little too loud and I end up screaming my conversation to my party.  Time and again I try the various dishes on the menu besides the dumplings and I'm always underwhelmed.  The fried rice isn't even really fried, the shanghai noodles are simply a stir fried udon... the list goes on.  Even the scallion pancakes are too doughy to really catch my interest.  The prices are really high for what you get.  There's also something wrong with their draft system.  I always order a pint and its always on the warm side... not really cold enough to enjoy. I'll keep coming back but I'll save my money and focus on only the soup dumplings which really are great and way more convenient versus going into the city for them."], ["Wattle K.", "This use to be one of our go to's, but unfortunately the quality, freshness and flavor has been getting less and less with every order.  We're buying better dumplings at Food Town these days; the love has all but left the kitchen. Come on guys, get it together."], ["Virginia E.", "Came in to try the soup dumplings. I had tried them before down in chinatown and ever since loved them and wish there was a place close to me that I could go anytime too. I was so pleased that the dumplings didn't disappoint at all. I had the steamed juicy pork buns which were yum yum yum. I also tried the Shanghai Style Lo-Mein but to me having the buns was enough to win me over. Delicious!!!"], ["Scott T.", "Alas, sniff, sob... I ended up here completely by a bizarre random chance that involved a downed subway line and a chance meeting with a fellow musician at a subway stop that included some general drinking and carousing fairly late into the evening. So why am I sad? Because, dammit, it's just not fair that food of this quality can be found seemingly everywhere in the greater NYC area. But then, I'm just a lowly native Kansas guy in love with Queens so I should know by now. But wait, where are the Chinese people working in this restaurant? Yet we were served perfectly marvelous soup dumplings, two types, and a beef dish with onions that was to die for. A couple of Chinese beers sitting elbow to elbow at one of their picnic style tables... life was fine. I've had soup dumplings at three other highly rated Chinese eateries on this visit and these took a back seat to none of them. Unlikely I'll ever visit again but I won't soon forget the pretty spectacular meal we had. This is good food as it should be.We had: Steamed Juicy Pork BunsSteamed Vegetable Buns (see photo)Sliced Beef with Scallion and Onion in Brown Sauce (Awesome!)Two Tsingtao BeersThe (Awesome) above is their description on the menu but I concur."], ["Scott K.", "I have not been in a while because I got fired from there(I am still the worst waiter ever) but I was passing by the other night and went in for one thing and one thing only....Juicy Pork Buns. Let me  tell you they are the best ever. The food there is the best Chinese food I have ever had."], ["Abbey S.", "I haven't had the best luck with finding entrees that I really enjoy at Shanghai- it might have to do with quality/way they cook their chicken? Their hot and sour soup, however, is definitely my favorite in the Williamsburg area and the service is awesome; everyone who works there is really nice and delivery is fairly quick!"], ["Steve W.", "As far as I'm concerned this place is a gem !  The soup dumplings are the best you will find and the beef awesome is outrageous !  I used to go to Joes Shanghai but after being advised by another foodie friend I haven't looked back !  And I travel from manhattan to Brooklyn to come hereI've read some of the other unhappy reviews commenting on Lo Mein and fried rice at M Shanghai and this is my take ..... It's like commenting on creamed spinach at Peter Lugars , it's not my favorite and I'd prefer The Palm Steakhouse for the creamed spinach department , but I'm not going to Lugers for creamed spinach and I'm not going to M Shanghai for Lo Mein or fried rice .... I'm going to M Shanghai for what they perfect and no one , I repeat NO ONE does a better Soup Dumpling or Beef (awesome) dish better than here . You want truly authentic Lo Mein go and enjoy an 80 hour flight , you want the best soup dumpling and beef awesome dish , this is the spot !"], ["Monique R.", "Came here on a Wednesday night around 6pm for dinner with my S.O. The restaurant was practically empty. With 4 long picnic style tables and two small tables in the corners, we had the free will to sit wherever we wanted. I was glad we were early because had it been later in the evening, the odds of sitting with a stranger were great. Service was quick and friendly. I ordered the pan fried dumplings to start. The dumplings were small but the portions were a little small. For my entrée I ordered the kung pao chicken and my S.O. ordered the special fried rice. The kung pao chicken was nearly $13. It wasn't large enough to share. I thought it was amazing but a little pricey. The kung pao chicken came with a small serving of white rice. My S.O.'s fried rice was really great as well. It was also on the small side for $10. Towards the end of our meal, we decided to order another kung pao chicken since we weren't exactly full. I can gripe about the prices all I want and how sitting next to strangers annoys the hell out of me. But one thing is for certain: their food is absolutely delicious. And if sitting next to strangers bothers me that much, I can always order it to go, or have it delivered. Get the Kung Pao Chicken!"], ["Lincoln L.", "Clearly they have new ownership or chef for the last 5 months. This tastes like typical Brooklyn Chinese  takeout now. So sad."], ["Carley F.", "Came in to grab a quick dinner before a movie at Williamsburg Cinemas. Ordered the steamed veggie dumplings and their signature lo mein (shrimp, chicken, pork). The veggie dumplings were decent but the lo mein tasted strange, noodles were too thick and cooked too long (soggy) and the accompanying sauce on the dish didn't taste right. On the way out we noticed the C eating which made our stomachs turn a little more."], ["Michele B.", "Ultra yummy Chinese food! Faves are the dumplings, Shanghai shrimp lo mein and string beans. Excellent indoor dining and quick delivery, makes a me happy"], ["Megan G.", "One of my favorite dumpling spots in the city.  In fact, the only thing I ever order when I come here is 2 servings of vegetable dumplings.  I have no clue how the rest of the food tastes! My boyfriend used to live nearby, and I would force him to order from here whenever I stayed at his place.  Now that we live in a different neighborhood in Brooklyn, I find myself craving these dumplings all the time, especially since we have no viable dumpling option that even comes close.  The sauce they mix up for you is delicious, and I've tried several times (unsuccessfully) to recreate it at home.  There is quite a bit of seating inside, and I've never had to wait more than a few minutes, even with a large party.  They have a cute back patio for when the weather is nice."], ["carsten v.", "The happy hour prices are great and the food is delicious. We really love the veggie wontons in peanut sauce. The awesome beef is great. The noodles are great. The pea leaves are great too.I've had a lot of the things on their menu and I have to say that this place keeps me coming back. The prices and the quality are all good in my book.I think a Tsing Tao is only 3$ but it may have gone up to 4$ recently. Either way that's not a bad price. The staff is nice and the hours are great. You can get a table without too long of a wait most of the time and it very likely that they'll have room to seat you immediately.Eat here!!"], ["Lucy L.", "My family is from Shanghai. I grew up eating my mom's handmade zhong zi and handmade sticky rice shumai. Being from the bay area, I'm so used to have good Chinese food right at my door step. Right now, I'm based in New Haven and I was desperately craving sticky rice shumai and soup dumplings (xiao long bao). After doing some research, I found that this place had them!I came here for 6 of my friends and was really suspicious when we found that the menu was only in English. That's usually a red flag for Americanized Chinese food. But don't be deterred! We ordered:Steamed Juicy Pork BunsSticky Rice ShumaiScallion PancakeSweet and Sour Cucumber SaladVegetarian Wonton Soup Shanghai-Style Rice CakeChicken with Chinese Broccoli in Brown SauceFried Tofu with Sweet Peppers in Black Bean SauceThe Steamed Juicy Pork Buns, Sticky Rice Shumai and Shanghai-style rice cake were all very good. Not too much soy sauce in the rice cakes but still flavorful. The juicy pork buns were really good - just enough soup in them. Finally, the sticky rice shumai was amazing. While I'm biased and think that my mom's are better, these are more than enough for stick rice in the US. Most places serve cantonese-style shumai. These sticky rice ones are hard to come by here, and authentic! I highly recommend giving it a try.Everything else we ordered was so-so - not very remarkable. The sweet and sour cucumber could be a little sweeter and crisper. The vegetarian wonton soup (eaten by my vegetarian friend) was okay, but what honestly, a lot of the flavor should come from the meat, so I'm not surprised. Overall, I recommend this place, esp for the soup buns/soup dumplings and the sticky rice shumai!! Check out our post here for photos and more: talksoverlatte.com/2014/… :)"]], "Triple Z Restaurant": [], "Hunan Delight": [["Joodie T.", "This is one of the few places that offer Peking duck on their menu in park slope and we always get this dish when we either order take out or eat in. It's pretty delicious with fresh spring onion and cucumber but the best part is the pancake they offer which is my preference over the steamed puffs. The rest of the fare is yummy american style and traditional Chinese dishes. Seafood dishes are exceptional and presentation is also impressive if eating in. Delivery is fast, no seamless but they will swipe your card at your door which is nice when cash is low. Yummy food here."], ["Rebecca N.", "This is as good as it gets when it comes to Chinese takeout in the neighborhood... I'll admit I've even eaten IN the restaurant when my friend and I were feeling adventurous enough to walk down the block one night, and it was pretty nice inside! My go-to moves: hot and sour soup, crispy honey chicken (YUM), roast pork fried rice, dumplings. All pretty exceptional. If you're going to Seamless some Chinese to accompany your Netflix binge (or if you're a Jew on Christmas), this is the right choice, even if sitting on your ass and eating yourself into oblivion isn't (but then why does it feel so good?)."], ["Queen R.", "Great on the apps, the dumplings, totally yumm, and the veggie wonton soup, oh so great, but the veggie bun unparalleled it all. The chow fun was bland as hell, and too expensive!"], ["Judd S.", "If you are shut out of a hipper place that is too hot to trot, this is a great alternative. Hunan Delight is a real underrated superstar. First of all it occupies incredibly envious corner. It is on a serene block on a quiet, beautiful brownstone avenue. They have gorgeous outdoor seating in the summer months. And although the name suggests a lame Americanized Chinese experience, it's actually not that at all. They have some Chinese-American standbys, but this is by no means in that category. No fried crunchy noodles here. There's dim sum, a good selection of mandarin noodle soups, and everything is generally cooked tasty and fairly light. The large vegetarian selection is also really phenomenal. It's rare to get this combination of comfortable and sophisticated atmosphere and very good ethnic food. A hidden gem, no doubt."], ["Sara L.", "I've been coming here with my family for the last 25 years and will continue to come in for another 25 years! Scallion pancakes are awesome, and there are healthy steamed options"], ["Leo L.", "This spot is ok, nothing Extraordinary, and nothing bad either. Good spot for some local Chinese food, it sure does beat any fast food Chinese restaurant around the area.I am very familiar with this establishment, although I've never got a chance to write a review. I don't visit frequent but when I do I stop in for the Lunch special. I stopped in today and decided to write a review.Their Food is ok, but nothing great, one thing is for sure... you can't beat that Lunch special price! Pretty inexpensive at $6.95 you have a variety of menu options to choose from, all Lunch specials comes with a Soup, which i love (Soup in general that is).I probably will stop by again one day since it's so near to me, but not too often lol. If it werent in the area I would never travel to come here, i only travel to China Town for some Authentic Chinese Food.The best part about the whole experience at this restaurant is the Complimentary crispy noodles accompanied with Duck sauce on the side for dipping, you get this delight as soon as you are seated."], ["Enrique V.", "Great place, consistely good service and food. Ive had a few things on the menu, but my fav is their version of the sweet and sour chicken. Give it a try and decide yourself."], ["Frank R.", "Delivery is insanely fast. Always a nice hard working guy comes in a car which is safe which I like. It's all about the crispy honey chicken, white strips of amazingness w broccoli, I order this like 2-3 times a week I swear to god. Its just real solid Chinese food all around. I also get the  baby bok choi w fresh garlic which is juicy and life-giving.Nothing off the charts, but never really fails either, 5 stars all day.-Frank"], ["Bedor E.", "The atmosphere is wonderful and romantic like- great for like a date or jus a bunch of friends- jus to hangout n eat some delicious food!!!!! Everything I order is tasty!!!! The food is AMAZING  The service is AMAZING! The window view is beautifulThe seating is comfortableThe bathroom is nice and clean.Must try, this place!!!!! If you love good chinese cuisine."], ["Susan R.", "Very inconsistent. Sometimes the food is great and like tonight it was just horrible .  The roast pork and mixed vegetables we terrible.  The pork was like chewing leather and the veggies were waterlogged and soggy .  The vegetable dumplings were soggy .   The vegetable fries rice tasted rancid and burned . Never returning."], ["Scott B.", "The reviews are right-- this place definitely serves up some delicious American Chinese food. In fact, so far, it's the best I've had in Brooklyn! I did have to jump on a train to get there and could have just as easily made it to Chinatown (and probably got there faster) ... but I'm a Brooklyner now, and I want to support my borough and explore the best of the best right here =) Plus, this place is very nice and modern inside, and atmosphere makes a huge difference to me. On my first visit, I saw a couple of Asian women prepping fresh green beans near the kitchen, so I ordered Chicken with Green Beans with Egg Fried Rice and an egg roll. Everything was fresh and above average... and quite delicious. Also, note that I had food envy looking at other patrons' tables--that is, everything I saw being delivered to other tables looked amazing. Needless to say, I'll definitely be back to try some of their other dishes... even if I have to jump on a train to get there."], ["Abul R.", "Best Chinese in PS. As another yelper wrote, not fancy, not dirty, just right.Only thing I would do for five stars is take away a little grease.Excellent scallion pancakes,Great chicken lo mein,Wife loved her beef Szechuan style. 20 min delivery time.Will def order from there again.Wish it was on seamless."], ["Aryeh N.", "Best chinese in the neighborhood by FAR. The lunch special in particular is a fantastic deal. Service is good, the food is great - what more can you ask for?"], ["Abby S.", "this spot is the perfect in between Chinese place. it's not an actual dirty Chinese take out but not a fancy expensive one. it is perfect for a fast but delicious meal. when we want that in between Chinese food fix we come here since it is right down the street. their shrimp dishes are really amazing. I have tried the shrimp with walnuts and mayo and also the shrimp with sweet and spicy sauce. they were both sooo amaaazeeeeee! I do not know what breading they use for their shrimp but it is so good. their portions are pretty decent and they come with white or brown rice. I have also tried their beef with string beans. super tasty too. the beef was actually really tender and the string beans crunchy and flavorful. it was not too salty like how it usually is at Chinese food places. their wonton soup is decent, nothing to be excited about.if you dine in it is really nice and clean and modern. service is good. take out is fast and efficient. this place is really awesome and really great. the food is quality. price range from 10-15 per entrée. although im a huge fan of dirty Chinese food places (I think the grittier the better), this place is on the top of my Chinese food list in Brooklyn."], ["L I.", "The food here is so tasty!! Things taste so fresh and not oily, like many Chinese Restaurants. They also have a great assortment of vegetarian options which fantastic. Highly recommend this place!"], ["Asmita J.", "Came here for a quick bite so this review is only based on one visit and one dish - the sauteed broccoli. It was great! I thought it would be chinese broccoli, but it was just regular broccoli. Nevertheless, it was very tasty. The place is a bit pricey but definitely worth checking out. I'd come back here to try out some other things."], ["AMANDA R.", "Hunan delight has never steered me wrong I come here every week and I have never had an issue or a disappointing experience. The food is amazing, staff is friendly and the prices are great. Very nicely lit cozy spot. I highly reccomend the shrimp dumplings they are always fresh plump and have great flavor!! I feel lucky to have such a great place to eat in my neighborhood. Just a tip if you are eating at hunan always bring a sweater they tend to keep the AC on super high could be a little too cold in their at times"], ["Hokeye1801 ..", "As a traveler with a taste for good Chinese food and a restartaunt that took my AMX Credit card, Hunan Delight satisfies!! I had a chicken/ vegetable combo platter with pork-fried rice and an egg roll as a takeout meal. Service was good and fast. Even after a 10 min walk back to my hotel, I found the rice to be seasoned just right (not over salted) and fluffy. Portion size and taste was delightful. I will definitely make another visit and highly recommend this restaurant."], ["Dee S.", "Finally, a reliable Chinese place.  No filthy windows, grease on your plate or C rating from the Health Dept.The scallion pancakes are the best I've had in a long time.  Delicious and crispy, they hit the spot.  The bean curd was also very good, as was the honey crispy chicken and the General Tso's shrimp.  Definitely want to try the sesame chicken soon.  Downside: prices are a little high, and I got a really mean fortune cookie!  The fortune told me to tone down my personality!"], ["Matt E.", "Finally Chinese that isn't the one of the 2 standard Chinese options of New York:1. Stand n Wait, dingy spots you always feel shame going to.or2. Frouffy, avant-garde often fusion spots where you get jacked for Szechuan shrimp.Yet, thank heavens, Hunan Delight is the odd one out. A straightforward, non-gross, easy, reliable neighborhood standby. It's got a large seating area and it's very fairly priced.Eating there can be convenient or annoying, convenient in that there's always space. Annoying in that this place can be crawling with strollers and annoying kids. But picking up food in the area is great. I order the lunch specials all the time and there about 30 different options. You get a good amount of food: entree, rice and soup. One thing I always like is that the entrees always have something extra in them, something you wouldn't expect, sauteed pork has tofu and mushrooms as well. Chicken and cashews also has vegetables. You never really know, I'll call it--a bonus! Food is always fresh, nothing soggy, I'm into it, yay, shall keep returning."]], "Siz-In-Pan": [], "Liu's Shanghai": [["Patrick Z.", "Just had lunch here with my friend. A bit busy for a Sunday but got seats right away. Service was great. Condiments and menu came right away. Didn't have to wait long for our food to come either.I got my usual that I get from shanghai spots. I had the spicy beef w/ noodle soup and shared a pork steamed bun w/ my friend. My friend had shrimp w/ lobster sauce on rice. We also had the shanghai fried wonton which was recommended and it was delicious definitely will get that again.Overall it was a great experience. The food was on point. The setting is nice, comfortable and clean. Nice and spacious. Perfect for small parties and family dinners. Definitely a go to spot if you're trying to get a taste of shanghai especially, for me since I'm local."], ["Es L.", "It's no fancy restaurant, but the food is sooooooo amazing!!! Definitely try their fried dumplings and soup dumplings. I'm so glad to have this place in my neighborhood."], ["Jammay C.", "We went to this restaurant for lunch, due to the good ratings from fellow yelpers.  The place is clean and fairly empty at 2:30 on a Thursday.  There were two other tables dining at this time.  We ordered the crab and pork soup dumplings and and an order of Seafood noodles.  The soup dumplings lacked the inside soup and the skin was a bit on the thick side.  The \"seafood noodles\" are what I call a \"catch the pig\" dish.  Couple of tiny shrimp, bits of squid and sliced FISH BALLS!  I was hoping this restaurant would be a hidden gem, but it is just another take out place.  Not recommended."], ["Eric L.", "A friend recommend this place to me because of their wings so I came by one day after a hangover with a couple of people and decided to try them along with their dumplings.Their wings have a different flavor to them unlike any other Chinese restaurant I've ever been to and their dumplings are on par, if not better than any gimmicky place such as Joe's Shanghai. Their prices are very reasonable and the customer service is excellent, constantly ensuring I had a fresh pot of tea. There is also plenty of street parking around the area. I didn't try anything except the wings and dumplings but the friends I was with had a few different dishes and they all approved of me suggesting the place."], ["J O.", "I live just around the corner and this place has never been on the radar for me until recently. I'm so glad I decided to walk in or  else we would have missed a neighborhood gem. Reliable, clean, and delicious, also great service and people. Definitely feel the family owned style of the place which is a huge plus for me. Will be back for more takeouts and dinners!"], ["Helen R.", "A must stop every time I come home to visit! I love love love the XLB's. That is all I eat when I come here. Nothing fancy just the original pork filled soup dumplings. Yummo!"], ["julia r.", "thanks yelpers, this place is fantastic! my park slope/boerum hill friends and i were up for something out of our normal five block radius, and drove out to liu's in bath beach for lunch in hopes of finding something new (to us) and delicious. our friendly table neighbor gave us some advice on the menu, and steered us in a most tasty direction. we tried the fried wontons (in a peanut sauce, perfectly crisp without being dry), the crab and pork soup dumplings (excellent), the triple delight noodle dish (yum), string beans (again, perfectly cooked and to be honest i usually don't even like string beans because they are often so bland but these i could not get enough of), and another dish that had rice discs that just melt in your mouth. followed by a viewing of the martian at sheepshead bay, liu's was part of a top notch day :)"], ["D K.", "So glad I don't have to trek all the way to the city to satisfy a xlb craving. Pro-tip: get the Shanghai wontons. They're essentially fried wontons drizzled w this peanut butter/hot sauce concoction topped w some peanuty dust. It's crack. No, I legit think the peanuty dust they sprinkled on these is crackcocaine bc I'm addicted and think abt them all the time."], ["Michelle F.", "Yum! The spicy wontons were the bomb! It so different. Not very spicy but it's coated with sugar and peanut sauce. The place looks so clean now with the new Reno. I can't wait to come back and try other items on the menu."], ["Yong Yi D.", "This place takes cash only! (Edit: My mistake, it does take cash, please see comment below) Small and sweet family owned place. The food has a home made feel to it. Xiao long bao is very tasty but the skin is slightly bready and thick. Best Xiao long bao I've had in Brooklyn. I'll be coming back soon to try more dishes!"], ["Sammi R.", "Excellent Shanghai food especially the Xiao Long Bao. Courteous and respectful service. Definitely recommend it"], ["Lauren C.", "Visiting friends & family in Brooklyn and it was too hot & muggy to cook or go out. Found Liu's Shanghai based on the good reviews so good friend jumped on the subway to bring back takeout.Shanghai wonton in hot sauce was unusual but very unique & tasty. Usually boiled & served in a spicy sesame sauce. The Liu's fried their with same sauce but the wontons were slightly rolled in a dry crushed peanut & sugar mix. Unusual but it works and the pork filling was very fresh so it was delicious. The fried dumplings were also delicious & served with a garlicky vinaigrette. We also shared noodles with chicken, shrimp, pork in lobster sauce. Add a little red chilli sauce & black vinegar and it's fantastic.  The noodles in spicy meat sauce was sweet & spicy and the Liu's cook their noodles very well. I've boycotted Joe's Shanghai because you can crack a window with their noodles. Some places over cook their noodles so it's a sticky mess and you can't mix it properly. Bravo to you Mr. Liu for getting your noodles right. And the Kau Fu was delicious, a little bit too sweet but they score points for the lovely tender texture. I've had this in 2 other places and it's always  been a chewy sponge like texture. Bonus points! For the $36.00 worth of food we purchased, we found 1 complimentary scallion pancake and 2 small containers of coconut tapioca dessert soup. Even the free stuff was flavorful & no skimping on ingredients. Friend says she hopes The Liu's prosper & do well without losing their perspective on ingredients. Not that many good tasting Shanghai style restaurants in this side of Brooklyn. Other 2 friends said same & will head straight to Liu's next time for soup dumplings."], ["Bing-chuan C.", "I am ok with their food and their service most of the times. But I went there on a Thursday night with my family of four and we were ignored. We had two young kids and they needed food. We only received one of our four dishes and the one that came was the soup buns which was not enough food. There was a family of three that came in at the same time and they received all their food. There were people coming in to order take out and they received their food before us, a family of four with two young kids. After more than 30 minutes of waiting we decide to have the rest of our order to go! I was so disgusted that I didn't even bother to get my change. I hope this is not an average occurrence. The brother and sister team was just disorganized when it got too busy. I hope they hirer an additional waiter on those busy times or they will start to see business sharply decline."], ["Tanzina A.", "Really great place to eat! I went there for lunch on a Saturday afternoon and although the place was a little crowded at first, the food was great (especially for the cheap prices!) and the staff was very friendly and nice about explaining the dishes. Although they were sadly out of the 5-spice beef, the soup dumplings were delicious and the fried wontons covered in peanut sauce were AMAZING. Love them and can't wait to go back here for more!(Only thing I disliked... the outside of the restaurant looks kind of dingy, although the interior is quite nice. This place needs to clean its windows and look a little more inviting, if it wants more walk-in business!)"], ["Sasha C.", "snuck in during lunch with just the 2 of us so we snagged the table by the front. it was pretty full and people looked like they were enjoying their food and company. we were craving some shanghainese and looks like theyre one of few if not the only one in brooklyn. had a great fulfilling meal - wine chicken, aromatic beef, fried rice with anchovy/chicken, soup dumplings (these were just ok). tried to come back for dinner one day but the line was out the door so moved it along. will def be back soon."], ["Lucia C.", "I have gone to Liu's Shanghai a couple of times and I can honestly say that each time, the service provided was impeccable. It's always a full house the past couple of times I've been there but I was always persistent to wait because they provide such great customer service and to top it off, their soup dumplings are seriously amazing. There is one situation I feel is very important to address. To start off, the menu has a HUGE variety of options to choose from and being the indecisive person that I am, I couldn't decide what type of dishes/appetizers I would like to have for the night. The waitress who took my order was very thorough with describing the dishes. Not only that, but the waitress had asked me, \"What type of dish are you looking for? Noodles, rice dish, etc...\" At that moment, I was in awe. Usually even in 4 star restaurants, waiters/waitresses would just tell you their \"special for the day\" and then resume to asking you what you would like to have. They don't waste any time to ask what type of dish you might be leaning more towards for the night nor do they have the time of day to elicit a minimal conversation. Like I said, it was a full house! There was another table waiting to order but the waitress still made sure to give me the best service possible by taking the time to answer all my questions. Any customer would want a waitress/waiter's undivided attention when it's their turn and I feel that, that is very important in gaining new customers + returning customers. Another thing I noticed was that there was another waiter working and he consistently refilled my tea without me having to ask! Usually, waiters are never aware of the little things like filling up a cup of water and so forth but these little things add up to the great experience and It is safe to say that Liu's Shanghai provides all the little details to make your experience the best possible! Now, let's talk about the food! The food came pretty quick! My soup dumplings came first and right after I was done, my fried peanut butter wontons followed. Let me tell you. These are the best wontons you'll ever taste if you're into a sweet & salty combination! I order 2 of these dishes every time I visit and there are 10 wontons on each plate! They're just THAT delightful! My main entree was also great. One of the best entrees I've had there would definitely be the stir fried rice cake with shredded pork and mushrooms! It is a MUST TRY. To keep this \"kind of\" short and nice, I felt that the waiter & the waitress definitely prioritized well! They keep their customers happy and always make sure all the food are served in a timely manner! I haven't had one bad experience yet and I can't wait to stop by soon!"], ["Lenny G.", "Been coming to this place for the past few weeks with my wife. We love the service and the food. My wife and I like different spice level of the hot and sour soup and both of us get exactly what we want. We love the hot and sour soup and the attention and appreciation we receive as customers. We also tried some other dishes (general tso's chicken and beef with Chinese hot pepper) and they were excellent. Definitely one of the best places in the area."], ["Ariel F.", "Well this evening I I'm not feeling well and decided to get soup and when I'm sick I love egg drop soup so I decided to come here always read and hears about so me and my son said today is the day. The guy and girl that were at the front were so nice really cool I think he said his name was bailey (sorry bro if I got your name wrong) we felt very welcomed when the the greeted us! I ordered a large egg drop soup (hit the spot) and my son ordered General Tso chicken with beef fried rice and it was so good and fresh! I will be ordering here again and again and again"], ["Suzy Z.", "new family owned business. very friendly and nice. i love the way they changed their decor. more comfortable than before. very fast and attentive. would come back."], ["Shirley F.", "Cute mom and pop shop in bensonhurst. The only shanghai food in bensonhurst.  The soup dumplings were the best part."]]}