{"Cafe Rue Dix": [["Erin B.", "Love, love, loved it!-Beautiful decor and relaxing ambiance for brunch-Crepe Monsieur (crepe with ham, cheese and a fried egg with greens on the side) was absolutely delicious  -Tea was served loose-leaf in an individual teapot, gourmet tea -Splurge for the fresh squeezed oj! -Service was friendly"], ["r m.", "Great atmosphere, very well-prepared food. Nice place to mellow down, breezy and open space, welcoming waiters and bartenders, if a bit slow at times. From a solo breakfast coffee and baked good.... to a full meal with friends, lovers, or parents...to a drink at night at the bar, this place serves all times of day and all needs.There's also an occasional impromtpu dance party, with a DJ booth in a nook above the restaurant spinning excellent music. The owner does this when he feels like it, when the mood is right, he doesn't force it.Food:*Their croissants are very French, as they should be and never are. Ask for them heated up, with Senegalese hot sauce on the side. *Delectable brunch and endless coffee which isn't at all weak, choices for every palate.*For dinner, at first I thought this wasn't a great place for vegetarians, but then I had their kale salad. It's one of a kind, and very filling, with half an avocado at center and an excellently tangy dressing."], ["Lauren B.", "I was first wary when I entered this restaurant because the aroma was very strong. After awhile, I got used to it and it didn't bother me. I only came here to grab a drink with a few friends and I am happy I did. Their Bloody Mary's are so good! I think Bloody Mary's are so fancy and grown up. I have tried them twice and just couldn't stomach them. My friend ordered and I thought, what the hell, let's try this out. I am so happy I did. Not too salty and a great amount of vodka.My friend also had a coffee, a Touba. Delicious and strong.Hummus plate was also really good. Their pita bread was very soft. I thought about ordering another one just because of that bread!"], ["Lily N.", "The food was great, especially the french toast. However, the service was extremely slow. We asked for the check 3 times and they did not begin to calculate the bill until we asked for it the 3rd time."], ["meli l.", "Lost our reservation and then gave me shit about it (actually said, \"Hon, I don't think you MADE a reservation\" until I showed them the confirmation email on my phone) and took over 40 minutes to seat us as a result.  Did we get comped drinks or anything else for our trouble?  Nope.   The food was delicious, but two in our party got the wrong entrees - and not each others' just two totally different entrees, but we certainly weren't about to say anything since everyone was totally starving by this time.   And ditto on those who have commented on the hit-or-miss service.  Two were full on rude (see the one above who was condescending about our reservation) and two were the nicest, coolest servers ever."], ["Sandra D.", "Wow. This place is a hit. First things first, the decor and ambience is welcoming; decked with Senegalese decor. I went here with my parents and boyfriend after my graduation commencement so it was a happy. And our meal only helped improve the mood! We had the empanadas for appetizer: the meat inside was just delicious. Add in the sipping hot sauce and you have a great appetizer! Meal-wise, I had the cafe rue burger and it was the best I have ever had. Not onlyWas it seasoned well, it was paired with my favorite kind of Fries (with the skin on them). There is also a happy hour until 7 during the week which includes lower prices for more than just the drinks. I definitely recommend this place!"], ["Tommy K.", "Cafe as a whole is four stars. One deduction was for the fish stew that smelled foul. The source was from the eggplant, and the smell was like wet dog. The fish was decent but the smell overpowered everything on the plate.The chicken stew was delicious.Service was great. Can get tight inside when it's crowded. Bar area is nice. We'll return for another visit. Worth checking out.p.s. New clothing second-hand retail shop next door by the owners. Great selection at great prices."], ["Diana X.", "Absolutely lovely! I had the duck croquettes and rose lemonade. Both were spectacular! I was traveling alone and the waitstaff was very friendly and attentive! Will definitely visit again when I am in New York again :)"], ["Michael M.", "This place is a gem.  Great food, great service, great vibe.  Thrilled to live near it."], ["Margot M.", "Went in for the Happy Hour (eh), stayed for the incredible food. Holy smokes the spring rolls are so savory and absolutely amazing with and without it's tangy dipping sauce. Happened upon this cute spot by chance- but now I know the fates brought me to this scrumptious establishment. Goodbye pay check because I'm eating out more!!!!"], ["Melanie M.", "I happily came here with some visiting friends on a Sunday night and I would happily go back again. I am actually eager to taste more of their traditional Senegalese fare.I ordered the papadelle, which was one of the greatest things I've ever eaten. Big flat egg noodles with mushroom and asparagus, topped with a savory truffle sauce (more like gravy). They serve toasted bread on the side to sop up all the juice and I sure did, leaving nothing on my plate. My mouth is watering just thinking about it!!The rest of the group had the burger (which my local friend absolutely raves about), the steak sandwich (very good and filling) and the chicken sandwich (spicy and delicious). All were pleased!I loved the service. The bartender was sweet and the waiters were extremely nice. The host easily relocated us from the bar to a table (with a baby). They also have a pretty hysterical birthday celebration, which the whole restaurant witnessed - you can't help but be happy from the experience.A cozy place lit by candlelight with fun jams. Smells a bit fishy in the restaurant because of the menu items, but overall, a worthy experience!"], ["Jane O.", "A sweet brunch spot setting with superb food quality. Best omelette I've had in a long time, not to mention the vintage atmosphere. Very charming and can't wait to go again!"], ["Lauren H.", "For someone looking to enjoy a light brunch in the neighborhood, this place is the way to go. The service is friendly, though a little slow (understandably so) in the small and particularly packed place. I ordered a Caesar salad with grilled chicken -- it took a little longer than usual to come out (due to a large party ordering and waiting for food before me, so completely normal). Salty, and perfect with the shredded kale. They make the salad with real anchovies, so those expecting a typical Caesar should not order it. However, I found it delicious! Read what is on the menu and it is exactly what they bring, so don't get upset when your salad isn't what you would \"think\" it would be.The bar area is cute and definitely a great place to order a few mimosas or beers and enjoy the warm weather. All in all, this place is trendy and cute -- but know what you want, because their food can be quite original.Happy eating from Crown Heights!"], ["Nneka U.", "My new fave Senegalese spot! I sat at the bar with my girlfriends and we enjoyed happy hour drinks followed by traditional Senegalese food. I was already familiar with Senegalese food because of my previous visits to Jollof restaurant in BedStuy. The food here at Cafe Rue Dix was just as good as that at Jollof. However, there was certainly a different ambience at Cafe Rue Dix. Not better, just different. It was a bit more livelier and the crowd seemed more \"hip.\" This is probably a result of the neighborhood as there are a lot of bars and restaurants cropping up in Crown Heights along Bedford and Franklin Avenues. I would  recommend this place if you are adventurous with your food choices. You'll be eating authentic Senegalese food. I had a chicken dish (Yassa Ganar) and my friends both had a fish dish (Thiebou Jen). Both dishes came with a choice of rice or cous cous. We got the rice. We also had the bread pudding which was surprisingly good. I will definitely be making more trips to this spot and hopefully get the chance to try more dishes."], ["Gingere L.", "Slow, dizzy service. Got our order mixed up. I brought two coworkers to check this place out during our lunch hour. When we arrived at 12:45p on a Friday in August 2014 the restaurant had two customers at two tables with their laptops. The lighting was dim and intimate.There was only one waitress who took her time. We ordered the steak sandwich with mozerrella cheese, a portabella sandwich with blue cheese and one without cheese.The service was really slow. The waitress was too laid back and it was hard to get her attention for water or for ordering. When our orders arrived, they got our order wrong: they put the mozerrella cheese on the potabella sandwich, and the blue cheese on the steak. Due to us being at work at lunch hour, we quickly finish and did not bother to let them know or risk getting back to work late. The service was too slow for us so we won't be coming back during our lunch hour. The sandwich was delicious and so was the salad, but again, if you have time to kill and some $$ to spend on sandwich, this may be for you."], ["Stan S.", "Now this place right here is just good. They get it. What every your cooking make it yours. Don't push out what everybody else Is maken.  The service is great. The decor makes you feel like you in a lil restaurant in South Africa.  Try the shrimp!!! Was not a big fan of the burger to much bread in the felling but thee season was really good."], ["Ronsheeka H.", "They really need to pay attention to the orders.  I ordered no tomatoes and hot sauce on the side.  The hot sauce is hot as shit and the tomatoes were on the sandwich.  When I told the waiter he did nothing more than take off the tomatoes but what if I was highly allergic and litigious?  The sauce was so hot that I could barely think, thank godness for my portable fan otherwise I would've been sitting waiting as my friend ate her equally spicy tuna tartar.  I also told the server who said yeah I told them no tomatoes.   This was my 2nd visit and I doubt that I'll go back for a 3rd time."], ["Kate B.", "This is my favorite spot in Crown Heights right now. Friendly service, great ambiance and standout vegetarian options.Try: 1. The kale zinger salad -- more filling than you'd think with the avocado2. Hummus vert3. The Michelada 4. Fries with Roquefort sauce"], ["Nadia A.", "I looooooooooooooooooooove this place! I loooooooooooooove this place! From the owner to the Bartender Dana............. OMG! Everything was just perfect!It all started with the cocktail - what is it called again - uuuuuuuuuuuhm - Ok people I can't remember it  - but the cocktail is mentioned here.Appetizers: Calamari with the avocado salsa - SO GOOD                     Kale Spring Rolls - AWESOMESalads: Kale with Avocado - AWESOME......... It is like you get a big dish of seasoned kale with a half avocado with dressing in the center - oh so good... AMAZINGEntree: Grilled Sea Bass - OFF THE HOOK............... OFF THE HOOK PEOPLE............ OFF THE METERS!.................. Dang need I say more......... A MUST HAVE!!!Woo hoo........... And Dana was awesooooooooooooooooooooome!Great Ambiance........Other dishes that friends had: Salmon dish was awesome as well...........PEOPLE YOU MUST VISIT AND TRY WHAT I SUGGESTED - LOL! Happy Eating"], ["Lauren S.", "3.5 starsEverytime I've eaten here, whether for brunch or dinner...or just dessert & drinks....the food has been good. They serve a great brunch & the menu is more so fish-oriented at night. You'll find a dimly-lit intimate (but not tiny) French-bohemian-cafe -style atmosphere with African accents that's artsy, pretty laid back & something we've needed in Crown Heights for ages. The service has been hit or miss. A few times it's been cheerful & attentive. But odd things happen like the waitress will stop & chat with you warmly like a friend but never ask if/what you need - i.e. forget to bring you a menu after the initial chat, or water (at all!) or drinks, or take your finished plate that's been sitting there demolished for 20 minutes. A few times the service has been great though, but other times I was ignored or got the feeling that the staff would rather chat with eachother than do basic server stuff - just like how it is in Paris!Food:*I've had the most amazing french toast with fruit and a to-die-for creme brûlée syrup @ brunch* I've had the lamb - pretty good* I've had the creme brûlée & some decent cocktails. They have bitburger German beer here too which is one of my favorites. The bartender made me the most amazing sangria drink ever (since I said I was craving it) it had so many fresh strawberries it was like a fruit salad cocktail ! The flavor was amazing...then the check came - I was charged $13 or $14 for this cocktail * I tried to order the African red rice (the yummiest rice ever!) on the side or by itself to accompany another dish I ordered & they refused. I was told I could only get it with that one specific Sengalese dish it comes with:Thiedbou Jen (sp?)* have had the steak sandwich which was great & the burger which was just ok* frites/fries here are awesome * ordered a roast chicken dish awhile back (I think it's no longer on the menu) via delivery...took forever & the food was all run together & all over the bag when it arrivedOther notes: when you try to look at the menu online, you can't read it. I've told them about this twice, but the same blurry, UN-zoomable picture of the menu remains If you're expecting African food, there's like 2 - 3 things that relate to Sengalese cuisine, Thiedbou Jen (the Senegalese national dish involving stewed fish & veggies over delicious red rice) & a spicy chicken dish & maybe one other I think fish dish. Sometimes they have specials like beef stew in peanut butter sauce, which I've enjoyed at other restaurants - never here - it's very Senegalese as well. While most other dishes besides these may have some \"safe\" African accents, its kinda mainstream cafe fare ...American with Parisian aspects...for the most part - so just keep this in mind if you are looking more Sengalese-centric cuisine."]], "Chez Moi": [["Zvia S.", "Love the Chez Moi cocktail and the truffle mushroom croquettes. I've eaten her twice already and really enjoyed each meal. The service is great and the waiters are always very friendly. Would love to go back for the $1 oyster specials and brunch"], ["Oliya C.", "Tio and Pio in Brooklyn New York, it's great place to go to eat as a family. Friendly staff and clean"], ["Daniel N.", "Great ambiance, reasonable prices, wonderful service. A little out of the way for me, but I find myself making the trek. Great place to bring friends."], ["N. S.", "Food was great! I came here for dinner with my wife and it was a great experience. I got the duck which was cooked a seasoned perfectly. Amazing duck, get the duck :)She got the Skate fish which was also amazing. Great food and nice ambiance."], ["Samantha M.", "Delicious brunch, never disappoints!"], ["Vic S.", "We just had lunch here, we were in a hurry but really wanted something good instead of something quick in a to go box.The server was so accommodating and nice. Everything we ate was absolutely wonderful! Tuna tartare, escargot, Caesar salad with salmon, and mussels in white wine broth were all so outstanding. Prices were really reasonable for that type of food and quality of food. I would recommend this place to anyone! They are only open for lunch on Fridays though, but I'm sure dinner is equally good or better. I wish we lived nearby so we could come here more."], ["Jennifer B.", "My favorite spot in Brooklyn heights. I like seating at the bar, very friendly bartenders.Favorite cocktail, the 'Chez Moi'. Favorite plates to share (or not :) : cheese plate and the pate. VVery cute place."], ["Lynne W.", "Hadn't been here for a while. Came today for brunch with out of town relatives.  The food was, as always, very good.  Friendly and attentive (but not bothersome) waiters.  We sat for 3 hours without any problem."], ["Aviva B.", "After trekking around Brooklyn in the sunshine all day we were ready to sit down somewhere and eat something delicious. Not just anything would do.Chez Moi hit the spot in so many ways.We started with the escargot, which, while they weren't served in shells (what was I expecting, honestly?) were extremely fragrant and we sopped up the garlicky oil with some spongey and flavorful sourdough bread.I has the Bisous cocktail: bourbon, melon puree, ginger. Delicious. Served on the rocks. I ordered the roast chicken, hoping I wouldn't be bored by it, and oh...my....god! I didn't know chicken could be so tender and rich. Maybe makes my top 10 favorites list. It was that good! And it was JUST CHICKEN! Was it covered in butter? Maybe. Probably. Who cares."], ["Arnaud W.", "The place is nice. We've been greated by people knowing how to make you comfortable.Ordered french onion soupe and a hamburger. Both were good, even the meat was a bit cold (i asked for it to be cooked rare, but i'd have liked to get it hot as well).Then ordered a tarte tatin and profiteroles. The tarte tasted more than a \"chausson aux pommes\" with apple puree on a flaky paste. Was pretty good, but definitly not a tarte tatin. Profiteroles were good, but the chocolate was too cold and wasn't liquid anymore when it came too us. The hot chocolate must be served on the choux once the plate is in front of the customer, otherwise that's what happens, cold and \"hard\" chocolate. Thae taste was here anyway. The choux were good, as the vanilla ice cream.The 2 people who served us were delighful."], ["J Mase I.", "Stumbled in here on the way to an open mic with a few friends. Everyone loved the food! (Even the pickiest of my friends who hates everything we choose, was happy and smiling!! That was quite an accomplishment in my eyes!!) Please try the octopus appetizer and any of the cocktails!!Cannot wait to go back! Staff was very friendly and attentive!"], ["David P.", "Yet another top notch place on Atlantic Avenue. Great to stop by for cocktails. Dinner is excellent. 5 types of mussels to try. Fish special entrees are excellent. Terrific salads. Don't miss it!"], ["Barsista K.", "Love this place for brunch. Cute, romantic, great staff, great food, chill but pretty. Only drawback is the occasional table with noisy children (could something be done about the acoustics, I wonder?), but I guess that's unavoidable in B-Heights."], ["Peter D.", "I'm not sure why I waited so long to check out Chez Moi, but how was I supposed to know they've got it all? And by all, this is what I mean:An EXCELLENT steak frites. A simple, perfect burger. So juicy it'll soak the bun right through.Rich, luscious foie gras that'll transport you directly to Paris.A very nice country pâté.Delicious cocktails.A very decent, huge portion of tuna tartare. A new risotto special every day, one that always satisfies. $1 big, beautiful Bluepoint oysters until 7 pm on the weekdays.Five different types of mussels, all worth ordering. A molten onion soup gratinee you'll want to burn yourself on over and over again.Fantastic service. Every employee will offer a smile, and they are all looking to please. For instance, one time we forgot our leftovers and our waiter chased us halfway down the block to make sure we got to enjoy every bite we paid for. After several visits, these are the only issues I've encountered:1. The butter they offer with their bread are the cold packets, rather than warm, convenient, spreadable butter. 2. One time they told us the risotto was roasted tomato, and it turned out to be butternut squash. Still delicious.3. One time I got my Manhattan up, instead of on the rocks. Still delicious.4. My legs tend to fall asleep when I sit on their barstools. I'm assuming this is my own fault, and I just don't know how to sit properly. Clearly, the pros outweigh the cons."], ["Matt E.", "This is beautiful little French restaurant along Atlantic Ave in Brooklyn Heights. They have a casual yet romantic vibe with dim lighting and superb service. Prices hover in the mid 20s for entrees so it's not cheap but it's affordable if you're looking for nice night out. To start I got the French onion soup ($7), the broth was addictive and the abundance of perfectly caramelized onions was great. They skimped on the bread only having put a small slice of the same hearty bread provided at the table (which they continually refill), and there wasn't a ton of cheese either. Regardless it was a delicious soup. For entrees me and my friend shared two of our top pics. The classic steak frites and the fish special of the day (striped bass fillet with fingerling potatoes and asparagus). The steak was supposed to be a New York Strip cooked medium rare. I found the steak to be disappointingly thin (especially as other Yelp photos of the dish showed a much thicker cut of meat). It was also cooked medium, almost medium well. The fries were average at best, no seasoning or features or flavors that made them stick out. The fish dish was very good. The fish portion was modest but it was cooked very well and had a night crispy skin on it. It was sitting in a buttery sauce which had great flavor but could have used a little more seasoning. Overall I was happy with the dish. As mentioned before the service was amazing and the restaurant overall was nice, the food I'd say is 3.5 stars but this place definitely deserves a solid 4 stars with all things considered."], ["Annette M.", "Love the garlic and parmesan fries! Also, if you're into cocktails, I highly recommend the Basilic."], ["Melissa R.", "Excellent food and service.  I just grabbed a quick bite at the bar on Sunday afternoon I truly enjoyed it.  The quiche was light and fluffy.  The home fries were perfectly cooked."], ["Simone S.", "I love Chez Moi!! Super consistent fresh food and great drinks. It has a chill local environment that has really grown to be my favorite spot. Jesse is basically the best and most fun bartender in Brooklyn!"], ["Will N.", "Croque Monsieur: it is simply not ok to make one using rye bread. I mean, would you bake a cake with rye bread? What about rye bread donuts? Rye cookies? Rye flour anyone?On the bright side, probably one of the best bloody marys around."], ["Diana C.", "My boyfriend and I wanted something low-key, no-frills, local but still romantic for our valentine's day dinner.  Chez Moi was a good fit.It wasn't a huge pain to make reservations a week before, which is the biggest plus.Restaurant is cozy and has a lot of charm. Perfect for an intimate dinner.  It sits maybe about 40 people.  I didn't feel too cramped even though it was a full house.I loved our waitress.  Even though she had a lot of tables to tend to, she remained calm, polite, and friendly.There was a prix-fixe menu option, but you can order from their regular menu as well.The prix-fixe was $49 and it came with: complimentary champagne, appetizer, entrée and dessert. I ordered:1) Foie gras - delicious! I would recommend this for sure. Bread was perfectly toasty too2) Scallops - fell short.  They came out undercooked the first them and had to send them back.3) Cheesecake Crepe - this is a crepe layered cake.  The cheesecake/crepe combo didn't work for me.My boyfriend wanted some other dishes to diversify, but truth be told the prix-fixe menu had 75% of the things on their regular menu.  Anyway, he ordered (these were not on the prix-fixe menu):1) Escargot - very meaty.2) Lobster Bisque - came out lukewarm which was disappointing, but flavor was decent.3) Mussels - some were sandy, but most were pretty good.My favorite part was that everyone received a rose when the check came.  That was a really nice touch for Valentine's Day.Overall, there were some hits and misses.  I think I would still recommend this place for a date, maybe not a special occasion."]], "Pates Et Traditions": [], "Le Fond": [["Karen W.", "This place is amazing! Food and decor on fleek. I hope he continues to get business just too great not to."], ["Alika T.", "Great  value versus price. Dinner costs around 20 $. Everything was prepared and delivered in an elegant way. The ambiance is very nice, modern. Design is simple and beautiful. Jake, a chef, is very friendly. A service is fast and helpful. The prices of a glass of wine are reasonable."], ["B S.", "This is a welcome addition to the neighborhood! Easy to make a reservation and we were sat immediately. Love the simple design of this place and the noise level was on point as I didn't feel like I had to shout at my husband. The foie gras was so amazing and went well with the delicious bottle of wine we ordered.  The chicken was cooked to perfection and so was my husband's hanger steak. The only thing that didn't stand out was the maple beignets but I think that was only because we were expecting a warm pastry a la Cafe du Monde. That doesn't mean it wasn't good! We left satisfied and not stuffed and feeling disgusting. Everything tasted very fresh!The flow of the service worked for my pace. I hate being rushed through a meal and we were able to take our time and actually enjoy it. Another thing appreciated is not having the tables directly on top of each other. Those are just two points that I usually have an issue with at other restaurants in the neighborhood that I didn't have here.Can't wait to come back!"], ["Catherine A.", "We came here because of the reviews and we were staying in Brooklyn.  The food was scant to say the least.  My boeuf en daube was tough, the root vegetables were so raw I couldn't even cut them with a knife.  No gravy to speak of and there was nothing special about the flavor.  My sister ordered the vegetarian option.  Maybe a 1/4 cup of garbanzo beans atop a spinach purée.  For $16!  Come on......  The bare walls contribute to the sound level being so loud my voice was hoarse from trying to converse with my sister and we were sitting right next to each other.  On the positive side, the wait staff were very attentive and the wine was good."], ["Noah C.", "Wonderful new spot! Very solid happy hour and delicious lite bites. Looking forward to going back for dinner. Jake, Esther and the whole staff are terrific."], ["Olive I.", "Can't say enough about this new addition to the Greenpoint food scene. We stopped by on one of their first nights open and were wowed by the food and the gorgeous and warm decor and service. It's clear they thought through every detail. The olive oil broccoli soup was unique and really a special dish and the short ribs were among the best I've had. Try the almond cake for dessert - you won't be disappointed. Already planning to go back next week. And maybe every week..."], ["Kathleen R.", "Lovely restaurant. Excellent food. We shared chicken liver mousse, octopus, cassoulet, hanger steak & a pasta. All were top notch. As was the affordable wine list & local beer. We saved room for desserts which included an outstanding Nutella bread pudding. Greenpoint's lucky to have Le Fond."], ["Winnie M.", "Went to Le Fond last night for dinner and it was the perfect thing for a rainy night! The decor is cozy farmhouse with charming little touches. Big points for not bringing hard-as-a-rock butter to the table with the nice olive bread. The foie gras appetizer was great, although it would've been better if it was a bit more room temperature. I had the cassoulet, which was really tasty and innovative; no one should pass up Chef Jake's cassoulet, it's the best. The Pat La Frieda burger was also great, although maybe the brioche slices could be a bit thinner to not overwhelm. A cheese plate brought it all to a great end. We'll definitely be back."], ["Julie R.", "We were lucky enough to get reservations for Le Fond's Christmas Eve dinner.  Hooray for us, especially since the meal was spectacular from beginning to end. I've been to a ton of restaurants, and nothing will turn me off more than getting pre-meal bread that tastes as if it came from the local grocery store.  Here, at Le Fond, I guessed the meal would be good as soon as I tasted the bread!   The foie gras was also delicious, as was the clam pasta appetizer (can't remember exactly what it was called).  We had the duck for the entree; what a special holiday meal it was with three sides that were all excellent.  Since there were seven of us, we even got to taste 4 of the desserts.  People are right -- desserts are top notch here.  I was surprised to read about noise issues with the other reviews.  My husband and I are in the \"over 60\" crowd, and we hate noise.  We didn't notice it was noisy, which means that something must have changed to improve the level of noise."], ["Sue Z.", "Went here this past Saturday and it was very nice.  I had the roast pork and my friend had the beef.  Chickpea soup that was amazing.  I had the house white and my friend also.  The decor blew me away (I knew what it used to look like) and the people that work there are so nice.  We also had the almond cake with pears, shut up that was so so good.  Great place to take a date. Note  I am not sure but I don't think they appear to have a full bar (I am a fan of vodka but wine is fine with dinner). I wish Le Fond well and will be back."], ["Whitney Z.", "I had a burger, IPA, and a glass of wine. The burger was excellent. Served on (very) buttery toasted bread--I was skeptical at first, but it definitely worked. The meat had excellent flavor and the cheese added the perfect highlight, not overpowering the flavor of the beef."], ["Mike Q.", "Welcome addition to the Greenpoint/Williamsburg restaurant scene!  Had dinner here for the first time on Tuesday and the food was so good that we had to come back again with friends on Saturday.  Chef Jake is very friendly as are all the staff.   The chicken and the beef short ribs are amazing!   We left both meals very satisfied and even our friends from said that they would come back  again."], ["Jon D.", "I live in the neighborhood and I'm so happy to have found this place. Just the vibe Greenpoint needs (decor/atmosphere that's almost, dare I say, elegant and zero attitude). Most importantly: honest, delicious food that aims higher than you'd assume (and a great wine special during happy hour!). Chicken with jus and broccoli puree was unexpected and very nice. Fall/winter comfort food at its best. Cheese selection was served without an introduction/explanation of what was on the plate, but who remembers/cares what they're eating after the first bite, anyway? Beignets were a perfect sweet, quick bite after our mini-meal. High hopes for this place and can't wait to go back. Looking forward to a longer dinner and the chance to try more than one dish. Welcome to Greenpoint!"]], "Petite Crevette": [], "Bacchus Bistrot a Vins": [], "Santos Anne": [["Daniel S.", "I had a Santa Anne Burger and a seasonal beer: Ithaca Stout. Came on brioche bun with crispy fries and dark green salad. Tasted good. Good service. Other items looked good. Will go back and try them."], ["Anton S.", "Great food! Best ambience! Cozy and personal with live music. Friendly and professional staff. Well worth a visit!"], ["Yosephine D.", "I had a group dinner at Santos Anne because it was recommended by a friend, and she wasn't wrong! I love every inch of the restaurant decor, they have the cutest outdoor seating and they also have live music! The price was decent and the food was amazing. I had the paté plate, kale caesar, and beef tartare and I loved every one of them. It officially became one of my favorite restaurants in brooklyn"], ["Siouxsie B.", "Pretty awful experience. They seated us next to the bar which meant we were constantly butted up against a gang of smokers and attendees of a loud bday party. This large picnic table out back has an uneven surface which they disguise with one if those cheesy red and white table cloths you see in old diners or Italian restaurants. Consequently my friend set her glass on the table and had it fall over and spill water all over her immediately because of the uneven surface. When we mentioned the issue they seemed irritated with us for bringing it to our attention. Though maybe that was a cultural/language barrier? Dunno. The tartare was disgusting. My friend ordered bacon on her burger, it came without and yet was still on the ticket. Another friend is gluten free and they failed to put the croutons and dressing on the side like she asked. Another friend had her order taken only to find out 5 minutes later it couldn't be made. And the last of us (we were 5) had his order forgotten all together. In all fairness the did offer us tequila to make up for the terrible dinner, which was funny because none of us intended to drink. A couple shots did loosen us all up, which was their aim I'm sure. Still, wish my dinner reunion with old friends had been better served."], ["Melissa N.", "This place is great! I eat here about once a month late night with the bf after visiting Bottleneck Gallery.We usually get the mushroom and shrimp risotto (2 separate dishes) and they always let me add truffle oil to my shrimp risotto. There are both so deliciously made and even better on a cool fall or winter night. Live music plays until around closing sometimes and it a nice treat. It's a cozy and romantic place as well lit with candles.The waiter that we've had was great and we would definitely recommended and come back. We never get a chance to taste the drinks because we are usually driving home, but I'd like to change that some time :)"], ["John W.", "Solid food, but the real treat is the backyard garden in the summer. A hidden gem in Williamsburg."], ["Blake T.", "I'm sure this place is nice in summer but in winter its ice cold and dark on top of it. Avoid unless you like eating with your coat on.Service was OK..."], ["Jennifer S.", "I have eaten here often - the prices on the food are pretty reasonable. The kale salad is bangin'! Boyfriend and I come here a few times a month at the least. Get the duck! :)"], ["Bryan M.", "There is something wonderful about this shabby restaurant.Yes, service is always a little off, the drinks can be weak, and the menu is a bit limited. But Santos Anne is a laid-back neighborhood joint, not a gastronomic destination. The food is (relatively) inexpensive and plentiful, there's a great happy hour, and everyone seems to be enjoying themselves. Not a destination to travel far for, but if you live nearby you have to try it -- a few times at least."], ["Oliver B.", "Love this little place. They always use fresh fruit for the margaritas and they're only $5 during happy hour. The hangar steak is excellent and the fries were great too! I'm excited to come back and try the burger next time."], ["Aurelie S.", "The food here is on the better side of average, but there is one dish that is absolutely, utterly, unbelievably exquisite: the kale salad with seafood. Ask for the hot pepper powder (it comes in a vial with a skull and cross bones, not all waiters will know what you're talking about but the bussers might). The decor is charming!! But not in that irritating campy previous kind of way. It's genuinely charming. And reasonable prices too. And presentation is great. Go!"], ["Holly T.", "The BF and I wanted to celebrate our anniversary with a nice dinner, but being the couch potatoes that we are, decided to order in instead. Found this sweet little spot on good ol' Seamless. The calamari rings are a little small, and significantly blander than versions I've tasted in other restaurants. Otherwise, based on my take-out experience, I'm tres impressed. Love the fusion of Mexican and French cuisines. The Mexican steak tartare, shrimp risotto, and duck breast magret loco are all must-try items. Everything tasted very flavorful and fresh. I'm sure our food would have been even better straight from the kitchen. Really looking forward to trying their brunch menu."], ["Molly G.", "Great neighborhood spot. They have a backdoor patio and a small band playing on the weekends. Great food, drinks and service. Love this place."], ["Jimmy H.", "Cool spot"], ["Marina S.", "I debated whether to post this in Craiglist's \"Missed Connections\" or Yelp. Yelp won.I am guessing you are looking at your smartphone, standing on a street corner in Brooklyn searching for something that's open and serves good food. You probably don't have time to read the anecdotal musings of a girl who has fallen in love. I understand. If you want a straight-to-the-point review of Santos Anne, scroll to the bottom of this absurdly long post. If you want a story of passion, hope, love and loss -- keep reading.In order to understand the importance of this night, you must first know that I live in Taiwan. Taiwan is the land where eligible bachelors are not only few and far between, but they also are NOT interested in awkward Jewish girls who drink a lot and talk too much. I moved to Taipei from New York for a job and had the opportunity to visit Brooklyn a year later. My friend and I decided to treat ourselves to a nice dinner after some comedy at the Knitting Factory (I highly recommend you go to their free shows on Sunday nights).We saw that Santos Anne was open until 12am and decided to power walk over at around 11:50pm. Last minute customers are a servers worst nightmare, but the staff welcomed us with open arms. As soon as we sat down I saw him. He was sitting in the corner with a plate of cheese and a glass of wine (or was it beer?). I don't think I have ever seen a man so beautiful in my life.You can imagine my shock when he got up and walked right over to us. Turns out, he was our waiter and he was French. The accent! I die.* I stammered through my order and accepted wine from the bartender who insisted we drink. Team, listen: A man hasn't so much as looked my way in a year. That is precisely why I acted like a giddy 12-year-old girl who just spotted Justin Bieber every time this guy came to our table. I scarfed down my duck tacos, which tasted like love and possibilities, and proceeded to imagine all the things I'd do to the waiter (you know, things like stare at him in his sleep, buy cupcakes and pretend I made them, hide the fact that I am a crazy lady until we were married) if I lived in the States. At the end of the night, the drunk bartender poured more wine for me and said, in a very difficult-to-decipher slur, that a man was going to fall in love with me really soon.Now I don't know if the waiter and bartender set up some sort of ponzi scheme where insecure women who have intimacy issues believe they can sustain a successful relationship with one of the wait staff, but I asked for a job application after dinner. When he came back with the bill (sans application) I saw we were only charged for our tacos. FREE DRINKS! As we were getting up to go, my waiter/boyfriend looked me in the eyes and said, \"We go make out now, no?\" He felt it too! I smiled coyly. Could I kiss this man I hardly knew on my last night in Brooklyn? He was so beautiful. His eyes were the ocean! His skin, the sand! Despite his beauty, I knew what my answer was. \"No, not tonight.\" When I said it out loud, my heart attempted to punch my brain in the face. Alas, I am a woman of class. I cannot make out with a man unless he's bought me flowers or at least six shots of whiskey. I left Santos Anne with nothing more than a kiss on the cheek.I am back in Taiwan now, but my heart just isn't in it anymore.If you are reading for a review on the food, atmosphere and all that other crap Yelp is useful for, then here you go:Food = Excellent. Order the tacos you can't really go wrong. Atmosphere = Adorable, friendly, cool.Other Crap = Great. This is a good restaurant. That's it.*Just to let you know, I am an intelligent girl that is not easily fooled by a pretty boy with an accent but you try living in Taiwan for a year and not getting so much as a Herro!P.S. Stay away from my boyfriend."], ["Danni L.", "This review is overdue, but I just want to say that I had a great experience here with my boyfriend and I would like to come back again. The food here is very delicious. I didn't give a five star because the service is a bit depending on the person who serves you. There were two waiters while we were there, the first waiter who ordered for us gave us drinks, and never came back to order us food (for like 30 min), even though we told him we are here for dinner! Finally we had to find someone else to serve us so that we can actually eat something, and the second waiter who served us was AMAZING! Not only did he recommend the best dish on the menu, but also gave us free round of shots since I liked them on facebook. The shots taste very good, it was not a simple shot but a recipe in which tequila is mixed with other things, yum! I was really surprised because usually I have low expectations for shots, even mixed ones due to many past experiences. I didn't finish the shot in one time because I wanted to save it for the entree. Seeing my unfinished drink, he came over and asked if I didn't like it. After I explained, he said he will give us another round of free shots if I finish it, so I don't need to save this one! Obviously I did and he delivered another round as promised. We finished our dinner in happiness and satisfaction.Btw, their bathrooms are very funny. The sex of the image on the men and women's doors are not easily identified, so people go in the wrong one all the time."], ["Paul A.", "The salmon tacos were absolutely disgusting."], ["Jared F.", "The most amazing salmon burger and salmon Eggs Benedict I've ever had. Also had the Kale Caesar salad with octopus it was all amazing. Would 100% go back with friends!"], ["Nicole A.", "Ive gone a couple times so Ive had different experiences. happy hour is well priced but the margaritas are a bit to strong were  I had to force myself to drink it in order to not waste money. The food is good but sadly food portions keep getting smaller and smaller :( The ambiance is cool and the have out door seating yay"], ["Aaron W.", "Easily the worst service I've ever experienced. Drinks and food were about average but we saw a server once an hour. Just paying our tab took serious effort. My girlfriend commented that it was the only time she has ever felt trapped at a restaurant. When we did finally get our bill it was for the wrong table. This place is an absolute disaster."], ["Charles L.", "Fav. The backyard is the best. The beautiful tree covers everything, so it stays cool and refreshing. I love the free music and free tarot.Brunch is my obsession-I go nearly every week. Delicious, clean, fresh and affordable.The staff is friendly and gave us a free round of drinks when one time our order was delayed. Not that big of a deal on time, it was Sunday. I was just enjoying the space."], ["M M.", "Fantastic garden and a wonderful atmosphere. I went on a date on a Friday night and the service was excellent. I had the pork brochette and it was delicious.  Portions were very generous - my entree came with mixed greens and french fries. Only disappointment was no live music! I guess I will just have to come back soon and try again."], ["Michelle S.", "4 for the food, 2 for the service.I came here on the early side of brunch, and the restaurant was half full. By the time we were trying in vain to grab our check, it was almost completely packed. This place suffers from some serious logistics issues.Environment is great! The outdoor patio is such a city oasis. I absolutely love the atmosphere.Our waiter was nice enough, albeit a bit on the slow side. He spent about 5 minutes introducing himself and the menu with his personal recommendations, which is TOTALLY fine with a nearly empty restaurant and when you have your tables under control, but when you're pressed for time, you might want to speed up the speech. It took us 10 minutes to get our food and drink orders in and then our waiter went ghost on us. In fact, I didn't see him again after he brought our drinks because the bus boys ran the show after that. However, they didn't speak a lick of English, so when I asked for a side of home fries (that were delicious, by the way from the sample I took from my friend's plate - hence the need for a side order), he said \"one second\" as if to grab someone and never came back. So, I didn't get my home fries, and after we got our check, no one would come to pick it up. I was running tight on making a train home, so after another 15, 20 minutes, I had to pull a power move and go to the bar and cash myself out.I'll admit it. I am probably going to return. My brother ordered the Steak and Eggs and I ordered the Mexican Breakfast. Wow! Amazing. I think I had plate envy because my brother's Steak and Eggs was so flavorful! Overall, the Mexican inspired brunch was phenomenal and their picante sauce was some of the best I've ever had. I just hope next time, I can upgrade my review after service that matches the quality of the food.PS. Hot restaurant owner alert."], ["Patrick C.", "I encountered the most spectacularly offensive service at Santos Anne that I can remember of any restaurant experience. I came here for dinner with a group of friends for a late dinner after a performance in the neighborhood. And I get that it was late, and we were closing the place out, and that our waiter probably was at the end of a long day and eager to get home. I understand. But such circumstances notwithstanding, I still expect some measure of civility. Instead, our waiter acted out, treating us to shockingly heinous attitude. I would rather have just been told upon arrival that the kitchen was closed than been subjected to the treatment that was in store for us.First, there was a simple mathematical mistake in dividing up our check. (We didn't realize that tip had been included.) Instead of coming back to our table and politely clarifying, our waiter came back and straight-up berated us, talking to us like we were stupid. The level of disrespect was breathtaking.One of my friends then asked if she could have her food boxed up to take home. Our waiter snatched the plate off the table with an aggressive sigh, like a teenager being asked by his mom to take out the trash.And when he came back with our bill and credit cards, he literally threw them onto the table in front of us and said, \"Whatever, just do what you want to do.\"I plan to take that advice and, in the future, do what I want to do, which is to take my patronage elsewhere. Life's too short to be treated like garbage.P.S. Here's where I might otherwise say that, while the service was atrocious, I have to admit that we really enjoyed the food... - but to be honest, the food was nothing special, and, given its mediocrity, the price was almost as offensive as our waiter."], ["Elizabeth P.", "This was a great spot for our group out celebrating my friend's birthday. The margaritas were amazing (especially the ginger one!) and our server was super attentive. He kept the free chips and salsa flowing and was super friendly throughout the night. The menu is unique and there is something for everyone. The ambiance on the patio is lovely. I'll definitely be back.Tip: get the cheese plate! Tequila marinated fig... Need I say more?!"], ["David C.", "I'm smitten! This place is so good. The food is great, but the service is out of this world. Our server was a doll and the owner of the restaurant kept checking to see if we were happy.  We ended up hanging out with them most of the night. When we left, they hugged us like we were long lost relatives. The people here made it great. I am going back."], ["Donna S.", "came here with my friends for a birthday celebration and had a wonderful time.  food was good, service was very friendly.  the live band was a big plus (and not overbaringly loud).  the only downside was the almost non-existent AC.3.5 stars but not 4."], ["Jane K.", "So disappointing the second time.  The first time I went, we had great service, food, drinks and atmosphere.  That being said we were going to dinner with someone who lives near the restaurant and had never been so we highly recommended to him and we all went.  We passed up the lovely looking Le Barricou.  Should have tried a new place.  -Waiter stated that it was his first night.  He didn't know anything.  Besides that was absent.  We were never asked if we wanted more drinks when we were finished with ours.  -Drinks- margaritas were watered down.  I ordered the habanero/lavender and didn't notice either flavor just some limes and geez so much ice that I took a few swigs and all I had left was ice in the glass.  -Food- Cheese plate to share.  Cheeses and portions were decent.  No explanation of what cheese we got when they gave us the plate.  We just guessed.  -Salmon Tacos- super greasy -Veggis Tacos- Bland-Pork something- Bland Should give it a one but giving it the benefit of a doubt that maybe they had an off night.  They should train their new staff."], ["Noemi B.", "My review is based solely on their brunch. French-Mexican fusion? Say what? In my neighborhood too? Destined for greatness.I have been here twice and both times the food was absolutely amazing. First time ordered steak and eggs, yum! Way better than Cafe Argentina across the street. So much flavor and tender. Second time I had the salmon burger. Again mouthfuls of amazing flavor.Service is quick and simple, no rude waiters here.Definitely recommend this place for brunch."], ["Vivian J.", "One of my favorite restaurants to eat at in Williamsburg. We went last Saturday and had lunch in the garden. It's gorgeous with a huge shaded tree in the backyard and a flat screen showing the World Cup Game. Service was prompt, attentive, and efficient. The décor is very welcoming and has that exposed brick and French accents. The food is reasonably priced and delicious. So far I've had the duck breast magret loco (found the sauce too sweet), the Santos burger (it's huge and the chipotle mayo is very tasty), the duck tacos (only has two and they were pretty small but loved it), and the pate plate (totally addictive)."], ["Diana S.", "This place is amazing. I held my birthday dinner there: I called them to make a reservation for 10 people, then 12, then 15 and they were awesome all the way. I arrived there, they set up the longest table I've seen and we had the best time. Food and cocktails were delicious and arrived all at the same time, all my friends were happy and I was on heaven 'cos everything went well.And the end we all end up having lasts shots with the host!"], ["Jay F.", "I absolutely LOVE THIS PLACE. Waiters are very friendly. The drinks are amazing. I had the Habanero Lavender margarita. To die for! Spicy and just right! Very nice atmosphere and I love the love band! I didn't sit outside in the garden, because it was a bit chilly outside, but I will in the future! I will definitely be going back there soon!"], ["Juliette J.", "This place is sensual to the 10th power!The space is small and seating is tight, but the dimly lit Spanish courtyard decor makes for a very intimate setting. Seriously, you'll only want to come here with people you like.  Eight of us rolled up for a birthday shin-dig with no reservation. The inevitable happened: wait time 1 hour. No problem, we got our drink on at a neighboring bar and awaited their call when our table was ready. I'm still swooning over the  grown and sexy vibe. A lot of it really had to do with the  live, sotto voce jazz music that really spoke to my soul. It was some next level shit!  [re: sensual]  But enough of that,  we were there to eat not make sexy time, so onto the food:- Guacamole: cilantro haters will foam at the mouth and lovers will get weak in the knees. I belong to the latter group. - Vegetable tacos: interesting combination of portobello, cilantro-mint, avocado, raw onions, tomato salsa, goat cheese. I tore that bitch to pieces! - I couldn't tell you what the meat lovers ate, but they ripped their meals to shreds in record time, so there's that. Service was fast and very attentive. The manager did well to check in on us ever so often. One minor, almost major blip was the entree mix up. I was accidentally given a very meaty taco. Said  meat was hidden under a bed of veggies which I discovered while poking around before getting my grub on. I told the waiter and he quickly rectified the problem. Shit happens, but they've got to be very careful to avoid these kinds of careless mistakes. Overall, a fantastic experience. Shout out to my homeslice and  Bk's OG Yelper, Lans S for an evening well worth the trek."], ["Sean S.", "You know it's not everyday that a restaurant surprises you in so many special little ways as Santos Anne did me.  Maybe it was on a short walk towards destinations unknown, a gorgeous Saturday night unfolding in front of us, and our hearts open?  Maybe it was the funny & friendly owner who peaked out the door of this spot that we almost walked right by?  We explained to him we had been thinking of pizza and he offered some very clever alternatives.  Perhaps you'd like to sing tonight?  We asked if he had heard of the famous Grammy nominee Jennifer Fingers, a good friend of ours.  He hadn't but offered us a table instead.Walking in all smiles, we are surrounded by happy Breukelleners, some at the bar chatting with the bartender, and others scattered about at the many cute tables.  The first thing I notice is the decor, lime green walls and bright red pillows.  Something about it was really sexy.  The owner then offers us possibly the best table in the house, right next to the raised music set.  Sweet!We sit down, and begin looking at our menu very casually.  It's amazing how this boro slows you down almost imperceptibly, and while you're not in a hurry, you notice little things.  Like the laughter at the table next to you, or the waiters and how friendly they are.  While we're pondering what we might imbibe, a few musical fellows make their way up the tiny stairs behind us and setup to begin playing.  I order tacos, and ceviche for my nameless damsel or is searching for words, and being all of shyness extraordinaire.  I also a tecate for me, and muscle her into a mulled wine knowing full well she would love it.  Who doesn't like mulled wine?As our food order makes it's way from notepad to kitchen, Greg Green and his band begin playing and treating our grateful ears.  Jamaican Jazz sure makes a sweet sound for a non-date date, one of those where you just wanna have a really good time, letting life go whichever serendipitous way it might.  If I haven't gushed enough already, your guess is spot on to say that the food matched the quality of this restaurant in every other way, and that is sumptuous.  Delicious.  Delightful.  Memorable.  Really kinda perfect.I'd go back to this spot in a second, and I'd line up to take your date here now, before this little secret becomes less of one.  You know how wildfires travel in NYC."], ["Michael A.", "I went here for the first time last night with a few friends, and I couldn't have enjoyed it more. Really nice ambience, great service, and the food was amazing (and not overpriced like many of the other places in the area). We sat inside to enjoy the live band - which happened to be awesome - but there's also a great backyard that I'll definitely be back to enjoy this summer."], ["Lans S.", "For reals!? I don't know where to start. Perhaps w/the beginning.A great neighbor/friend of mine put this spot on my radar, otherwise I'd be in the pitch black dark and missing out, for sure.Since it was the bday wknd, Santos Anne w/it's rave reviews and live musica seemed like a fine option for little soiree w/some of my lovelies. The staff took fabulous care of us. We were a group of 8 and it was a Saturday night, but they made it happen - and even hooked my peeps up at the bar...The drinks were inventive and oh so fine! The octopus ceviche was also fine -  mighty fine. A french twist on mexican can easily cross that fine line and end up right smack in bougie-town - but Santos handled it. Did I mention the musica? Live music is so key. I love how the space was constructed w/a deliberate focus on the stage. The music. The ambiance. Down to the cubby holes built into the wall in true mexican form. The 4pc band jammed the night away. It seemed the owner couldn't keep from tappin his toes, and ended up finding his way on stage, as well, to drops some beats on the drum box type device. It was a fine night and a lovely way to spend a cold Saturday evening w/ the lovelies!"], ["Bill S.", "I'm a big fan after just one experience. We came in, 6 of us at 8:00 on a Friday eve without a reservation, after being told of a 45 minute wait at Dumont a few doors down Union street. We were warmly greeted by the bar keep, a handsome  Australian chap who helped us with drinks and delicious guacamole. The atmosphere and vibe was warm, friendly, hip and grounded. We were told that they had large party reservations but would get us a table in less than 20 minutes and they did.A trio, started playing some of the sweetest guitar tunes from the jazz catalog we dream of and the place took off into dinner heaven.Food and drinks were well priced, ample portions and real tasty. I had a terrific salmon burger. A few skirt stakes and a brochettes were served and everyone was happy. We didn't have desert but I will go back!"], ["Jessica J.", "Amazing!  Was here for brunch and I want to eat EVERYTHING on the menu!  I ate an amazing sandwich that came with fries and a salad.  French press coffee served in small or large.  Beautiful backyard with live music and trees that block out the sun and rain perfectly.  I want to come back every weekend.  No iced coffee or credit cards, but everything was sooooo amazing it is fully deserving of it's 5 star rating."], ["Sarah R.", "I love this place! Glorious backyard, killer drinks, service was fab, can't believe I didn't find this little neighborhood gem until now! Maybe everybody else who left bad reviews caught someone on a bad night, cause we had a blast."], ["Sophie T.", "I now crave their salmon tacos. YUMMM!"]], "Petit Oven": [["Tiffany L.", "came here on a friday night with the boyfriend. place is small and cozy. great service and food is pretty legit. we got a bottle of Bordeaux, a half dozen of the best oysters i've ever had (also happy hour, $1 a pop) and escargot to start. for main, we had the duck confit & filet mignon with foie gras cream & frites. The star were the oysters and foie gras cream. it's bad how good it is.i asked the staff to surprise me with a dessert and she didn't disappoint. bread pudding was one of the best i've had.overall, a great place for a date night!"], ["Alison S.", "I can't believe I overlooked this restaurant for as long as I did. This is by far the best restaurant in Bay Ridge. I can't wait to go there again. They have an small variety of dishes but ones that'll be sure to please anyone. I started with the Oysters and immediately knew that these were the freshest oysters that I have ever had. What flowed next (duck, fried checking, pudding) was a bit of a blur. I was in food heaven! I don't think I've tasted food this good ... Ever! I'm now a fan of farm to table and don't think I'll ever stop coming here. The place is intimate, the wine selection is top notch, the food is the best you can get and the service is simply amazing."], ["W L.", "Hidden gem in Bay Ridge. Small space, but cozy. Excellent food, and wonderful owners."], ["Brett B.", "Used to be much better.  Sloppy amateurish service from the waitstaff and seemingly tired dishes executed poorly.  Could be much better and indeed, it used to be..."], ["Susan M.", "The organic hanger steak special was bland, over priced in its non existent soy emulsion sauce. The steak for all their hype was a cheap cut, with too much fat & gristle, 15% of the meat was actually edible. The only thing good about it was that it was cooked properly \"med-well\".This place is pokey, tight, has a freezing cold unisex bathroom. I hated it. The food gets a -2 out of 10, however the wine was excellent. Stay clear of le peitit oven and get better food & value for your money almost anywhere but here."], ["Carmen W.", "Surprisingly, the food is pretty cheap considering the quality of it. For $35 you can get a 3 course tasting which is very filling & trust me when I am say filling I mean you will be STUFFED. I also think that this deal beats restaurant week's currently priced $38 (dinner) since many of such restaurants give you small portions and just... a rather insatiable appetite. I came here for the duck confit because I love duck confit. Sadly, they did not have it since their menu is based on what ever is fresh on the market that week (which can be good or bad depending on whether or not you like the element of surprise :p). Instead, I ordered the fried pork chop which was mmm mmm good and very filling for an entree and escargot that was a tad bit salty for an appetizer. For the dessert, PLEASE trust me on this, order the bread pudding! Never have I ever tasted such a delicious, harmonious, and satisfying bread pudding. Never. I seriously enjoyed this place, but as a warning this place's menu differs from what they have online. If you see a dish you want and petit oven claims they make it, call them to just double check!"], ["Shelton H.", "This place is an absolute gem in an otherwise culinary desert. The chef changes the menu regularly and is a star at making a menu that suits everyone. From fried chicken to pan seared Foie gras! I've been here too many times to count with my wife to celebrate special occasions. We've been going since it opened and I am still amazed to have such excellent food so close to home. Even after we moved out of Bay Ridge we still return. We've have never had a bad experience and can't say enough about it.  The tasting menu is a steal at 3 courses for $35. I would love to see more of a beer selection (not to say the eight choices they have are bad) and that's my only critique."], ["Edymari D.", "Although I now live in Arizona, I can still say that this is my favorite restaurant, period.  It's a small, intimate place that feels cozy, warm and artsy (in a subtle, pleasant way) with excellent service and PROBABLY THE BEST FOOD I'VE EVER EATEN.  I can't count how many times I've been there; I lived in Bay Ridge when they opened and it immediately became my go-to for birthdays, anniversaries, celebrations, a treat, etc.    The menu changes seasonally and based availability of fresh, usually local ingredients.  If you're going for the first time, I recommend the prix-fix tasting menu ($35), or that you try at least one dish in each course.  Some of my favorite dishes are: any kind of duck chef Kat is offering (the same goes for beef / steak), escargot, warm brie, salmon tartare, the homemade Gnocchi, mussels, every plate of greens I've ever had there and ohmygod the BREAD PUDDING!  I try to make it back every time I'm in NYC, well worth the trip to Bay Ridge.Tip:  Save room for dessert.  The Bread Pudding is the stuff of legends, but everything I've had - mousse, creme brulées, etc - has been exceptional."], ["Amanda L.", "What a lovely date night!Had the duck, just phenomenal! Melts in your mouth. The service was very friendly, they truly want you to have an enjoyable experience.Be sure to make reservations - the restaurant is tiny but cozy!"], ["Danielle K.", "This was one of the best meals we have ever had. We really appreciated the creativity that chef Kate has created. There is not another place like this in Bay Ridge, its very unique. The food was amazing, from the appetizer, to dessert, everything was great. The waitress Nicole was so polite, a pleasure to speak with. You can really noticd the passion in the cooking.We cannot wait to go back and see whats on the next menu! What I love is that every time you go, its a new experience all over again which really makes it so exciting for the next visit."], ["Yitong M.", "Went there for my hubby birthday, it's very cozy and romantic. The food is impressive. Even though you made reservation , still need to get there early . They kind of push you to leave which I don't like ."], ["Milena E.", "It's like eating art.  Kat knows how to combine flavors to perfection.  Always make a reservation as the place is so very popular now."], ["joshua k.", "Worth the trip to Bay Ridge. The Zagat 27 is definitely justifiable. Go Wednesday night for the unbelievable price-fix that can't be beat anywhere in NYC for what you get for the cost."], ["Pat R.", "My new favorite restaurant in Bay Ridge. We usually end up outside the neighborhood, but after dinner here last week, I am recommending Petit Oven to my friends in Park Slope! The food,wine and service were excellent. Three of us ordered a different entrée from the prix fixe menu so that we could each have a taste. The mussels appetizer was perfectly prepared with basil and jalapeño. I really enjoyed my entrée of homemade orrechiete with pork ragu, as well as sampling the cod and chicken entrées. I have seen the chef at our local farmers' market and the fresh ingredients are apparent in her cuisine and the seasonal menu. The wine list is reasonable and the waitress was knowledgeable about each selection. Desserts were another triumph-freshly made crepe with berries and bread pudding with caramel sauce. Just overall high-quality!"], ["Jenn S.", "Tiny tiny fantastic spot!We were seated quickly even without a reservation.  SCOREHad a 3 course pre-fixe menu that is usually $35 but was $28 SCOREEverything was well seasoned, eve the bucket of rustic bread was seasoned with a pinch of course salt.  Had the Escargot, watermellon salad, a delicous Fried Chicken entree and their gemelli in a creamy pesto pasta.  Ended the night with bread pudding swimming in amazing alted caramel sauce and the most delicate crepe filled with even more delicate blueberries topped with vanilla bean icecream.Our 2 servers were so attentive and lovely to converse with, will be back again very soon!"], ["Nadia Z.", "Update: Petit Oven continues to amaze me. I could not resist the duck again, and it was cooked just as I like it - pink and juicy, with crispy sear on outside. Desert was beyond this world, Spicy Crème Brûlée that is worth posting this update - rich chocolate with a spice kick that reminded me of Mexican chocolates. Must try if they have it on menu! (can I give it 5 more stars?? I would if I could)"], ["Frances H.", "The food at Petite Oven is absolutely AMAZING!!!! They always have fantastic seasonal specials with a constantly changing menu. I know whatever I order I will not be disappointed, and for that reason its a go to staple for me. I even find myself ordering things I normally don't like because I know its going to be good. The preparation of the food and presentation is always immaculate and the end result is  = DELICIOUS ! I literally have never ordered anything there that I did not like.  The duck is phenomenal! If you go you must order this. The owners are freaking awesome, very chill and down to earth and also very accommodating. The dining experience at Petite is reminiscent of Europe , where you never feel rushed. You are able to truly enjoy your food without feeling like you are being pushed out the door. This is  indeed a good thing because you HAVE to stay for dessert. The chef makes the best bread pudding you will ever taste in your entire life! It will blow your mind !Probably my favorite restaurant in NYC!"], ["Ihab S.", "I liked everything about the place, which is unusual, I think I would complain of mot enough seating on weekends and late dinner"], ["HEATHER M.", "Absolutely love this place.  The food is ridiculously fresh and flavors are so comforting and fulfilling.  My mom and I had both the pre-fix with an additional escargot which came with this yummy garlic sauce that I kept finding myself dunking bread into.  The service was friendly they sang happy birthday to my mom which I know she was happy and all and all a great experience.  Second time there and both times have been good.  Will be back!!!"], ["Kitty P.", "So delicious!!!!!"]], "La Cigogne": [["Ian J.", "Glad to have this place in the neighborhood!-Service is friendly, and the owner is nice.-Food is fairly priced.-The burger was pretty good, and after having it again... even better. Dare I say great!?Brunch food wasn't the perfect, the portions seemed tiny for brunch... and honestly was kind of bland, but hopefully it was just a bad day and it will improve over time. It's a nice quiet place worth stopping by to check out, I have no real problems or complaints. Edit: Oh, except for the iced coffee. It was mostly water and ice! Please fix that.Overall I've enjoyed my meals here and will definitely back."], ["Linda M.", "Did I just step into a French plaza? Is that dining al fresco and a French film playing on the TV?That's La Cignone... and yes it's truly modern European at a price you can afford.  Hip, chill, AUTHENTIC.  There is no pretending... The atmosphere alone is worth a visit. For brunch, I had the eggs benedict which was served with home fries and some dressed arugula. The hollandaise sauce was just right, eggs poached to perfection and home fries seasoned and delicious.  I enjoyed a beer and we were treated to a sampler as we hung out at the restaurant to enjoy the French film they were playing. Service was exceptional and you truly felt like you were visiting a friends home and they were preparing their best dish for you.  Meteor beers on tap for all the French beer lovers out there.  Excellent selection of wines as well.I will definitely return...to visit our new friends at La Cignone."], ["Cristina C.", "Great place. Great service. Solid food and drinks. Very friendly. They haven't been around for long, but I can see them becoming a local staple. It's all in the details, and they've got that down."], ["Dina M.", "Came here for a birthday brunch and let me just say everything was delicious!! Loved the flat breads (tarte flambee) especially the goat cheese one. The omelettes were well done as well. Can't wait to come back for dinner and try that wine list and sit my the fire."], ["Samantha R.", "Had a unpleasant experience the first time my boyfriend & I came here but they were probably having an off day which happens everywhere. I really appreciated the fact that both owners of La Cigogne reached out to us regarding our experience so I definitely wanted to give it another shot. The second time around was phenomenal. Jeremy (one of the owners) is great and made sure we had a wonderful experience. Jeremy's drink recommendations for both of us were right on point and the tuna tartare is definitely something worth trying if you stop by. 5 stars for the service, food, ambiance!"], ["Sean C.", "Quick Info: Alsatian Cuisine aka French/German FoodThings to Order: Spaetzle/FlambeesWhat's Spaetzle? Egg noodle pasta.What's a Flambee? It's like a flat bread or super thin crust pizza without tomato sauce.Recommendation: Les Champignons Flambees - Mushrooms, crème fraîche, bacon, onions.The food here is good - just not the greatest thing I ever ate. I came here on a Sunday after July 4th for family brunch so there weren't many people in the restaurant. The ambiance is nice and there's also outdoor seating. They serve a couple of Alsatian beers as well as your American craft. My one gripe is that the food took a bit of time to come out - not sure if it was because of the holiday weekend."], ["Natalie R.", "Damien the host/part owner is super nice. The scallops were amazing and so was the organic chicken entree, especially the truffle mash and the delicious garlic brussel sprouts! I highly recommend coming here."], ["Frank B.", "The Spätzle were way to puffy and had no taste to it. - the staff was friendly and accommodating."], ["Alan I.", "La Cigogne. Where do I start? Don't be intimidated by the name, I can't pronounce it either but who cares? It's damn good. I've been here a few times and had so many things but what stands out to me has been Le Burger strasb..., Steak frites( extra credit to the frites) and Spatzle was pretty good. One time there was a Spatzle with seafood on the board as a special that I pray will buy property on the permanent menu. Today, I had the La Chèvre tarte flambee  and I can't lie, it was a moment on the lips that's innocence won't make me feel like I'm adding inches to my hips. The mix of goat cheese, bacon AND honey?!Look, bottom line...get here early, enjoy a few of the signature cocktails. If you're a beer drinker, trust me that the Kwak will make you love your mother-in-law and the wine won't let you down. Meet me at the bar and we will chat more..."], ["Diane G.", "I came here by accident as there was a parking space directly in front.  The french onion soup may be the best I've ever had.  The caesar salad was delicious topped with ample anchovies.  I enjoyed it so much that I went back last Sunday with a group of friends for a birthday celebration.  We tried a few appetizers and entrees and everyone was pleased with our newly discovered restaurant and it's attractive and warm ambiance."], ["Aly S.", "I never write reviews but I am making an exception.A friend of mine took me to La Cigogne a few days ago.I live on the UES but eat all over the city & Brooklyn truly has gems.The two young owners are behind cool and well worth the trip alone.The menu diverse yet comprehensive & authentic.The Tartes Flambees are to die for. I honestly don't think I'll ever go to another restaurant if I want Alsatian food.The simple yet well curated wine list covers all the French wine regions so your thirst for an earthy blend from the Northern Rhone will be satisfied as well as your friend's yearning for an elegant Pinot Noir or your date's wish for a vibrant Sauvignon Blanc.You can even find a Pinot Noir from Corsica! Bold choice that pays off.If like me, you are lucky enough to have Morgan as your waiter, then you can just sit back, relax, enjoy the gorgeous evening unfolding in front of your eyes...... And wish that you did not have to leave.Try to secure a table outside & dine al fresco.Due to limited sitting outside you might not be able to get that prime real estate spot but do not fret: the inside is just as inviting: plenty of space between the tables allows for intimate discussions while the cozy setting imparts great warmth to the restaurant.I could go on and on and on....do yourself a favor, hop on that bike, train, Uber, Lyft, yellow cab,.... Or use those limbs called legs & get to LA CIGOGNE asap.I know I am going back with a gaggle of girlfriends..... To have a wonderful budget-friendly  dining experience and also I must admit.... To  have another glance at Damien, Jeremie & Morgan....."], ["Katrina L.", "I enjoyed brunch here. No lines or long wait here!This place is lovely and spacious with good food. Had the croque madame, which was amazing and just the right size. Service is friendly as well."], ["Theresa P.", "My family and I just had the most delicious brunch at La Cigogne. They are well-known in the neighborhood for their excellent service--the owners could not be friendlier and always have a smile for us when we walk by. And now I will certainly go back after trying their delicious menu. Between the five of us, we had standard brunch fare, all of which was absolutely perfect: the blueberry, banana and nutella-stuffed pancackes; french toast; hamburger; scrambled eggs for the little one; and finally the not-so-standard fare: a tarte, which my cousin's wife raved about.The atmosphere on a beautiful summer day is relaxed and not rushed--very inviting. Highly recommended!"], ["Damir T.", "Very nice place! We celebrating my birthday in La Cigogne, and all was great. Red wine, cocktails and of course Grilled Salmon. For the dessert i took Apple crumble and it was great! Hot, not sweety and little bit crunchy. The waitress Taya was very kind and friendly. Thanks!"], ["Kelly Z.", "I am not sure how this place gets an average of 4.5 stars. I do not think it would, in Manhattan.Don't get me wrong, I love Brooklyn and I made a long trip to this spot to try out this restaurant. We ordered the burger and salmon, and maybe that was where we went wrong, as this place seems to specialize in tartes flambées and spatzle - we just found we were not quite in the mood for the latter two options (and judging by our neighbors' plates they looked only okay). The burger and salmon were both good portions and well executed medium as requested, which we were very happy about. However they were noticeably under-salted and not very flavorful. The salmon was also overly charred on the bottom.Maybe the rating is a bit inflated because it happens to be a good and relatively affordable restaurant with a welcoming and cozy interior - love the fireplace and option to dine al fresco - in the neighborhood. For sure if I lived nearby I would consider it a good option. But as I do not live in the area, I feel no desire to return. I will, however, visit the Alsace region in France next month and will report back if any of my sentiments change after sampling the food there."], ["Al R.", "pros:Casual space with cute decorYummy bloody Mary's Family friendly Outdoor dining cons:Slightly loud/ kid noise"], ["Milo S.", "Had a great anniversary lunch here with my wife. The food was delicious. Great ambience (we ate al fresco in the front). The service couldn't have been better. Highly recommend."], ["Yuriy B.", "La Cigogne; it's a restaurant with extraordinary food  and extraordinary ambience that is marred deeply by extraordinarily thoughtless service. I'll get my major complaint out of the way first, as I loved everything else about La Cigogne but our experience was messed up by a horrendous lack of understanding by the waiter.We ordered four appetizers and two entrees to split among four people. Simple enough, right? Forty minutes pass and no food. This is OK with me, as I prefer to wait longer and receive good food than to receive crap food fast. However, ALL of our food shortly comes out. Appetizers, some cold , come out at the same time as *steak and salmon*. So now, we have to either rush or eat cold steak and salmon. What was worse was that three waiters brought our food out; THREE  of La Cigogne's waiters didn't know the essential  concept of appetizer before entrée.  I mean, there was a salad that was put on our table at the same time as a steak. Guys. GUYS. Besides not bringing steak knives and not knowing the non-alcoholic drink menu, that was the biggest mess up our waiter made. For a Friday night, you'd expect top notch service. This really took me out of it. While the rest of my party liked the food , they found this also to be incredibly annoying. On the positive side, the host was very friendly and pleasant; this spot just needs someone to oversee the front of the house more as some of the waitstaff appear to be deliriously clueless as to what's what  This is coming from a former waiter. PS the bread for the table was absolutely stale but that's forgivable. Notes for some items we ordered: Tartes flambes - La Chevre tart was incredible. The honey taste wasn't overpowering and wasn't too vague. The kitchen knows how to make flatbread. Tuna tartar - I enjoyed this more than the rest of my party, I felt it was a hearty , chunky tartar and could not have asked for more.Steak frites - Excellent cut , very tender but would have been better IF IT WAS HOT.  Steaks tend to be a bit  better when you're not fighting against time to eat them before they get cold.As far as other items there was the scallop appetizer, which was soft and flavorful, and the almond crusted salmon entrée, which exceeded my expectations. But again, it was fairly cold by the time we got to it.I would go back  to La Cigogne tonight if I could despite the f-up mentioned . In fact, my wife wants to go back already and I dont blame her; it's a restaurant worth returning to.  The kitchen has tremendous capacity for excellence, the interior is pleasantly stylish . I just wish there was some sort of supervision (or the most seriously basic waiter training that you can think of) in the front of the house to prevent silly mistakes from happening."], ["F. A.", "Where here for the b'day dinner of my mum. Came super late, but they kept the reservation and served us very well. The food was extraordinary. Though I recommend it to people who understand the Alsatian kitchen - nothing for kale smoothie hipsters (joke)..."], ["Pamela B.", "Walked into La Cigogne on a Monday evening, located on the beautiful block of intersecting Union St and Henry St. in Carroll Gardens. I was warmly welcomed by Jeremy (one of the owners) who then walked me to the bar, he asked what type of libation I was interested in, I told him I enjoy pale ales with a bit above the average alcohol content. He recommended \"Wendelinus\" on draft, it was delicious. The bartender was also very sweet and attentive, I told Jeremy I checked the reviews on Yelp and was impressed with the 5 Star rating, he immediately said \"in my culture, people shouldn't be treated less than 5 stars, service should always be the best.\" I couldn't agree with him more. I wasn't very hungry but it was my first time at an Alsatian restaurant so I decided to try some appetizers. I ordered the Scallops and the Camembert frit. I'm always hesitant to order Scallops in fear of disappointment but these were perfectly browed in Caper sauce, I love Capers, and the Camembert (oven baked) was delicious too. Music is important to me, at all times, exceptionally when a drink is keeping me company, they played a mix of lounge and sensual tunes that completed the vibe, so good I forgot I was a party of one. I returned the very following Friday night. This time I came with a close friend, we sat at the bar again. I had Kwak, one of the best Belgian beers I've ever had. To start, we ordered Moules marinières (Mussels), they arrived covered in two bowls, when my friend opened the bowl, he immediately said \"there is a God!\" referring to the generous portion.  For dinner we ordered the Gambrinus (meteor beer marinated beef stew in egg noodles) and Steak Frites to share, everything was exquisite. In conclusion, as other Yelper's mentioned, there are many reasons to dine at La Cigogne, whether you want to just enjoy a good drink by yourself, bring a date (a special one), enjoy a good time with your entire family or group of friends, this restaurant and the level of hospitality from the staff and owners cater to all of the above. Two thumbs up La Cigogne, these 5 stars are very well deserved!"], ["Timothy R.", "New Alsatian French restaurant that's opened in a long-empty storefront on Union and Henry. Wine choice is good and well priced; service is friendly and informal; on warm nights, the storefront windows open completely yet, unlike the awful Buschenschank with a similar open storefront on Court Street, background music is quiet.Lots of great choices on the menu.  The Alsatian tartes flambé that they feature is basically a small pizza with crème fresh and light toppings.  We've ordered tartes flambé with salmon, another with muenster cheese and bacon, and a third with mushroom - all very good.  The burger is juicy and served on a soft pretzel bun - try it with gruyere cheese and dijon mustard - and their french fries are the best in the neighborhood, relatively thick and deeply friend and crunchy.  The steak frites is also delicious - one of the better steaks at this price in the neighborhood.Perhaps the only misfire here is a minor one: the table bread plate offers a few paltry baguette slices - basically a single thin slice of french bread per person - and pre-packaged cafeteria-style butter.  Even if they continue to provide only a few slices of bread for the table, surely butter can be offered in a pot instead of plastic packaging.For dessert, the apple crumble is served warm and optionally (and recommended) a la mode. Family recipe, according to one of the owners, and delicious.Glad to have these guys in the neighborhood."], ["Paul W.", "Had tarte flambie and Kwak Kwak beer. manager/owner is a COOL DUDE. The eats is a COOL FOOD. Atmosphere is a RIGHT MOOD. overall I'd have to say not coming here is a CRUDE/RUDE."], ["Presley A.", "An outstanding and disarming little hole in the wall in the Carroll Gardens neighborhood of Brownstone Brooklyn, on the corner of Henry and Union, which is a surprising little nexus of eating establishments, by the way, removed from the boulevard of midling eats on Court St.We happened upon it while strolling around, feeling spontaneous.  The site of a blazing fireplace at the back of the restaurant, visible from the street via the opened terrace doors, was a magnet to us.   The place was bustling and friendly to the eye.  Intrigued, we examined the menu that was posted at the entrance.  An Alsatian restaurant?  How novel!  That would be cuisine from the French side of the Rhine, with Germanic and Swiss influences as well as French, of course.Normally I am a little put off by French cuisine - atmosphere frequently too snooty, too much sauce on everything, not a wine aficionado, etc...  But the owner, Jeremy, was humble and gracious, delighted to see us and enthusiastic about describing his restaurant's offerings.  The rest of the staff was also friendly and attentive yet casual, never overbearing.  And the offerings were simple and earthy, with a great beer and wine menu to accompany.For libations, Kim enjoyed a glass of Brut while I partook of a glass of  Meteor Wendelinus Pale Ale, which was crisp and very slightly sweet.   Super refreshing.  I loved that it came in its own, branded beer glass, which was more of a goblet. Beer should always be served in goblets!  Later during the meal, I followed that with a stronger ale, a Delirium Tremens, delivered, again, in a uniquely branded glass, this time more of a snifter, and accompanied by the remainder of my beer portion still in the very pretty bottle.   All great all fun.Even the bread and butter were outstanding!  Rich creamy, lightly salted butter on chewy baguette slices.  Perfect.For dinner, Kim had the beef stew with spaetzle, which was tasty, almost home cooked in its melange of warm flavors and simplicity, but I found it a bit dry.  It needed a splash of beef broth, I thought.  That's probably not spaetzle anymore, I'm sure someone will say, but there it is.  It was very well prepared, just not my cup of stew, if you will.I had one of their signature tartes flambes, which are basically similar to thin crust square pizzas, sans red sauce, with creme fraiche and simple toppings, like munster cheese, onions, and of course, in my case, bacon!  Completely delicious!  Kim ate half of mine!    I also liked that it was served on a cutout of French newspaper placed over a cutting board.  A nice touch without seeming artificial.It's just a fun, friendly, unpretentious place with an authentic European feel to it, that serves great food and drink in a warm and inviting room.  We thoroughly enjoyed the meal, the service, the congenial room and left feeling completely satisfied and relaxed.  I am sure to visit this lovely establishment again."], ["Jessie Z.", "Great time. Nice outdoor seating and great service. I recommend the Morning High whiskey mixed cocktail. We had the Chèvre chaud , side of wild mushrooms, mixed greens and an order of the Steak tartare  all which was amazing. I highly recommend everyone to give this great gem a try."], ["Elisa E.", "Was curious about this place, been there twice and i enjoyed it,  Jeremy is really cool,The flammekueche was good , great merlot and nice choices of beers, but \"Cesar\" salad is way too expensive for what it is :/ in my opinion ;)"], ["Kristopher W.", "Are You Sick of Bad Pizza Yet?Introducing a New Restaurant - the Only One Serving this Cuisine in BrooklynDon't Wait - It Won't Remain Secret for LongDear Reader:Let's face it, the restaurants in Carroll Gardens have become a bit...hmm, how should I put this... stale? It seems like there is one, big, central kitchen making food for all the restaurants, and the only way to tell them apart is from the signs out front. Sure, we could make the walk over to the bedbug-infested subway, crowd in with everybody and head into Manhattan, searching -- possibly in vain -- for a pleasant, inexpensive, and hassle-free meal. Of course, if we do find this magical place, once we finish eating, we will have to turn around and make the late-night return trip home...If the trains are running!I'd like to suggest an option that may seem like more of a vacation than a nuissance.Have you heard of La Cigogne, the new Alsatian restaurant -- the only restaurant of its kind in Brooklyn -- that just opened... In our neighborhood!I'm telling you, my girlfriend and I were strolling by La Cigogne last week and the atmosphere inside was calling to us...and we had just eaten.In fact, when we walked by on a Sunday during this year's World Cup, the restaurant was full and they had not even been awarded their liquor license yet. Can you believe it? When is the last time that you saw soccer fans watching a match without alcohol? Alot of the exitement about La Cigogne has to do with the owners, Jeremy and Damien. They've brought everything that they love from Alsace and combined it with everything that they love about America. They treat you like you are a close friend and not -- like some restaurants in our neighborhood that will go unnamed -- like they are doing you a favor.And while La Cigogne's atmosphere transports you from the hustle and bustle of New York to the laid back, seize-the-day vibe of the French-Swiss-German border, it is the food that makes you want to come back again and again. Gone are the generic pastas, salads, and cookie-cutter pizzas. La Gigogne offers a unique blend of Alsatian fair. What does that mean? Well, it means that you are getting the best blend of three distinct, yet complementary, culinary traditions that makes Alsatian cuisine renowned all over the world.Nestled on France's eastern border with Switzerald and Germany, Alsace is famous for being one of the most highly concentrated Michelin Star regions in the world.This means that you can get a Mac n' Cheese appetizer made with rich, smooth, melted, delicious cheese -- not made with ingredients that sound like they are straight from a laboratory. You can get a burger that reminds you that hamburgers can be delicacies, not limp, soggy-breaded, overcooked cast-offs.Looking to venture deep into Alsatian territory? La Cigogne's spätzles will make you wonder why you have waited this long for food this good. My personal favorite is the Steak Frite entree, which is so authentic that it should come with a beret -- although, I'm sure that you could get it with a baguette if you asked nicely.To complete the illusion of vacation bliss, you can enjoy a wide array of Alsatian wines and beers...beers that you'd be hard-pressed to find anywhere else in the city...beers so tasty that you'll wonder why they've been hidden from you for all this time.Listen, typing this review has made my mouth begin to salivate. So, head on out to La Cigogne. You'll thank me later. À votre sante!-Kris"], ["Snooki F.", "This place is clown shows delicious. The beer list is quality and the food is even better. Tarte flambee was out of control. Put it in my mouth. Right. Now. They've got some sick French beer on tap as well. Definitely worth a taste. They just opened, so support them!"], ["maia f.", "I've been here for brunch twice, both times at around 10am on a Sunday. There has never been a wait of any kind, which I very much appreciate in this neighborhood. The servers are friendly and attentive and the coffee is delicious. I ordered the pancakes both times because I love pancakes stuffed with bananas and berries. I think they're perfectly delicious. Not too sweet and just slightly crunchy. The Nutella on the side is an added bonus. I would definitely go back, especially with a group or my parents since it's quiet and never crowded."], ["HY K.", "Happened to chance upon this gem of place as my bf and I were coming from the 74th precinct and was pleasantly surprised. Delicious drinks, morning high was my fave~ we also had the most amazing tarte flambe. Really cool and laidback owners."], ["Mia J.", "After a year of watching the renovations taking place and wondering what was going to finally be there, I am so happy to have La Cigogne open and in my neighborhood.The first time visiting, they got me hooked with their fantastic pan-seared scallops appetizer. Just this past Sunday, I was shocked to experience one of the best bloody marys I've had in a long time - and trust me, I am no stranger to a bloody mary (in fact I am drinking one at home right now). The only downside was the lack of olives or pickle for a garnish...but that was forgiven and forgotten rather quickly thanks to the deliciousness in my glasses which were emptied rather quickly.While I am definitely more of a hard liquor kind of gal, I've branched out with their wine selection. Actually, now that I think about it, I've tried and loved a lot of new things here. The same Bloody Mary Sunday I just wrote about, my friend and I tried one of their tartes flambees with cherry tomatoes, black olives and arugula. It was a great combination of fresh, warm, tasty and filling without making you feel like you're going to need to be rolled out of the place.Later, we were treated to the day's special dessert, a s'mores flambee. Don't think any less of me but I'm really not a dessert person. I prefer to get my calories in the form of salty carbs or alcohol. This though...not only was it not overly sweet, the roasted marshmallow brought me back to my childhood. It was great and will go really well with their fireplace this winter.Everyone who works there is not only attentive, but also very sweet and it's not only been nice to get to know them, but it's also been great to watch them interact with other customers every time I've been there."], ["Andrea D.", "I feel very fortunate to have found this unique French restaurant. We started frequenting this place two months ago and have gone back several times since for brunch or dinner.  Have tried something different each time and haven't been disappointed.  Can't go wrong with anything on the menu, but the burger on its pretzel bun and the tarte flambées are spectacular. Excellent selection of beer and wine as well, and the atmosphere is warm and casual. Also, the service is attentive without being intrusive and they love kids! Highly recommended! La Cigogne really is a welcome mix of old-school service and amazing food and atmosphere."], ["Kate S.", "I came the opening night and was like uh ok. So I had been lame and not come back. Popped in tonight for an impromptu bite and think I ate the most delicious thing ever. The Brie, mushroom bacon cheesy flatbread tarte was rich good deliciousness. Had a bite of my besties burger and almost cried. Go there fast. It's amazing. (Get the Rose.. The bartender has great recommends!!)"], ["Sara B.", "Great atmosphere and our starter of Spatzel Mac & Cheese was awesome, but service was slow and inattentive and our entrees of steak frites & the chicken were a bit disappointing."], ["Deborah B.", "I don't give five stars very often. But this new restaurant, La Cigogne, celebrating authentic Alsace cuisine, certainly deserves it. Five stars mean that the ambience, the menu, the service, and the food were all excellent. This restaurant was an accidental find. I didn't read any of the below reviews before I went, but I can attest to the fact that they are all correct. The ambience is quaint. It feels like an old cafe from France. The menu and the wait staff are authentic... Imagine French staff (we will not argue over the legitimacy of calling Alsace French) actually working in a French restaurant. The service was solicitous without being overbearing. And if for nothing else, they get an extra star for knowing that no one wants to be seated next to a spoiled misbehaving child with inept parents who can't control her and moving them to the back of the restaurant without incident. Bravo! And yet they are still family friendly. There were many (well behaved) children outside (sidewalk seating) and inside who seemed to enjoy the food and the ambience. Food, even simple choices like ceasars salad and macaroni and cheese, were well crafted and delicious. I will definitely be back and I encourage you to try it. It was early evening on a Friday so was reasonable busy but not crazy, a great time to visit a great find!"], ["Ellar J.", "The Best Burger and fries in Carroll Gardens!!!!The Beef Burger was cooked perfectly and was topped with melted Camembert Cheese and crispy Bacon.The home cut fries were crispy on the outside and cooked just right on the inside and tossed in rock salt.The Outside seating makes it a great place to enjoy lunch during the week."], ["Aggy C.", "Delicious and modern French restaurant! the owners are so devoted and the staff is great! would definitely come again."], ["Stephanie A.", "I would give La Cigogne a 3.5, but my family insists I give it 4 stars.  Although we were seated well before other tables, we received our food much later than others.  And, it wasn't because we had ordered something complicated.  In fact, we had almost the same order as another table, but they still received their food well before we did.  When I questioned the manager? he brushed off my questions and said our food would arrive shortly.  Our food did arrive soon thereafter, but our server should have communicated with us a bit more and the manager should have been a bit more apologetic and less brusque.  As for the food, the La Mer and La Fromagere, were quite good as were the various beers and cocktails we consumed.  That said, my steak frites, which I ordered medium rare, came medium well.  The frites were not bad but not memorable by any means.  I had specified that I wanted my steak to be cooked medium rare as I find consuming overcooked meat to be a waste of eating.  Nevertheless, the steak was still overcooked.  Our server, who was quite sweet, apologized.  But, that still didn't change the fact that my steak was overcooked.  We concluded our meal with a creme brûlée, which was excellent.  Overall, pretty good, but not amazing.  However, worth going back to on days when we don't feel like leaving the 'hood."], ["Peter B.", "Nice atmosphere; I like the bistro look... But the Spätzle were very mushy. Either they were overcooked or maybe too much flour. I had the beef stew which was much more flavorful than my friend's chicken."], ["Meghan M.", "We only came for drinks so far but the staff is SUPER friendly and so welcoming! We are looking forward to coming back to eat! But the beer is delicious and I'm a beer fan. The wendelinus is a great beer I highly recommend it for any type of beer drinker. They have freak cocktails as well."], ["Mark-Antonio S.", "The ambiance of this French eatery is inviting as well as relaxing. Great food, great drinks, great music!"]], "Cafe Paulette": [["John S.", "Bad review based on a 4 dollar iced coffee that was both small(12 ounces) and tasted mostly like water. Pretentious atmosphere does not guarantee  quality."], ["Maeve M.", "I can't believe I haven't reviewed Cafe Paulette yet! I've been walking by it for months, and have eaten dinner and brunch there, had a few drinks on New Year's eve, and even stopped by just for coffee.  I'd definitely recommend their dinner service:  the radishes with butter were so delicious, and everything we ordered (plate after plate) was really fantastic.  My boyfriend is French and enjoyed speaking with the owner, who also sold us a really nice bottle of wine for a deep discount.  I had a creamy, cheesy cauliflower soup (the soup of the day) which was perfect.  The brunch was not as good as dinner.  My croque-monsieur needed more cheese, and to be cooked more, the cheese that was on it wasn't melted (a pet peeve).  The French press also tasted really off...but on the other hand, their pan perdu/french toast was extremely good, and the prices are pretty good for Brooklyn/Fort Greene.  Definitely worth a trip!"], ["Beryl F.", "Cafe Paulette's is an incredibly over priced cafe/ bistro. Yes it is adorable and the ambiance is quite charming however this doesn't out weigh the plain fact that its over priced. Since Fort Greene is now bursting at the seams with new families and upwardly mobile singles there have been lots of awesome restaurants and trendy cafe's popping up all over the place, hell the bakery/ cafe next door to Cafe Paulette's is a great example. Good prices and great quality! At Paullett's I bought a glass of wine that was priced at $14 (I know I'm a baller), it was poured into a quaint wine glass that brought me back to the days family passover with my thimble glass of wine that was filled with Manischewitz. Once the waitress poured me the glass I was like \"ummm I'm an adult and I didn't want just a taste\". For anyone who who has the motivation I would walk up the street and go ANYWHERE ELSE."], ["Lebleena L.", "This is a quaint place. It has an intimate cafe style for coffee, tea, and breakfast bites  They offer good brunch and evening food with wine and beer. It's great because it's close to the park."], ["owen w.", "I want this place to succeed, I really do. But all I wanted was a cup of coffee to go and the staff couldn't seem to get it together. It took about 15 minutes to do something that should have taken a second."], ["t c.", "1-  you marginalize and exclude the working class in your neighborhood who want to give you business by considering 50 cents insignificant.  If it's that insignificant to you and your staff, then round up, not down.  2- if your server's dehumanizing look and tone in emphasizing the word \"you\" was not a sign of judgment and racism, then what was it?3-  you fail to quote my positive reviews, at other male/white dominated establishments who treat all people equally and with respect"], ["jessica k.", "Total find.  Adorable place, great service, and the best coq au vin I've ever had (plus some unique offerings like raclette--permission to eat a plate of melted cheese for dinner!).  We'll definitely return."], ["Janna Y.", "very nice and cozy place, had dinner with my friend there. the food was very good, but service........ i wish it could be better"], ["Pamela B.", "A lovely, little cafe for simple French comfort food. The knowledgeable waitress coaxed us into the perfect dinner (hint: don't forget the leeks), and obligingly over-poured the wine."], ["Evan J.", "A real gem. It reminds of the little cafes and brasseries in the Latin Quarter. Excellent service; the food was a little slow in coming, even though there were hardly any customers in the place. The table next to me got unreasonably angry with the waitress, as they couldn't understand that she *hadn't* given them a free dessert--they misheard through her thick French accent (another draw of this place). The coffee is French too (an OK, but not amazing latte; but I suspect the espresso will be good on my next visit). The food: incredibly simple, clean French flavours. The perfect escape from New York."], ["JP S.", "Clean with good decor, French music in the background and good light. Quiet during lunch. Had the lentil soup with a carrot/OJ juice. The soup was a bit salty for my taste. I couldn't get comfortable during my meal. It seemed hard to find a good space to stay relaxed."], ["Olivier B.", "Excellent French bistro, fresh food, great atmosphere. Love the Brandade."], ["Ted C.", "Great neighborhood restaurant.  Classic French cuisine with local materials at very reasonable prices.  Best Creme Brulée I've had in a long while.  Personal, intimate, pleasant, unpretentious.  Unlike many area restaurants, not so loud you can't hear yourself think, and it's fun to see the parade of humanity stream by, some engaged in the workaday mundane, some enjoying Fort Greene Park across the street.  A hit, I think."], ["Benjamin T.", "Lovely authentic-feeling French place. If you just want to take it easy and hangout and have delicious food, this is a great place."], ["Jennifer F.", "This place looked cute, but I was stunned to see that they billed me 7 dollars for a small glass of orange juice.   My latte was poorly made, and also the smallest I've ever seen.   26 bucks for a small glass of juice, a poorly made latte and some eggs.   No thanks."]], "Le P'tit Paris Bistro": [["Tai M.", "Cute, cozy neighborhood spot. Don't understand why it's being categorized as French though. Most of the items on the menu are Mexican and Spanish. We ordered the only French appetizers on the menu, which tasted very good. Great service, very attentive. Definitely recommend for a quick bite/drink."], ["Ingrid S.", "Much much better this time, walking in on Saturday afternoon for brunch. I feel this place gets over-whelmed when super crowded. But perfect when there is a normal brunch flock. My friend's all enjoyed their meals. And the drinks were not stingy in the least bit. Also, delicious creme brulle and interesting interpretation on french toast. I got the ham and cheese crepe. A little too heavy on just mediocre ham and not as much cheese as I would have preferred. One of my friend's ordered the same thing and agreed. But she loved her french onion soup. We had a good time. Fantastic waiters."], ["Michelle F.", "They have amazing French food. Would highly recommend. Beef tartar was good. Crepes here are my fav. Nice little neighborhood place for French food."], ["Rae C.", "Awesome place for Sunday brunch . Went there with my boyfriend and we had a great time . We choose the $10 pre fix menu. Service was on point. They came around and asked if we wanted more orange juice or coffee . The orange juice was fresh and delicious . Portions were filling. Bacon was crispy just the way I like It ! Will definitely go back for Sunday brunch ."], ["Annie T.", "A group of us were out here for dinner on a week night. The decor is true Parisien along with the fact that the staff are French.While glancing at the menu, I was excited to see french onion soup + escargots, different types of mussels and steak frites..which I feel are the quintessential french dishes I prefer to get.The onion soup and escargots were in fact delicious!My husband was dead set on ordering the Steak frites but ended up going with the Beef Bourguignon. It wasn't terrible but not a great dish. I just don't feel beef should be partnered with noodles.Other dishes were good at our table. The salmon tasted fresh and fantastic.The service did not help our dining experience. Our french waiter, whom I spoke to in French, felt so rushed that night. Our entrees took a while to arrive a the table and when they did things were disorganized. I did not receive the  mussels that I ordered. I was supposed to get he ones with seafood broth. Instead I received the tomato sauce which I didn't noticed until I started eating and getting towards the bottom. Overall we both didn't get the ideal dishes we wanted. I'm not opposed to coming on another time for dinner and brunch."], ["Paul F.", "Food was good. Service was better. Unlimited mimosas and wine was best! You won't be mad for Sunday brunch at all! Give em a shot!"], ["Cecelia S.", "Bottomless brunch you can't go wrong. Served until 4:30 which is very rare. The mussels in white wine were fresh and served in a large portion. Definitely want to come back for dinner."], ["Jaszon S.", "Came here for Sunday brunch the other week with a fairly large group...  We all opted for the $16 prix-fixe menu (instead of $10), which allows you to pick a brunch entree (typical breakfast fare), and comes your choice of grown-up beverage (mimosa, bloody Mary, sangria, or house wine) with unlimited refills.  The $10 menu offers the same food selections but excludes alcohol.The food was good...  Most of us went with the Eggs Benedict.  We also ordered dessert after our meal, and I went with the Napoleon, which is probably the best I've ever had -- I would totally return for the dessert alone!The service was friendly and prompt, and they were constantly refilling the drinks (unlike some places that advertise unlimited mimosas and what not, but are extremely slow at refilling).  I highly recommend and look forward to trying other things in the future."], ["Amelia M.", "Best brunch deal for sure.  Either $10 for an entree (my sandwich included steak fries) with unlimited coffee/juice/tea or $6 for mimosa.  I was so full and satisfied after the hangar steak sandwich but I would definitely come back to try desserts (they looked amazing)."], ["Mike M.", "I came here on a weekday afternoon and was very happy with every aspect of the restaurant. Great atmosphere with relaxing music to set the mood. I came during the afternoon and the lunch specials came with either a soft drink or a glad of wine. I chose the wine of course and I will be coming back here again. A must of you're in the area!"], ["Ashley Y.", "The food here was good, the dessert was even better! They had an amazing 2 layer chocolate and hazelnut cake that was plated beautifully. The servers were really nice. The ambience of this restaurant was great and they are kid friendly. They even have a kids menu options."], ["Carol F.", "My sisters threw me a baby shower here this past weekend and it was such a great experience. I highly recommend planning an event here.Guests enjoyed a late brunch and unlimited mimosas. The service was prompt and courteous and the food was very good. Guests raved about the cake - one friend even said it was the best she'd ever had! The ambiance is really cozy and nice as well.If you need a venue for a party of 40, definitely give Matthieu, the owner, a call."], ["Susan V.", "My family and I have been regulars at this neighborhood restaurant since it opened.  I have always had a good experience and the service has always been excellent.  The food has generally been good, though not as good as when it first opened.I am writing specifically to WARN PATRONS WHO PURCHASE GIFT CERTIFICATES  for this restaurant to BEWARE!  They offer an unusually short expiration date (3 months) and they refuse to honor the gift certificate if past that date. We were given a $100 gift certificate which was purchased in early June, it expired late August!  We had many times been to the restaurant but forgot to bring the certificate with us.  When we finally remembered the other night, we were sadly told by one of the owners that there was nothing he could do--and this was said to us, regular customers.  He finally relented somewhat and gave us partial credit for the gift certificate.I find this to be extremely bad neighborhood relations and bad business on their part.  They received the money and refused to honor the full value of the certificate within months of purchase.  So, if you do purchase a gift certificate from them, make sure you know what your are getting and make sure the person you gift it to also is aware or you will be throwing your money away.  I'm sure the person who purchased it for us didn't realize is expired so quickly.  I feel as though it is a real rip-off and as a result, I have decided not to patronize their establishment any more."], ["Alice E.", "A fine and cheap brunch option.  $10 with a drink you can't beat it! Portion sizes were large but overall food wasn't great.  I had a way over stuffed/ too rich crepe.  Totally a fine option for brunch and I would be curious to try for dinner but also better food in the neighborhood.  Fast and warm service."], ["Dani N.", "Just a review of the dessert- I had a salad which was fine, nothing special but the dessert, fantastic!!! We shared a bunch of desserts, including creme brûlée, profiteroles, a napoleon, and some sort of meringue which was tremendous! I have never had this type of meringue which was soft and not rock hard. It was so smooth in some sort of cream sauce. The napoleon was really traditional, not at all like one you would find at a bakery. I definitely recommend going for dessert!"], ["Lex F.", "Everyone I know raves about this place. But I haven't had the same experiences. Will still keep trying Lol. Service is good, prices are excellent,  and feels authentic."], ["Yana G.", "Really glad we stumbled upon this place. Great bistro food at an even better price. Haven't tried their brunch yet, but dinner never disappoints. The steak tar tar, mussels and boeuf bourguignon are really delicious."], ["Jin Y.", "Le P'tit Paris Bistro is such a lovely restaurant and perfect for an intimate dinner. The food was really delicious.We had:1. Mussels with garlic & white wine 2. Pan seared sesame crust tuna, wasabi mashed potato, julienne vegetable3. Braised lamb shank in tomato brother with mushroom risotto4. NY center cut strip steak, potato gratin, tomato provencal, string beans5. Roasted stripped bass, sautéed spinach and potatoes, lemon beurre blanc"], ["Christle A.", "One of my favorite places for brunch. $10 unlimited coffee/juice brunch? or $16 unlimited sangria/mimosa/house wine/bloody mary brunch.  Can't beat that! Always easy to get a table and they have the most amazing crab cakes. Loved their pain-perdu (french toast) sliced baguettes with caramelized crunch and a milky butter cake center. Served with a raspberry drizzle, maple syrup on the side and a fresh fruit salad in the center. Presentation is beautiful! Also had the Oeufs Florentine (Florentine benedict) which came out perfectly. Served with the yummiest roasted fingerling potatoes."], ["Megan C.", "I've been eyeing this place since moving to the 'hood 7 months ago.  You know that old saying, that if people from the actual culture being represented are there then it must be good? Well French was spoken from all surrounding tables! We had brunch with muscles as a starter. I had the goat cheese crepe which, despite being two things I love (hello goat cheese... and crepes) was a bit odd. It seemed as if someone has put an entire package of cheese into it and it was overwhelming. Overall, enjoyed the experience, and nearly packaged the wasted goat cheese in a doggie bag.."]], "Le Paddock": [["John H.", "Ugh. First of all, the cash only thing is terrible. The principle of that really bugs me. At best it's pennywise and pound foolish to save on the few percent it costs to give customers the convenience of paying by card, at worst they're fersure avoiding paying income taxes. Even worse, though, is that these guys aren't good enough to dictate from on high how their customers shall pay. If they were in a more competitive neighborhood, they would not be nearly as busy. The service was super slow, and performed with classic French indolence. At one point, a busboy plonked an eaten plate of oysters on our table when he was picking up our appetizer dishes. Gross. The French onion soup was smelly, and my skirt steak was really under seasoned and tough. Overall the food was substandard, especially for the price. I'd give it 3 but I am so so fed up with cash only. Unless you're a dive bar it should be illegal."], ["Lee L.", "Nice thin crust pizza, cozy shop and friendly service."], ["renje g.", "++- Harvest pizza with scrambled eggs and cheddar cheese on the side; I'm and egg hater and I loved this dish- Price; $13 for pizza + mimosa + nonstop  coffee is a good deal+- Coffee was good- Service was good- Mediterranean pizza was cool"], ["Geoff S.", "Despite the 2 stars, I love this place. My wife and I always enjoy the terrific rustic French cuisine as well as the friendly service. However, 2 things troubled me on our last few visits. First of all, they only accept cash, which would be fine, but their ATM will only dispense $120 at a time. Which is not enough for a nice dinner for two. So before we sat down we paid $10 in bank fees. Second, and more importantly, I have witnessed the waiters and busboys countless times clearing dirty glasses off tables by sticking their fingers inside them. I'm going to have to assume that they didn't wash their hands each time before handling my bread and clean silver. It's really quite disgusting. It might also explain why they have a \"B\" sanitation grade. I really hope they change this practice, because I don't think I can go back again."], ["Mike L.", "My wife and I eat here all the time. Service and food are great but the oysters are hit or miss. Crab cake is delicious. Bloody Mary's totally worthy."], ["Justin L.", "FeelsCharmingBut chargesExtra due toNo nearby competition. Nice servers."], ["R T.", "Went back months later to try dinner. Even worse than lunch! The dinner menu, judging by my plate and others at the table, is not healthy, well presented or tasty. Lots of bland, overcooked, fried food and white flour. The noise level was beyond jet-engine levels--staff regularly slamming down bussed dishes and silverware helped by the screaming children and large number of loud-talking inebriated people, which perhaps helps explain why this substandard place has so many good reviews. Add to this the inattentive staff and \"cash only\" policy! Until we get a quality restaurant in this neighborhood, I'll continue to walk to 7th Avenue in Park Slope."], ["Tom R.", "The brunch menu is wide-ranging with many tempting choices. The prix fix choice of eggs, salad, potatoes  and bacon was well prepared and satisfying.  There was no wait on Sunday around 2:00 p.m."], ["Mike F.", "We ate outside, had a combination of appetizers and small plates - all were delicious, in particular the whole roasted garlic.The staff were nice and present, never overbearing, and came around at seemingly the right time for everything.Definitely a place we're planning on a return visit."], ["Sheila J.", "A second go around and I must honor this spot with an extra Star. Went here for the New Years Eve Prix Fixe Dinner and tried a variety of their offerings. Every course was stellar (with no gluten reactions this time-yay!). I had fresh juicy oysters with a nice hot sauce and bright vinegar- delicious and fresh..followed by the perfectly seasoned Monkfish over butternut squash risotto. The Risotto was swimming in butter, and I was just fine with that. It had a nice little crunch in there too. The texture, flavor and presentation of the main course were all spot on. I finished with a ginger crème brulee which was glorious and not too sweet, with a gentle ginger flavor and subtle fresh coconut! The staff was charming as ever- hitting a rare balance of charm and authenticity that lacks in pretense you'd normally fear in places like this, the environment just as sexy as the first time I went in for the incredible Mussels/Wine and fry for $15. Stepping into Le Paddock you feel transported. This is officially one of my favorite restaurants."], ["Miss G.", "My boyfriend brought me to this awesome restaurant and we had a great time  The service was outstanding.  Our waiter Gregory was great.  The manager also checked on us as well, which I like.  The crab cakes were AMAZING.  Seriously AMAZING.  We also had the mussels and the deviled eggs were a hit as well. Plenty of portions and a great vibe on a rad street. I look forward to returning."], ["megha s.", "Just finished Brunch here. Not impressed at all. Despite being Father's Day, they were not super packed. Service: We were seated fairly quickly, but that was the only time anything happened quickly. After we were given menus, the waiter completely ignored our table for at least 20 minutes, catering mostly to the tables outside. To be fair, he was one of two waiters and the other one was new and really slow. After a significant amount of stare downs, the owner came up to us and took our order. We were not informed of the specials, just that they were out of scones. Drinks: the coffee was just OK, slightly burnt, the mimosas and orange juice were pretty good. Food: I ordered the Ranchero Pizza and the bf ordered baked eggs. My pizza was visually very appealing but super bland and dry. There were more mushrooms than chorizo and it lacked any kind of salt or sauce. I had to bathe it in hot sauce to make it enjoyable. The baked eggs were also bland, I kind of liked the sauce but the Feta was nowhere to be found. If you me promise cheese it better be there. Price: At about 14 bucks a person it wasn't very pricy, but I wouldn't mind paying a little more to get better food.  Despite having a solid menu, we won't be returning for more."], ["Brad M.", "Time and time again they continue to impress us with their fresh ingredients, great flavors and friendly service. The escargot, deviled eggs and seafood pizza were real standouts on our last visit. They have great wines by the glass and by the bottle but they don't mind if you bring your own. There's a reason this place is always packed. Go and be happy!"], ["Romy G.", "Obviously, \"Le Paddock\" is French for \"da bomb.\"I had lunch here while on a getaway to NYC on a beautiful, sunny weekday. The outdoor dining area was pleasant and my server, Gregory, was attentive. I asked him to help me decide between the croque monsieur and the roast chicken (which was part of the prix fixe lunch menu) and he seemed a bit torn, then suggested the chicken. For $10.95 you get an appetizer and choice of entree from the special lunch menu; bread and butter is also served with your meal (yes!). I opted for the deviled eggs, which arrived as an order of 3 egg halves on a bed of baby greens. Then came my main dish: 1/4 roast chicken with mashed potatoes and spinach, with a delicious gravy circumnavigating the plate. The chicken was amazing, with evidence of fresh spices: rosemary leaves, parsley, even a lemon seed. I'm delighted to say it fell off the bone, and I savored every bite. I also enjoyed a glass of cotes du rhone.I was hoping to also enjoy a creme brulee, but was stuffed, so I'll have to save dessert for my next visit. If I lived in Windsor Terrace, this would be my date-night go-to for sure.A lot of reviews complain about it being cash only, but... That happens a lot in New York. Keep an emergency c-note in your wallet, folks."], ["Nicole S.", "Stopped in for brunch with friends on a brisk Saturday. This place is adorable. Toasty warm, great for families with small kids, solid menu for a neighborhood spot. I had the eggs florentine, which came with tossed greens and seasoned roasted potatoes. Cleaned my plate. My husband had the burger, medium rare, which was thick, juicy, cooked perfectly to order and appointed with pickles, bacon, cheese and some crisp fries. Orange juice was freshly squeezed. Bloody Mary was on point. Stuck around for dessert, and the chocolate mousse was fluffy and not too sweet; the slice of almond cake was immense -- definitely sharable -- and came slathered in apricot compote, a dusting of sugar, and a generous dollop of fresh cream. We were very happy with our meal and will definitely be back to this cozy neighborhood staple."], ["tee p.", "I am upset that Le Paddock has a B rating! That shows me that this place does not care about its patrons. Not sure at what point this place started the nosedive but I will not eat in a place with a B rating. It takes a lot of neglect to get there..."], ["Donna K.", "Brunch places are always tricky once you have your solid staples but hubbs and i decided to venture out in the world and although i had this place bookmarked for dinner - their brunch did NOT disappoint at all. he had the Norwegian (eggs benedict with salmon), i had some eggs on the side of a kale salad, and we split an order of the french toast. amazing. all of it. the portions were perfect size, potatoes and salad on the side were cooked and seasoned well, the salad was perfectly massaged (a big deal for kale..) and seasoned with a bit of a spicy anchovy style dressing...and the shredded egg they add to the salad was also very genius in taste. coffee was fresh and tasty.if you can grab a seat outside on a nice day it's very enjoyable because the street isn't too busy - slow enough for you to enjoy your company, but busy enough to people watchwill be back for dinner for sure! especially for their $1 oyster happy hour on Thursdays!the only minor complaint would be the service (a bit slow, although fully attentive once they came over) - but i give slow brunch service a break because it's the weekend and well, it's brunch - everyone deserves a break. also - CASH only but they have an ATM inside."], ["Amanda M.", "I just moved in the area and this was one of the first places I tried. Wow, this place did impress!! Everything about it was excellent. The food, the service, and the drinks were all top notch! I will definitely be back in the future"], ["tony T.", "Margarita pizza was tasty as was the goat cheese salad. Service attentive in a nice hipster way in a cozy setting with roughly 15 tables inside and 3 outside. Burger was plated well but tasted average. Beer selection had 4 drafts with a bias to sweet citrus flavored though not for me who desires more hoppy tastes. Daily specials and definitely a neighborhood spot. Major downside is that it is cash only and no happy hour!"], ["Chompawomp B.", "I'll even forgive the no credit card idea since the prices reflected that...Great great great great find in Windsor Terrace!!!"]], "Mominette": [], "Georges-André Vintage Café": [["Patrick H.", "Very comfortable, cozy coffee shop with a wonderful staff that you won't really find in Bed-Stuy. Everyone who works here is so friendly. The atmosphere within the cafe is warm and very vintage as well, with board games, lots of places to sit, and lots of areas to do some work or reading. They also have outdoor seating. It's very kid friendly! Every time I go, I see (very happy) kids everywhere playing with toys they have while the parents are relaxing and chatting. So if you have kids and want to get coffee, this is a good place to go!Coffee's great, and the pastries they have are also amazing. I normally get the iced coffee, which they automatically make into a red eye, which is pretty awesome since that's what i usually get at other coffee shops. They have a variety of homemade donuts, and they are pretty good. Prices aren't any different from other coffee shops. They don't take card, so make sure you have cash! I really have nothing bad to say about this place!"], ["Ashley R.", "Outdoor patio in front is a quiet nook in the heart of bed-stuy. Love the lattes here and the tomato mozzarella panini is killer."], ["Letty C.", "Strong coffee, a variety of pastries and eccentric decor all within Stuyvesant Heights. The owner is known in the hood as \"Super French\",  she's \"super\" and \"French\",  she definitely lives up to her name great customer service, friendly, smiling, and laughter. This small coffee shop is cozy and the warm lightening of the various lamps, couches, and music makes it feel as if you're sipping delicious coffee in your living room. Outdoor seating and wifi are available.The owner and barista speaks fluent French. Sounds heavenly to hear them speak amongst one another as they prepare your almond croissant which by the way will have you licking crumbs from your plate. My son loves the hot chocolate and I love supporting small businesses in our neighborhood."], ["Eduardo G.", "This place is really cute and like the quintessential little coffee shop you want in your neighborhood. Forget Starbucks that purposely spells your name wrong and acts condescending. These types of coffee shops are where it's at. The lady at the counter is really nice and makes the her coffees well and her customer service is on point. Definitely will be back."], ["Jerome T.", "It's cute and cozy inside. They have Dough donuts and other tasty treats. The coffee is superb. Decent amount of seating.  Cool vibe and peeps. Friendly staff, good bathroom. Fast wifi. Not many options other options unless you feel like walking another 16 blocks."], ["e b.", "Super French and this cafe are super dope or très bien! Great and tasty food and drinks. The ambiance is warm and welcoming to everyone. Allez/go!"], ["Hong L.", "On a rainy dreary cold Sunday, I was lucky to come across this cafe to grab a soy latte and a toasted ham crossant. The furniture and decor are extremely cozy and warm. People come here to relax and chat. There is a small play area with kids toys so I assume families bring their kids who can then play in the play pen. I love the fact that the people who work here speak french fluently! Doesn't feel like you are in bedstuy."], ["Claudio M.", "Great little cafe, lovely atmosphere, amazing decorations and details, I love their ice cappuccino and croissants, warm and professional service, thumbs up!"], ["R G.", "Great relaxed place. Very friendly and accommodating barista. Let us stay outside while he closed up inside after 6pm..."], ["Ken W.", "Coffee is good, as is the service. Full of WiFi spongers, taking up all the seating while working on their homework. Reminds me a lot of the Starbucks in Brooklyn Heights. Thankful we missed the pet and baby parade other reviewers mentioned. Might be nice if you're part of the clique, but we were definitely put off."], ["Rosana V.", "Very cute place with a few couches, delicious tea, and a very friendly staff. I didn't have any but they have the best coffee brand in New York City, La Colombe. This place is ideal for the warmer weather. Because they have outdoor tables and benches. It gets quite crowded and there isn't a lot of space so unless you gey a spot on the couch it's not easy to relax.   I had to sit at the window seats in order to work on my computer. They have a nice assortment of pastries and quiches.  It's a perfect spot for the neighborhood because there aren't many options around here in terms of cafés so a lot of the locals come in to grab coffee or stay a while to sit and catch up with friends. There is a bike rack right outside, a kids play pen inside, and free Wi-Fi."], ["Reshard R.", "Very cute place with loads of activity from laid back neighborhood folks. The coffee is worth it bit when it starts to crowd...take it to go."], ["Antonio C.", "I not big on Coffee but I'll tell you one thing this mocha is Slamming... forget Starbucks way to overrated this is the real deal and the Decor it reminds me back when I was a child."], ["Simone B.", "This is a cozy little coffee shop in Bedstuy. It has a vintage feel and is never very crowded. The owner is nice and the coffee is good. They sell baked goods and Dough donuts ( nom nom nom). Good vibe overall."], ["Marlena D.", "Very cute little coffee shop with good coffee, sandwiches, pastries and a true neighborhood vibe. NOT a good place to take a laptop and expect to get work done, though. This place is better for meeting a friend and chatting. The seating is primarily couches and comfy chairs rather than tables. There's also a kids' play area which means this place is always packed with little ones..."], ["Omar S.", "A children's area for play, imported coca cola, good iced coffee, surprisingly quiet and pleasant. Lots of sitting options. Brave cafe in a seedy yet changing neighborhood."], ["Michael Y.", "Awesome coffee and Nastia the barista is the coolest!!!"], ["Danielle T.", "The BF and I came down on a Saturday morning before the rush at 10AM and found a charming, chock full shop with very high quality pastries and iced drinks. The BF had a cream filled donut with visible vanilla bean inside, and my almond AND chocolate croissant was the best of both worlds, crunchy, sweet, and chewy!! The iced coffee had some real roasted flavor and the iced chai was nice and creamy. Unfortunately, the barista was a little inexperienced about how much ice to use to make a drink.... That's why there are lines on the cups, honey, I used to work at Starbucks they teach you the insider secrets. So there was a bit too much ice and a bit too little liquid. But it won't keep me away. To our delight there were babies and puppies coming and going pretty quickly so if you find those things entertaining instead of annoying, this place is for you!!"], ["Hannah A.", "I'm a pretty harsh critic when it comes to espresso, but then again, who isn't? I only ordered a cappuccino and I was not disappointed. It struck a perfect balance between foam-milk-espresso. And the espresso was not bitter. The barista knows what he's doing. I spent over an hour here writing and observed the different characters that wandered in & out.I will be back :)"], ["Sophie S.", "Living just around the corner makes me a frequent visitor of Georges-Andre, mainly because I do my laundry across the street and won't say no to a good coffee. Georges-Andre is indeed a child friendly cafe which is fine but, at times, can be annoying simply because it's such a small place to begin with. Maybe in a larger setting the children screaming & playing wouldn't be quite as distracting and overwhelming. That being said, when Georges-Andre is quiet, it's a lovely coffee shop. Frankly, I'm happy to blame any qualm I have with the cafe on the size of the space itself. On days when it's busy, I take my coffee to go.The coffee is good! My boyfriend swears that their cappuccino is the best. It's a little on the pricier end and is cash-only (ATM with fee inside though). However, I find myself wishing they had medium size for their coffees because the larger is enormous and the small is very small and comes in an awful tacky little stackable ikea mug (the small mugs are my only other issue with the cafe - which seems trivial but is really annoying when you are a frequent customer).Definitely worth stopping by if you are in the area. A nice alternative to sitting in a laundromat, too."], ["Arnaud W.", "Went there. My wife can't eat some kinds of pastries, then we assumed that we'd find what we needed for her in here, as we're used to eat french pastries (we're french, then we kinda know what diversity french pastry involves).We faced a window with 3 different kinds of pastries, all made with the same kind of ingredients, those exact same ingredients she can't eat. OK, bad luck, not their fault. But a so called \"french\" restaurant, providing only 3 pastries for breakfast, including $2.5 croissant? Joke.As we explained my wife can't eat those, they proposed quiches or soup.... For a french BF... Why not, but no thanks. No fresh pies, no elaborated pastries, biscuits or even cookies or brownies...On the bright side, nice atmosphere, nice decoration, really vintage, even if a bit too small. The people making service in here were confused for us (weren't owners), and were truly nice and tried to help. That's where the 2 stars come from."], ["Kawshie W.", "I walked to this cafe from Bushwick for about 25 miss upon stumbling some cute insta-pics and was craving fine caffeine! As soon as i entered, jazz music filled my ears and the tiny but extremely cozy atmosphere took my heart. I love the warm couches and atmosphere on a cold day, to get away from it, specially in the neighborhood where good coffee and pastries are a rare treat. Their coffee is extremely well made. Rosemary choc-chip cookies were just a delight. The owner is a super bad-ass french lady who is very friendly and warm but knows how to run the cafe to a fine french style. And her adorable BABY andre! such a warm and cozy feeling to have tiny babies running around. I like the cafe, and its warm ness to anyone who comes looking for a getaway or a nice cuppa ; despite the last persons' comments. Really she sounds like a un happy person. oh well. Great music and ambiance and they get 5 stars from me."], ["Eprom B.", "Love the place for the most part. Had one really good face melting coffee here. Must be some way to sort out the cue and pick-up area. No one seems to know what drink belongs to them; I'm accustomed to others picking up my drink here. You have to shimmy by customers on-line to get out or get your drink if it comes up first (could move that huge golden sofa).  Also everything is overpriced by at least 25¢. Sorting some things out could make this place better for sure."], ["Natalia B.", "This place is great! Love the decor, the food, the coffee, the people who work there and the customers. Wish I lived in Bed-Stuy to be able to make it my daily go-to place."], ["Nicholas C.", "On-point neighborhood staple. Adorable children everywhere. Great espresso, local pastries and quiche are excellent, and the DJs on Saturday consistently kill it. The best part of the cafe, however, is the owner, Superfrench, who can be seen running a yoga studio across the street or calmly reprimanding her toddler, Andrés, who likes to bus people's dishes and knock things over."], ["Ryan H.", "Question for the community -- since I am a parent with a toddler, does that automatically disqualify me from getting to go to cool little cafés?  Because that seems to be the message I'm getting from some of the other reviews here.  This is a comfortable little neighborhood nook, with friendly staff, good coffee and a nice selection of pastries and breakfast treats of different kinds.  Yes, it is toddler-friendly, with a little fenced-in play area and an assortment of toys to keep the little ones occupied while their exhausted parents take a much-needed (and much-appreciated) breather while enjoying a grown-up cup of coffee.  If you're a parent, this place is a godsend; if you don't like little kids, well... the toys and play area should be enough of a hint to let you know how things roll here, no? Please try and pay attention.  It will get you far in life."], ["Sophie F.", "I've been here twice already. I've only ever had the coffee and it's the best I've had in Brooklyn. And I'm a tough critic when it comes to coffee. My first visit here, I was struck by how homey the place felt. Comfortable couches, throw pillows, board games. Nothing matched but everything looked great the way the owners threw them together. I wish I had such skills. A lot of vintage knick-knacks placed throughout. Super cool. I had my coffee and got comfortable. I almost did not want to leave. Great coffee, free wi-fi, and a comfortable surrounding. This place is VERY kid friendly so on my second visit, I went with my toddler. I was able to relax and sip my coffee as I watched her play with the wide assortment of toys. There were other kids there that she was able to interact with. Both times I've been customer service has been wonderful. This place has not been around long but they already have regulars. The staff took a minute or so to talk with the regulars but made sure not to neglect the non-regulars waiting to order."], ["Danielle V.", "Warm, friendly and cozy little coffee shop in an area that benefits from such a place. Great find and delicious soups, too."], ["Jonathan L.", "Georges-Andre gets it right on every level.  The owner (Super French - she's French and pretty super) is really particular about her coffee, quality, preparation, etc...  You can tell she's sort of a stickler in general, and a good way.  The pastries, including a nice variety of Quiches, are made by Ceci Cela, which is amazing in its own right.  The decor is vintage, and takes you back to good times past, rather than feeling like old musty stuff plopped in the present.  Most importantly, they're doing a nice job at cultivating community, including a full-press baby gathering wednesday afternoons. Babies may or may not be your thing, but it's the intention that matters here.  They're also planning scrabble and movie nights, so there you go.Get-togethers, great execution, excellent coffee, and a mustard-colored-plastic-covered fur couch. What more?"], ["Michelle S.", "I came here after my failed attempt of eating lunch at bread love. It's definitely a place for coffee with a side snack and to relax. I was hoping they had light sandwiches or wraps along with pastries. The menu was a variety of quiches (13 min to heat up he said) and pastries. They have soups but not all the time. I ended up just getting a chocolate filled croissant like pastry topped with powdered sugar and almond slivers. It was very good. Light crisp but still moist and a semi sweet chocolate. They had some delicious looking brownies and Danishes as well. The vibe was a bit too hipster for me with the ultra vintage furniture and quirky music but I can see the appeal for new comers to the neighborhood. I don't drink coffee so cannot attest but if the vibe was a bit more laid back than forcing a relaxed feel it would be 4 stars."], ["Duana S.", "Ordered a white chocolate mocha which was really great.My daughter got a chai latte that she really enjoyed.We struck up a conversation with a few young moms hanging out with their adorable kids...Very much a hipsters vibe, but not so much that I felt out of place.Enjoyable!"], ["Taylor H.", "Okay so I am giving 2 stars because my latte was perfectly fine. However I just moved to the area and as a freelancer I love to hop around coffee shops to stay out of my house because I work from home.... I agree completely with a previous review that I read on here... The place is very very small, and has the vintage cozy feel. What I do not like is the screaming children in the corner of the room and the parents allowing their children to bump into me, knock my coffee over etc. If the place was larger we could dedicate a nice little corner for the screaming little rascals... I love the old movies but I also find it to be kind of strange that 90% of the patrons are wearing headphones l. Now I see there is a reason for that. The music could also be lower... Also rather weird that the bathroom door has a window... I gave 2 stars because this is not the establishments fault for the child's unruly behavior. It is however their fault for the playpen in the corner. And I get it because the owner has a kid it seems... The owner was also very curt with me for me not understanding that the place is cash only and had to remark that, \"even if it wasn't cash only I would never charge $4.25 there would have to be a minimum\" Well...  I have owned a business for 6 years and I completely understand that... But I feel that remark was unnecessary... Just get to the point about where the nearest ATM is."], ["Hae-jin M.", "Love this great neighborhood spot. Good vibe and awesome coffee. Definitely get a chocolate chip bread too, it is to die for."], ["Amber F.", "Adorable spot. Very welcoming. New extended hours. Cory is SO nice and makes a mean latte! He put a  in mine!! So awesome - made me feel loved on this my very 1st visit... Of many! Smooth jazz playing. Board games galore.  Wifi.  Yay!"], ["Miso H.", "Great coffee in a nice atmosphere. Great place to bring your toddler.  Sandwiches aren't great, but not really their specialty."], ["Nana M.", "Love this place! They make a mean cappuccino, have amazing pasties (I haven't tried the soups and quiches but I'm sure they're delicious), a very sweet staff, and a great, laid back vibe.  The owner has a toddler who is often there, so it's very kid friendly. They also have board games and great music for the big kids.  I usually come with my pooch, and sit in the front.  No complaints about this place... Great addition to the neighborhood"], ["Cindy C.", "Tasty coffee - from cappuccino to the dirty chai lattes. The croissant was good too. Friendly service."], ["Eva B.", "Cute little cafe. I like the interior style and the fact that they are kids friendly. Coffee is good but the nutella croissant was a bit disappointing."], ["Daniel N.", "Cute neighborhood coffee joint, good coffee, friendly service."], ["Concetta M.", "Coffee from La Colombe. Great pastries. Staff is friendly and takes the time to remember each customer.Wifi is actually fast. Major points for that.  Kid friendly, for better or for worse. I love me some kids, but it can get loud. Babies are always fun, but  when older kids from neighborhood run around and argue, it can suddenly feel like a playground. If you are going to get work done, it may be quiet, it may feel like chaos.That said, it's a welcoming spot for people of all ages and life styles."], ["Lucys P.", "This place is a treasure to the neighborhood. Great pastries, especially the pear and ricotta tart, and great coffee. I love that they have many options for those of us who are lactose intolerant or vegan. Great atmosphere as well, very welcoming and relaxing."], ["Amanda A.", "Came in two weeks ago for a bit to grab a pastry with a friend visiting from out of town. I liked the cute and cozy feel of the place. The waitress was friendly. My friend and I split an almond cream cheese croissant, it was tasty. I would have preferred a little more cream cheese filling. Cool place to go if you need a place to study or grab a coffee or tea. I'll come back to check them out again."], ["Chanel B.", "Very cute neighborhood spot that also has wifi and is nice for ppl watching AND the Cafe Au Lait was as lovely as Cafe Du Monde in New Orleans , I'll be a regular I for see !"], ["Jenna D.", "Firstly, I'd like to start off by saying I love what SuperFrench is doing for this little corner of Stuyvesant Heights. Georges-Andre Cafe is such a unique cafe experience. The decor being all vintage kitsch, furniture, lighting and draping. Every time I visit, something is slightly different. The food itself is delicious and definitely high quality. The pastries are fresh everyday and the espresso and coffee is strong and flavorful. If I had one complaint, it would be the barista's not mixing the iced-coffee beverages. It just feels weird standing at the counter, sloshing ice around in your cup, trying to mix the vanilla syrup on the bottom with the milk at the top. Otherwise, Georges-Andre is a great addition to the neighborhood."], ["Sarah D.", "The best Almond milk latte in the city!!!!!!! Not to mention the mini croissant for kids :-)"], ["Matthew N.", "I absolutely love this funky French vintage cafe in my neighborhood, BedStuy. I am so grateful to Super French, the owner, for bringing her magic to us./Users/matthewnamie/Downloads/ga/IMG_20130901_1235­13.jpg/Users/matthewnamie/Downloads/ga/IMG_20130901_1233­34.jpg"], ["Olgita R.", "You better don't waste your time and get here early, since those amazing freshly baked French pastries go fast on a weekend morning. Very cute vintage cafe, good for a chat over coffee with a friend or to get fresh croissants for breakfast. It has wifi and you might bring your laptop, but its often full with moms and small kids and might get a bit noisy to work. It's too cute and relaxed to work anyways, so just get your coffee and enjoy the scene! Great addition to the 'hood!"], ["Chika H.", "I am so glad I found a spot like this in this neighborhood! I needed a place to get out of the home to study and actually be able to tick things off my to do list instead of getting distracted every few minutes at home. This definitely has the homey, cozy feel I was looking for! I am partial to good coffee and can live on pastries alone so that was definitely a delicious plus! The workers are definitely *not* jaded but very nice, friendly enough and helpful but then again I did not come looking for a new BFF. I read reviews before going so I knew to expect the kids. As a mom of a toddler I love that this place has a play area for kids and is so kid-friendly! There are few places I feel comfortable and not judged for bringing my \"friendly\" and very verbal toddler. I'll definitely bring my daughter here sometime! I don't mind seeing cute kids and if they get too loud I just pop in my headphones, no biggie. There are silent french films projected on the wall which provide a nice diversion and I could have personally  made all the  music playlists. Love the music selection and was so hard for me not to jam and sing along! All in all I was pleased and will definitely become a regular here and will bring friends and family here for sure!"], ["J S.", "Used to have great pastries. Now they're merely mediocre. Coffee was always bad, but could be stomached with sweets. The high prices/cash only problem remains. The presence of the childcare corner has now added a sticky layer to all interior surfaces. Too bad, I thought they'd pick it up, but I guess they won't."], ["Greg C.", "I don't mind coming here for an occasional cup of coffee because it's close to home, but most of my experiences I have encountered very rude service. You're just getting me a coffee... Cheer up!"], ["Zoe T.", "Wonderful coffee, average pastries, but so wonderful to have a place I'm comfortable taking an avtive toddler. He gets an apple juice or organic milk box or mini water (great to have the option) and plays happily, and I get to take a deep breath. Not for people who resent kids being in cafes."], ["Cletus F.", "I give it 4 stars but it's not a place I think I'd ever go back to personally. Coffee was good and the girl running it was very nice a fast. The place is very much like a family room in a small house thats owners have small children. If you have a kid but like to get out of the house and hang at a coffee shop... then this place is gold.  But if that's not you then grab your coffee and go. I kinda felt like I was in a daycare, or maybe a home practice pediatrician's waiting area."], ["Slater B.", "I love Georges-Andre. Best coffee in the neighborhood by far, the quiches and pastries are incredibly good. My favorite combination is a quiche (lorraine, mushroom and broccoli are all excellent choices) and an ice coffee (with espresso shot gratis to make up for the ice dilution). The owner, SuperFrench is as much a part of the atmosphere as the quirky but tasteful decor. She is warm, outgoing and very funny. Her son (Andre, named after her father Georges Andre) is another frequent staple and he is adorable. Ask about her birthdays book. They also do occasional movie nights where classic films are projected on the wall. All in all, this place has exploded into a local hub of culture in a very short period of time. The acclaim is very well deserved."], ["Bartlomiej P.", "A welcome addition to the neighborhood. The coffee is by far the best around Bed-Stuy. The pastries are nearly perfect. The vibe is sweet. The owner, Superfrench (an apt description), is friendly. George Andre is easily the most comfortable cafe I've ever spent time in.Little kids abound here, which is nice if you're not a grumpy old man. On the off chance that you are, you have the option of picking up awesome cafe fare and going home. For that reason, the little kid isn't a reason to discount the rating. It's a neutral factor at worst."], ["Chadwick S.", "A reliable coffee shop in Bed-Stuy that is open during expected cafe hours, weekdays and weekends. Great coffee and pastries. Friendly owner, staff, and crowd. Child friendly vibe.  Also, unlike most places in this neighborhood, they are relatively quick getting their customers through the line. Yeh, you know what place I'm talking about."], ["Cara A.", "I like the coffee, and the vibe.  If you're not a fan of shabby-chic decor or babies, you might want to stay away, but I love them, so I'm a fan."], ["Lilly A.", "Had a really watery cup of coffee. This spot is a La Colombe account. Seems like a great place if you have a baby and need to get out of the house and the shabby chic is cool but it wasn't my vibe."], ["Jacqueline L.", "Good, strong, hot coffee - fast and friendly service - vintage decor and outside seating. What else could you ask for in a neighborhood coffee shop! I stop in pretty much every morning to grab a coffee before I walk my dog. There is also an extensive pastry selection and many non-dairly milk options. And i have made new friends in the other regulars. It is a sweet little place and if you live in Bed-Stuy you should check it out."], ["Yelena K.", "Great coffee, super nice owner, good place to do a bit of work (reliable wifi!) or meet up with a friend, and the almond croissants are RIDICULOUS!"], ["C. G.", "It's high time I wrote a review of our favorite cafe in Bed-Stuy. We've been frequenting Georges-Andre (Georges being the owner's father's name, Andre is the little wobbly guy you'll meet if you go to the cafe) ever since it opened. I sometimes go there to do work during the day with my computer. Wireless is good and fast. Depending on the time of day, and your luck, it may be quiet, it may be packed with babies and neighbors. It is a baby-friendly place, so parent central. The pastries are from very good French bakeries, so always top notch. I like savory stuff, so the spicy chive scone and ham and cheese croissant are usually my faves. And of course delicious quiches. There is no blah tasting coffee here. They use Le Colombe beans, and do not shy away from strong espresso shots in the coffee. Iced coffee is made with two shots of espresso regularly, for example. Compared to the coffee served in all the other places in Bed-Stuy, Georges-Andre has the best coffee, in flavor and in strength. They have a great selection of teas and organic teas, as well.The owner is always very friendly. The baristas are also very friendly and efficient. The best thing about George-Andre is that the owner has a mission to contribute to the community. She will talk to people, introduce people to each other, and remember you. Once, I saw her return someone's wallet, which they had lost, and another store owner had returned to GA, because they knew the guy would come for his coffee. There it is, you're among family. Another time, someone who knew me from a previous job recognized me at the cafe, and the owner introduced us, because she knew we had worked in the same field. Other times, people just talk to each other, and start conversations, just like that. There is always some conversation going on about art, real estate, block association, parenting, schools, whatever... Of course, you can also put on your headphones and do your work, if you want to be left alone.There is a parent/baby meeting in the middle of the day one of the week days (I think now on Wednesdays, but check with the owner), and several block associations meet at GA, too. A great place to eat well, drink good coffee, and meet neighbors.ps. there is no TV, but they project films on one of the walls every week."]], "Le Gamin": [], "Cafe Luluc": [], "Olivier Bistro": [["Aaron P.", "Typical French Bistro brunch menu. Eggs Benedict was very well executed - perfectly poached eggs, well seasoned, great Hollandaise. Delicious coffee, cozy atmosphere."], ["Faye B.", "I live right by here so it was nice to finally give it a try.  The service was great, they were very friendly and the food was good too!  I got a lamb sandwich, some of the pieces were all fat, but I rarely eat meat so I am very picky.  Overall, the flavors were savory and delicious.  :)"], ["Annei L.", "Came here for brunch on a hot Sunday.  The food was just ok, but the staff were very friendly. I had the French toast (good). I tried a piece of the brisket, but it was very salty. My husband ordered his steak with sunny side up eggs, but they gave him over easy instead. Overall, the atmosphere was nice, but the food could be better."], ["Bjorn P.", "Came for brunch and really enjoyed it. Had a great Croque Monsier with an egg and the Eggs Benedict. Both were awesome. One complaint was the coffee we were served was cold...but the kid was apologetic and replaced it when asked."], ["Rick N.", "Found this little bistro when planning a day trip to IKEA and knew I'd need a nice place to eat with a couple friends beforehand. The Yelp reservation process made making a reservation incredibly easy and got my group of three a nice little table for four! The service was a little slow, but the food was great! I got the La Tartine D'Olivier (tender brisket and eggs over crusty bread in a shallow plate of beurre blanc) and it was quite delicious. It was like a deconstructed French onion soup with a meat and eggs brunch twist. The steak and with frites is a definite winner too."], ["Felicia V.", "What a fantastic Easter brunch!  I had the steak and eggs, which were just perfect. My sister had the French toast and even though I was very happy with my meal, I kinda wished I had ordered it for myself. But I will admit that it's very sweet. Same for the desserts, the creme brûlée being my favorite by far! The service was great and the atmosphere was perfect for a family outing but I could also see it being a cute date restaurant too. I'll definitely be back!"], ["Ina L.", "This is a very cute restaurant on 4th Avenue in Gowanus, right next to the F train (4th Avenue, 9th street). I'd recommend this restaurant to anyone in the Park Slope, Gowanus, 9th street area but I didn't find it special enough to recommend a Manhattan-dweller. Also, it's a teeny bit farther off from the 9th street buzz, so the view out of the restaurant windows are of run-down bodegas and auto shops. And for all of those who are not aware, there is a huge gentrificiation, remodeling, rezoning process going on 4th Avenue, so in no time, Olivier Bistro will be part of a great mecca of food and night life, but it's just not quite there yet. I've only been to Olivier Bistro once for their $1 Oyster Happy Hour deals and it was great. I'd highly recommend it for anyone who is available 5-7PM! It also helped that the owner was a perfectly chivalrous gentleman with a tantalizing European accent! And I wish I can make it back to the area to try their weekend brunch or dinner because the restaurant itself is such a cute space with a little bit of European flair. It's cozy wooden decor adds a nostalgic homeyness. They have such a great selection of salads, steak, fish, and my favorite cheese and charcuterie plates! During the summer months, the windows open like big glass doors... so I forecast that Olivier  Bistro will be a great experience, for when the 4th Avenue Brooklyn project is done!"], ["Teresa M.", "Here is where I want to spend my calories with reckless abandon.  I'm happy to give 5 stars but I want to point out a couple of things , well because I'm selfish and hope they add it to their menu #1 quiche - pleaseeeeee add this permanently to your menu?  I drove my friend there last time raving about it and was given a wishy washy answer on when and if I could ever expect to see it again.  This was the best quiche I've ever had in my life.. Sorry Mom!   It takes a hell of a quiche for me to pass up my normal croque Madame ..  The coffee+ food already has me wanting to never ever leave but they also make an excellent Bloody Mary. And lastly the owners are handsome and cool and watching them effortlessly serve the brunch crowd is like watching a ballet - with grace and style ..."], ["Andrew J.", "I had a fantastic dinner here with my dad recently. He had the pork chop special and I had the fish of the day, striped bass. The pork chop was gigantic and everything was delicious. We finished off the meal with creme brûlée and a chocolate torte. I would highly recommend checking this place out. One note - they only take cash or Amex."], ["Tim C.", "I want to rate this place better.  The staff is great, the place is nicely decorated and setup.  The food quality seemed to be good.  The bad is the octopus.  It was burnt and the salad wasn't tasty, just needs to be removed from the menu.  The hanger steak was good but your side is fries.  The fries were ok but I'd prefer something better or have more options.  I'll try the brunch as the pictures on Yelp look great."], ["Kari L.", "Great neighborhood French spot. I recommend doing the specials, as they always make it something delicious and interesting!"], ["Oz P.", "My husband & I came to eat here, and let me tell you how amazing the experience was. We came to have dinner and our waitress Anette was superb! For appetizers we had the salmon tar tar with chips & the Ham Croquettes, when I tell you this was DELICIOUS, it really awakens your taste buds! For the entree the fish of the day is the way to go, so good it makes you wanna smack your momma (no im serious its unbelievably GREAT!) My husband had the rib eye, he described it to me as being juicy tender off the bone tasty! We're definitely coming back!!! Last but not least the dessert a warm chocolate melted cake with coconut ice-cream, like seriously whos gonna go wrong with this place! NOONE. It's absolutely amazing and delicious, even the ambiance chilled great music great people! My note to all, EAT HERE ASAP! Xoxoxo"], ["A R.", "Food was just ok. The poached eggs were slightly undercooked, with the whites still runny. For the Eggs Florentine you get 2 poached eggs on spinach & English muffin and 1/3 of a potato cut into 3 wedges...for $12. One surprise to us was that a mimosa was not included in this price, despite them being on the menu with no price. Mimosas alone are $9, which is just a ridiculous price for a restaurant along traffic-heavy 4th Ave in Park Slope. Our bill was about $50 for two. Not worth it, there are plenty of better restaurants nearby for that price or cheaper."], ["Tori R.", "really great french toast and cappuccinos for breakfast. adorable little spot!however its AMEX or CASH only. luckily theres a corner store with an ATM."], ["Elena B.", "Went for brunch on the 4th of July with my fiancee. Slow service and bad food: not coming back ever again.We ordered:- The escargots to start: which were OK. Did not love them.- Steak frites MR: It wasn't good at all. We barely had two pieces because it had a meat taste of a sweaty cow and it was just tasteless. We even got up to ask for steak sauce and they did not have it. How am I supposed to eat a piece of dry and smelly meat? (They should really make sure that they are getting a good cut from their vendors or get a chef that knows how to prepare the meat)- Burger R: it came out more like M and It was terrible. The burger was all soft and smoochy. Definitely not something you would like in your mouth.At the time, there was a sweet girl working that was making the coffee, and serving the food. She approached a table because they needed something. Instantly the french guy (what appears to be the owner and our waiter) yells \"Don't take any orders!\"... And then they argue about how they did not had steak sauce for us.The way you communicate with the staff affects the experience of your customers. You don't want to run an establishment where you show customers how bad you treat your staff. (We saw the girl leaving the place at 11am right when it started getting busy and before world cup: maybe she went shopping or maybe...)We did not complain at the time because the guy (what appears to be the owner) was running the place by himself, and by the time we needed his attention, he wasn't around. We had to flagged down the busboy to get our check.We left hungry because we barely ate our food."], ["Adam K.", "Great spot for brunch or to grab morning Americano on the way to work. After hurriedly walking past Oliver Bistro many times on my way to the F train, I finally made it here in for Sunday Brunch. The food was good - the French-American menu is perfect for bunch - and the staff was very courteous. It's a fresh cozy space with outdoor seating for the summer. Oliver Bistro defies 4th Ave's reputation as a culinary dead zone, and made it on to my personal \"brunch spots\" list"], ["pslice p.", "How this has 4 stars is beyond me. Maybe the brunch is better, but dinner here recently was not good.- Bread was stale, tiny portion. - Service was quite slow and there were only a few other patrons. - Gnocchi was far too dry. Had to add some butter!- Veal dish was overcooked and the spinach was lumped into a pile underneath the veal. - Pork Belly was fine, but rather small portion of vegetables accompanied it."], ["Mary M.", "Started visiting Olivier's when they first opened last summer to grab iced coffee and fresh croissants. Since then we have moved onto dining for brunch. The food is amazing and authentic. And during the warmer months there's some options for outdoor seating and then open the windows in the front for an open air experience. I'm excited to hit up their oyster happy hour soon! Heads up to bring cash (or Amex only)."], ["Lila Z.", "Olivier's is a cozy neighborhood bistro with great food and a friendly atmosphere. The owner, Olivier, has a constant presence in his restaurant, ensuring that everything is running smoothly, and is the first to address any issue you may have. The rest of the staff is also warm and competent, and the young blonde woman makes a great cocktail. The menu changes from time to time but there are some solid choices that remain consistent. Although not the most French item on the menu, the hamburger is always good and cooked to perfection, and the soups are well rounded in flavor and variety. If their fish soup is being offered it is a definite go- to. In addition, their French fries are crisp and delicious, and the fois gras is smooth and rich. I have been here many times with family and  friends, usually for dinner, and always have an enjoyable and relaxing evening- just what you would want from a charming neighborhood place! I would recommend more for dinner than for brunch, just in terms of the menu offerings but great options all around. Will definitely continue going to Olivier's for as long as they are willing to host me."], ["Sam G.", "Lamb merguez with scrambled eggs for brunch. Have it. So good."]], "ICI - French Country Kitchen": [["nina s.", "Superb! I come to ICI regularly for brunch and the food, service, and ambiance are consistently wonderful! The French Toast is to die for! The shirred eggs are delightful! I love the low key atmosphere and the friendly yet not overbearing staff! A highly recommended brunch spot!"], ["Jimmy I.", "Underwhelming unfortunately."], ["Jessie A.", "Not bad...  Bloody Mary was night at the Apollo and could actually use a hook.  Not good.  Hanger Steak and eggs pretty good.  I expect my eggs to be traditional French and a bit soft scrambled.  They seemed to have trouble really getting it right on some things.  The fruit was apples cover in a berry sauce.  Unless the dish is traditional French it seemed a poor alternative to just a bowl of great fruit in the spring."], ["Allison D.", "Adorable and delicious for brunch."], ["Ben C.", "We came here on Valentine's Day... The food was great and the staff was very friendly. Everything came when we were ready for it. Had some drinks in the upstairs bar before hand and that was great also.  So glad we chose ICI !"], ["Maeve M.", "It was beautiful today and I was insistent on finding a backyard to brunch in.  Ici fit the bill; the back yard is utterly charming with leafy shade and twinkly lights.  The menu is a little small but definitely had some tempting options.  I ordered the brioche french toast and side of their thick cut bacon.  The bacon blew my mind: it was so savory (and fatty) and delicious.  You need to appreciate the thick gluttonous quality to this type of bacon, but I do, and really liked it.  The french toast was also quite tasty and I liked the whipped cream.  I could have done without the fruit compote but whatever, it was easy enough to displace.  My boyfriend ordered the pork confit which looked tasty, although it was a small bowl and he finished it before I even though of asking for a bite.  Ici is tres mignone and though there are a lot of cute places like it on Dekalb, it's not a bad option."], ["Nikki S.", "This review is mostly for service but also food. We went to ICI for brunch on a relatively busy Saturday morning. I had made a reservation for 10-15 but our group ended up being much bigger than that. Staff at ICI were so nice and accommodating that I couldn't believe it. They immediately added additional tables and managed to sit everyone pretty quickly - and they made no fuss about it! I'm sure any other NYC restaurant would have given us a ton of attitude - speaking as a truly jaded NYC restaurant-goer! Oh and yes the food was delicious too! Thank you so much ICI and sorry again for all the trouble I caused you that day!"], ["Tom M.", "Fantastic Sunday Brunch experience today! It was a beautiful Memorial Weekend experience. We chose to sit in the backyard which is pleasantly not cramped but unfortunately small enough that you will hear other peoples conversations. The Pork Confit Hash was stupendous and the Brooklyn 75 cocktail are both MUST HAVES when you're there! The staff was more than pleasant and friendly the entire time! What a great experience! Traveled here all the way from The Bronx!"], ["Kelly F.", "Delightful Brunch.Pork Confit Hash. Steak and Eggs. Shirred Eggs. Farm Vegetable Omelet.Everyone was happy."], ["Annie T.", "Walking in,  I could see how people choose this place for weddings. The  decor is serene and romantic . Very warm and cozy ambiance. Felt like we were dining in someone fancy living room.Out of the 3 appetizers we picked, I really liked the kunick cheese and shishito peppers. Very slim selection of wine but I was satisfied with the Red I chose.  As entrees I had the swordfish while my husband had the hanger steak. The food overall tested very fresh and organic but overall was not majorly impressed.The hubs and I were dining on a gift certificate he won. They acknowledged it but I also felt it might have impacted our poor service.  We were given one piece of bread with our Kunick cheese while we witnessed more was given at other tables. There was lots of lag time where no one peaked on us to check on our order or whether we were enjoying our meal. Lastly, I was given a cardboard box for my swordfish leftover without a bag. The sauce from the dish leaked inside my bag on my way home.Little incidents but they all add up. And for a place like this that seems to value gastronomy I feel service should be held in the same standard. I was glad that night we were dining on a certificate because the high price was not worth the food."], ["Sara K.", "Heard good things from a few friends and knew it was only a matter of time before I came here myself. We ventured out on a freezing cold night, but were ushered inside by the warm hostess. ICI is a wonderful farm to table seasonal type restaurant. We ordered a bottle of wine and to start we had the shrimp appetizer. It was baby shrimp which are very cute to look at but not quite as tasty as full grown shrimp. But the mains were where we really hit the jackpot. I had the smoked duck breast and my husband had the braised short ribs. Both dishes were perfection. We kept switching back and forth and couldn't decide which one we liked better. The atmosphere is simple but they take their food seriously!"], ["Do V.", "The food was ok, but the menu gave us very limited choice. Looking at previous reviews and the photo gallery we thought there was a diversity of dishes but it turned out to be very few, maybe because they'd have different menus for each month or week. Anyway, would have liked some more options. Also it should be more than $$, probably closer to $$$"], ["Raven D.", "I found ICI when looking for a nice, reasonably priced venue for our small, intimate wedding. Lauren, the event coordinator, was helpful, responsive, and organized. The staff was always knowledgeable, accommodating, and on point. The food was delicious every time we visited and the restaurant is gorgeous and rustic chic. I highly recommend this place to eat or even for an amazing wedding that exceeds your expectations!"], ["renje g.", "I really wanted to give this place 4 stars, considering they were nice enough to donate $100 gift certificate to a local organization, for which I wonDon't get me wrong, the food was stellar all around and we had the restaurant to ourselves until around 8:30 on a Saturday night (it filled pretty quickly after that) Without gift certificate, we splurged on wine, apps, dinner, and dessert The Kunick cheese and the homemade ricotta were grand. Our dinner (Hanger Steak and Swordfish), although I felt less than ideal temperature, were unlike any other. The goat cheese cheesecake was the perfect top off and the wines matched perfectly.My biggest gripe was the service.  I was highly dissatisfied with the fact we got one measly piece of bread to go with out Kunick (cheese). The table next to us actually dropped her bread all over the floor, and the wait staff rushed out to bring her another bowl. On top of that, our waitress forgot to serve us our duck fat fries. I do not believe they were attentive us very much in pouring water and asking how our meal was. And lastly, we had food to go, they gave us the folded up cardboard box (which is not leakproof BTW) with out a bag (we figured since they don't offer the bag, the container must be leakproof...I would fund out later that, that assumption was dead wrong). And of course, when the mrs stored the box in her bag, the juices leaked all over the place, leaving her belongings reeking of sword fish parts.In the end our bill came to 127, 150 with tax. Thankfully we had our gift certificate (perhaps the reason why our experience was unpleasant) to cover most of the charge, but, had I spent that kind of money in reality, I would like to think the experience was well worth it. I do not believe this experience was worth $150."], ["Gabriel M.", "Brunch was amazing and a great value. Those shirred eggs and bacon are incredible. Definitely going back"], ["Agnes C.", "I came here once a couple years ago and didn't even realize it until I walked in again a few days ago.  I'm glad I didn't review it then because I remember not enjoying it all that much.  This time around, I thought the food was super fresh and well cooked.  Olives on the table to munch on as you peruse the menu is nice.  The farm to table concept is always nice since they change up the menu often.  A girlfriend and I shared the citrus salad and the spring greens.  Both were really delicious!  The citrus had a light dressing and the grapefruit was sooo fresh and juicy.  The spring greens had an anchovy vinaigrette which I loved because it had a hint of caesar but so much better since it wasn't creamy.  Crunch crouton crumbs sprinkled on top was nice for texture.  We shared the scallops and the duck cassoulet.  Scallops well seared, delicious kale, beet sauce a little too sweet.  If you don't like beets, don't order the scallop dish because it's on top everywhere.  Duck cassoulet was very hearty.  Great on a cold night.  Duck meat fell right off the bone.  Tad too salty for me though.  Mushrooms in there were the best part. All in all, much better food than the first time I came.  Will return again."], ["Genevieve T.", "Dunno.  If I had another $160 and an evening with friends, it wouldn't be spent here again.A very pretty place with what seems like career waiters (i.e. practical, fast, knowledgeable or can fake it) and ambiance.  Though it was one missed opportunity after another.  We went on Wednesdays for their $25 set menus, some sides, a bottle of wine, a perch entree.  All for about $160 for 3 people.There was something almost great about everything, but it always fell short.  The cod was seared, a favourite from other restos, but this was pink and gelatinous--had to send it back for an edible texture.The perch entree cost as much as the $25 cod set, but without the app and dessert--and had no special redeeming qualities, which made it pointless.  Also, there was something frozen fillet about it--tasteless, cooked in a way that didn't differentiate it from the white fish of everyweek.We had like, deep fried zucchini blossoms, which were a neat concept, but then just tasted like regular tempura, only pricey.  The wine menu is extensive, until they \"sorry, out of that\" you into 2 choices.  Organic wines are cool, but without the full body, watery purple for $48 a bottle is just an added bummer.Everything is priced just so that you can't really afford seconds, so we just went across the street and loaded up on beers.There is only one toilet on the ground floor, and it did not flush.  But, this anxiety at the end of this restaurant experience was fitting."], ["TIFFANY C.", "I was really excited to try this place since it seemed so charming and reviews were solid. We came here on a Friday evening without a reservation. First of all they don't have high chairs and only offered a booster seat without seat straps to keep the child in place. This was surprisingly to me since brooklyn has become a stroller destination. The restaurant was about half empty but the food took extremely long to serve. At least 30 minutes for the appetizers. During our hungry long wait they didn't even bring us bread or something to nibble on given that they were probably swamped in the kitchen. Being that we were starving by the time appetizers arrived , any type of decent food would have tasted delicious. This was not the case! We ordered a chickpea & chorizo casserole. It just tasted like bowl of boiled chorizo with beans served inside a small stone pot. Tasted nothing like a casserole and very bland , no depth to the dish whatsoever. As a second app we also ordered a mushroom puff pastry.  The bread was extremely dry and the dish was so bad that I don't even have a recollection of it. Now for the main courses, we orders a pork chop - overcooked and tough on the outside, portion was small considering the price and in comparison to other neighboring American restaurants, no real side dish either to compliment.  Just a tiny salad drenched in vinegar on the side. The other dish we orders was the mushroom cavatelli - lacked salt and extremely oily. So oily that I felt like I ate just fried chicken. Desserts - pear upside down cake , not special, tasted similar to something of a carrot cake with less spice. Just okay - something you would find in a coffee shop, not a dish you would order at a restaurant, definitely for $10 dollars!Black out cake- again this is similar to a Devils food cake but with less pudding and sugar. Best dish out of the entire meal but again , not something I would think is outstanding esp for 10 dollars ! Portion size - everything was very small given the price. Even for some restaurants in Manhattan it would be a bit of a rip off. An unassuming small slice a cake was $10, charging above average price for below average food. I would justify paying these prices for small portions if the food was good, however this experience was certainly not the exception to do so.Steer clear of this restaurant , so many better options out there!!"], ["Lans S.", "The signage out front might be deceiving. At least it was for me. I had no idea how lovely the interior or how pleasant the back garden area would be. For the past 3 years, I assumed this place would be 'eh', just based on the sign alone. It's actually very romantic inside.Shows me not to judge a book by its cover!So a friend suggests we meet at Ici. We pull up to a table in the garden and stick w/the Wednesday prix fixe selection, after placing an order for cocktails - which were delicious!My chilled beet soup was refreshing, but slightly under seasoned for my taste. The housemade pasta dish was also fresh, cooked al dente with beautiful fresh squash and zucchini. Flour-free chocolate cake - also yum.The gentlemen chose the hanger steak option. The meat was cooked perfectly medium rare and deliciously seasoned, though a bit chewy. It was served atop a fabulous heap of sautéed veggies. There was also a kale salad which was a generous plate of crisp chopped kale tossed w/ parm and anchovy dressing. Refreshing, though my companion found the fish overpowering after several bites. While the service was great and the meal was good, I think I prefer Roman's for flavor, although the dining room ambiance at Ici can't be beat!"], ["Maureen D.", "Lovely brunch place.  Despite a friend's strong suggestion to get the gravlax, I got a special omelet (chard, carmelized onion and cheese), which was delicious and decadent, appropriately paired with a sparse salad of some hearty greens.  My dining companion, did get the gravlax, and it was not disappointing.  It is served with an amazing soft chewy warm New York bagel with dill cream cheese- so tasty. Nice staff, nice location and ambiance."]], "Le Barricou": [["Heather F.", "This place got ranked recently as \"Best brunch\" in Brooklyn and now it's hard to get a table.  Having said that our wait was only around 20 minutes on a Saturday brunch hour so you never know.The theme is French but they make a mean Bloody Mary that includes chunks of veggies, green olives and fresh shrimp in a Mason jar.  It was sooooo good.I had their duck confit (duck confit is slow cooked using the leg of a duck) and it was excellent.  I heard the lamb sausage is also great.The inside really does feel like an old French cafe that you would see in Paris.  It is a very old Brooklyn building."], ["Sonia T.", "Super crowded on a Sunday morning for brunch but the Bloody Mary's were spicy, the mimosas were bubbly and the food was awesome. I had the vegetarian egg white omelette and I would definitely go back for more. The atmosphere was very warm/ friendly and the bartenders were more than capable. Hands down, a great spot."], ["Joanna C.", "What a lovely find! Was in Brooklyn on Sunday morning and decided to meet some friends for brunch. After perusing the Yelp app, we decided to check out Le Barricou. It was a bit out of the way from where we were in Williamsburg, but the trip was definitely worth it.We arrived around 1 PM and had a 40 minute wait. Luckily for us, we snagged some seats at the bar and ordered drinks to pass the time (the Bloody Marys are really popular here and were quite delicious). We also spent an embarrassingly long amount of time trying to figure out what to order. Everything was crazy affordable and sounded delicious! I had the Eggs Norwegian, which were delicious. The eggs were cooked well, the salmon delicious (I could've had more salmon. Then again, I always want more salmon), the side salad refreshing, ahd the potatoes, seasoned with rosemary or thyme or something, which added an interesting flavor. I started getting full halfway through the dish, but of course, powered through. We all left feeling full and content. The service was admittedly a bit slow, but I loved the ambience and was content waiting. Would definitely come back!"], ["Rhonda R.", "Awesome place !!  Worth the wait ! Food is fab and the wait staff is super nice !The French onion soup is one if the best soup I've had .My husband had the Auvergnate omelet which we both wanted the last bite!A gem and an excellent find on a snowy Sunday !"], ["Kary V.", "Great Brunch spot delicious food attentive service really the only complaint I had today I had lipstick on my glass but it was cool they got me another one and it was all good.     We order the Caramelize French Toast: wow how they make bread taste so good sweet crispy a little hard to cut but out of this world.    The Eggs Benedict were fantastic, spot on hollandaise perfect pouch eggs I had them with French Fries instead cause they look good on the next table.     The Pancakes were okay but that's because I already had the best french pancakes in the USA so in comparison this came out lacking but they were good but not the best I sample.      Overall I had an amazing meal @ Le Barricou is worth the trip to Brooklyn..."], ["Tom F.", "Yum!!! Great brunch (and I'm not even a huge brunch fan), friendly staff, cool interior, and very reasonable prices, especially for Williamsburg brunch."], ["Internal S.", "It was a 20 minutes wait at 1PM on a Saturday but it was worth it. Street parking was not a problem. The eggs and french pancakes were on point. The service and decor bring you matched the williamsburg feel. The pancake is especially different than other places. I would like to try their dinner menu next place."], ["Carrie M.", "Felt like I was in Paris. They even have an absinthe fountain. Mussels and coq au vin very good."], ["Danielle R.", "Went here for brunch today -- SO cute! Arrived around 1pm, expected a gnarly wait, but was told that we'd have a table available for 3 within 20 min. Not bad! Had a delicious bellini at the bar while we waited. Even before finishing our cocktails we were whisked away to the cute little \"outdoor/patio\" area which was adorned with vintage knick knacks. Very homey. I had the duck confit hash. Fairly bomb. My friends had the lamb sausage and the special shrimp and grits. Also pretty good. I did love the menu though -- there were tons of great options. I'll be back mostly because I live in the area, it's walking distance, and it's cute -- but not because the food was life-alteringly good. Overall cute place to take friends from out of town."], ["Christina C.", "BRUNCH:1. Yaaas. I love this place! They have a great brunch menu and I've never waited for longer than approx 20 mins for a table. Full discretion: I've only come here with my boyfriend so we always only wait for a table for 2, which is infinitely easier to seat than a larger party. 2. If you like to have a ginormous brunch (no judgment here!) go for the Croque Madame. It's huge, has carbs, ham (a step away from bacon!) and you can even choose to get your starches in there if you opt for the fries on the side. The fries here, if you've never had, you MUST. They're airy, crispy, and not overwhelming. I usually can't eat a whole side serving of fries, but I finish everything on my plate whenever I'm in the mood to just dig into a huge whooping meal. If you're looking for something lighter, I'd recommend the benedict, which is your typical fare, nothing extremely great, but their salad is also fresh, crispy and delicious, highly recommend!! They also have really good coffee, I don't know why, it just always feel good to have a cup of cold brew or even hot, and the hot coffee is constantly being refilled, yay!DINNER:So, to be fair, the only time I've ever gone to dinner here is for Valentine's Day, which was pretty good, but...interesting. We had an amusee` that was oyster--I'm not a huge fan of it but it was pretty good, according to my boyfriend. I thought it was O-K. I had lamb for my entree, and it came with a side of creamy mashed potatoes. It was delicious and also tiny tiny tiny tiny tiny. Sorry, not enough 'tiny' in the world to describe how hungry I still was after the meal. There was definitely more bone than meat. I'm also completely aware that lamb is usually small, meat-to-bone ratio wise, but damn. The dessert, in my opinion was the most delicious part of that Valentine's Day meal. It was this wondrous maple-bourbon(? not completely 100% on the bourbon) cupcake with icing, and a cute bacon wheel as garnish. The salty bacon with the sweet icing + cake combo is something I still dream about."], ["Adela A.", "One of my favorite french places in the neighborhood! Very adorable atmosphere. Perfect for either a late night bite, a cute date spot, or a sunday girls brunch.The service is great and everyone is super nice. As for the food..omg what a treat. Their escargo is like butter, melts in your mouth. The bone marrow delicious, as well as the liver pate. Their steak tartare was decent but I'm not really a big fan of steak tartare anyway. As for main course, I have had the porterhouse, and it was cooked to perfection. Just the in past 2 months I've been to this place 3 times. That says a lot ! Definitely recommended!"], ["Priti R.", "I've come here for a few times for brunch. Just beware: if you come anytime after 11am there will DEFINITELY be a wait, as this place is incredibly popular. I'm a big fan of their French Toast, if you are skeptical on what to get, but really their entire brunch menu is fantastic. The decor is really homey, and it actually gets pretty big towards the back of the restaurant, with a faux fireplace and a small couch located in the back by the bathrooms. It gets a bit tight on space in the middle of the restaurant, but they do their best."], ["Lindsey G.", "Are here for the first time yesterday and was sooooo PLEASED!!! delicious food, great service, and DELICIOUS food!!!We ordered the pancakes which are the best pancakes I've ever had, the eggs Benedict which were PERFECT and one of their specials for the day. Each dish was mouth watering and I'm already dreaming of having their pancakes again."], ["Sean C.", "Le Barricou has two different types of bloody Mary's, one is a shrimp cocktail which had two deveined shrimp, green olive, sweet pickled style green bean and the other is a classic which has everything except the shrimp. They were delicious (not too spicy, which I would have preferred), would def recommend the shrimp one.I ordered a Duck Confit Hash w/ two sunny side eggs overtop and substituted the salad for crunchy potatoes. Was what you'd expect for this type of dish and of an average taste. They didn't do anything special with it but had good proportions.As a second dish, I was going to have the Pancakes, but it takes 45 mins to prep since they bake them in the oven. Instead I tasted the French Toast, and it was unlike any I've ever had before. Was very crunchy on the outside yet soft within. They supplied a minimal amount of strawberries and blueberries but was definitely a dish I would have again."], ["Garima V.", "Came here for dinner on a Sunday night with a few friends. We had two bottles of wine (I believe they were $26 each, which is a great deal, and were good). We shared appetizers which included: steak tartar, escargot, fried artichokes, and steamed muscles. Everything was delicious and flavorful. I would recommend all of it.I had the coq au vin for my entree. It was also very good. I love pearl onions and they added a nice bite to the dish. I dont generally order chicken when I go out to eat, but from everythign on the menu the coq au vin seemed like the one item less common to be found on another menu.We finished our meal off by sharing the creme brulee and it did not disappoint. It was the perfect sweet end. Creamy custard with the burnt sugar on the top. Great meal and definitely recommend this place!"], ["Jennifer W.", "amazing, amazing, amazing pancake!seriously, you won't regret it."], ["TJ K.", "Note: Given the otherwise overwhelmingly positive reviews of this establishment, please note this review concerns a dinner menu meal ordered through Seamless and does not necessarily reflect the quality of the in-house offering... I feel the truly deplorable nature of the produce requires a public evaluation, though:1) The $13 burger looked, felt, and tasted like it came from a prefab random meat shavings compressor, was burnt on one side (presumably that would be both sides, if I had ordered medium in stead of medium rare) and moreover, came on two soggy excuses of sliced tastelessness that likely had to function as a bun. The \"hand cut fries\" that came with it represented something of a grass-like mound of sloppy potato slivers that had possibly previously been served as garnish on a meal back in the eighties. A true disgrace and an insult to the Belgians, who would happily receive this ultimate proof of their dominance in the realm of pommes frites... If I'd had to speak on behalf of apologetic optimism, maybe the delivery person had come in through a monsoon, that would explain some 50% of this mishap?2) The \"sauteed greens\" are, well, a bunch of green leaves soaking in oil and too many flakes... I cannot even find the words to adequately describe this greasy garlic-overdose of a tangy mess. Charging $5 for 4 bites of a chard-like substitute in such form as a side dish is nothing short of a sin!3) By the time I came to consider the $9 flowerless chocolate cake, I had already chosen to write this review as a more soothing dessert option, and so it came that too was tossed in the garbage together with the majority of 1) and 2). It did come with a separately \"packed\" scoop of vanilla ice cream (I'm guessing, re: tossed, but it was a cold white substance) which seems a nice touch. Not enough for a half star or more to balance a less unfavorable review though.As a final thought; it took two telephone inquiries as to when the food would finally arrive, well over an hour into the order, so that may explain part of the negative review...Perhaps the regular crowd, the ambiance, and the option of sending the food back to the kitchen immediately are what make the attraction here, but otherwise there are far better take-out alternatives in the neighborhood!"], ["Daniel L.", "Came around 4:45 which was their late brunch.  So they serve smaller menu list.  I had the grilled burger in medium with fries.  They said they only have house fries which came out to be square potato fries. As far as the burger go, didn't have any complaints really.  It was a burger and it wasn't crazy good or bad. But fries was disgusting.  Idk if it is their thing to just soak it in whatever oil. But I bit into the fries and my mouth was full of whatever oil it was.  After eating few, I felt sick with oil.  The oil was so excessive, it soaked my burger bun and it wouldn't even dip in ketchup. Okay fries, I can frog vie but what have me give two stars is this girl waitress in her brown hair.  Came to the bar and took out plastic container with shrimp in them and just grabbed two with bare hand and ate them \"discretely\" when bartender was gone. I think he was the manager or something, but I also saw a guy who was dressed up a little and maybe he is the manager.  She wasn't mean or anything, but I just couldn't believe that she thinks it's okay to put her hand in the container where majority of the shrimp is going to be served to customers.  If that whole container full of shrimp was hers, then I apologize, but that was disgusting.  She touched bills, computer screen, and brought my food out, and now she's going to slip two shrimps into her mouth.... Gross... I hope she gets to have some conversation with her manager about her sanitation understanding.  I don't think I'll ever come here again and I felt horrible paying $16 something for the burger that is handled grossly by the worker here..Ew."], ["JoAnna D.", "My family and I visited Le Barricou last winter for a private event. It takes a lot for me to come to Brooklyn, so I was mentally prepared for the worst - despite the glowing Yelp reviews for the restaurant.First of all, it was shockingly easy to find parking on Grand Street ... though that may have had more to do with the blizzard outside than anything else. But we found a metered spot right in front of the restaurant, so I can't really complain.We were ushered into the back room, where our small ceremony space was all set up & ready to go. The room was ours for the evening, with one caveat: the only bathroom in the restaurant was in the back of the \"private\" room. So, for having a reserved room for a private event, it was very inconvenient to have guests walking through our group & opening the swinging door to get to the bathroom every few minutes.When my cousins were reserving the room, we were asked to give our menu choices a week or two in advance, so they would have enough time to prepare the meals and have them available after the short ceremony. Yet, strangely enough, they didn't begin to prepare the food until AFTER the ceremony was over. The waiters came in and asked, \"So we should start the food now?\" Umm, shouldn't you have started it an hour ago when we all arrived? So, we waited in our seats for an hour while the kitchen began to cook our meals.The food - when it did eventually come - was amazing. And I guess this would be where the glowing reviews are coming from. I ordered the Le Barricou Salad, the Skate Meuniere, and the Apple Tart for dessert. Someone at our table ordered the Brussels Sprouts as a side dish, so we all tried that as well. The salad was a very generous portion - probably enough for a meal in itself if I wasn't already so hungry! I loved the fresh green beans & the bacon. Even the croutons were exceptional. I ended up sharing my salad with my cousin, because I knew I had two more dishes coming.The Skate Meuniere was outstanding. It was light & buttery, with more fresh green beans & capers, and the white wine & lemon sauce was unbelievable. The fish filet itself was bigger than I thought it would be, but it was so delicious that it disappeared in an embarrassingly short amount of time. And the Brussels Sprouts were exactly how I like them - roasted & slightly crunchy. Really tasty.The Apple Tart was perfect. I think it was more ... constructed? ... than I thought it would be. It arrived as a little masterpiece: a flaky tart shell filled with tiny sweet cubes of apple, drizzled with a light caramel sauce. It was warm & sweet, and the ice cream was a perfect addition. Like an organized, yummy apple pie.All in all, I have mixed emotions about our experience. I really enjoyed the meal we had at Le Barricou, but I wasn't too pleased with the service or the organization/coordination of our \"private\" event. The food is fantastic, and I'd consider coming again for the meal alone, but I would probably look elsewhere if I was planning something bigger. À la prochaine, Le Barricou ..."], ["Vanessa C.", "Wanted to try this place out and I was glad I did. I enjoyed the food. It is a lil packed so make sure to make reservations, especially on Sundays. But I had a great time and was stuffed from the food."]], "Bistro Petit": [["Ben A.", "The best meal I've had in recent memory!  They seated my friends party of ten in their tiny restaurant, and although it was cramped, the food was so amazing it didn't matter.  The waitress was great as well, serving us in such a cramped place.  We shared several appetizers, and our entrees.  Absolutely very dish was a knockout (it's going to be hard for me to cook without feeling like an amateur).  Chef Park seamlessly blended French and Korean cuisine, to the point I liked it better than most of the finest dishes I've had in Paris and K-town.Standouts were the truffle mac and cheese, oyster pancake, and beef bourguignon.  But honestly everything was 5 stars.  Probably my current favorite in NYC! Hopefully they move to a slightly larger place, but other than that, perfection."], ["Jessica H.", "The Petit Bistro hosted a fantastic birthday dinner, I highly recommend this restaurant for your events! The food is delicious and the staff were great. Plus BYOB, can't beat that!"], ["Craig Z.", "This restaurant is 12 seats...barstools...around the perimeter of the restaurant. I think there are a couple places where they could do a party of three, more than that wouldn't be very comfortable--eating at the bar with more than two people isn't that great for talking to one another.Given the seating, it's an informal place.  Likewise, since it is BYOB ($10 corkage, per bottle I assume), that makes it informal as well. However the food is very much fine dining.  The chef's plating of dishes is not as precious as a fine dining restaurant, but the ingredients, the flavors, the preparations, are all fantastic.We had an outstanding english pea soup, which really delivered seasonal satisfaction.  It had a ton of pea flavor, rather than tasting like butter, cream, or chicken stock.  We also very much enjoyed the watermelon salad.  The only other dish I tried was the rock sole, which was also delicious...it is tough to describe, but it was well cooked and very flavorful.  This was the only dish that tasted like it had any Asian elements, but I am excited to return and try the kimchee boilabaise (sp?).Service was also very good."], ["Brad P.", "Remember: cash only.Korean chef in the kitchen who really cares about his food.Menu seems like it's seasonal. Probably changes a little everyday. Tiny place with minimal seats - awesome and intimate. Food - delicious. 5/5"], ["R R.", "***SMALL*** This place is petite so do NOT bring a large group here without discussions and planning with the restaurant. Our group of 6 had a fantastic meal here - mostly because we knew to bring cash, knew the place was small (and made reservations well ahead of time), brought our own wine and water, and were ready to make the trek across the street to use a deli's bathroom.The food was fantastic, and the layout of the restaurant makes it possible to watch the chef at work - but keep in mind that this place is idiosyncratic."], ["Tae K.", "Best restaurant I have been while living in nyc for 7 years, inspiring. All you need is love."], ["Clari B.", "Finally ate here it was an ok experience. For what it is and the taste it's far too pricey. Ordered the foie gras, what a joke. This portion was the smallest thing I've ever witnessed in my time of eating this. It was laughable but sad since the price suggested something I'm use to would come out. I was not expecting what I ate. The sole could be absolutely delicious however with mine whomever made it, their hand slipped, it was far to salty and acidic (lemon foam). My partner order dry meat, apparently. Good thing we paid for water to wash it all down....... Really you can't give tap or invest in a filter (if your reason is you'd prefer not to give tap).. There is nothing out of the ordinary here that's worth sitting in a small area and paying for who knows what because it isn't the food."], ["Carley F.", "Went here last Saturday night for a 10pm reservation for two. We heard it was a great date spot and were able to make a reservation same day. Upon arrival we were greeted cheerfully by the hostess, who gestured us to our cozy seats facing out the large windows towards the street. Such a cool intimate vibe in here - maybe 10-12 seats total and almost all of the restaurant has a view of the kitchen. We started with the truffle Mac and cheese and baby lettuce salad. For being such a trendy, ubiquitous dish, the truffle Mac and cheese was head and shoulder above others I've had recently. Smaller penne noodles - perfectly creamy cheese, plenty of truffle flavor without being overpowering and a light bread crumb dusting broiled perfectly. Definitely get this. The baby lettuce salad was a great way to get our greens and don't get me wrong it tasted fantastic, but I wouldn't go back solely for that. It's a good option to balance out some of the heavier flavors.This is an incredible French-Korean fusion restaurant where the best entree combines each nation's signature dish - Kimchi Bouillabaisse - amazing! This was served piping hot, full of fresh seafood (shrimp, scallops, mussels, fried tofu, pollack) and housemade kimchi. The beef bourguignon was also incredible - the braised grass fed short rib literally fell off the bone, and the crushed potato doused in the short rib jus was unreal. We also met the friendliest people next to us - they were regulars and enlightened us to the \"not-miss\" items on the menu. Definitely a cool, chill crowd here. Also - they're BYOB so bring your favorite bottle or two."], ["Nicole L.", "Bistro Petit has been on my radar for the last year, and my partner and I finally agreed to go there for my 30th (gasp!) birthday because I was looking for a very low-key, relaxed celebratory dinner. Thankfully, the restaurant was atypically empty and we were able to score seats right at the kitchen side.For appetizers, we settled on the heirloom beet salad and the grilled artichokes. The artichokes were lemony and wonderfully grilled, and the beet salad came with these delicious breaded goat cheese croutons which were a great compliment to the tangy beets.The Korean beef bourguignon was simply to die for. The short ribs were so tender that they were falling off the bone, and I loved the flavour of the beef. The potato mash was also smoky and garlicky, and the grated horseradish over everything was a splendid touch. I also tried my bf's kimchi bouillabaisse and it was plenty spicy with a nice kick at the end.While my boyfriend loved the dessert special, a molten chocolate pot, I opted for the Coffee and Doughnuts, which were freshly made cinnamon beignets served with espresso gelato. Who needs birthday cake when I had those steamy beignets? Wow.There was a brief period where we awkwardly overheard Chef Park berating one of his kitchen staff, but for the rest of the evening they were all in good humour and spirits. It's clear that Chef Park has high standards, and this definitely translates into his food. We will definitely be back to become regulars at Bistro Petit, and this time we won't forget the wine (or the cash!) for our next visits. Though the $10 corkage fee is a bit steep..."], ["Aurelie T.", "This place is charming and the chef's presence is a nice touch. Although, we did not enjoy everything we had. Either a bit too rich or too simple. We found it expensive and left this place not fulfilling our expectations. Not sure we'll go back."], ["Alissar T.", "So we decided to give Bistro Petit one more chance despite being aware the service is awful, but I gave them the benefit of the doubt and convinced (begged my boyfriend) that sometimes things change... (and I was craving their Kobe Beef burger).We walked by to see the restaurant empty, so walked over to the ATM to get cash (they are cash only) and a bottle of wine (since they are BYOB), and a bottle of water (because they don't serve you water because \"Chef Park doesn't like the way it tastes\". We get seated at the \"spacious\" high-top table, and everything seems to be going almost too-good-to-be-true... until we notice that they now have a $10 corkage fee, which they did not a few months ago, but fine, we deal with it.Our waitress comes by and takes our wine to be opened, to then come back and tell us that she was \"mistaken\" about the table, we actually have to get up and move.......She then offered us another high top table in the corner, but would only have 1 hour so they could accommodate another table. At this point everything was happening so fast and we were so confused.. we actually moved over to the other seat, which was so cramped we could barely fit in and sit comfortably. At that point we obviously got up and left. The waitress then goes \"Well wait, if we get a cancellation in 20 minutes.. want us to call you?\" .......No.I really tried to give this place another chance, but they disappointed yet again. We ended up at Roebling Tea Room which was amazing, so I guess everything happens for a reason.See ya never, Bistro Petit."], ["Frankie S.", "Bistro Petit is charming, welcoming, and an overall delight. The space is tiny but the chef cooks up a unique experience combining Korean, French, and American cuisines. This place is worth and second and third visit! They take cards nowBYOB"], ["Judy R.", "Interesting flavor combinations:  Korean Beef Bourguignon was delicious!Kimchi Bouillabaisse was interesting but thin on the seafood.  Not the most comfortable place  - only has 4-5 wooden stools against high countertops.  BYOB."], ["Jessica D.", "Updating!   I\"m still a big fan of this place but sorry to say that they are no longer making the donuts in mint flavor.  Bummer!   also they only give you TWO donuts now with one scoop of icecream.   Rather than the cluster of hot steamy darlings they gave before.  But i could not complain through my mouthful of delicious cinnamon donuts with mocha icecream.  It was divine.   My last time here I got pasta, salad mushrooms and the kobe burger.  both the salad and the pasta were meh. going forward Im just going to stick with the mushrooms, the burger and the donuts."], ["Tammy K.", "Sure, we had to sit at the end of a bench that required us to get up every time someone needed to get out. And sure, we were cold when folks opened the door to enter or leave the restaurant. And sure, we had to bring our own water (though they now sell it too) and booze (now a $10 corkage fee). And sure, it's cash only.However, all of these quirks can be overlooked, given that Bistro Petit is home to the best cassoulet I've ever had. Who knew that kimchi+cassoulet = food nirvana. The bouillabaisse was good too. But seriously, get the cassoulet."], ["Kal T.", "The food was great. Interesting fusion of ingredients and flavors. The joint was small and we were pretty much cramped. I have to say that the portion of food was rather small for the prices they charged. I guess they are trying to compensate quantity for quality? This might not be my daily go-to place but I wouldn't mind dropping by if I am in the neighborhood :)"], ["S Y.", "Bistro Petit may be my favorite restaurant in New York. I read some reviews from Koreans who say the food isn't really Korean, and I'd say that's the point.  They're really French dishes prepared with a bit of a Korean flavor profile, and the combination is spectacular.  I'm not sure what Chef Park does in that kitchen, but I suspect that there is hours and hours of cooking down beef to produce the insanely flavorful demi glace-like glaze on the Korean Beef Bourginon and perhaps the same methodology to produce the kimchi flavored broth in the bouillabaisse which carries a wallop of flavor.  Every bite tastes like the flavor of a thousand bites is compressed into a single one and elevated to a level of deliciousness that's mindblowing.  My friend still can't talking about the wild mushroom app we ordered.  It came out in a tiny cast iron pot and each bite concentrated so much mushroominess, well, we were rendered silent except to beg the chef for more bread so we could sop up the incredibly buttery juices at the bottom of the pot.Btw the service is informal, friendly and well, just awesome.  The chef always recognizes me on the phone even though now I live out of town and only can make it in a couple of times a year.  I asked the chef about opening a bigger restaurant and he said that he wants his restaurant to be small enough to really be able to produce the food perfectly himself.  I think that for the chef, this is a passion project, not just a business.Bistro Petit is truly phenomenal.  I feel like I give 5 stars circumstantially (really nice folks, good food, made me happy, good value), but I should really save them for special places like this that are simply extraordinary.P.S. A couple of the wine places offer a 10% discount when you mention you're buying for BP.  When you make a reservation, ask for a recommendation to go with your meal."], ["Geoff P.", "Came here for a quick lunch and had the truffle mac and cheese.  It was very good and I would definitely stop by here again when in need for a quick fix!"], ["Marianne P.", "We went to Bistro Petit last night for my roommate's birthday. It's a small boutique style restaurant -- great decor and open kitchen so you can watch the chefs prepare the dishes. The only down side is that the place can get a little warm inside in the summer. About the menu... the food blew me away. We were a party of 10, so we tasted just about everything. All of it was delicious and savory, but the truffle mac and cheese was the star of the night for me. The staff was very attentive and friendly. I was so impressed with the food that I hugged the chefs at the end of the night. Fantastic spot for a date night too!"], ["Steve B.", "Supercute little place with a great small menu, BYOB, and few tables.  High quality at reasonable prices.Strong Yelp reviews drove us here - they should get you to come as well.  Not the most comfy seating and definitely not a place to bring a group, but great food makes up for it.  We walked out very full as well, so no worries there either.Some topline notes on specific menu items: The Truffle Mac & Cheese - the pasta was a bit too al dente for me; I prefer my pasta a bit more done than they gave it.  The cheese sauce on it was great, but the pasta was a bit too chewy.The Mushroom appetizer - good, not great, not really worth the money in my mindThe entrees have changed from our first visit, but all 4 we had were really good.  This time I had the Korean Beef Bourguignon - meat fell off the bone good, great potatoes, all around extremely tasty.  She had the risotto - really good and creamy, awesome shrooms included, definitely a tasty dish.Yes it's CASH ONLY but they do allow BYOB with no fees - there's a bodega across the street for easy beers and Breukelen Bier not too far away for quality craft offerings.  Net net, come here for great food, good luck finding a time when it's not full!"], ["Sung K.", "Fan. I finally got to try this place with my sister after wanting to come for such a long time. It's a cute, petite, French-Korean restaurant that offers BYOB ( $5 corkage fee for wine). Being a Korean, I had a different expectation from this place. Meaning, I really wanted to see the difference that Bistro Petit had to offer when compared to other \"Korean fusion\" restaurants. My sister and I got the Beef Bourguignon and the Seafood Bouillabaisse - as they were the most recommended dishes on yelp. The beef bourguignon was delicious. The meat was fall off the bone tender (but then again, it's hard to mess up short ribs), and the traditional soy/garlic/ginger flavor was certainly there. However, only things that were non-Korean about this dish, in my opinion, were the mashed potatoes and the thinly sliced green apple, which I didn't really see the connection. But in the end, it was overall a delicious dish.The seafood bouillabaisse was great as well. But then again, it was hard to tell significant difference between a milder kimchi stew to this bouillabaisse. Of course the chef probably used various French techniques during the process, but I began to get the feel that they were pushing this \"it's not just Korean\" thing too far when the waitress described the rice cake in the bouillabaisse as \"rice gnocchi\". In the end, I'll just view it as a restaurant that serves tasty food and come back to try smaller dishes along with a friend/date to grab a brew or a glass before going to our next destination."], ["SHIMON C.", "Anchovies , risotto amazing!!We had Salmon, Bouillabaisse,Korean bourgujgnon. . All recommended"], ["James S.", "They really need to have free water. It is a silly and eccentric policy, which I think may be in violation of some local ordinances. Foods is outstanding but portions won't fill you up."], ["Hong L.", "On a Friday night, what could have been more romantic than a dinner with the boyfriend at Bistro Petit! The restaurant is cozy , seating 10 people inside on high bar tables and 3 small round tables outside. I really felt as if I was on vacation dining in a French restaurant with its cute classical decor, sipping a glass of wine and watching pedestrians walk by. Mental notes I took down:- Definitely make a reservation as this place is very small. - BYOB ! This restaurant focuses on French bistro cuisine, with an Asian/Korean influence. Keep an eye out on what is their specials for the day. We had the watermelon salad appetizer and it was extremely refreshing with a marriage of the sweet & juicy of the watermelon, sourness from the pickled watermelon rind, and savoriness from the grilled cheese. The entrees are reasonably priced for the amount and quality of food. I had the kimchi bouillabaisse, which is a caldron pot filled with mussels, scallop, shrimp, fish in a kimchi based sauce. Caution: If you can't take spicy food, you may want to stay away from it because it's a good type of spiciness that stays in your mouth and refuses to leave....Always leave room for dessert. Bistro Petit is known for their donuts which are rather large in size (5 pieces) and comes freshly made with a googy eggy goodness inside.  One order is more than enjoy for 2 people - trust me , I made the mistake of ordering two orders because my eyes were bigger than my stomach!"], ["Sumito A.", "Get to the Chase:Pros: ***I have been here 5 times and the quality has never ever been subpar...it has consistently BLOWN MY MIND and I can't get enough. Hands down THE BEST Restaurant in New York (rather go here than any Michelin Star restaurant in Manhattan) 1) Absolutey amazing food!!! Delicious, unique, ingenius, generous portions! Had the -Mac & Chase: Three cheeses, black truffle panko, rosemary, white truffle oil Duck Confit: Slow cooked duck, fuji apple, celery root puree crispy celery leaves, fig balsamic reduction-Foie Gras: DIVINE...I'd have this 3 times a day every day if I could (the buttery-smooth texture and rich but balanced taste is to die for)-Kimchi bouillabaisse:Mussel, scallop, pollack, shrimp, fried tofu. Rice gnocchi, konbi, white wine, korean chili paste, watercress and kimchi-Mushroom Risotto-Rock Sole (Market Fish of the day)-Beignet with espresso/coffee gelato-Handcut Fries-Farro Mushrooms-Anchovy Frites-Lobster roll2) Absolutely reasonable price, not cheap, but not exorbitant like Manhattan3) Can meet the CHEF!! He is an absolutely charming and humble guy, who is down-to-Earth. With his skills he could easily open a multitude of successful swanked up restaurants in Manhattan, but he purposefully chose not to do that. Instead he wanted to focus on delivering good comfort food that is affordable and enjoyable. 4) I've now been here 5 times and each time it is outstanding. 5) ALL TIME FAV dishes: 4 mushroom risotto (4 different types of Asian mushrooms in a light and yet deliciously creamy and flavorful risotto), the lemon profiteroles/doughnuts!! (Absolutely melts in your mouth, so warm and yet the lemon gives it a kick of delicious flavor), Lobster Roll (hands down one of the best I've ever had, and that's not easy to say. The balance with all the ingredients was perfect)Cons:1) REALLY small, we're talking barely fitting 7 people (but to the Chef's credit he built the entire establishment with his BARE HANDS along with his sous chef)...MAKE A RESERVATION and DON'T BE LATEHighly highly recommend it!"], ["John I.", "Absolutely horrendous. We had the oyster pancake (awful), the mushrooms (a ok), the foie gras (tiny and mediocre), and the mozzarella di Buffala (meh) for appetizers and the bouillabaisse (worst I've had ever in my life, plus seafood was definitely not fresh although we were said opposite) and the beef bourguignon (mediocre and meat was dry and tasteless) $25-30 per entree and $15 per appetizer is a JOKE for this 8-stool 1 table smelly joint. Service is also bad.A failed attempt of French-Korean fusion food.Never go its a joke."], ["Brian M.", "The only downside of this place probably was the price and the Asian guy who came with his hipster friend chatting with an annoying Gay lisp and saying things like 'OMG, that is like so good like it gives you orgasm like yeah~' and talking (more like moaning) like he's getting off or something.  lol I had to hold back my laughter, yeah thats YOU buddy if you ever read this post lolRegarding the price, sure this place is half \"French\" so I knew it would be pricey. Walked into the place to find out that this place is VERY small and yes PETIT. Probably can seat only about 10 people or so. This is not a sit down place with tables and chairs but a place where you'll be seating like if you're at a bar or something. Asked the server girl whether I should get the Cassoulet or the Bourguignon. She told me I should get the Bourguignon. I also asked about water and they told me that there are still water for purchase but today, she was going to offer it to me on the house which was awesome and made me feel good. Well, ordered the Korean Beef Bourguignon, one of their signature dishes which came in an iron pan/pot/skillet. It's basically identical to the Korean \"Galbi Jjim\" or Braised Short Rib with added French influences and ingredients like Glazed Carrot,Chipolini onion, Shiitake Mushroom, Sliced Granny Smith Apple, Grated Horseradish, Crushed Baked Potato With Garlic Confit. It was very good, fatty and tender that will satisfy even the most demanding taste buds but as a Korean, the taste was too familiar. Bill was $26 with tax included. The food was delicious but the price is a bit high for what you get. Sure it did satisfy my hunger and I left happy and not stuffed but maybe if it was about 5 dollars cheaper, it could definitely be a great spot for a nice meal in the area.CASH ONLY (didn't know if I had to tip or not since the only thing your 'server' does is bring out your food)NO RESTROOMS (Yea it sucks to being able to pee or wash your hands, so bring a hand sanitizer and don't drink too much liquid before coming here)It seems like this place is geared  more towards the locals and those that live nearby as it is very small and not in an area where all the action is. Maybe another day I want to come try the Cassoulet as well as other dishes but next time, will come with at least a group of 4 so we can try a variety of items and pay less lol"], ["Audrey W.", "To confirm all the NOs of this place: 1) NO restroom; 2) NO free tap water; 3) NO credit cards (or checks, I'd presume, although even my dad-- whose last movie seen in theaters was Jurassic Park, One, hasn't paid with checks since 2009), and 4) NO A.C. and only one small countertop fan inside, important to note in these summer months.So. 1) Void prior, and hold; 2) there's a bodega across the street, we were there at noon but maybe all the people complaining visited Bistro Petit when the bodega was closed (this concerns me more than no free tap water, as I'd have to reassess everything I hold to be true); 3) chance to gangster it with a roll of 20s, you're going to drop at least $20, probably $30, most likely $40, per person, on a meal; and 4) this kind of sucks, but there's outdoor seating under the awning, a four-top and a two-top in the shade. (Another two-top in the Sahara-- i.e., exposed.)And it's small. 5) NO(t) a lot of space. We ordered the watermelon salad and the beef bourguignon. The salad was so refreshing, big cubes of watermelon with smaller cubes of pickled rind, mild spicy sauce (Sriracha-esque), mint, and grilled halloumi cheese. The beef bourguignon was three glazed short ribs (very tender meat that fell off the bone) in a skillet with garlic mashed potatoes and vegetables-- onion, carrot, plump shiitake mushroom-- topped with apple slices. Hate to use this word, but it was tasty, lip-smackingly so. It was one of the hottest days of the year, and we wanted to go light and shared, although I could've had both myself-- and maybe the truffle mac, and wait, what if I got hungry at midnight, better throw in the duck confit...  Service was casual but assured, the waitperson offered us glasses and ice for our BYOs.I'm happy with everything I ate, and not concerned with if it's Korean-French or French-Korean. Just know this: YES, the food is not only pretty to look at, but YES, it's delicious too."], ["Z A.", "\"We Close.\"I walk in on a Saturday at 3:45PM.  I ask to see a menu and the guy working says:\"We Close.\"I say: \"That's strange-on your menu online as well as outside it says you have brunch till 4:30PM.\"No apology, no explanation-he just repeats:\"We Close.\"Yeah, Bye Felicia-I won't be back."], ["Jon W.", "In the heart of Williamsburg, this French Bistro is one of the best the city has to offer.  The greatest bouillabaisse I've had in New York.  Lots of garlic in the mussels, which I love.  Wonderful atmosphere and our server was friendly and worked hard to please us."], ["Kassy M.", "I got the classic burger with avocado as an add-on ($12). This shit was one of the juiciest burgers I've ever eaten. Just make sure you get a couple napkins! It was very delicious, though definitely not filling. For $12, I wish it came with a little side dish.Definitely sit at the bar facing the kitchen if you can, as you can watch EVERYTHING, it's pretty awesome. The window seats are not as great for people watching as it seems, just because it's south side and there's not much action. Also, at night time, the lights are so bright inside that it's difficult to see the outside. Note: BYOB! No cork fee! Even if you're just drinking water, bring your own or buy it at a nearby bodega because they only have Evian and Volvic! I hate Evian!"], ["Raina L.", "I agree with everything S.Y. said in her review, its my fave restaurant in the whole city. It's like getting big, high end french restaurant food with slight Korean flourishes in a tiny intimate setting with everything done perfectly! I can imagine this is the kind of food chefs prepare for each other or experiment with. Even the kobe burger knocks my socks off. but love the kimchi bouillebaisse, bourgongion, mushroom appetizer thing that comes in a tiny cast iron pot, and just get any of the specials. Chef Park is a badass chef guy with lots of stories and opinions. This place / Chef Park has a lot of character. Also, it's BYOB, counter seater, and has a casual vibe. Don't expect a full service regular restaurant-- this is like dining in a special little house."], ["Joe D.", "We decided to give Bistro Petit a go, and were slightly turned off by its very quaint dining room (the name should have given us a clue, but we didn't think it would be so literal.)  My girlfriend and I had brought an excellent bottle of wine and sat up at the counter looking into the kitchen.The experience was absolutely stellar.  Great interaction, good service, and MAN... the food was to die for.  As a self proclaimed foodie, and one who is not afraid of trying ethnic and new cuisines, I have never eaten anything that so masterfully fused Korean inspired food into French cuisine, elevating the food to a creative new level.  An unlikely fusion, it was like nothing I ever had before.We had the tempura battered and fried sardines, which were excellent.  The starchy texture, saltiness of the sardines, and lemon blended perfectly.  The watermelon salad (seasonal) was so refreshing and tasty, perfectly balancing sweet and crisp flavors with Korean spices.  The kimchi bouillabaisse was so rich and tender, and I literally would have killed someone if they tried to take the dish away from me before all of the broth was consumed with toasted bread.  The Korean Beef Bourguignon was everything that I knew about the dish, but elevated to another level.  The spiciness of the korean ingredients cut through the fat to create a perfectly balanced and harmonious dish, complete with things to be expected: meat falling off the bone.I would HIGHLY recommend this restaurant to anyone who likes good food and likes to experiment.  The Chef is a master."], ["Justin L.", "CashOnly,No restroom,BYOB,Good small dishes (mac and cheese!) and few seats."], ["Nasim K.", "My bf never gives 5s, and he was leaning towards 5 on this one so you know it's good.I really liked the kimchi bouillabaise. Something between traditional bouillabase and kimchi jigae :-)Love love love the wild mushrooms and the foie gras w toast and grapesThe doughnuts are light but doughy too. Delicious.Very tiny place, nice for a date. Don't go in a group more than 4. People said in their reviews there are 10 seats, but that's the whole place and it's all counter set ups.Servers and chef are friendly. Open kitchen so you can see and sometimes talk to the chef. BYOB and they deliver too!"], ["Ella T.", "5 stars for food!Restaurant is really really small, only a few counter seats! BYOB!Chef and staff very nice and accommodating. 3 Michelin Star chef at really affordable prices!Ordered the Beef Bourguinion.  Meat melted in my mouth, delicious carmelized carrots.And I loved the thinly sliced apple strips with horseradish....it was a garnish, but wow amazing and unexpectedly delicious.Will be back!"], ["PP F.", "Overall, a spectacular experience! Tight fit but enjoyed being able to peer into the open kitchen. Chef Park is very friendly, and it was entertaining to watch him command his staff in the kitchen. It's cash only here but on the up side it is BYOB.To begin this lovely meal, I had the watermelon salad. Beautiful, symmetrical presentation of watermelon cubes that makes for a cool, refreshing start. There are even miniature cubes of pickled watermelon rind that add a little crunch and sour flavor to complement the sweetness of the watermelon.Of course I had to try the signature dish, kimchi bouillabaisse. This is so much better than any K-town soondubu jigae. Enjoyed the savory broth with a good amount of fresh seafood (mainly mussels). The kimchi was not overpowering, and I think there was turnip even though it's not listed as an ingredient on the menu. Also had one of the specials, the beef bourguignon, braised short rib with carrots, shitake mushrooms, onions, and granny smith apples. This is the kind of beef you dream about, meat so tender you don't even need a knife to cut it. It was served with a crushed baked potato topped with scallions. Ended with the cinnamon french donuts. Comes in a set of 5. They were crispy on the outside, dusted with the perfect amount of cinnamon, and pure soft doughiness on the inside. Out of everything, the beef bourguignon was my favorite! Would love to see this as part of the permanent menu."], ["Guillaume T.", "Deserved a good four stars,. Great place, great people. The food is well executed and a plaisir to eat. Thank you"], ["Laurie F.", "Shockingly good. When the recent trend in South Williamsburg is new pricey restaurants with attitude, Bistro Petit is friendly, welcoming and delivers an incredible foodie experience. Yes, they take reservations, yes....stop at a wine shop and bring a bottle, and some water and any other beverages with you (they are not in love with the flavor of the tap water, and don't serve it). There is NO corkage fee. We had the strip steak (that comes with perfect roasted potatoes, bone marrow, and fresh roasted garlic). Tasty, hot, perfectly cooked...better than any steak house in Brooklyn. Husband had the Kimchi Bouillabaisse which is the perfect french fish stew, with a little spice of the kimchi. Was wonderful, too. Both starter courses, were cold, fresh and perfect.  We live in the neighborhood. Will be back soon."], ["Sadie K.", "Wow! The food here is absolutely delicious. Its eat till you pop good! I had the watermelon salad, the truffle Mac and cheese and the kimchi bouillabaisse and everything was divine! The kimchi stew was by far my favorite! And no matter how full you are, you must try the donuts! After the 1st bite, I said \"oh my god\" 3x! It is so moist and soft, you want to savor each bite! This is truly a gem in Williamsburg!"]]}