{"Mahal Kita": [], "India Place": [["Finlay L.", "This is my go-to delivery place (how did I survive without Seamless?). They are very consistent and quite good! I usually get the dinner special, samosas and saag paneer, which comes with nan and various chutneys. Indian delivery is my comfort food (Bad day at work? Guys don't return my calls? Disappointing political news? Indian.) so I like it to be fresh, hot, and brimming with spicy/savory goodness.The samosas are always perfectly crispy, a feat not to be taken lightly. They make their vegetarian dishes just a little spicy, so that you can temper them with the little bit of raita (yogurt) you get. All the entrees I've tried have  been tasty: Chana masala, chicken tikka, rogan josh, and aloo gobi are all solid bets. Anything with a sauce will satisfy you; they really do a good job with the flavor on those dishes. Plus, they really give you a lot of food, and you know what that means? Leftovers!!! (Seriously generous portions, as in \"the lid holding my chickpeas in their container split from the pressure.\")Anyway, my other reviews document misguided experiments with other nearby Indian restaurants. Don't repeat my mistakes! Order from India Place and be happy!"], ["jaclyn g.", "they have a $20 for $40 on yelp that i strongly recommend getting if you are going to dine in. SO much stuff to choose from. really good prices. excellently spiced. we got samosas, banana pakora, a veggie biryani (tip: stick to the plain rice), mixed veggie tikka, and an okra dish, one garlic, and one plain naan ==== $40.06!!!!! great service too! i was randomly also into the way the restaurant was lit and the smooth jazz. great ladydate!plus they deliver?! BONUS!i will definitely be coming back."], ["Shu Jin S.", "Excellent delivery service for Indian food in the 'hood. FINALLY. Ordered Lamb Vindaloo, Aloo Gobi and plain naan via Seamless and all the food (piping hot I might add) arrived in 26 minutes. The delivery guy was very friendly and I worried that the curry wouldn't be spicy enough. Oh, but it was! The spice level of the vindaloo is fantastico - hot enough to feel the heat, but not so hot that you can't taste the dish. Nommy. Basmati rice was also excellent.Could very well be my go-to delivery place for decent Indian food."], ["Carolyn H.", "Not sure why the rating is so high. Ordered some delivery for lunch yesterday. While the price was decent, the food was very meh. It also didn't come with naan, which was kind of weird. I found their food to be overly sweet. I didn't get the spice or the homeyness that indian food usually offers. Kept wishing the food had that kick that didn't exist. It was overall unsatisfying."], ["Linda S.", "Like many other yelpers I also got the $20 for $40 yelp deal. While it's worth it with the discount, I don't think I'd go here again without it.To be honest, I was not impressed with the chicken tikka masala that the menu claims is top seller. The chicken breast pieces that I got were dry. Other dishes we tried were the Kerala Boatman 's Crab Curry, which was surprisingly PACKED with crab meat, and the saag paneer. The mango lassis here are nice. In total, we ordered the three curries, plus three mango lassis, and a keema (ground lamb) and cheese nan. Without the discount, our order would've been $48 (tax and tip not included). With the discount, we paid $28! Otherwise though, there are better Indian restaurants in the neighborhood."], ["Rachel M.", "I ordered delivery. If you have never eaten here before, try to get the lunch special, it's about 13$ for an entree and samosas. The food here is terrible. The samosas have NO flavor, which I think is an incredible feat considering that it is an Indian restaurant. The texture of the pastry reminds me of a ritz cracker. I actually couldn't even eat it. I got the chicken tikka masala, and asked for it to be spicy. It was incredibly mild and also sweet. I've never had tikka masala that was sweet before so it was incredibly off putting. I was so pissed because I was so hungry and I wasted it on terrible food."], ["RoseAnn B.", "Absolutely delightful from start to finishWe ordered appetizer, bread, fish and vegetables... didn't expect so much food and it was so good I couldn't stop eating. The service was also very nice, making this an even more a wonderful dining experience."], ["Kenny C.", "Atmosphere:Springy muzak, natural light (was a little dark after the sun set), window doors wide open, not overbearingly chic but dignifiedAppetizers:The kachori (that the menu does not describe at all) was very tasty. Good for 3-4 people and might fill you up because it's so doughy. Love the chickpeas and tamarind flavors.Entrees:Beef saagwala- not the best I've had, but it was very good. Out of the three things I got, I'd recommend this first.Lamb makhani- not overly spicy, but the lamb was very tender and fell apart without too much chewingMango chicken- off the daily specials. Too sweet, not very Indian-tasting. But acceptable.Service:Impeccable. Not a single water glass was unfilled at any point, and we received rice pudding on the house at the end of our meal. Our server was also super nice and patient with our ordering."], ["Rose K.", "Safe, standard dishes, good balance of spices, sweet, and savory. Attentive service, reasonable prices, good size portions, and convenient."], ["Sabina M.", "This is definitely the best Indian food I've had in New York, and it might be the best Indian food I've had anywhere.  The food is flavorful and authentic-tasting, but that said, be warned: when they say that something is spicy, they mean business!  I consider myself pretty strong when it comes to spice... I love spicy food so much that usually at least one of my meals every day is spicy... but their vindaloo was almost more than I could handle!My boyfriend and I found this place on Yelp, and we used the $20 for $40 deal they've got going on right now.  We're both pretty frugal people normally, so it felt strange to have the ability to order not only main courses, but appetizers and desserts and sides as well.  Take advantage of that deal while they still have it because you get a LOT of food for that amount.The service was very attentive (they refilled my water frequently, which I was thankful for given that I was working up a sweat with the vindaloo), although the waiter seemed kind of weirded out by my request to have the vindaloo without the lamb haha (I'm vegetarian).  The place itself isn't super fancy, but it's pleasant and has a relaxed atmosphere.Anyway, this place is the bomb, so you should go eat there--and go quick before the deal expires!"], ["Adam B.", "Everything was delicious! Service was outstanding!! We even got free rice pudding at the end of our dinner :)"], ["Vika P.", "Horrible service: the waiter almost spilled the rice all over my sister, the hostess dropped a fork on my foot, and the beer was pored with half a glass of foam.Poor Environment: Smelled like paint and cleaning products, pictures were crooked on the walls, and the music was amateur and annoying.Bad food: The food tasted like it came from a jar, had little taste/spice, and texture.Needless to say, I would recommend trying another Indian place in the area."], ["Anna S.", "Maybe the best baingan bartha I've had ever. Friend had Rogan josh and also loved it. They have a $13.95 dine-in deal (appetizer, entree, bread) with lots of options. Service was also great and decoration/ambiance was much better than average. This will absolutely be my go-to Indian restaurant."], ["Robert Z.", "5 stars may be pushing it a bit but, ultimately, India Place deserves it offering richly-spiced and seasoned  Indian food in ample portions at  reasonable prices in a quiet and cozy setting, and friendly staff too!To start things off, the samosa are very good, larger than most, and contain, besides the requisite potatoes and peas, corn kernels, which added some texture and a unique flavor.  The vegetable fritters are excellent especially with the onions and other standard condiments, although they WERE mostly batter with what appeared to be shredded carrot and onion mixed in.  But I wouldn't hesitate to order them again since they are so flavorful, and the portion was plentiful.  I think we got 5 or 6 huge fritters.If you like lamb Korma (outstanding), ask for it 'spicy'....it won't make it fiery like a vindaloo, but adds some balance to a dish that could be overwhelmed by the sweetness of the raisins, cashews, and other assorted fruit pieces that is a staple for this dish.  The lamb is always fork-tender, but I especially love that savory Korma gravy that begs to be scooped up with a piece of naan (standard variety).Always a plus to me, they serve ice-cold CANS of Coke, not the flat non-descript fountain 'Cola' that they try to convince you is the \"real thing\" (it almost never is).After this wonderful, unhurried meal, the waiter very graciously offered us two small desserts, their delicious rice pudding, not too sweet and with a nice sprinkling of shredded coconut!  Perfect way to end a great meal.Water glasses were always filled! Can't wait to go back."], ["Ardi E.", "Compelled by the owner to write a review as  gratitude for having honored a 40 for 30 deal on Yelp I hereby unequivocably state that this restaurant serves very, very tasty Indian food. The reason I return to this place over and over again (aside from the fact that I have a weekly appointment in the neighborhood) is the naan and the poori. Whatever they are doing with their oven, they are doing well! The bread comes puffy and light yet still with the crispy bite on the bottom which makes it so delicious. The food is not like that gloppy Indian food where everything tastes the same, each dish is unique in its flavorings, and the chicken is not all dry breast meat. I especially like their appetizers. Staff is super friendly."], ["Bhavi A.", "Zero stars. DO NOT ORDER FROM HERE.  And do not trust reviews of Indian restaurants by white people. As an Indian I can testify as to how they make their chicken tikka masala. Take some ketchup, mix with water, throw some 5 day old chicken pieces in, microwave, and serve lukewarm. PUKE!"], ["J F.", "This was my first time having Indian food and I am hooked!!! The food was amazing. I had the Goan shrimp curry and could have licked the bowl. My bf had the sampler and I couldn't stop dipping into his dish as well. The food was very well seasoned and the staff was extremely helpful. We even got a complementary dessert. I will be back for sure!"], ["Akini M.", "Food was very tasty. I had the seafood platter and my date had the ghoan shrimp curry. Everything was amazing. I would definitely get either again. Staff was attentive and we even got a complimentary dessert. It was my first time really trying Indian food but I would recommend it to anyone who likes their food well seasoned."], ["Sateesh P.", "Excellent foodGreat serviceI have ordered take out several times and service and food is greatBest indian restaurant in nyWould highly recommend"], ["Andrea S.", "This was an excellent meal with friendly service. We were looking for a vegan place where there is other food too and this fit the bill. Well-seasoned dishes: we had the okra, the dal and the cauliflower and chicken vindaloo. The naan was fluffy and the pappadam was good too. Forget the house wine (yuck) and they didn't bring one of the side dishes, and there was no condiment dish for the table, so one star off. They did bring free rice dessert for us, so that was a nice touch. I would come back again if I'm I'm ever returning to Brooklyn."]], "India House Restaurant": [["New Biker B.", "So happy to have this place close enough for delivery. I ordered the veggie kourma and the chicken tikka, both were good! The veggie kourma had raisins in it I think, and my wife didn't like the sweetness of that, but I loved it! Oh and the garlic naan was good too. The meal came with plenty of perfectly cooked rice, yummy rice pudding for desert, and two excellent sauces. Delivery took about half an hour. It was cheap too!"], ["Amanda H.", "I'm so torn when writing reviews like this. We got delivery and about half of the items that showed up were tasty, standard indian take out, and the other half were just gross.We got samosas and gobi manchurian as appetizers. The filling for the samosas was dry, and the pastry was a bit dense and not at all flaky. The gobi manchurian was pretty much inedible, the breading on the cauliflower was dense and super chewy. For entrees, the vegetable jalfrazi was very good, actually, nice sauce and a good variety of fresh (not frozen) vegetables. The malai kofta was weird, almost no tomato flavor in the sauce and really heavy on the coriander -- the vegetable dumplings were pretty blech. The nan and rice were fine. I don't know, I might try this place again and avoid ordering anything fried."], ["Rory M.", "Had the mango chicken off of their main course, everything was very fast and delicious! The service was great, very friendly, constant water refills, and free rice pudding for dessert!"], ["Amy G.", "This restaurant is great. The staff is very friendly. They welcome you upon entrance and quickly seat you. The server was very good with refilling our waters. This is important because we ordered our dishes spicy and I had to wait for water refills most of the time.The food was very tasty. We had ordered chicken biryani, lamb biryani, matter paneer, chicken tikka, and chicken tikka masala. All dishes were very spicy as we had ordered it to be. Watch out when ordering spicy, our food had us tearing and sweating. We like it like that so it was good for us. The food came out very quickly(we were the only people there). Why I didn't give 5 stars: The server brought out everyone's food except one's and so our food was getting cold while we waited 5 minutes for it to arrive. Also, the chicken tikka masala's curry was a bit too sweet and tangy.Overall, I would come here again and do recommend it."], ["Ce T.", "Everyone in the neighborhood loves them, authentic, rich flavors here. Anything you order here will be delicious and worth it. Dine-in is private and simple- hardly anyone there. The staff are very accommodating."], ["Lisa F.", "Well, let me start out my review by saying this... I placed my order at 8:22pm. It is now 10:09pm, and my food finally showed up. That means almost 2 hours to deliver. This is after I called the restaurant at 9:30, asking where my food was, they told me they had the wrong address, and that my food would be there in \"a minute\" - my food didn't show up til 40 minutes later - 1 hour and 50 mins. waiting time, total. If that wasn't bad enough, when I called to check up on my order, I actually heard the owner pick up and hang up on me - not once, not twice, but 6 times in the course of 10 minutes! Not cool, India House.On *top* of that, upon opening my delivery bag, I realized the raita that I ordered wasn't included.That's already 3 strikes, and I haven't even begun my meal! I was really hoping this food would blow my mind to make up for terrible delivery, lacking raita, and rude worker who answers... or should I say, refuses to answer... their phone.Anyway, moving onto the food. The mulligatwany soup was delicious. In my opinion, a perfectly slightly-sweet tomato mixed with oil and lentil. I can see how some might say that the tomato is too sweet - definitely sweeter than most mulligatawny - some might even go so far as to compare it to sugary Spaghetti-O sauce. They have a fair argument there, and normally that would turn me off, but for some reason, this works. The lentils were also a little under-cooked, but the flavors pulled the soup together so nicely that I was able to look past it. I'd recommend this. 3/5I ordered chicken madras, with \"medium\" spiciness.  For $12 I received a pint-sized wonton-soup container full of chicken (I'd say about $6 worth) -  that was so horrifically dry, that it felt like I was chewing on leather. The fact that it was in a literal tub of sauce didn't even help. And not just dry, but not spicy, either. I understand that choosing \"medium\" spiciness is a lesser degree than choosing \"super hot\" spiciness, but this wouldn't even be labeled as mildly spicy. I think the best description, sadly, would be \"flat-out bland\".The chana shag was a complete disappointment. There were, at most, 8 or 9 chickpeas in the entire dish. The spinach was so sickeningly sweet that I couldn't even get halfway through it. There was no spice to it whatsoever. Not to mention, the restaurant gave me an absolute pathetic amount of rice - didn't even fill the container up.The \"specialty\" naan that we ordered, which supposedly included cheese and keema (meat), had absolutely no meat or cheese- in it, or on it. It was plain naan, with a handful of scallions on top. There was no pappadam with our order, and all 3 condiment containers (your average size) were half full.When they finally delivered my raita at 10:35pm (did I mention that I placed my original order at 8:22pm?), it was SWEET! Almost tasted like rice pudding, without the rice! For those that don't know raita, it's the equivalent of greek tatziki and is made with yogurt and lemon juice (just to show you how *not* sweet it's supposed to be). And the amount I received was the size of a condiment container! Are you really charging people for this?My bottom line is this - unless the owner of this restaurant read this review, felt absolutely horrible, and called me to offer me a refund on everything I just stuffed in the fridge (which will eventually be thrown out, because most of it is so lacking in taste that it's inedible), then, and only then, would I give this place a second chance. I just dropped $30 on food, and am *starving* at 11pm, because this stuff was so awful. And being so rude as to hang up on me every time I tried to call to find out the status of my order - after it's been over an hour - that's not just unprofessional, that's unacceptable.I was going to say that this was the worst Indian food that I've had in Brooklyn, but the more I think about it, the more I can honestly say that it's the worst Indian food I've had in NYC. And worst delivery experience, too! No thanks, India House. I'll take my business elsewhere."], ["Sally A.", "SO good. India house has quickly become one of my favorites. I will say that when I order the chicken tikka masala it sometimes lacks enough chicken. The masala sauce itself is excellent though, so i don't mind  having a little extra to dip naan or rice in. Delivery is always prompt and they have good combo specials."], ["Grace I.", "This is the best place to have Indian food in Crown Heights, according to my experience. The place itself, though modest, is atmospheric, pleasant, and cosy--with neat red walls and tablecloths. As a vegetarian I almost always order in Indian restaurants Saag Panir--spinach with cheese. At India House they agreed to make it without additional cream, which makes the dish not heavy and really tasty. I'd say it is the best I've had in a very, very long time. Also the mixed vegetable curry was excellent. The man in the front desk who handles all the orders (and there seems to be a lot of them) is very helpful and polite, and he kindly added a rice pudding to my order without additional charge. I'll definitely be back and I highly recommend this place!"], ["Christopher C.", "I have not been in the city for over 2 years, and THIS was my first meal.... 2 samosa that were monster HUGE, and a FABULOUS chicken korma. I am alone and there is enough to feed two HUNGRY adults! AWESOME!"], ["Aicha F.", "Amazing tasty Indian food, fast delivery, very nice friendly staff ( Either in the restaurant or delivery ). I ordered dinners from this restaurants over 5 times now and was happy every time i did ! So glad i live close to this restaurant !"], ["Colleen C.", "I haven't written a review in years, but today, I had to stumble to my old ways. Negative reviews are more fun, but I have got to give a shout out to India House. I just got turned on to Indian food since moving to NYC, and have ordered from this joint probably 4 times in the past couple of months, and I rarely order food out! The samosas are off the chain! The curry is on point. The spinachy stuff I forget what it's called is amazeballs. They gift Ya with little extras here and there. And to top it off, their customer service is great. That can't go unnoticed. Hoping this gem in the Bed stuy 'hood is here to stay!"], ["Daniel F.", "I like this place. We order in for delivery from India House often and I think everything is pretty tasty. The free rice pudding is a nice touch and the saag paneer seems fresher than most. It's bright green and delicious!"], ["Monica R.", "love this place. the service is great, the food is quick and always the same! highly recommend!"], ["Alex D.", "Great Indian!  One of the best in NYC and I've tried a bunch.  Got the chicken Saag and it was delicious.  This will definitely be my go to place. Quick turnaround and very friendly.  Easily the best in the neighborhood."], ["Jo W.", "This restaurant is fabulous. I placed my first order through Seamless and decided to run errands and pick it up. My train was delayed, but instead of watching my food get cold they called to check on me. I wanted a variety for my first order so I tried both of the mixed appetizer plates, some naan, and gulab jamon. Everything but the gulab jamon was excellent. That is usually my favorite but it just wasn't that great here. I am going to give it another shot when I am not late picking things up and getting back to my apartment to eat.I have since picked it up to go twice and ordered delivery once. It has been wonderful every time. I'm grateful this is right on my train stop on my way home!"], ["Oleh Z.", "Great bharta and even better service."], ["Turi C.", "I like India House. They're not the best Indian I've ever had, but they are very good. I'm also ecstatic that I even have an Indian restaurant that will deliver to my neighborhood. I've never had any issues with delivery or incorrect orders and they come up to my door. Another plus.Last go round I had Lamb bhuna. It was delicious. I'll surely order it again next time. The naan is not very good imo but I also find that naan in general is better on the spot and not saved or transported."], ["Gokul S.", "Really tough chicken and very inauthentic curry. Delivery took 1hr 15 mins!"], ["Kate M.", "Consistently delicious and fast delivery. Lots of Indian spots in the neighborhood but this is my go to. Chicken madras packs a punch and channa masala is best in bed stuy. A staple on the Seamless delivery rotation"], ["Michael N.", "Amazing! The service is exceptional, and consistently friendly. I always find some manner of freebie every time I order, usually extra papadam since I mentioned how much I enjoy it to the staff.Biggest mark in their favor and the reason I had to give them 5 stars is that their Chicken Tikka is never dry. Chicken Tikka is my wife's go to for indian food, but it's usually overcooked and a touch dry everywhere we go, but they always make the Chicken Tikka fresh for every order at India House, so while it takes about an extra 10-15 minutes longer compared to other nearby Indian restaurants (which they always remind me of when I order it) it is worth the wait.Tikka Masala is my default and it was flavorful and moist. Vindaloo is truly spicy, and if you request extra spicy, they defnitely will put a boot in it.The Jalfreezi is full of fresh, tasty vegetables. The garlic and onion nan is very flavorful. I also enjoyed the Potato Paratha.Their Kashmiri Pulao (saffron rice with cashews, raisins & fruits) is so sweet, I actually order it as my dessert."]], "Bombay Kitchen": [["Ciara S.", "The best takeout I have had in Bushwick HANDS DOWN. I found this place on delivery.com after ordering from a different indian place that food was not great at all. This is one of my favorite Indian places to order from period. I love their selection of curry, I think I have ordered almost all of the ones listed on the menu. I will miss this place when I move next week. If you live in the area and love food with a kick i would suggest you order from this place."], ["Jamal P.", "You have to tell them your order 3X, no, 4 to 5X to make sure your order is right. That's depending on who answers the phone. I'm not saying the food is not good, but getting what you order is a priority to you... recheck, recheck, recheck. I'm giving them a low star rating because of the way they don't deliver on the orders that have been made. The food is ok, i've had better, it's just good to have a variety in the neighborhood. I hope they work on that."], ["D'Brickashaw J.", "If you're will to pay $16.50 for Indian delivery in Brooklyn, there are at least two better joints on Seamless. One won't have a picture. So...the mango chutney condiment was the most enjoy feature of this meal. My homey from Baltimore plowed through our Curry and Tikka Masala, fueled by munchies--not satisfaction. According to my carnivores comrade, the chicken was dry, tough, and full of inedible components. The sauce wasn't bad. And the samosas were very good. This place was decent, don't get me wrong. But the Jackson Heights has certainly spoiled us."], ["Rethna E.", "Always hits the spot in the best way possible! I love ordering from here. Their tikka is always incredible and their fresh naan is awesome."], ["Autumn B.", "I've ordered delivery from here four times since I move to Bushwick in March. They left a menu on my doorstep so I gave them a chance. The first two times the delivery service was quick and friendly and the food was pretty good. The last two times the delivery service has called me instead of ringing my doorbell, and talked really fast with an indian accent that I could not understand. The first time the delivery guy called he complained that he couldn't find parking (I'm sorry, I cannot help this!). I tipped him well for his troubles because he was still nice when he came to the door. Tonight when I ordered delivery the woman on the phone said it would take 20 minutes AT MOST and it arrived in an hour. FAIL!It was raining outside and the delivery guy called me saying something about the rain that I truly couldn't understand. I looked out my window and he was standing at his moped, but not coming to the door. I waited until he walked toward my door and waited for him to ring the bell and he didn't. I then called him back to see if he was having trouble and he started to yell at me about the rain. THEN he went back to his moped for some reason instead of coming upstairs while I buzzed him in. When he finally came upstairs, I was apologetic and said that I couldn't understand him and that I was sorry and he started yelling at me saying \"What don't you understand? Why can't you understand? Look at me? I am all wet from the rain!\" He continued to yell some more which I couldn't really understand, so I said I was sorry, signed the receipt and when he got the receipt back he says \"You still don't understand, nevermind\" all annoyed. I still do not understand why he was so upset with me. Yes, I ordered delivery on a rainy night. MANY PEOPLE DO. I was planning on tipping him well because of the rain (I still gave him over 20%). WTF?Also, I had like 4 pieces of chicken in my sauce...and it was an entree.I'll try a different indian restaurant next time. This delivery service ruined it for me."], ["Cynthia G.", "I'm ashamed to say in my quest of foodery I have never tried Indian. Either I always try to and my plans are foiled or I always end up finding something to eat that is either cheaper or familiar. Well my day with Indian food finally arrived. They left a menu in front of my building and upon seeing it a smile crept on my face. I called my bf uttering one sentence...\"We're having Indian tonight.\"I called and placed the order about half an hour before their closing time, mostly because I was researching the dishes online. I finally gave my order. For 1 main seafood dish and an all day special it came out to 32 bucks. I thought it was bit pricey and once I got the food the portions didn't match the cost. I kept scanning the menu after ordering and wanted their version of garlic bread. I called back and told them to charge it on the card I had ordered with. He said no problem or at least I thought so, since his accent was very hard to understand. The food came quickly and the guy called once he was here. He kept repeating himself over and over on the phone but I could not understand this guy for the life of me. I was so embarrassed because he kept talking and I just kept going \"huh\" over and over again. To end the confusion I just ran down and got the food. Went to sign and this dude did not have a pen. Now I live on the 3rd floor so now we both have to go back up (no elevator!) so I can get a stupid pen that you should have. The whole time he's asking me if I'm good which I can only understand as \"Are you ok with all the mess about the pen\" and I answer politely with a yes. Then come to find out the bread was not added. He handed me his manager on the phone and I quickly told her I would add it to the tip. The guy misunderstood and was disappointed once he figured half of his tip was to make up for the bread that wasn't charged to me. But oh well you were confusing me anyway.Now to the food! It was actually pretty good. The shrimp pathia was alot more spicy than I was prepared for but it was delicious nonetheless. The garlic naan was warm and fragrant. My only complaint was they only gave like 4 shrimp in the sauce. I would order again but I would just hope everything is a bit smoother next time I order."], ["Michael M.", "Well, I was freaked out by the reviews.  But I was watching the \"Best Exotic Marigold Hotel\" and I had to have Indian food.  Obviously the reviews were inconsistent, (restaurant, I mean, the movie was great)  but I figured I may get lucky.  I guess I did!  Granted I didn't challenge them very much with a simple order of Chicken Tikka Masala, but it was really good!  Very glad to have Indian food in the neighborhood.  I'll let you how how they do next time.   Maybe Slumdog Millionaire."], ["Beth H.", "I love this place. Sure, it's not quite as good as my favorite Curry Row restaurant (Panna II on 1st) but it's in Bushwick and they will (and frequently do) bring delicious naan to my apartment.  Although I usually get delivery, I did eat at the restaurant once, and the service was great.  The waitress was friendly and polite and the food came quickly.  Plus there was a lunch special so it ended up being cheap cheap cheap.It took me a few tries to find my usual order. The vegetable curry is a little spicy for my taste (and I LOVE spicy food), but once I found the vegetable malai I knew I had my go-to dish.  My girlfriend usually gets the chicken tikka and says it's also very good. Yes, sometimes delivery takes a while on busy nights like Fridays and Saturdays, but I've never had a wait that was excessive and the delivery people are always nice."], ["Niki M.", "how do you give no stars?please pass on this restaurant. as stated in more than one review below, they used to be great when they first opened. the first time i ordered it was great. the second time we noticed the portions mysteriously got smaller for the same price. third time my order was inedibly spicy and got thrown out. and today, decided to give it one more shot and it is decidedly the very last. the fish was rotten, the chicken tough. we threw out more than half our meal, wasting $30. i love indian food and this place is, after many chances, the worst."], ["Andrew S.", "I had the $11.95 combination with mushroom mattar and the chicken tikka appetizer. The chicken tikka was very good, though even for an appetizer it was a little small: just 4 chunks of chicken on a bed of onions, cucumber, and tomatoes. The mushroom mattar (peas and mushrooms in a curry-type sauce) was a bit milder and sweeter than what I've had elsewhere, but it tasted all right, and I'm guessing you'd be able to ask for a hotter version if you wanted. There was also a good amount of it, enough that with the rice and naan I was easily able to save half for tomorrow.I just missed the cutoff for this, but another nice aspect is that they give a 25 percent discount on almost everything on the menu between about 11 am and 4 pm. Not bad overall, especially since there's basically no other option for Indian food in Bushwick."], ["megan n.", "More like 3.5 but I don't know that I can forgive two flaws in my delivery service experience.I'm wary of Indian joints in Brooklyn. They always throw a wrench in my master plan to obtain and inhale delicious aromatic meals. The naan will be burnt or the rogan josh will have a mildly disconcerting hue. The naan at BK is delicious. Fluffy and sweet, it is disarming. The samosa is a samosa is a samosa. Mango lassi could be a little thicker but for the price it works.I should note that I have a cold which is relevant for three reasons:1) The saag panir while good was super spicy. I love spicy food and consume it routinely; in fact, I usually prefer that it be spicier than not. However I have this thing with saag. I like milder. So I chose medium. My taste buds are dulled and my nose is stuffed and I could still feel the burn. It was pretty real.2) I got a little sick but my stomach also hates me for one cocktail too many so that just might be a series of poor choices on my part and so dock them I won't.3) I clicked the \"please call this number\" box. And then in special instructions I wrote \"Please call XXX-XXX-XXXX. The buzzer is not working\". I did this because my roommate who works nights was trying to sleep. THE GUY RANG THE DOORBELL NO FEWER THEN SIX TIMES AT AN ANNOYING PACE. When I wrapped myself in my robe and stumbled to the front of the building he's just like this is you? Yes. Hi. So yeah basically you could do worse but they're not perfect. If you realllly don't want them to ring your doorbell you should probably call to be extra careful."], ["Melinda C.", "It all started out on a rainy Friday night... tired of McDonald's, Spanish, and Chinese food, I needed something I've been missing. My friend's and I decided not to trek into the city and instead came here. It was weird being the only ones inside, but that was all forgotten. I was glued to the TV and smiling remembering the \"Girly Man\" video on YouTube (HA HA!). Within minutes a sizzling plate of chicken tikka made its way to the table and I was in heaven! Naan, beef bhuna, rice, and lemon water... what could be better?! On my second and third visits I tried the chicken kati, roti, poloori, chicken tandoori, and samosas. I've had better samosas, but I've also cut out fried foods from my diet so maybe that's what threw me off. The manager's been there every time I've gone, and although he isn't overly friendly, he's always one of the people serving my food. And again, it's always empty... WHY?! Bushwick folks need to open up their food palette. This soooooooooo beats everything else in the 'hood."], ["The Q.", "i order from this place all the time on grubhub, and it is absolutely the best indian food in the area. the food is much more flavorful than the other indian restaurants nearby, and the delivery is super fast (delivery person is always really friendly too).i usually order the chicken makhani, which is both sweet and savory and generally just magical. i always fight an internal battle with myself not to eat the whole thing in one sitting (because it's definitely two meals worth of food). i've also gotten the chicken tikka masala and the garlic naan, both of which are great as well."], ["Thomas D.", "My girlfriend and I have eaten at here twice - once sit down and once delivery - we were excited to find an indian restaurant so close to home. The sit down experience was actually pleasant, the food, while not particularly impressive was adequate and the restaurant and service was endearing. HOWEVER our recent delivery experience was abysmal. The baigan bartha which they call simply \"bartha\" was fine. Good even.The samosas were also at least as good as you would get from the freezer section at Patel Brothers. The other dish was quite possibly the worst indian food, or for that matter food of any variety, either of us have ever paid for. \"Alu mottor gobi\" allegedly potato, cauliflower, and peas. We were perplexed by the gray desiccated lumps floating in the unappetizing watery broth. It turns out that they were potatoes, but through some unfortunate series of events had been transformed on an almost molecular level to a new vegetable substance, completely inedible, mealy, horrifying. I can hardly fathom that a restaurant, any restaurant, would have the temerity to serve such  a \"potato\" much less charge for it.I hope that they change whatever it is that is so obviously wrong with this place."], ["Tia P.", "Not happy spoiled Rasmali twice, did not want to correct their mistake. Never going back and I would spend money with them every weekend, bad business."], ["Joe M.", "So I just ordered chicken korma from this place.  Upon arrival I noticed that the chicken korma was a completely different color than it normally is.  It was a sort of light green and it didn't have anything other than chicken in it which it normally does.  I tried a little bit of it and realized it was chicken curry.  So I called them up and explained the problem and the lady I talked to apologized and said she would take care of it.A couple of minutes later they called me back, and it was a different woman on the phone.  She proceeded to explain to me that the korma was darker today, more so than normal.  I told her that it wasn't darker, it was actually lighter and more yellow/greenish.  Afterwards she said \"Yes it's lighter today and more yellow, only today though.\"  Obviously I was a  little surprised that she decided to tell me at that point that it was lighter and more yellow when she just told me it was darker.  So I asked her why she just told me it was darker and then after I told her it was lighter she said it was lighter.  She then proceeded to deny every saying it was darker and insisting that it was just screwed up for today.  Even if this wasn't her lame attempt at lying (which I'm pretty sure it was) she would then have been implying that someone messed up when they made the korma and they just decided to deliver it anyway.  I think lying to me was pretty bad, but the alternative is certainly not much better.She then ask if I still want them to deliver me the korma, and at this point I'm kind of mad so even though I figured I was going to get the same thing I said yes.  She then told me that I have to give her back the other screwed up batch and take this one.  Anyway, about 20 minutes later the delivery guy came whom I was polite to because obviously he had done nothing wrong.  The 'chicken korma' was even more yellow this time and I didn't even bother eating it.It's unfortunate that instead of fixing a mistake they opted to blatantly lie to me.  I wouldn't recommend ordering from this place."], ["Norbert W.", "Pretty good, fresh naan was nice, definitely the best Indian food near ridgewood or bushwick. Food came neatly pack no spilled  sauce all over the bags. I will definitely order again."], ["Kurt S.", "The food is great. There's no doubt about that. The Seamless orders are relatively fast. But there seems to be a communication/customer service problem. I was yelled at by the delivery guy for not having my phone number listed, despite calling and sending instructions through Seamless. They have poor customer service and I didn't get an apology. I don't think I'll be ordering from them again."], ["Mitchell A.", "i ordered this place on grubhub, and it was great!  everything tasted amazing."], ["Yvonne G.", "Pretty decent food. The Naan is really good."]], "Agra Taj Mahal": [], "Bombay Grill": [["Nina L.", "First meal at this restaurant and it was perfect! -The service was amazing. Attentive ,very nice waiters!-The food was great. I tried both the vegetarian and chicken dishes. The chicken was delicios and completely non fatty. (which i love)-They dont serve alcohol, so bring a bottle of wine and enjoy your dinner!This will be my new go-to local Indian !"], ["Pamela M.", "I heard great things about this place and was excited to try it. I went in today and it was horrible!When my boyfriend and I ordered, the waiter was being very pushy into us ordering more food. \"THAT'S IT?!?! YOU DON'T WANT THIS THIS AND THIS?!?\" Then, while taking our plates away, he grabbed them out of my hand while I was trying to put my utensils on the plate and had a very snobby attitude. After giving him a tip he deserved for his rude behavior, he screamed in front of the whole restaurant to take it because he didn't want it at all. Although the food was okay, I rather amazing service and average food than excellent food and awful service. Very disappointed in my visit. I have told everyone I know about my experience and would not recommend it to anyone."], ["Katharine S.", "If you know me, you know that Indian food is my number one favorite kind of food. This place is great - the quality of the food really stands out to me. I've been here a few times and have had:Chicken tikka masala - amazin'Butter Chicken - amazin'Chili chicken - really spicy, but still goodMango lassi - very rich and deliciousAloo Papri - not the best...the crunchy pieces seemed staleOnion pakora - my favorite, really flavorful The people here are very nice, they don't bother you too much while you're eating, which I like. Also, they give us a small complimentary rice pudding before we leave. It's just a cute place and my go-to for dinner when I want Indian food."], ["Iva S.", "I tried few other Indian restaurants and this was the best. Fresh, tasty food, good service and the best - they could accommodate our gluten free sensitivity. All the food we ordered-vegetable dhansak, shrimp vindaloo or shrimp tandoori masala - was gluten free. Even the thin crispy \"cracker\" is made of lentil and is also GF. I am going back for sure!"], ["Garry M.", "This place is a rare find. The staff is nice, they are not overly friendly and try to get under your skin pretending to be your friend and everything. They listen and patiently answer our questions; they are attentive but in a, shall we say, professional way. We felt welcomed and being taken good care of. The food was great. Curries were thick rather than watery like many other Indian places. The flavor was just perfect, not overly spiced, not overly sweet or salty, but just right! And the sweet sweet complimentary rice pudding at the end was also a very nice touch. Little things like that gave us an overall very pleasant experience. I will definitely come back."], ["Jenny C.", "Their service is actually pretty good. They gave my friend and I free pompadoo while we were waiting for our third guest. We ordered a bombay aloo and they kept giving saying that what we wanted was a bombay live. My friend got the bombay aloo from here a while back so we thought we could get that except what we got was not a bombay aloo. I'm guessing it is a bombay live because they kept saying bombay live when we said aloo. My friend was a little pissed about that because she really wanted the bombay aloo from here because it's good but apparently we didn't get it this time. The lamb vindaloo was very good and they gave us free dessert so it wasn't as bad as an experience here."], ["Yana B.", "Great food and a very nice relaxed atmosphere. They have no alcohol, but you are welcome to bring your own (everyone does). They play Indian music videos on the large tv above the counter which adds to the experience and gives you something fun and colorful to look at :)"], ["Mike B.", "in search of dinner in Bay Ridge - our original dinner plan having an hour wait, our backup having been very recently reformatted to just a pizzeria - we found available seating and solid Yelp reviews pointing to Bombay Grill. and, to the delight of my wife's cousin's husband, it was BYOB too!as we ended up sharing pretty much everything ordered, we got a respectable sample size to analyze. the mixed vegetarian appetizer platter was a good kickoff, especially the pakoras. as a big fan of lamb rogan josh, I ordered that as my entree and was quite delighted with it. the saag paneer was also great. everything is full of the spices and flavors that you expect from Indian cuisine, and at a fair price point. the staff here are friendly and the TVs showed various Indian music videos, which I enjoy. Bombay Grill is pretty, pretty, pretty good, and I'm envious of our lack of similarly good Indian in Forest Hills."], ["Bina S.", "Great place! I came here with my husband for dinner.  We ordered our usual, chicken tikka masala and beef curry.  The curry here is packed with flavor and has a slight thick consistency, which I prefer.  We also ordered garlic nan which was baked perfectly.   Service could not have been better. The minute my glass of water hit half way empty, a waitress came out of nowhere to fill it up.  I would highly recommend this place."], ["Cat M.", "It's a rare opportunity when you find Indian food on the side of the tracks and it is a restaurant that deserves ever star.Top notch service, excellent food and beautiful decor, Bombay grill is an amazing and tasty addition to bay ridge. I was surprised to find this restaurant so close to home. It is a restaurant where every table has a flower and the inside glows. You are greeted by the manager who assists you to your table and pulls it out for you. The menu is filled with delicious choices at great prices -- two samosas for $3.25 (instead of that last place that charge $6). I ordered the chicken tikka masala and a mango lassi. My friend has the lamb biryani - we shared naan.  Before our meals came out they brought a side of crisp flat wafer like bread (sorry don't know the name! )  and a tray of side sauces to dip with. Our glasses were never empty and our meals came out quick, amazing food!!! My entree was nothing less of mouth watering. It was hard to concentrate on talking (I was a bit too excited I found Indian food in bay ridge) . Shortly after they collected our plates the waiter came over with two dessert and said \"dessert on us\". ( my eyes turned into hearts ) It was an excellent dining experience I recommend  to everyone ! They even do take out (move over Chinese food :p ) I am so happy bay ridge has Indian cuisine and seeing how well they treated us, hopefully will stay for a long time !"], ["Dina M.", "My absolute by far most favorite Indian restaurant evaaaaa! Their chicken tikka masala is bombbbbb and definitely the best I ever had. N their naan is so soft n fresh n they're so polite and welcoming and the service is great!! My fav spot ever ever ever forever. Bye."], ["Sonia F.", "Their Tikka Masala is perfection. They give you your moneys worth and a rice pudding dessert. I had my food delivered and it was amazing. Cant wait to go in person."], ["Amy N.", "The aroma of warm spices and curry when you walk into the restaurant, I know I'm going take that smell home with me. The dining area looks romantic, from the fresh roses on the table, to the lighting.  They offer a daily special 24/7. For $14.95, you get an appetizer, an entree, naan, and rice. I gotta tell you guys, it was alot of food for me, and yes, I'll admit it....I usually eat big portions. I chose the Alu Tikiyas for the appetizer part of my daily special. Never had this before and it's actually a potato cake made with chutney and chickpeas. Wasn't bad, crispy on the outside and creamy inside. All the sauces paired really well with them, sweet tamarind sauce and this spicy green one that's similar to a chili sauce.The naan is soft and fluffy, I dipped it in every single condiment they included with the entree and the appetizer. Among all the sauces on the table, mango chutney was my favorite.For the entree I went for the Chicken Tikki Masala, my to go at any Indian joint. Beautiful orange red color, creamy, sweet, and tangy, just like how it should be and it is the best tikki masala I've had. There was more than enough sauce to pour over all the rice and sopping my entire naan in. I think I've found my new joint for Indian food, but the hunt is still on."], ["Zee H.", "The best Indian takeout food I've ever eaten in bay ridge! Appetizers of samosas and aloo tikki were so good, the thought of the aloo tikki on a burger bun with chutney and onions already has me wanting to go back.Chapati was good, garlic naan tasted way too strongly of raw garlic for my liking. Saag paneer as my main was good, but lacking a little bit of heat. It was bland, but I probably should have asked for it to be made more spicy as I noted another reviewer did. Overall loved the food, best $25 I've spent on food in a while...Delivery took 50 minutes only from a couple blocks away, but I'm willing to wait for such good food!!"], ["Xiu H.", "Came here for lunch on a Saturday. It was pretty quiet but they do get a lot of take out orders. The food was really tasty. I ordered the chicken curry and chicken tikka masala. Both were quite good except the chicken was a little dry. Note: they give unlimited rice & offers free rice pudding dessert"], ["Peter O.", "(Copied from my other account, 2/7/2015)Had the Naan and Tikka Masala.Naan was warm, soft, fluffy. All the good things you want your flatbread to be. Easily the best part along with the tandoori sauce for the Tikka Masala. They offered 3 dips, I liked the chutney the best.The Tikka Masala (they do chicken or lamb) was just about right. Not too thick, buttery, or sweet. It wasn't spicy at all, which might be something people look for. The portions are pretty good, more than enough to leave you satisfied and filled (unless you just happen to be a going-through-puberty-aged-teenager after a few hours of balling). I wish the lamb were a bit softer, but that was an afterthought.Service was excellent. Staff were timely, courteous, and helpful.Overall, would highly recommend. Can't go wrong here. For what you're paying, the food is a very good, and the service helped easily push this to a 5."], ["Tuba H.", "The rice they used to use was so much better. It was long and thin and the rice they use now is not as great. Love the condiments they serve at the table and love their chicken tikka biryani. They could work on phone/ customer service. They're pretty bad at taking orders and reading card numbers. This one time they guy called back in a ride voice blatantly saying to give him another card number because the one I gave him didn't work. So I told him It did work and gave him the same number again. Turns out he mixed up a number. At least be polite if you're wrong, don't assume it's me. And he charged me for something I didn't want, because he wasn't listening."], ["Nancy R.", "My husband and I have ordered from this place a few times. We've had the chicken tikka masala and the chicken vindaloo. I like that each entree comes with an appetizer and naan bread. Not the best tikka masala I've ever had, it's a bit too tomatoey for me. The chicken vindaloo can be hit and miss because sometimes they give lots of potatoes and barely any chicken. Last time, when I finally had a lot of chicken a lot of pieces were tough with no potatoes."], ["Said S.", "Bombay Grill has no respect for customers and honoring their liabilities from mistakes made on their advertisements and menus.See, at first this place had a $14.95 dinner special for dining in that included an entree, app, and bread. Now it's only for deliveries.How did I find out? After reasonably relying upon their false advertisement that this daily special was not online only, as it had been on the menu before and their current website states it on the main page as well with no caveat. We arrived starving after deciding we'd pass over Taj Mahal, where we were first parked, and driving out to Bombay Grill because of the deal and because we had quality meals there before. We sat down, asked for the daily special, and were berated for \"haggling\" over their illegal actions after informing them that their insistence on it being delivery only was incorrect per the advertisement. I assure you if they had the disclaimer stating it was delivery only, this would be a non-issue and I wouldn't have wasted my time Bombay Grill, don't disrespect your customer after they report errors out of good faith and advise you to change them to prevent future liability. The legal advice would have cost you a few bucks at most and saved you headaches. Instead of management thinking \"here's a customer who helped me out with excellent information that others pay consultants for, which will also save me from future problems, let me just honor it this time\" I got the opposite of what any succesful, responsible, and aware business owner should do.Don't let people rip you off: truthinadvertising.org/n…"], ["Sud K.", "Ordered chicken biryani.. It had no flavor, it was literally the worst biryani i hav ever had. The food blows !!!!"]], "Indian Spice": [], "Tandoori Masala": [["Bill W.", "So glad this gem of an Indian restaurant is right around the corner. My vegetarian girlfriend and I checked this out the other night, and it was really nice. Tasty, rich chicken makhani (aka butter chicken), excellent crispy okra (though it could use a few less onions). My girlfriend ordered a cauliflower appetizer as one of her main entrees; she asked about it, and the server said if she didn't like he'd pay for it. She loved it so we paid (and I really don't like cauliflower, but I tried it and even I liked it a lot).I think this is a newer place and I think they may be still hitting their groove, because though the food was excellent, the service leaned heavily to the slower side (the only reason this review gives it four instead of five stars), but mostly it was toward the end when we were ready for the check. The dining room is clean, neat, but spartan, and they seem to do a pretty active take-out business.Slowish or not, we'll definitely go again. Can't wait to try one of the tandoori specialties. Totally worth a trip."], ["Antoinette I.", "The food is Deelish!!! The ambiance was horrible.  I ordered the Lamb Saagwala. It had the perfect amount of spice. My mouth was happy. The rice pudding is heavenly!!!!!!  While I waited for my takeout order, several individuals came out of the kitchen . They didn't smile....they didn't say hello....they were unfriendly.  I've patronized other restaurants for take out, and they usually offer a glass of water at the bare minimum, as you wait for your order. Since no one else was in the restaurant besides myself and the staff, the atmosphere was very uninviting to say the least. I can't say that I'll EVER go back, because ambiance is VERY important in the restaurant business."], ["Cassidy P.", "Amazing food! My boyfriend and I have come here twice now and we would make the trip anytime to eat their food! We are going to order them for delivery some time soon, as they are on seamless!The Chana masala is amazing and so is the lamb dahi gosh! We tried the raita today for the first time and it has a great sweet and tangy flavor to it which is a great addition to the rest of the meal! We always get garlic naan because it's incredible!Highly suggest going here! We tend to go at odd hours like 3pm and there usually isn't anyone else there, so you get your food fresh and quickly!"], ["Makenna S.", "Really fast, friendly service. Prices aren't cheap but they are very reasonable (especially for an Indian place!). I had the chana masala, and my friend had the rogan josh. Both really, really good. Great portions, delicious naan, limitless rice! Definitely will be coming back here."], ["Anne B.", "I've only ordered online, but delivery is always really quick and the food arrives still hot. The food is much better than other Indian options in the area. I usually go for Lamb Saagwala and it's the best I've had since moving to NY years ago. I usually go for samosas, but the marinated meat appetizers are also really good. So glad to have this so close to my apartment!"], ["Koby T.", "Just moved in to the area and this was an amazing first meal. Authentic and rich in flavor. Having enjoyed Indian food in the Middle East, this place brings me back! Garlic naan was on point and the tandoori masala and lamb were phenomenal. Definitely will be back!"], ["Teshanee C.", "Excellent food and fast delivery, no problems at all, would definitely order from here again, the garlic naan was excellent and I had the chicken tikka masala, also very good."], ["Liz L.", "Excellent food. Outstanding service. Gorgeous presentation. They take a lot of pride in the restaurant and after speaking to the (owner?), it was clear that they have even bigger plans for this place. He said it was happily BOB until they get a liquor license in a couple months. Everything we ordered was tasty (lamb stuffed chicken and a spicy shrimp dish), but the best was the naan stuffed with coconut, raisins, and other stuff. Tastes like drugs, really. It reminds us of coconut turnovers. Absolutely amazing. So happy this is in the area!!!"], ["Dj W.", "Expensive, (having only tried the shrimp tandoori dinner) small portion size, yet a top notch high quality meal. Cuisine of this rate isn't usually found in this area; I'm grateful this restaurant is here."], ["Samantha P.", "Sweet and unassuming, Tandoori Masala creates a prefect atmosphere for dinner with friends. The staff was polite, friendly and quick! I have allergies to certain spices and the kitchen was accommodating and provided excellent service. The food is top notch! The naan was soft, the chicken tikka masala was tender and perfectly spiced. What really topped the experience was the humbleness of the staff. Great place to eat! Check it out!"], ["Lani B.", "Really great food at a reasonable price.  My husband and I only had a take out, but looking forward to dining there one day!"], ["Matthias H.", "Stopped in for lunch and was not disappointed. I was the only customer and service was a bit slow, but the bhartha (eggplant) and naan were delicious (though the frozen peas didn't improve the dish). The phone kept ringing and staff kept busy in the kitchen (with take-out orders, I assume). It feels out of place on this block, but what a great addition!"], ["Ryan L.", "Went here for lunch in the middle of the week, we were the only customers so service was prompt and the server was very warm and friendly.  We ordered samosa to start, it came with two sauces and it was delicious.  Order comes with two so good for splitting.  For our main courses we got paneer tikka masala and saag paneer.  Both meals came with basmati rice and a huge basket of delicious, warm naan.  The tikka masala sauce was SO GOOD.  I order this dish in every Indian restaurant I go to (and I go to a lot of them), and this was among the top three best I've ever had.  It came with a great amount of fresh, light paneer and there was lots of extra sauce which was great for dipping all that soft buttery naan into.  Overall a great meal, quick service, food was clearly fresh and made to order, nice atmosphere, and enough to take leftovers home all for a reasonable price.  Competes with some of my favorite places in Manhattan (I only say this because I know it matters to some people, I'm not that pretentious).  I would definitely come back!"], ["Michael G.", "This is a very new restaurant and I hope the best for them since the food is authentic and the service is friendly.  The bhel puri is better than thelewala in city.  It is sweet, sour, a hint of spices, and deliciously garnished with cilantro.  The samosas are savory and delicious.  The crab curry is authentically south indian, meaty with crab, has mustard seeds, curry leaves, chili powder, just like a south indian crab curry should have.  The papadum in the beginning is slightly salty, but nothing else is too salty which is a big plus.  The meal concludes with a complimentary gulab jamun, which is sweet yet succulent, it literally oozes saffron, rosebud syrup.  Great novel place in bushwick, i recommend it to all."], ["Willie G.", "This place is amazing. Please stop by and support this place. This is an Indian food treasure, and it's right on the edge of Bushwick. The tandoori grilled chicken, salmon, n lamb is delicious. The lamb Handini was awesome. The garlic naan yummy. And to top it off the service is friendly. Enjoy, it's a treat you will enjoy."], ["Kaila J.", "This place is AMAZING! We ordered take out because it was pouring outside. Everything was fresh and so flavorful. We ordered stuffed naan, vegetable platter, bhel puri and fish tikka. The naan!!! Omg! Stuffed with pistachio, raisins and almond. I will be craving this when I go back to Florida. I'm so full, I've yet to crack open the rice pudding we ordered. I'm sure it will be just as good as everything else. This is a must food stop if you're in Brooklyn! Eat. Here. Now!"], ["Micaela R.", "The food here is so good. The flavors come together and hit you with a little POW!. I haven't visited this establishment as I have just had delivery. I do plan on taking a trip."], ["Ayanna J.", "I only give a four because it was cold in the restaurant. The food was great and service was excellent. Well worth the drive from the Gateway Mall area. Everything is cooked to order. The Naan was great. Lamb saag and lamb curry - excellent, spicy but not overwhelming. The belchau shrimp was tasty (new item for me) and the chicken Tikka Masada was good as well (a lil sweet for me).  Will definitely be back. Owner should work on the heat situation for the colder months, it will prevent folks from dining in."], ["Enoch P.", "Phenomenal food and excellent service. Some of the best Indian food I've had. Glad to have a great new restaurant in Bushwick!"], ["Juan H.", "Worst experience ever. I ordered food through grub hub and the order updates and everything. 30 minutes past deadline for delivery I call the store, no answer. I call grub hub and they had to refund me because the restaurant was CLOSED! Get you shit together."]], "Taj Mahal": [["John R.", "I've been going here for years and have always had great food and attentive service. I especially love the mixed tandoori grill plate, its amazingly flavorful! The staff and ownership are attentive, but not on top of you. The wine list is also a very pleasant surprise! I particularly like the Tangley Oaks Cab or Amando Sur Malbac. HIGHLY RECOMMENDED!!!!"], ["Tiffany A.", "Found this via yelp while cruising the neighborhood for some Indian food and this place was legit!The atmosphere-- nicely decorated, great for dates or meals with fam/friends.The food was great! I was craving chicken tikka masala and my date ordered lamb vindaloo. Both were delish, we could have ordered just one of the curries as we ended up taking some home. We also ordered the meat samosa for appetizers, garlic naan (must get) and I couldn't resist the mango lassi! They gave us complimentary coconut custard to try and I'd definitely pay for it for dessert next time. Also, you can't beat the service! Our waiter was super nice and friendly and you can tell the staff works extra hard. Definitely give this place a try!"], ["Kongjing C.", "Went there with couple more friends once.    Had a nice experience    the waiters were friendly   they paid attention to our water.  They filled it up right away as long as it was not full     they food came in a very special Indian styled bowl  which is very interesting    I like their decorations of the restaurant itself too    and the food was tasty enough     would recommend to someone who wanna try something new and Indian"], ["Nina L.", "I have eaten here many times , and everything was delicious. However, last time I ate here was probably in september.  I came for dinner a few days ago (FEBRUARY) and was disappointed . Everything from the entrees to the appetizers was eh. It wasn't horrible but wasn't good either. I felt disappointed as I use to love this place. Samosa had no flavor , tasted like a pot pie rather than the samosa. The chicken dishes were also eh. Don't know if I will return .The service was good as always . Very kind, attentive waiters. Feels very relaxing and home like inside."], ["Chris D.", "Phenomenal cuisine, Try anything Masala and prepare you're tastebuds for pure delight. I always order papadum because those curried onions (side) are too delicious."], ["Jay M.", "Good food. What puts this place over the top for me was the level of service I received. Kind and attentive waiters. Endearing almost. Would return. Kulfi desert was delicious."], ["Jen C.", "YUM! I cannot believe I just found this gem in Bay Ridge. Been living here for years and just tried it last week. The food was delicious and what you would expect from an Indian restaurant. We ordered to go but will definitely go the coming week to eat in. While waiting for our meal (a 15-20 min wait on a busy Saturday), we were served their special \"Indian Spice\" tea for free! Tea, food (garlic nan, chicken biryani, chicken vindaloo), and service were great. Recommended to food fanatics!"], ["Susan K.", "Wonderful food and helpful accommodating staff. The spices are adjusted to your request as the food is made to order. We brought some picky friends that loved it too.I love the chicken liver and mugli pratha appetizers. The atmosphere is relaxing the decore is lovely."], ["Raoul D.", "My favorite Indian place for years now!- Classy as f*ck! No seriously. This place makes you feel like a king with how polite and customer-service-oriented the waiters behave and are dressed. The decor is very nice and pleasing to the eye, the music is some type of relaxing Indian tunes, the bathrooms have mirrors covering all the walls - SWEET!- These guys have some curries I have never seen in any other Indian restaurant. I'm a big fan of spicy Vindaloo, my girlfriend always gets the one with the bananas in it (forgot the name, don't have their meny on hand and the one up here on Yelp is NOT the full menu!) Bananas in a curry?! Sounds weird, but trust me, it's GRRRREAT!-While I usually prefer to dine in for the whole classy vibe of the place, their delivery has always been on point. Like all delivery, you lose the presentation (they do that really well!) because everything's crammed into plastic containers, but the food still tastes great and I've never had it arrive cold - but then again, I live like 2 blocks away.-Since Indian food is 'trendy' a lot of Indian restaurants will charge $15-$18 for an entree. These guys are cheap but don't be fooled! The quality is high and it's a GREAT bang for your buck.-I'd say it's a great place to go on a date to. Makes you look like some kind of Playboy McFancypants. Chicks love those."], ["Angela W.", "I love the whole atmosphere in this restaurant. Very inviting and comfortable. The food is authentic and delicious. Appetizers here is a must!!! A must go Indian restaurant in the brooklyn area."], ["Nicole A.", "Always always always consistent.  Best Indian.  Huge portions wether you eat in or take out and such pleasant staff.  Can't beat the prices either- especially with the portions.  Most times they bring free app and free dessert when you dine in.  Great!"], ["Tai M.", "Best Indian food I've eaten. They cook their meats to perfection. Service is on point. They also give you a  free appetizer and desert. What's not to like?"], ["Stephanie C.", "I can't believe it's taken me so long to write a review for this place. It's my absolute favorite restaurant in the world. Even I was lived in London for a while and tried a bunch of restaurants along Brick Lane, I found myself yearning for this place, where my love for Indian food began.Their chicken curry is amazing, and when you ask for it to be as hot as humanly possible, they actually listen. The vegetable samosas are super delicious, full of warm, soft potatoes, and the crust is so crunchy and buttery. The nan is super fluffy and I think dipping it into the curry sauce might be the best part.Service here is always exceptional. Since I get my curry so hot, I'm constantly chugging down water, but I'm never waiting for a refill. Once, they even smiled and set a whole pitcher by me. Fantastic.I love this food and these guys! Highly, highly recommend. Also very reasonably priced, and there's a movie theater nearby, the Alpine, that plays $6 movies all day on Wednesdays, so if you're looking for an inexpensive dinner and a movie evening, I'd say this is the area to be."], ["Sarah A.", "Love the soup but would never order anything with meat from here! Got chicken curry meat was gray inside . Tried chicken masala same thing so I stick to the vegetarian stuff here ! Mulligatawny soup and vegetable fritters ! Amazing"], ["Ballack U.", "The place was great. I went with my girlfriend. Ordered beer, 3 naan, chicken tikka makhani (which came with rice...I didn't know that). We got complimentary vegetable cutlets which was superb. Chicken was well cooked. Asked for cheque. Got complimentary coconut custard. Bill was $22.40 with tax.."], ["Doris D.", "I'm no Indian cuisine expert (meaning I'm Chinese) but this place is great and I've been to a zillion Indian restaurants.  We ordered  vegetable samosas (tasty), saag paneer (excellent), lamb in tomato sauce (forget the name but it was delicious), Taj Mahal Biryani (best I've ever had), plain naan (good), and jasmine rice (good).  You should get the mango lassi, it's fabulous. Like drinking a mango."], ["Mitch K.", "I blame this one on you Yelp!  I followed the advice of fellow yelpers and went to this place. I have had my fair share of Indian food in NY and I must say this is clearly the worst. Everything I tried tasted like a watered down, shitty version of what I normally get; almost anywhere else. I don't understand where any of these good reviews came from. Service was good, to be fair. Food was awful!"], ["Katerina K.", "I love this place! I've been coming here for two or three years now and they hands down have the best Indian food I've ever tried. My favorites have to be the meat samosas, buttered naan and the chicken tikka masala. They are to die for! I could eat that every single day and not get sick of it. If you haven't tried those three try them and thank me later!"], ["Jess X.", "DELISH!! Garlic nan was delicious! I am not a heavy spice person so their mild curry were all wonderful! (to me at least).  I had the chicken and okra with curry. I loved it! However, the friend I was with did not think the spice was strong enough.Nonetheless, it was a great experience and the food was great. The reason why I gave them 4 stars instead of 5 is because it took quite a while making our food... additionally, the garlic nan came at least 30 minutes later than our entrees, even though we ordered that once we were seated."], ["Rachael C.", "So we picked this place on a whim...it was open and someone suggested Indian. I've only had Indian a few times, but the menu looked pretty good, so I was excited. We sat down, and the waiters were attentive. A little too attentive in their water refills, but honestly, when you're dealing with a little bit of heat, no one minds that too much.I had shrimp curry. It was delicious! I was a little worried it would be spicy, but I was very surprised at how very mild it was. My boyfriend had the chicken saab. That was also really good. We also had an appetizer sampler, and that was delicious as well. So overall, the staff was great and the food was great. I would probably get delivery next time, but just because there was a little bit of a smoky (like cigarette) smell when we came in."]], "Delhi Heights": [["Alaysia J.", "Tried to order online, something went wrong with the system. Called to confirm, guy says it didn't go through and because of that, he tried to make me pay twice when I'm looking at my bank account and it says that the money was taken out. Finally get my food after an hour or so. It was not what I expected because the menu gives a brief description. One item said it came WITH bread so I expected to see some bread, not chunks of break lost in a pile of chick peas. Thought I was getting sautéed spinach and chicken but got a bowl of some red stuff with little and I mean little, green spinach pieces and chunks of chicken. Tasted both, didn't trust what I was eating because it was always lost in something.  Ate a little and my stomach felt weird. I threw it out. Eventually I waited till morning so I could get a muffin from Dunkin Donuts.Not to be mean but I had to keep it real. I like to try things at least once and I so wanted to like the food. (I was hungry, man. Waited an hour. I wanted to grub.)This was my first time trying the place. I walk by it every day but never really saw anyone. Only a few people every couple of days. Always wondered why. Welp. Won't wonder anymore -__-"], ["Ryan C.", "Best Indian Food in NYC. I don't know what the people complaining about the delivery service are talking about... Maybe they live miles away and habitually don't tip. I usually get my meal before I'm fully prepared to go downstairs and get it.    The Chicken Tikka Masala is the best, but I've been trying to eat more vegetarian, and the veggie dishes are also amazing, especially eggplant bharla (don't let its appearance fool you). Get a mango lassi, too.    I've also dined-in, and the service is great unless you get off on over-formality. The people are very nice and the service super fast, but maybe they are a little distracted... by the great Bollywood dance numbers always on the flatscreen!"], ["Rosanna A.", "Only dined here once and the food was delicious and authentic. Small restaurant but located on a quiet block. I came on a Sunday with my boyfriend and the place was empty. Normally I would be hesitant but it was a nice experience to have a restaurant to ourselves. I just assumed most ppl ordered for delivery - if I lived near by I would too!"], ["Quincy G.", "The service is good and most of the people that work there are really nice. But the food is just ok to me. While I would not call their dishes unpalatable by any means, I think it misses the mark on Indian food. . I just think of it as an alternative to  Spanish, Chinese, Crown Fried Chicken, or Soul Food in the neighborhood."], ["Amanda C.", "I ordered from Delhi Heights and was told the delivery would take 30-40 minutes. An hour later, I called and asked if my order was on its way yet. The (pretty rude) guy on the phone told me that it was already on its way and should be there momentarily. 20 minutes later, I called again to ask about the same order. He told me the delivery guy had just called him and that it would be there in 5 or 6 minutes. After ANOTHER 15 minutes I called again and told the same guy that the food still hadn't arrived, and asked about any potential discount. He told me that he couldn't do that because I already had my food, but that I could get a discount next time. After explaining that no, I did not have my food, and that I would not be ordering again, he hung up on me. I called back after another few minutes to cancel the order, to which he said \"Fine\" and hung up.Lo and behold, 10 minutes later, nearly 2 hours after I ordered, the food shows up. The restaurant had never told the poor delivery guy that we cancelled the order.The service was incredibly rude over the phone, and I suppose I can't rate the food, given that after nearly 2 hours of waiting, I gave up and ordered from somewhere else. Will definitely not be ordering from here again."], ["k m.", "The quality of the food is good. However, they are extremely unpleasant to deal with for deliveries. An hour after food was supposed to arrive, I called to inquire. They said: you're too far and hung up. I called back, they said the order would be there in 10 minutes. 30 minutes later the delivery still hadn't arrived. When I called back they said I'd ordered through Seamless, which would take awhile, and that if I wanted to make a phone order it could be there in 20 minutes. Clearly, my address wasn't too far, it was just too far if I ordered through Seamless. The food finally arrived cold, some 2 hours later than the initial estimate. There was no apology, no credit, just a lot of nastiness and yelling - and I have been a regular customer for several years. I wouldn't be writing this if it had been the first time it happened. But it's been happening systematically - four out of the last five orders. I will not be ordering with them again."], ["Santana J.", "Chicken Tikka Masala  the best."], ["Greg C.", "This place is great!! First time going. Got the mushroom/beef curry with a side of the garlic nann. Some of the best Indian i've had in a while. My girlfriend and I were the only ones there (eating in) but a few people got takeout while we were eating. The food was really great and it was very cheap. The bill was around $25 and we got very good portions. I'd recommend Delhi Heights to anyone who likes good Indian. The service was good although the waiter was a little quiet. Other than that, I am coming back here as soon as possible... probably tomorrow!!!"], ["Mike H.", "There are some foods that NYC just doesn't do well and, unfortunately, finding good Indian food while far from impossible seems to be one of the more challenging cuisines to find.  While this place was far from terrible, I agree with a few of the comments who said the food was bland.  I ordered the kati chicken, chicken pakora and naan.  Nothing really stood out except the rude service.  I'm not from New York and I've often been told I have to calibrate my standard of service to account for typical NY rudeness I won't do it, so Delhi Heights gets no breaks.  The gentleman who rang me up was rude and playing with his phone while I ordered.  No one said hi when I walked in..and there was only one other gentleman at the table. Most Indian restaurants I've been to have offered superlative service no regardless of how the food was. With that being said, given the mediocre food and terrible service I wouldn't recommend Delhi Heights.  I'm sure you can get better food somewhere else, even if the food is on par with Delhi Heights I'm positive your business will be better appreciated elsewhere."], ["Ebony T.", "Can I give 10 stars?? I was highly impressed with their food. The Chicken Tikka Marsala was awesome! I couldn't get enough of it, so I went back and purchased another order for take out. The chicken was very tender and the tomato cream sauce, incredible! The rice was super good, seems like they mixed spices and coconut in it. Needless to say, I will be back. Oh, and they gave me a sample of a creamy dessert that tastes similar to rice pudding. I'm not sure of the name, but it was good too. Overall, I give them 5 stars!"], ["Maurice L.", "The food is tasty.  Considering the long wait I am forced to think everything is fresh.  Service is soso."], ["Poindexter T.", "This is the best Indian food I've ever had in NYC and I am including not just take-out store fronts but all the sit-down places I've been to on Indian row and that place with all the crazy fucking lights (Milon)They have never fucked up my order, not even once, and I've ordered from this place dozens upon dozens of times. I looked up my grubhub history and I look like a crazy person sometimes ordering lunch and then dinner (on the same day) and often ordering from them 2 or 3 times the same week.Aside from me being able to rave about the food (except one miss, their ice cream was more like a frostbitten/melted-then-refrozen mess) they ALWAYS come in the window of time they claim the food will be delivered (though sometimes it's even earlier if you don't order something like their salmon, which I am a big fan of.)PROS - LUNCH SPECIALSCONS- confusing descriptions of menu items"], ["Jonathan L.", "I've ordered from Delhi Heights 5 times so far, and have had positive experiences each time.  The delivery is fast, and the food is really fresh and tasty.  Their rice is nearly perfect, everything is tasty, and the prices are right. We've also ordered with friends from other neighborhoods, and they were totally impressed also.  Finally a place I can rely on for fresh honest food and delivery in BedStuy!PS: Regarding the negative reviews below.  If you have one bad experience, and it's specific to an individual, don't leave a low star rating that will harm the entire restaurant permanently.  Stuff happens.  Give them another few chances and then make your decision."], ["Neo D.", "Pretty good food an a nice quite place to enjoy it in they don't serve liquor but they have a B.Y.O.B policy that sealed the deal for me, for those who don't know what that means its bring your own bottle"], ["Pete H.", "Consistently great Indian food. Service is always fast and friendly. Very happy with this place."], ["Kayla P.", "I ordered pickup so I definitely won't have the same experience as these negative reviewers.  I made my first order ever using yelp's ordering app. That was very cool, paying in advance and everything.  For a Saturday night,  my food was ready in no time.  I called when I got there 2 mins later to let them know I'm parked outside and check to see if they received  order and they  were already working on it.  I'm impressed by the speed of it all. The guy had me verify my phone number gave me my hot food and sent me on my merry way.  My samosas and chicken tikka masala were hot and delicious, still, by the timeb I got home. The only thing is when ordering samosas, I don't understand why they gave me chicken.  I thought the default samosa is veggie no? And I got two orders thinking I was getting two samosas but one order comes with two, which I wish was specified somewhere. Veggie vis ny favorite but it was still very tasty.  Love the convenience of it being walking distance to my house."], ["Jane P.", "Ordered delivery, which took 1 hour 20 minutes to arrive to my building on a Sunday at 2 pm.  When the delivery guy showed up to the building, he kept ringing the buzzer even though I was buzzing him through.  He finally called my cell phone and asked me to come down to pick up the food from the front of the building because he didn't want to leave his bike unattended.  I went down to meet him, but he wouldn't give me my food! He kept going on and on about his bike and at that point I'm hungry and just want to sign for my food!  Just seemed like a strange delivery process... The actual food is ok. I got vegetarian samosas which were *extremely* salty. Also ordered the chana masala and shaag ponir which were both alright.  Don't know if I would order them again.  Honestly, the best part of the order was the rice and 8 different sauces which came with the order.  All the other reviews rave about this place... so maybe I just caught them on an off day."], ["Andrea M.", "The Indian food in this neighborhood is sub par. My husband is from India and I will admit we are kinda picky.....not too much oil, the chicken can't taste like rubber ect... Not only was Delhi Heights super fast, but EVERYTHING we got was amazing. I ate it all!!! So happy to have found an amazing Indian rest. in Bushwick!"], ["J K.", "Just moved to the area from park slope.  I've been underwhelmed by the dining options in my new nabe, but thank god for Delhi Heights!  Their portions are HUGE and the food is on par with the better Indian places in the city.  I've ordered both lunch and dinner specials which come with Naan, rice, and several sauces.  , It is definitely a great bang for your buck (I had enough food for dinner, lunch and then some!)  Both times I alled and  picked up the food so I can't speak to the wait service or delivery service."], ["Jocelyn K.", "Most of the negative reviews are about their delivery service. I have only eaten in the restaurant, which is clean and comfortable. Food is great and owner is wonderful when you get to know him. Go in and sit down instead of eating on your couch! Well worth the trip."]], "Kanan Indian Restaurant": [["Chris M.", "My girlfriend and I just attempted to eat our meal from here, but it is probably the worst indian food I have had in New York. It's really unfortunate that our $30 meal was not worth it. We ordered daal Turka, naan, rice, tandoori chicken, and 2 drinks. When the meal was delivered the drinks had been forgotten. The daal was very bland. There was no flavor and it was very watery. There was hardly any lentils in it. The naan was soggy and the texture was just very off. The tandoori chicken was decent, but still below the standard of many other indian places I've tried. My girlfriend and I spent 4 months in India, and while we didn't expect the same quality as we had over there, we expected an indian run restaurant to be able to satisfy our craving. This was unfortunately not the case. Worst $30 I've spent in a long time."], ["Remmos F.", "I work and live nearby and order from here frequently. I have gotten takeout/delivery and dined in. The food has been consistently fresh, flavorful, and fantastic- definitely some of the best Indian food I have had in South Brooklyn. The ka-chori appetizer is a standout- I need it at least once a week!"], ["Eric C.", "Always great portions, decently fast delivery, naan is some of the best I've had. Go for delivery, always."], ["Grant A.", "Quality Indian food at good value (which isn't easy to find in BK). Very friendly service and good turn around time for take out."], ["Joe S.", "Food was hardly outstanding, delivery time was super slow.The roti was overly chewy and mealy - not crisp like a good tandoori roti ought to be. I asked for the food to be spicy (and it's pretty obvious from my name that I'm Indian, in case that might have been the confusion...) and it was barely medium.I may have to try it again, and it's possible the reviews are just because it's a wasteland out here in terms of this cuisine, but, hell, by my accounts, even Ramna, right nearby, is at least as good or better."], ["Erin C.", "Delicious every time!In addition to doing a great job with our favorite dishes, the owners or managers here really went the extra mile this evening to correct an error with our delivery order on a busy night. They quickly brought us our missing curry and were very, very sweet. We've had great aloo papri, samosas, korma and paneer bhurjee."], ["Elizabeth L.", "Pros: Top notch Lamb Rogan Josh and vegetable curries, great naan, delicious indian pickle, quick delivery every time.Cons: Watery chicken curry (only dish I've been disappointed with - gave it two chances!), protein is sometimes on the dry side, sad veggie pakoras.Conclusion: Every indian restaurant does some dishes better than others. Once you figure out what you like from this place, you will never order from another indian restaurant in this area again! Also: While the Indian pickle is delicious, the portion is HUGE ($2.99). Far too much if you're only going to be eating it with one entree. I'd like to see an option to add a smaller order for $1.50."], ["Sasha K.", "Kanan is my go to Indian delivery in Park slope. Everything I've had is great, especially the chicken vindaloo and the veggie samosas are awesome! Quick delivery too! This place never disappoints."], ["Caroline B.", "Solid Indian delivery (haven't been in to eat). I've ordered here a few times, and I've enjoyed it every time. The mint lassi and the lamb sagwalish (lamb in spinach) are really good. Chicken tika is also very good.The delivery is always quick and the food is hot when it gets here.  A great addition to Gowanus!"], ["Lee P.", "After reading the good reviews, I decided to stray from my usual indian take-out spot and try Kanan. Our food was so fresh and delicious! The chicken tikka masala was so flavorful, and we loved how fresh and tasty the sag panner was. Delivery was fast friendly. A great choice!"], ["Elena M.", "Delivery was very fast, less than 30 minFood: so fresh and tasty. I got their appetizer, entree and plain naan for $13 deal. I got a good amount of food (will last me 2 meals) Vegi samosa and chicken tikka masala were definitely worth it."], ["Bjorn P.", "We had Kanan cater for a going away party we held in our apartment building. We went to Kanan to meet with the chef, plan the order and even sample some curries - the mushroom was excellent. The restaurant itself is a hole in the wall but apparently the chefs are from Saffron in Jersey. We ordered the following:- Naan: Standard- Rice: Standard- Malai Kebab: tender and very tasty- Chicken Tikka: tender and tasty- Paneer Tikka: Big chunks of paneer cubes - very good- Chana Masala: Standard- Daal: Very good - the Indian aunties loved it- Chicken Curry: Excellent. Tender, juicy and flavorful They delivered the appetizers first and then delivered the mains. They came right on time and didn't skip a best. We will definitely order from Kanan again. Thanks Kanan!"], ["Mable I.", "Hard to find a good let alone great Indian food in Brooklyn until I ate here. First from the outside you will be hesitant to walk in because it really is nothing to look at from the outside. If you were not looking for this restaurant you will walk right past it. Inside my first impression is pretty basic no frills. So I order & the food came,I ate & ate & ate. Atmosphere...who cares! No frills who cares! Once you you taste their food its really full of the flavor that is lacking in most indian restaurants in brooklyn. I had Chicken Vindaloo,Chicken Tandoori,Bhindi Masala & Goan Shrimp, & Naan. Every dish was as flavorful as the next. I really didnt quite expect great food on 1st impression but never judge a book by its cover!Kanan dont loose that great chef!"], ["Alex D.", "Desperate for Indian food in the Gowanus-Red Hook area, I was really happy to see Kanan open up. It was a mixed bag, though.Pluses: the dal makhani was pretty decent, the naan was fine, the people were friendly and on top of things.Minuses: the chicken curry was just terrible. It was made up of chunks of chicken breast in a thin, pale-yellow gravy that didn't taste like anything. I had ordered the chicken curry because I wanted a masala made with onions cooked dark, lots of spices, etc. and this was the opposite of that.Also, Kanan is one of several area Indian restaurants that give out pudina ki chutney that is fluorescent green--clearly the product of a laboratory."], ["Jed B.", "Very delicious Indian food served quickly with very friendly hosts.Can recommend without hesitation."], ["Rosalie N.", "Had a great meal in the restaurant but I decided to try delivery tonight and I was very impressed with the speed at which my ordered was delivered. I ordered 2 delivery specials and the portion sizes were plentiful and everything was delicious except for the mulligatawny soup. I've it at other places in the city but this just tasted like hot water. It was very bland. I tried to add salt but it just seemed to be lacking some essential indian flavoring, it was also very oily. I will order from here again, just not the soup."], ["JoAnna D.", "Joy! Good Indian in the slope! FINALLY. Every time we order delivery we get the delicious, al dente, tandoori vegetable appetizer and it is to die for. We've also had the Onion Bhajia, Dal Mahkni, Chicken Curry, and Chicken Achaari and all of them are out of this world. The Chai is delicious too. Unfortunately, the kheer could be better...but the food is so good that I don't care. Plain naan was even good."], ["Christina V.", "Completely solid Indian food! I haven't ordered Indian in forever and I'm always skeptical to try new places but this was flat out amazing. Their chicken tikka masala was perfect. I got the combo meal where you get an entree, appetizer, rice, naan, and chutney, and I'm stuffed for under $20. Also the veggie samosas were great with the darker reddish chutney (mango?) the delivery guy felt horrible that it took so long (I ordered off grubHub) but the food came hot AND fresh and I'll definitely order again!"], ["Malika W.", "Lovely attentive service, and the food was delicious! It's byob so next time I'll definitely bring a bottle of wine"], ["Richard F.", "Don't waste your time on delivery unless you just finished your previous meal. They take forever and when you call the guy has no idea which delivery driver took the food. How they run a business is beyond me."]], "Ashoka Indian Grill": [["Bee K.", "my favorite Indian spot to order from!* food always warm, seasoned and cooked well with good sized portions.* the delivery-guy is always on time and polite.* I love the different naan breads and vegetarian options"], ["Tarita H.", "This review is for take out. I usually order to go AT the restaurant or phone in orders for pick up. I absolutely adore this place. After my formerly favorite Indian restaurant in Park Slope went to the dogs I couldn't believe my luck when I stumbled onto this place.Pros: Food is fresh and well seasoned. Indian cuisine can be very spicy but Ashoka's dishes are never too peppery.They have a very balanced mix of oriental flavors.Affordable prices and large portions. There's always leftovers when we order from here.Staff are so sweet, polite and helpful they always make you feel welcome.Cons:Service can be slow BUT that's because it is clear that food is prepared fresh to order. However, the longer you have to wait, the more freebies they give you. (Usually bread, samosas or kheer.)So far I can vouch for the curry liver poori, channa saag, curry salmon..."], ["Ahmed M.", "Man, the pakora was nasty.  The kebab were microwaved.  The prices were too damn high!They brought us taco shells for an appetizer until the food came.  The hell do I want to eat taco shells for at an indian restaurant.  I ate them though lolThe butter chicken, chicken pea masala, and nan were off the chain though!  I dipped the garlic nan into the butter chicken and scooped some chickpeas on top for an incredible bite.Service here is good, they try hard to be helpful but yet again I was the only one in the restaurant so I better have all through attention!If you come here, get the butter chicken and skip the majority of the other foods because they are nasty.  Oh the prices are way too expensive, you get only a few pieces of butter chicken for 10 bucks.  I can go to jackson heights and have an \"all you can get buffet\" for 10 bucks.I might come back for nan n chickpeas."], ["MJ H.", "Delicious selection of vegetarian dishes. Great flavor and great service! whenever I am town I make a plan to order tons of indian food from Ashoka. They are courteous and provide great and speedy service. But most importantly the foods are well prepared and absolutely delicious! very lucky to have them in the neighborhood!"], ["Meghan F.", "Really really good food. Usually delivered in about 30 min. The delivery guys are really nice guys too- not that I require that in a delivery guy but it stands out."], ["Carina C.", "This place is delicious. Never ate in the restaurant but always got takeout. Always delicious and they had a dinner deal with naan, your choice of curry and an appetizer. I definitely recommend the lamb curry and the samosas. The naan was hot and fresh. This is one of the best Indian food places I've ever tried. Oh, the prices are great!The only downside is the location - it's quite terrible. It's even far away from the junction, but it's still the only decent thing next to the Brooklyn College \"dorm.\""], ["Sreenadh P.", "As an Indian & a foodie. This place does not serve authentic Indian cuisine. It's just a subcontinental mix.The kabab was burnt & each piece was a different flavor. Chicken tikka masala lacked the strong flavor."], ["Tashana B.", "The food is pretty freakin fantastic. I was pleasantly surprised by this place. It's very easy to find right on Flatbush Ave just a few blocks from Brooklyn College. My friend and I came here for some good Indian food and that is exactly what we got! She ordered the chicken Tandoori and I got my standard chicken tikka masala for $11. Both were really really good. Especially the chicken tandoori! The food took forever to come but when it did, it was well cooked and fresh off the grill.My pet peeves: I'm not sure if someone called out for the night or if they usually are not busy but there seemed to be 3 people on staff that night: 1 person cooking, 1 person making deliveries, and one person waiting tables/answering phones. This annoyed me because it made the service a little slow, keep in mind, there was only one other party in the whole place and service was still slow. If the food wasn't so damn good I'd give this place two stars. The delivery dude continuously opened the door, understandably, but this invited the 15 degree weather to come in and greet us which wasn't fun. All in all, if you want amazing authentic Indian food for a good price. Please do come here. It is worth the wait. I will be back here since the food is delicious and since it's right in the neighborhood :) Honestly, even if it wasn't in my neighborhood I'd make the effort to come back. That's how good the food is!"], ["Sumyia H.", "I got the chicken tikka masala and requested the waiter to make it spicy. Since I ordered the lunch special it also came with warm naan and basmati rice. I really didn't expect the food to be as flavorful and delicious as it was! I dipped the warm naan into the tikka masala sauce and it was just perfection! Service was also really prompt. At the end we were given a complimentary sweet dish called kheer which was a perfect way to cool down my pallet after my spicy meal lol. I will seriously be coming back here if I'm ever in the neighborhood!"], ["Mark M.", "This place is simply amazing. Brought my fiancée's Indian family here, and they loved it. Great grilled meat and flavorful curries. I though they really went above and beyond to serve us with great care and thoughtfulness."], ["Melissa K.", "This is my go-to spot whenever I'm in town.  Of all of the Indian restaurants I've been to, I've never really been to a bad one necessarily but this one is the absolute best.  The flavors are truly authentic and rich, the service is amazing and the delivery is very quick!  I highly recommend the chicken tikka masala, saag paneer, garlic naan, rasam soup, and mango lassi.  I only write reviews for places I think truly deserve 5 stars and this one is one of them.  I love supporting small businesses."], ["Glenn L.", "Amazing. An Indian restaurant that's actually owned and operated by Indian people. The food is great. I got the chicken tikka masala with Naan, as I don't like basmati rice and it was amazing. It had a ton of flavor and they gave me enough to last two days. I'll definitely be going back for the samosas and the mango lassi was also AMAZING. The pricing was right, the staff was great and welcoming when I went in there to pick up my food. When it comes to the atmosphere of the restaurant it's definitely casual, it's nothing fancy, but that's how I like it anyway. I didn't actually sit down and eat in but it's just what I noticed while I was there. Anyway, I'm definitely going to order from this place again, I highly recommend."], ["Jennifer A.", "Decent service, maybe it was just a busy lunch hour that they forgot about our check. I can appreciate that they don't rush you when it comes to serving each meal. The lunch specials under $10 is a great deal, it comes with naan and the curry is pretty good. I've tried one of their poori which was delicious (onions and parsley), soft, fluffy and well seasoned. I'll be back to try their other tandoori dishes; their salmon was on point."], ["Nwade O.", "It's a small hidden Gem that I found walking to work one day. There tiki chicken masala is on point. The only 1 dislike that I have is that they always bring a small bowl of Rice but if you ask for extra Rice they will give you without a charge. One of the Best Indian Stores on Flatbush Junction."], ["Kim V.", "Love this place! Good prices and generous portions. Everything we ordered was delicious. We went for dinner and got the tandoori mix grill, chicken tikka masala, naan bread, and this curry chicken & pea dish. The staff was very kind and friendly. They even gave us complimentary mini appetizers and mini desserts! We'll definitely be coming back."], ["Mictian C.", "Delicious food and super prompt delivery. Loads of vegetarian and vegan options if you swing that way, or simply don't feel like tearing into flesh."], ["Jenn J.", "The waiter was very nice and polite. I ordered a lamb vindaloo with mild spicy and it came out just the way i liked it. Everything was on point with the exception of the clogged restroom. I will definitely come back again with my date :)"], ["Anthony H.", "I've ordered from this place about 5x now on seamless. I  order the Chicken Tika Masala and Chicken Malai with Garlic Naan each and every time! They are very quick about 20 min and the food is always hot. My above order is roughly about $30 and worth every bit of it, especially delivered to your front door. I  have tried the Mango Lassi which is two thumbs up amazing... The Keema Naan was not my favorite and I would never order it again. Enjoy!"], ["Jelani R.", "Took mom here for Mother's Day, we were skeptical at first, but Ashoka Indian Grill came through!!!The Samosa is a perfect starter for any group....Then we followed up with Rice, Paratha, Lamb Vindaloo and Goat Vindaloo The dishes were SPICY, but perfect and tasty, full of FLAVOR!Negative: Server was forgetful of our drinks, but hey the food is WIN, would definitely come back...!!!!"], ["Ammu K.", "Being Indian and living in Midwood, BK means we have a lot of bagels, sushi and pizza around town.  Craving some Indian food after a long day of work--GrubHub came to the rescue and offered Ashoka's menu to my hungry eyes.While their delivery time is usually a bit off (they take a bit long to deliver) their food is pretty good.I'd definitely recommend their Keema Naan (minced meat inside yummy naan).  It's SO good.  Their biriyanis are also delicious.  I have not eaten at their physical location, but the food they have brought to my place several times has always been great.  Check it out!"]], "Bombay Masala": [], "Mashallah Sweets & Restaurant": [["Allstar I.", "This restaurant is the best and the finessed restaurant in the whole Brooklyn this restaurant has the best food the best service. MashAllah has a party/ family hall there food is amazing for the lowest and the best price. This is the best Pakistani,Indian food. I really recommend this place it is super good. The staff is really nice."], ["Pamela M.", "I frequently go here when I am in the mood for authentic Indian food. I find that the flavors and prices are better than those at the places that are tagged as Indian Restaurant.Aside from taste the way the food is sold is also different. You pick the size container you want for a certain side and you buy the side. Typically I opt the the smallest container and pick four different sizes this ends up costing $12 including the fresh naan. I always opt out of the salad because I don't care for it and I never buy the rice since the bread is better.I have never stayed to eat because the place seems more like a locals spot .... If you visit you will understand what I mean. Most recently they started accepting cards which is definitely an added benefit.Service can be a little slow hence the 4 stars."], ["Lane H.", "Great find in a neighborhood where there are few restaurants and fewer late-night choices. Mashallah is clean, well lit and friendly. The food is well spiced, and you will find good variety, big portions, all for a small price, open 24/7. -1 star because the food is held cold in trays and heated for each customer, resulting in some cold spots."], ["Tamara F.", "We really enjoy eating here because they offer different size dishes so you can get a little bit of a lot of different dishes and try them all. A side salad comes with the meals that has a riata dressing that is super yummy (no sugar added, don't know why so many places add sugar to the riata). Order at the counter and eat in but save a few dollars not having to tip a waiter, which makes it a great place for stopping in often and filling your tummy with delicious food. Only thing is, I prefer my food pretty spicy and that's not going to happen here bc the food is pre-prepared. Overall, an excellent place for a quick, affordable, yummy meal."], ["Shoaib T.", "Ridiculously Expensive compared to other restaurants in the neighborhood. Worst Service. Will not hesitate to charge you extra."], ["James H.", "LOVE IT! Excellent dishes, tons of deserts to choose from and priced just right. 75 cents for a samosa? $2.50 for garlic naan? Yes please! The staff is super friendly and the service is fast. Excellent!"], ["Oksana B.", "I like the fact the day open 24/7 their food is amazing everytime I'm in the neighborhood I try to stop by there just to grab their food and I love their lambs"], ["Rashid B.", "I love this place! The food is amazing! I always stop I if I'm in the area passing by and I'm hungry or getting my car detailed I'll spend the 30 minutes here! They're food is amazing! Try there naan and their fried fish also! The kababs are great! And their curry sauced Chicken or lamb is amazing too! Their veggie mix is to die for! Lol I'm getting hungry just thinking about their food!"], ["Tisha A.", "Since I am a vegetarian,I have limited options when it come to pick a dish.I mostly get Chana masala with rogini naan.Everytime we are around this area,this is our go to place."], ["Joseluis A.", "my friends live around this neighborhood so i yelped for economic places to go eat and this place popped up. they serve buffet style. i have no idea what i ate. i asked the guy behind the counter to hook it up for me. he asked if i liked spicy food and and i said no because some people are not sensitive to fire and i am. I'm afraid most customers at this restaurant eat way more spicy food than i do so i rather play it safe.my meal was awesome. it even came with a small soup as a  side. i don't remember how much i paid for this but i want to say it was around 12 dollars."], ["Pia B.", "Excellent Staff!! Always Pleasant whenever I visit.. BEST PAKISTANI RESTAURANT IN NYC!! Not to mention the food is always delicious!!"], ["Usman A.", "My mother, sister, and I came here two nights back for sehri and a real late late night dinner or breakfast, whatever you want to call it. We had some awesome Chanay Bathuray (Puri), Kebab Roll, and Kashmiri Chai. Shami Kebab was kind of nasty, I have no clue why my mom ordered that, but everything else we ordered was really good including the Halwa Puri. Service was fast and precise even though the restaurant was packed at 3 am in the night...lol. We had a great night and they had a great atmosphere with a total Pakistani feel like you are actually enjoying Ramadan in Pakistan. Of course the neighborhood has to do something with the whole atmosphere part of this review. Would definitely recommend this place and me and my sister asked the guys behind the counter if we can have those shirts that they wear because we would definitely rock those MashaAllah sweets polos and t-shirts."], ["Naz I.", "Only reviewing the days since it's the only thing I got. Came in on a late afternoon/early evening cause I was passing by the area and had the munchies. Ordered a box of assorted sweets and each one of the were on point. They all tasted fresh. They have other hot dishes available on the spot and for ordering. I tempted since all the food smelled sooo good but opted or for the sweets since I was on the go and in a rush. Ps. When reading Desi food one should sit down and carefully devour one's food because curry is a B to get out of your clothes"], ["G L.", "Really good food. I've been there twice and tried different things and were all delicious and true to the cuisine. Really good naan bread, chicken biryanni, mango lassi and of course an outstanding rasmalai to finish the meal. Inexpensive and spot on. My only suggestion to the restaurant is that they should invest in real plates and silverware for the patrons that choose to dine in. The styrofoam plates and plastic utensils are annoying to use, really bad for the environment  and should only be reserved for the to go orders. Overall great place."], ["Lauren C.", "Woah this place is so good and insanely cheap. A friend and I found it thanks to other yelpers. We had a variety of items: naan, butter chicken, daal, chana, and some other things we just pointed to because they looked great. Everything was so flavorful and perfectly spicy. The service was great and everyone was super friendly. The best part is the kulfi cardamom flavored ice pops near the door.  We wished we grabbed a few for the freezer. They are the best I've ever had. This place was a win and we'll definitely be back.Tips: there's a counter where you order and the food is in hot trays. You can eat there or take it to go. If you eat there, you pay after and they give you some yogurt, a mini salad and a pitcher of water. Also, it's 24 hours!"], ["Margot C.", "Super fresh food, especially when you get there right at lunch. Generous portions. Too much to choose from. Wish things had a bit more punch, though. But at least I know what I'm getting when I arrive, and that makes me happy. And, women, be patient. Men will always get served or acknowledged first."], ["Shamira A.", "Went to this place at 5am in the morning because we ended arriving in Brooklyn late and went straight to bed. This place was great! We had two roti's and a garlic naan and some lamb curry that was recommended to us. When we were there, there was some drama amongst the local Pakastani's which was probably what made the experience so good! If you dine in, you get one dessert on the house per person!"], ["Eatery F.", "I was first introduced to this place by my in-laws. Great place for a family hang out. Good food quality wise and quantity wise. I love their biryani, chicken haleem, naans, goat curry, falooda and other sweets. The best thing abt this place is you get to see your food first and ask to taste it before you actually order a whole plate. Shehzaad- one of their staff is great and courteous. He works with you according to your tastes and likings. I keep going back to this place to eat in and take out. Haven't been disappointed so far. Two thumbs up!!!"], ["Emma L.", "This place is awesome. Super affordable food and sweets that are super satisfying. Great for late night snacks as well!"], ["Tamoor H.", "The food taste has deteriorated over the years, used to be really good when they opened. The currys are pretty tasteless and bland now and so is the grilled food. The best thing they still have is the falooda which I think is the best on Coney island ave. The mithais are ok but nothing fancy."]], "Asya Indian Restaurant": [["Peter D.", "Manchurian Cauliflower. That's what they call their best dish. What it really is? General Tso's Cauliflower. And it's as good as you'd think. It tastes like syrupy, Americanized Chinese takeout, but without the factory-farmed, over-breaded chicken.Unfortunately, the rest of the actual Indian food has fallen off in consistency, but I still order from Asya sometimes because of the Manchurian Cauliflower. And because the garlic naan is still garlicky and naany."], ["Angela C.", "This service is horrendous. I placed an order on seamless and I didn't get a confirmation email saying they had received my order. Then I called THREE times and here's a little play by play of what happened.Call one- they told me my order was on the way and when I asked what address it was going to, they hung up on me.Call two- the order they thought was mine was not; when I told them seamless had charged me they told me they closed 20 min ago and hung up on me.Call three- I called them back after receiving a text from seamless saying I would receive my food in 30-49 min. They said oh, oops. Then hung up on me.Still no food in sight."], ["Gary M.", "Saturday night at 7:00 we order. At 8, we call and ask for a status update. \"5 minutes,\" we're told. At 8:20, we call again. Once again, apologies are offered and we're told, \"just 5 more minutes.\" At 8:40 we call a third time. This time, we're angry. The staff is unresponsive. They show no concern whatsoever that it has now taken them one hour and forty minutes to deliver food a few blocks away. They seem more annoyed that we're bothering them by calling. One hour and forty minutes. That is neither hyperbole nor exaggeration. One hour and forty minutes.     Just after our third phone call, by coincidence, the food arrives. It is ice cold. As far as taste, the worst offense was that the food was bland.  It was as if they'd forgotten to spice it. The chicken tikka was better than the saag, but only marginally. The kick that usually comes with these dishes was missing entirely.  Even a staple like samosas were just mediocre. They simply lacked flavor.    With so many better options (for both food and service), and with competition so fierce, it is unlikely I would try Asya again."], ["Samantha Q.", "Come here at night or when the sun is setting and the interior  brightens up. It's lovely.The service is ok. Our waiter was a midle aged man, thr type who doesn't say much, just takes your order and appears like once again. There was a woman filling up our drinks constantly. She did a better job being attentive.The prices of the food were reasonable and the flavor was great. Appetizer we got was chicken Tikka. The chicken was so moist you put a fork in it and it'd break apart. Then we got Behl Per? It was served cold and it had 2 flavors, one that tasted liked a light bbq sauce and another like a cilantro spicy lime sauce mixed with veggies and chutney.Entree I had a Korma. The texture of the sauce was a light slightly dense buttery melt in your mouth almond sauce and the chicken moist as well.Don't be fooled by the small bowls. The food is filling!Only thing I didn't like was that when they asked us what type of Naan we wanted. I thought it was complimentary since they asked us but they charged $4....Definitely an interesting place to check out, however with mediocre service."], ["Kashif K.", "Alright, alright; so once again, after exactly two months, my OCD got the better of me. Asya offers the sloppy pav only for lunch, only on weekdays, and only for delivery (no sloppy pav for dine-in customers). This limits the enjoyment of this piece of divinity to those who work near downtown Brooklyn... and to the likes of me! Once again, I procured a hotel room in Brooklyn Heights, worked remotely from Brooklyn on a Friday, and ordered three beef sloppy pavs for delivery. The sloppy pav is an Indian take on sloppy joe sliders. The mini buns are stuffed with tender and moist short rib that is braised with spices and black cardamom, which makes it flavorful and aromatic. It comes with masala chips and a side of jalapeno aioli. I requested the restaurant not to put lettuce and tomato on my pavs (those \"veggies\" just don't belong in a sloppy pav). I also requested an extra side of the jalapeno aioli, which I added to my already moist and tasty sloppy pav; and that, my friends, took it to yet another level of deliciousness! If you work near downtown Brooklyn, or just happen to be in the area during the day on a weekday, I would highly recommend trying this delectable treat. If you don't like it, you're just not worthy of my acquaintance!"], ["Aparna K.", "I was super excited to find one more Indian restaurant in the area but after coming here,I think Ill just stick to my usual place .To be fair,on the positive side,the decor is awesome,beautifully carved artwork and very desi looking lighting. Everything good about Asya seems to end there.The service was less welcoming than I am accustomed to but maybe they were having an off day.First of all,the specials(if there were any) were pretty confusing,outside on the board its written 50% off,on the menu kept outside,its 25% off and includes a $9 lunch combo  while the menu inside the restaurant  doesnt seem to have any specials at all.It would be so much better if there was more clarity.I have enough analysis to be done at work without trying to deduce things in my lunch hour too.We had decided to have the lunch special combo since our curry preferences are very different and ordering one entree per person would be way too much food.Well,turns out if you dine in,you cant get the lunch combo.umm what?!!why??You just need to give me exactly the same food on a plate and i swear I wont eat your plate!!Since we were seated already and didnt want to be rude,we didnt walk out and agreed to split one entree which didnt seem to sit well with whoever came to take our order!After reading some reviews on the quantity of food,I decided to get a chicken tikka appetizer too,hopefully making him happy.The food took forever to come out and even though it was okay,the quantity and taste does not warranty the prices they think each dish is worth.The asya baingan was brinjals in onion tomato gravy,tasty enough but a tiny portion for $12.The chicken tikka was flavorful but nothing you cant get in any and every other Indian restaurant.The lunch is cash only in case you miss the tiny sign hidden behind menus on the table out front. I do hope they can step up their game because it would be nice to have another decent Indian lunch option near work but for now Curry Heights is gonna get my business."], ["Jessica L.", "I would give this restaurant 10 stars if I could.The space is charming, comfortable, and authentic. The food is extremely flavorful. And the service is the best I've received in Brooklyn -- Anthony is fantastic.Highly recommended."], ["Kiai K.", "If anyone who has been around remembers Brooklyn in the year 2000, tourists would be lucky to find 4 star food that wasn't pizza by the Grimaldi family. Service at 3 stars was also hard to come by unless you dined at the River Cafe.An Indian place with romantic lighting, tasteful decor, soft banquettes (though a little low for eating at tables), and a decent wine list, this place already has 4 stars. The service is okay but not 5 star. Seems like a family business. No runner or bus person in sight. Just a couple working the floor for about a dozen tables. I stood at the door for a minute or two before getting seated; the couple was racing back and forth with barely time to turn the music on. I ordered the sprouted moong beans appetizer, the stuffed eggplant, garlic naan and a glass of Pinot noir. My body was craving something raw and the sprouts hit the spot. The eggplant dish was full of well-blended flavors that would make foodies question the spices. The wine went well with both. The garlic naan added to the flavor without being drippy with butter. It was dry but ready to melt a pad of butter. With the tomato base of the eggplant dish, it didn't need any oils. There are not many Indian restaurants that I like. What I ordered here beats everything I've had in the 3 or 4 places I've been to on 6th Street in the city. And the couple really cares. One day maybe they will have a runner or busperson. For now, it's \"family.\" Enjoy it and say hello to Anthony."], ["Lisa H.", "My new found love for Indian food started here. Everything was so good. The dishes that stood out to me were cauliflower manchurian, samosa, chicken korma, and the naan. Even the rice was amazing.  The restaurant itself didn't not have a strong scent which I truly appreciate. The meal was almost perfect. They should work on their customer service skills. It wasn't a big deal but were were rushed to order and at one point it felt like the waitress was yelling at us. All in all, thanks to this place I now love Indian food. Woot!"], ["Rashad M.", "I stopped by this restaurant for lunch today, and it was the worst restaurant experience I have had in a long time. The man is highly rude and racist. I was eating my appetizer and taking a phone call when the man walked over and told me to eat before the food got cold. I watched the service that other customers received and compared it to mine. Never again. Not to mention that they wait until you have eaten to tell you it's cash only for lunch. Never again."], ["Supragya D.", "We went to this place after walking down Brooklyn Bridge. Service was horrendous to say the least. As some other folks have noted the food is decent enough to although the the portion sizes are small. Staff was pretty rude and ostentatious to say the least. Refused to provide any recommendations. Old lady was aggressive and pretty rude. Sample the following gems from a single visit.. Won't visit ever Quips were like - Everything is special. You guys have to decide for yourself. - Our veg options are very limited. Try what is available. - if it's not in menu then it's not available. That's common sense. (To a 8 year old asking for an item) Avoid if possible .."], ["Nyota W.", "Never been to the actual restaurant, but I recently ordered food for delivery and was completely content. We ordered the sag paneer, samosas, garlic naan and tandoori chicken. Everything was pretty dang tasty. Was it the best meal ever?- probably not, but I have no complaints and was really content with my meal. Even the leftovers maintained its good flavor and quality. We all know that doesn't always happen. As my order was delivered, I can't speak to ambiance or in restaurant service, but from a delivery perspective- the food came in a timely fashion, as promised, and was accurate. This is winning from a delivery order perspective- trust me!"], ["Aito M.", "My sis and I were craving indian food and came right to Asya after class. We ordered the Naan Keema, the best naan I've ever had! It has a nice lamb filling with just the right crust and consistency.  For entrée we had Chicken Vindaloo and Lamb Kochin and both were pretty amazing! I am a spicy addict, and I would have to say the vindaloo was spicehh !  I would recommend Asya if you are in Brooklyn. And you gotta try their naan!! Best of all, you get 25% off during lunch hour"], ["Dylan K.", "I'm going to state this up front--I didn't eat here. But honestly, given their service and horrendous prices, why would I?We were excited to scope this place out for Dine in BK week. Upon getting there, we were promptly informed that no, they aren't participating in the deal for lunch--only dinner.Cool, we thought. They're offering 25% off lunch. We'll stay.We were ready to order in minutes, but ended up waiting 10-12 minutes because the woman decided not to take notice of us, despite trying to flag her down multiple times.Prior to ordering, we were informed rice was NOT included with any of the dishes. Um...what kind of Indian restaurant doesn't give you rice?! It was $6 for typical basmati. Outrageous.We left, and at those prices and absurd policies, why would we stay? Avoid, unless you want overpriced nonsense."], ["Kristia B.", "Great location in Brooklyn Heights. Though there is no outdoor seating, they did open the front door and windows to let the natural Spring breeze in. I loved the leather cushion seating along the brick walls. The music was low enough to add to the ambiance without preventing you from conversing with your party. The decor is simple at best with a few religious pieces. There is only one bathroom towards the back. This is definitely a family-owned business, because there were no servers - just two individuals. They're not really big on conversation and at times it took a little more effort on my part to grab their attention. Patrons moved in and out pretty frequently so you won't experience a long wait time if you did not reserve a table. I ordered the samosa (pastry filled with potatoes and peas) $7, saagwala (chicken with fresh spinach) $14, garlic naan for $4, mango lassi for $4. Food as always when it comes to Indian cuisine rarely disappoints. The spices and flavors were there. It was a hearty meal that I most certainly enjoyed. I had to walk it off a bit, because I was so full. The tab at the end of the night was easy on my pocketbook. Thumbs up!"], ["Sol C.", "I was quite disappointed... I had been so hungry and couldn't wait for my seamless order to arrive. Asya had a dinner special for $18 that included an appetizer, entree, rice, naan, mango chutney and raita. Sounded great to me!  Maybe I made the wrong selections but my appetizer was not even remotely good. I had ordered the aloo papri, which was described as potatoes, chickpeas and crispy wafers mixed with chutney. Bad idea to order this take out as it was completely soggy by the time it arrived and I couldn't eat more than a few bites.Then came my entree, the classic chicken tikka masala. It was not rich and creamy like I hoped but quite watery. Again, so disappointed! Everything was just a bit off with the meal. Very unfortunate."], ["Sarah S.", "I had a wonderful dinner last night all by myself...very comfortable place to eat alone, the food was great, and the service more than exceptional. I'll definitely go back."], ["william p.", "This place advertises... 5 days a week mind you... for 1/2 off lunch special. I went in yesterday and discovered they give you 1/2 a portions at half price! 4 piece Chicken Malai Kabob, $8 app at night is a 2 piece Chicken kabob for $4 during the day.  I tried to explain to the manager that this is false advertising and to bring me full portions. They refused."], ["Terry M.", "My friends and I was very hungry so we could eat anything and anything will taste good kind of mood. But when we sat down there was no body helping us for about 5 min and there was only 3 other tables with customers. And i asked about charging my phone and manager kind of looking guy just pointed where i can charge my phone.. no words...and when we order some foods, my waitress asked me if i want a naan, so i said yes, this is when everything started..Food was not that great but we ate cuz again we were super hungry..After we finished everything, waitress gave us a check she charged me or gave me naan platter or something which was about $15. we were very surprised about how much we got charged.. We explained what happened, But ended up paying everything.. except for the very small portion of rice they gave us for complimentary..Worst experience ever!!!I do not write or give this kind ofbad review but they deserved it.. Never ever going back"], ["S K.", "Came here for dinner with a party of four. The food was fine. It wasn't fantastic but it wasn't terrible. The service, specifically from the man (possibly an owner?) was incredibly RUDE.We ordered an appetizer immediately after sitting down. A few minutes later the man came over to see if we were ready to order. We asked for a few more minutes and he said that we had to order now because the take-out orders were getting really busy and if we didn't order right away we would have to wait for our food. We were a little surprised but we decided what we wanted right away and put in our order. The rest of the dinner was pretty uneventful until the end. Literally as soon as we put the tip down on the bill the man came over to tell us to get up because they needed the table. Mind you, the restaurant was not full and there were plenty of tables with enough seating for four or more in the back of the restaurant. As we got up in shock to start putting on our winter layers, the man came back to start clearing the table and to set new places even though we hadn't left yet. I was standing up at my seat and hadn't had a second to grab my coat or purse. I told him I needed a minute and asked him to wait. He responded that he wasn't in my way. Someone in my party told him that he was being extremely rude.I've never been kicked out of my seat at a restaurant like that in my entire life. This man's rudeness totally ruined what would have been a lovely evening out. I am never coming back to this restaurant again."]], "Desi Grill": [], "Gandhi Fine Indian Cuisine": [], "Masala Grill": [["Rachaela X.", "I am writing this from a table inside the restaurant. The food is absolutely delicious. I ordered the lamb saagwala and mixed seafood curry with poori. The flavors are well balanced, the staff is friendly and most importantly, their food is delicious!! Will definitely come back. Try to rice pudding too. Yum."], ["Eliza S.", "Yes! So happy about this great new addition to the neighborhood! The Indian options nearby have been pretty blah for a while, but this place really brings it. The delivery comes quickly and is super fresh tasting (plus the delivery dudes are always so nice). The daily special ($14 for an appetizer + entree + rice + naan + sauce) is an awesome cheaper option. I've tried the Chicken Tikka Masala, the Chicken Bhuna, and the Matar Panir. All are great. Basically, I'm stoked about this place."], ["Maria V.", "Mix seafood curry (salmon and shrimp) was good. It had 2 pcs of salmon 2 inches by 1 inches and 3 pcs of shrimp. Place was clean with good ambiance. Ras malai and gulab jamon was the worst I've ever had. It tasted  processed and not authentic. Overall, place was okay. Will not go back there again though."], ["Mary V.", "This place just opened on my block and I tried takeout from them for the first time.  I got mixed seafood biryani and bhindi (okra) masala.  Both were really good and that says a lot because I'm Indian and have a high bar.  The place looked standard for an Indian restaurant on the inside and the staff seemed very friendly and excited about their new business - it was a pleasure to give them some!  There isn't any Indian food in the hood, this is a welcome addition.  It's BYOB which is so great because there's a wine store right next door"], ["Vanessa C.", "Very impressed with this new place! Finally good Indian food in Brooklyn.Everything we had was fresh and delish.But the lamb vindaloo stole the show !perfectly done really hot and spicy the way it should be.Also the garlic naan was a winner.Our server was so nice and attentive.we did bring our own wine which we purchased next door( but my advice is bring a good bottle from somewhere else as next door is very limited and not great , but it did the job) .we look forward to our next visit .We left feeling full ,happy and satisfied!"], ["HanNa W.", "Best Indian food in the neighborhood.  I always get the chana masala and Manchurian gobi - delicious!  Very generous servings as well.  Have also tried their chicken tikka masala, very good as well.  They give a small serving of the rice pudding with every order.  It is so good I actually ordered a full portion last time.  Much needed addition to the neighborhood."], ["Marge C.", "Very good meal. Food was fresh, well prepared and looked and tasted delicious. Service was excellent. Only problem is I am so full right now!!"], ["Dana C.", "new restaurant in our neighborhood, very tasty affordable food - we had Lamb Korma - delicious - and Saag Panir with all the yummy extras.  Very friendly and helpful staff. We will definitely be back!"], ["Winnie R.", "This is for delivery: it took about 45 minutes on a Wednesday night and was delicious and plentiful and cheap. I ordered the \"daily special,\" from which you can choose an appetizer and entree from a dozen options of each. I ordered, based on the recommendations, ka-chori as well as saag paneer. Both were excellent and came with many condiments, rice, naan and dessert."], ["Alison J.", "Great service. Decor is pleasant and thoughtful.  Satisfying portions. I ordered the sagg aloo and chicken samosas. Both were tasty and delicious. 25% Discount at lunch made the pricing very reasonable."], ["Omar F.", "The best indian food I've ever had. They are just awesome.."], ["MJ S.", "I am generally very picky when it comes to Indian food.  Masala Grill does it right!  So delicious-authentic and fresh. Excited to have such a great new restaurant walking distance from my apartment."], ["JaimeLee R.", "We ordered from Masala Grill for the first time last night and we'll definitely be doing it much more. The food was SO TASTY!! We had a large order too and they packaged our To Go order quickly and efficiently (no mess in the bags). And I can't believe how quickly it got here. One of our guests actually made a mistake ordering their food (we used Seamless) and Masala was quick to rectify it, in a friendly manner to boot. Love this place."]]}