{"Peppino's": [], "Graziella's": [], "Scottadito Osteria Toscana": [["Erica T.", "Definitely one of my favorite brunch spots! Affordable, simple and delicious. Unlimited mimosas or champagne brunch for $20! Mimosas are always spot on. Their benedicts are great. My absolute favorite entree is the Tagliatelle Al Brie, Arugula E Speck - homemade pasta with truffle.This place is also great for all occasions - we had a birthday gathering here. The area in the back has such great lighting and its a great spring/summer brunch spot. I also came here with my girlfriend and her son. The waitress was nice enough to give her son creative gadgets to play with. The kids menu was great as well. I am never disappointed when I come back here."], ["Gessica D.", "Nice and friendly service Salads goodPastas Ok but not excellent, I would say they are a bit too heavy. I like more the \"fresh, light\" style , more modern and easy to digest Was lunch time, they had a great fix price and was a nice surprise"], ["Claudia M.", "We had our wedding in the wine cellar this past November. Our wedding was small, 25 people, and very low-key. Scottadito was the perfect venue! The owner, management and staff were all very responsive via email leading up to the wedding. They were accommodating and flexible. On the day of everything was perfect. We had our ceremony, cocktail hour and dinner all in the same space. The food was delicious, you get so much for the price. We recommend Scottadito for any event!"], ["Jswizzle S.", "My fiancé and I are considering this venue for our small intimate wedding. We met with the general manager who is no nonsense and runs a tight ship. I appreciated her clear cut no BS approach, if she could do it great, if not she said it. After our meeting, my fiancé and I decided to try out the fare the next day for brunch (we are breakfast people). We arrived for the pre-fix brunch with unlimited mimosas/champagne. I ordered the eggs Benedict with pesto/prosciutto and my fiancé ordered the french toast...Sweet baby Jesus! It was splendid! So yummy! I left nothing on my plate. y mimosa was NEVER empty, it was so much that I needed to cut myself off.We loved it so much, we booked! Yay! Can't wait to go back and try out some more items from their menu."], ["Gipan D.", "I dont do five stars often so listen up people. Bottomless mimosas and amazing high quality brunch food. Was enticed by the crossiant special. So good. Everyone really liked there food. My friend came and he wasnt hungry so he decided to order for mimosas and take the food to go. One bite and the plate became progressively empty. I will be back."], ["Linh L.", "Came here several times for brunch! Love the fact they have bottomless mimosas. I even took my family here! The decor (especially the back room) is beautiful! The front has a seating area for people waiting to be seated but minimal seats. The front of the restuarant appears much more dim compared to the back. The waiters are nice and even makes little jokes here and there. I really liked the eggs benedict with cured salmon. So so good!!! They also have a kids menu! I definitely will be back and would try their dinner!!"], ["Jen H.", "Went to a bridal shower here and had a very nice time.  Although the place is small, there was a lovely back room with lots of windows that the party was held in.  All the food was good...especially the pasta that I tried.  The wait staff could have been a little more on point."], ["Olivasaurus F.", "We went here for Christmas Eve dinner and were blown away by the service and food. Had a slight struggle with three separate floor staff who were trying to take the same plate away (it was empty besides a bit of sauce that I was mopping up with bread). It was funny but gave me heart palpitations because THE SAUCE WAS THAT GOOD. WHY ARE YOU TAKING IT AWAY FROM ME?!?!? Hahahaha. I'd recommend EVERYTHING on the menu! We came in a large group but everything came out on time. The affogato is fantastic- they mix something in with the icecream that makes it extra delicious. Mmm!"], ["Francesca C.", "I hosted a bridal shower here for about 25 guests. Scottadito was amazing. They answered all my questions prior to the event and was so helpful on the day of. The service was great-the waiters were extremely attentive and had great attitudes. The food was simple and delicious. I would definitely recommend coming here and hosting an event. Or even just for brunch. Thanks!"], ["Ada W.", "The 2-star is totally dedicated to the ok food I had there. The fritto misto was great actually. But I didn't like my Cabonara. It was too cheesy to my taste and the prosciutto they put in there were ALL fat. Back to the terrible service. We arrived 20 min after our reservations. They gave our table away, FINE. ALL the restaurants I have been to always give us the next table available. Instead, that hostess Lucy just made us stood for at least 20 min while I saw empty tables. I asked her why, she had an attitude and said I'm late so she needed to reserve all those tables for others who made reservations (which did not show up yet at that moment). And I asked her the estimated waiting time, then she reminded me again that I shouldn't be late and she cannot give me an estimated time, \"Maybe an hour, maybe 15 mins\". I feel like she just want to \"punished\" me by making me stand there and wait. I wonder if she really hate people being late or it's a racial thing. Finally, we got our table after half an hour of standing punishment. Our server didn't come until at least 10 min later. After he took our drinks order, he didn't show up at all after 15 min. Another server asked what happened and I guess he felt bad and become our server for the night. The only best part of this inattentive service was nobody was rushing us to leave the restaurant. We finished our meal and ended up sitting there for 30 min without anybody coming to check on us. I understand it was NYE and I did not expect great service. But what I had was totally unacceptable. I went to Brooklyn for NYE because I tried to avoid the crowded city. This place made my Brooklyn experience very bad."], ["Nikki G.", "We had our rehearsal dinner in the back room. The food and service was excellent. Everyone had a wonderful time. Highly recommended."], ["Alexis A.", "What can I say this place was just 5 stars and more. You must make a reservation and try this little sweet old Tuscan rustic style wood burning in the fireplace restaurant. Nice date night spot or even just come with good friends who love great wine and food with it. The workers were excellent and very attentive and professional but also were down to earth which was a plus! Started off with:Fried calamari with tiger shrimp that came with a lemon aioli dressed and a roasted pepper aioli which both were sweet but really good and just changed the whole concept of fried calamari and marinara sauce.Pizetta which was so good, soft thin crust pizza with fresh mozzarella, basil and these great tomatoes on top.Grilled octopus which came over a bed of nice argula salad which was grilled perfect.Entrees: Bucatini all'amatriciana which was hard to pronounce but the waiter understood and it was this amazing fresh home made soft noodles with this arugula, prosciutto. and so good truffle oil I could not get enough and it was just the perfect size, I loved it, just delish!Pork Tenderloin you could not go wrong with such a nice cooked portion of the best meat around to me, it was not greasy or fat as you think it was and it had cooked figs on top which just made it taste so great together, the boyfriend of course could not get enough haha! WINNER! It was really delicious and even with with mash potatoes underneath. Dessert:Nutella gelato! Which right there you should know how creamy delicious that is and I loved it.Wine:Stag's Leap Wine Cellars \"hands of time\" Napa Valley you can't go wrong with it and goes down smoothly and taste great with your entree! The truffle oil here you will not want to stop adding it and dipping it on all your food and I just loved that roasted pepper and lemon aioli sauces too.I will for sure be back to this pretty little place in the heart of Brooklyn and check out there BRUNCH menu which i hear is AYCD!! That right there is my kind of appetite ! From the pictures the food looks so delicious and I would love to have it all just in one bite! We shall meet again my little truffle oil fantastico restaurant !"], ["AJ J.", "I've been a customer of Scottadito's for some years now. Been a while since I have been back though. Recently, I took someone there for dinner as we both craved Italian, and the food has always been reliable. As usual, the service was spot on, the wine pour very generous, and the normal amenities there, like a full basket of tasty bread.  The food was fairly good, but what absolutely shocked me was the serving size.  Neither of us are big eaters, but our dessert was likely bigger than the serving of pasta I had (Papardelle).  I literally had 8 noodles in my dish.  The dish it is served in is huge. The portion, child sized. And that was for both of us.  At $18, I would expect a pasta dish to at least satisfy me.  I am guessing I had approximately 9 oz of food total in my dish, including the sauce.  Needless to say, we finished the bread!  What is going on Scottadito's?  I cannot think of any other place in Park Slope where a main dish has been the size of an appetizer."], ["Mary F.", "The Bad- Pizzete-- so flimsy that you need a spoon to hold it to eat- Veggie pasta-- don't recall the actual name (something with yellow spicy soup) but not worth your buck; you can probably make better pasta than this for way cheaperThe Good- Fish of the day special-- baked with salt layer-- it's ok, nothing special but a tad too small- Octopus salad-- probably the highlight of the whole meal (should've ordered another for my entree)- Free wine tasting that day :)The Bottomline: Not sure if this restaurant is just okay or that I just ordered the bad items from the menu. I wouldn't come here again though."], ["Stephanie P.", "Oh Scottadito Osteria Toscana, let me count the ways! So I have a friend who always joins me for shenanigans in Queens despite the hellish commute back to her kingdom of Brooklyn. This weekend I decided to rage in Brooklyn all weekend with her and she welcomed me with open arms to stay over at her place. First thing a lush foodie like me did was look up a brunch place in Brooklyn. It couldn't be just *any* brunch place though - oh no - I wanted it to be somewhere she and I had both never been to, had to be reasonably priced but still be high-quality eats and it *had* to be AYCD (All You Can Drink, kids! All you can drink!). After a little searching via the Yelps and the Googles, I stumbled upon this amazing Italian gem. At only $18.95 one can get a filling delicious brunch meal here plus AYCD champagne and mimosas?! I ran it by her and after an enthusiastic approval on her end we invited another gal pal and her boyfriend to join us on our brunchy brunch adventure, off to Open Table I went to secure a reservation (because surely, I figured the wait would be bad with such a lucrative brunch special!). Plus with word's from Zagat's like, \"Park Slope's latest secret weapon\" - I had really high hopes for this place and needless to say was uber excited for our brunch-capade!I made a reservation for 4 people for 12:45 on Saturday and of course we were all late. Since I knew we were running late I called Scottadito Osteria Toscana and they moved it to 1pm with no push-back or rudeness, couldn't have been more nicer or accommodating!At 1:10pm we finally all got together and I was nervous because here we are, 10 minutes late after moving our original 12:45pm one...the place was busy but not too full and they *still* had our table on reserve for us. AMAZING!! Restaurant in Manhattan could stand to learn A LOT from these guys. Their vibe is also very traditional, rustic - lots of exposed reddish brown bricks. I also learned that all their interior things and furniture is made from reclaimed & recycled wood AND they use sustainably grown, harvested and locally sourced ingredients - both charming AND environmentally responsible -I can contribute to saving the world as I eat, sweet! As soon as we sat down, looked over our menus and ordered there were mimosas plopped down in front of us. I was planning on champagne-ing since I figured the mimosas would be more OJ than booze, but NO SIREE! These mimosas were LEGIT. My party all agreed and we mimosa'd throughout our entire brunch.Kay, so FOOD - my gal pal and her boyfriend both ordered the Pane Dolce al Frutti di Bosco (French toast topped with seasonal fruit, organic maple syrup and powdered sugar) and it was definitely very decadent, fluffy, sweet but overly-so. They clearly put a lot of effort and detail into presentation and flavorings here. My tall, pretty-eyed friend (this is me exacting \"revenge\" for being called her \"little friend\" in her review below :P) ordered the Gnocchetti di Spinachi (homemade ricotta and spinach gnocchi, sage and butter) - this was AMAZINGLY delicious and definitely among some of the best gnocchi I've ever sampled. She needed a little assistance finishing off this awesome dish so my gal pal and I saved the day and polished it off for her with pleasure!I went with the Tagliatelle al Brie, Arugula e Speck (homemade pasta, melted brie, prosciutto, arugula and truffle oil) I'm pretty sure that my dish won the unspoken \"best brunch dish\" award for the day. Tagliatelle is a traditional type of egg pasta that is shaped like long, flat ribbons very similar to fettuccini. The truffle oil was so amazingly present in each and every bite! They used copious amount of prosciutto that was delicious and chopped up so make it easy to blend with the pasta. The arugala was fresh and not distracting to the overall meal, plus MELTED BRIE!!!! Brie is one of my favorite things on this planet (right up there for me with gruyere!) and it made an amazing addition to an already flavorful dish. I could eat this meal at least once a month, but I'd look like a cow...a very happily fed cow...holding a mimosa...in the pastures of Park Slope...Oh & Creme brûlée was dessert-gasmic!The only con I have about Scottadito Osteria Toscana is I wish they managed the restaurant temperature better. They do have a really nice outdoor area people can eat in out back, but there was a baby shower being held and so it was unavailable. It's hard to guzzle brunch booze when you're having heat flashes (as I often do, lol) and wiping the sweat off your brow. But still, this place is an absolute gem. Our waiter's name was Asmir and he was cordial, efficient and he kept the booze flowing - we even got one last round of mimosas out of him after we had paid our bill and were waiting to use the restroom (which is beautiful in a tradional, understated/vintage of way complete with a really beautiful sink).I love this place and can't wait to come back sometime! Ciao until the"], ["Michael H.", "The truffle oil tagliatelle at brunch was one of the greatest pasta dishes I have ever had."], ["Anna B.", "Wonderful restaurant with great staff and delicious food! You truly made my 30th birthday special. Highly recommend this restaurant!"], ["Ingrid S.", "My friend decided to browse yelp and the interwebs for a good brunch spot in Park Slope for Saturday, since she was staying over as my houseguest for the weekend. She found this place which I had never been to before and saw that they had good reviews. With it being conveniently located right on Union Street and boasting Italian food with an unlimited drink special for under $20, I can't believe I have never gone. The space inside is a little small with antiquated brick walls and fancy wine bottles decorating the shelves. The bathroom is actually pretty spectacular. There is only one for both men/women. But the sink basin is gorgeous. I want one. There also is an outdoor courtyard area with an enclosed roof. However, I think it is usually reserved for events and parties. The only complaints with the seating inside is that it was boiling hot and only 70 degrees outside. To start off with our server gave us a basket of a delicious bread that kind of resembled a wheat focaccia, served with a tomato purree. It was something different to start off with than your typical bread and was really delicious. There were four of us eating at brunch so I got to try a range of dishes. I personally ordered the Gnocchetti di Spinachi; homemade ricotta and spinach gnocchi in a sage and brown butter sauce. Holy moly. I haven't had gnocchi in years and each bite was decadence. I was so full by the end of the meal that I had to have all of my friends chip in to help eat the rest. My little friend ordered Tagliatelle al Brie, Arugula e Speck. Tagliatelle is a lot like fettuccini. All of the pasta was absolutely homemade to perfection and her sauce you could taste the truffle oil in every single bite. I think I may have even liked hers better just because the flavors were all so distinct and melded well together with the brie, truffle oil and PROSCIUTTO. I love prosciutto quite a lot. My other little friend and her boyfriend both got an order of Pane Dolce al Frutti di Bosco. Or French toast with seasonal fruit, organic maple syrup and powdered sugar. I didn't try theirs but they looked super fluffy and the maple syrup was stopped with a wine cork. Adorable. Her boyfriend got an additional side of scrambled eggs which looked like a mound of buttered pillows. I can't stress how great the food was. Enough so that we even got a desert creme brulee. I have never had creme brulee before but I am officially a fan. I thought it would taste like flan, which I hate. But no! This was more of a rich vanilla pudding custard with a caramel crisp top. Also, the mimosas weren't too strong and not too sweet. Made with a better quality of champagne probably than some unlimited brunch spots in the slope. Our waiter also was fantastic and not stingy at all with refilling our cocktails and didn't make us leave after we finished our meals."], ["Marcy W.", "We had our wedding reception here in January 2015. The staff was ridiculously accommodating; we accidentally had an extra person, vegetarians we didn't know about, and we went over a half hour over time. Our guests even broke some bottles of wine from the wall. We were not charged extra for any of this. The food was great. We did have a tasting (complimentary) and I'm glad we did, because some items we tried we didn't like. But day-of, everything was delicious and all of our guests were very happy. I highly recommend Scottadito for small weddings and parties.Their brunch is also great, both sweet and pasta options."], ["Liz B.", "After doing a TON of research for a New Years Eve dinner in Park Slope, I am so happy I chose Scottadito. It was the perfect place for a low key, romantic, New Years Eve dinner... and there was no mandatory price fix, just the regular menu with some extra special specials.Even though we had a reservation, we still had to wait about ten minutes. But it was NYE so I didn't mind. We wound up getting seated in one of the two top tables by the door... it was a little inconvenient due to the draft every time someone exited or entered, but again I didnt mind because the overall experience was great.The fritto misto appetizer was delicious... hot and crispy, not too greasy, and quite large for the price. Both of our entrees were also generous and delicious. We both got specials and I honestly don't remember what they were called, but everything on the menu looked good.Drinks were okay - my first glass of champagne was warm... again, probably due to NYE, but my second drink, a vodka sprite, was REALLY strong. My boyfriend enjoyed his Morettis and I thought they were fairly priced at $6 a bottle.The service started a little slow but became much better... our waitress was very attentive but not hovering, and she was very knowledgable about the menu.At the end of the meal, all guests got a shot of limoncello on the house. It was a great way to end the meal... and start off the night :-)I will definitely be back for brunch (unlimited mimosas) and most likely another dinner."]], "Mariella": [], "Giovanni's Brooklyn Eats": [], "The Saint Austere": [["Linh L.", "I finally came here!!! We ordered everything i read about on Yelp! We had the meats selection, the cheese selection, broccoli rabe, creamy polenta, wagyu beef tartare, wine, and a free dish of octopus! Everything was so delicious. We didnt have room for entree but we will be back! And to end our night, we had the nutella zeppole with orange creme.. Ill never have zeppoles without nutella ever again!!! Cant wait to come back to try more items! The staff was super nice and friendly! What an awesome experience!"], ["Erika T.", "I went here with my friend and the food was amazing! I had the organic chicken- it was delicious. Friendly staff and a nice spot!"], ["Tash R.", "This review is a solid 4.5. We were in the area and turned to yelp for help - Saint Austere was the winner.Everything we ate was tasty and we were surprised with the the great value and wine selection. Would also have to say the staff were amazingly attentive and enhanced our dining experience!This is what we ordered:- broccoli rabe: never had broccoli rabe like this before and we loved it! - creamy polenta with sausage: I don't think I've ever had tastier polenta (although it doesn't say much as I rarely order it) - amazing- grilled octopus: it was tasty, but on the pricier side considering the size. I also prefer my occy a little more firmer but regardless it was tasty- steak special: this was a large serving and was cooked perfectly and delicious. Now steak is something I order a lot- this steak is up there!Can't wait to come back!"], ["Jim F.", "Really delicious! The agnolotti (which was a special but it was so good they should have it on full time), polenta board, and barrel aged negronis were our favorites out of the items ordered. The butternut squash and tagliolini were both very good but the other 3 were stand outs. Sadly, the desserts were a disappointment. I wish we would have passed so we could have left on a high note. Would definitely come back but would skip dessert."], ["Stephen T.", "The were very patient and very polite.  A few items I must recommended: Wagyu Tatare, Polenta board, and the pork chop!  One downer was the size of the octopus and the cauliflower.  I wa expecting a bit more for that price. Over all a good time and good food."], ["Tyler B.", "This place has all the makings of a restaurant I normally wouldn't like. Pretty expensive? Check. Small plates format? Check. A really popular spot that doesn't have much space? Yep! That would normally be three irredeemable strikes but this place overcame my prejudices and then some!First of all, the service is top-notch. Right before we were about to be seated, the Health Department barged in for a routine, unannounced inspection, which shut down the kitchen indefinitely. The staff couldn't have been nicer about the situation. Even as they prepared to lose a ridiculous amount of Friday night business, they graciously suggested some other great restaurants in the area. We felt so bad for them, though, and decided to stick it out.Lots of people filed out after the inspection began, which created some space at the bar. At that point, I'd say the kitchen stayed closed for only another 30-45 minutes or so. In the meantime, we chatted with friendly bartenders and a couple of pretty cool people at the bar. The wait was definitely worth it. We started out with an order of Brussels sprouts and creamy polenta, both of which were out of this world. We also got the Octopus, which was just as good and easily shareable between two people. These were traditional small plates portions, with the octopus being a little bit bigger than the first two.We loved all of the above but the real star of the show was the oxtail cavatelli off of the \"big things\" menu. This is a much smaller selection of dishes on the menu that are pretty close to standard entree portions. It was simply the best pasta dish I've ever had in my life. My boyfriend agreed after just a small taste and I ended up sharing a little more than I would have liked :/His dish off of the \"Big Things\" menu was the only thing we tasted that I wasn't crazy about -- their \"beef cheeks\" special. It was cooked perfectly but it came with an orange-y sauce that I wasn't crazy about. Also, it was about twice as much as my pasta ($40 vs. $22) and we both agreed that the pasta was way better. Oh, and I can't forget the wine...though can't quite recall the name of it. Regardless, it tasted amazing. If we're ever back in Brooklyn (oh, we will be), we'll pay this place another visit."], ["Trevor N.", "Sat down last night with my girlfriend at around 8pm and had the most goddamn amazing meal ever. We both did the chefs tasting menu with wine paring and couldn't get enough. The chef kills it. Also, Hands down the most amazing and friendly staff and owners we've ever met. I was racking my brain this morning to find anything negative to say at all, to help with feedback, and the only thing both myself and my girlfriend could think of was that the tasting menus portions were too big for us. If that's the only negative thing then this place is doing almost everything right. We're definitely going to be back here a shit ton more."], ["G G.", "Pretty decent. I like the lighting. The food's not bad. They have a lot of Italian wines. Friendly service. Probably a better spot for a cocktail & snack rather than a full meal. I'd go back again if I was in the neighborhood."], ["Patrick W.", "Came for a friend's birthday. Apparently it was so good, they explained they had just ate there the night before.Chef's Tasting Menu at 4 courses for $40 a head? I'm down.Broccoli Rabe - Probably my favorite thing on the menu. It's got anchovies, parmigiano and boiled eggs. It's just so rich and so mmm.Patatas Brava - Solid.Creamy Polenta - I don't go out of my way to get polenta but this was really splendid.Fritto Misto - Very tasty, I've had many fritto mistos before but this was definitely above average.Brussel Sprouts - The burnt ends are just delicious.We had the veal ragu for our pasta. The roasted organic chicken here is really something special. The gravy and the flavor is just really good. For dessert they do this interesting twist on Tiramisu. It's served in a jar with espresso granita and it's hard to describe. Wow-meter was spiking."], ["Craig Z.", "Oooh, I loved this place.Oysters were outstanding quality...I never eat a dozen of the same oysters, but did here because they were so good.  Also, it was delightful to have them with a half bottle of sancere.After the sancere, I had an excellent manhattan, which was well priced. \"patatas bravas\" were excellent, even though they weren't truly patatas bravas, and were really just in that style.They pushed the polenta and the broccoli rabe as signature dishes.  They were both good, but not the stars, and I thought the rabe desperately need red pepper flakes--they accomodated this request, as well as when I asked for salt for the brussel sprouts, which were very good, but also underseasoned.  The chicken liver also seemed to need a little more seasoning or something.The waiter that started us off was really nice...the waitress that took over at some point was a little pushy.Place was quite cozy.I know this doesn't seem like a glowing review, but I am definitely a fan, and could see this place going up to 5 stars."], ["Mallory O.", "Great menu cheese on point. Great selection,  loved the dinner the polenta board was amazing. Fun atmosphere! Good place for dinner with friends"], ["Kurt R.", "Meant to review St. Mazie. Now I cant delete my reviewhere! Yelp, WTF!"], ["Heather E.", "My husband and I had dinner here a few nights ago and really loved it! We both did the tasting menu, where we shared the patatas bravas, stracciatella, broccoli rabe, polenta, caccio pepe, and stracci. Every single thing was tasty, and they tailored the menu to be vegetarian friendly!The tiramisu with espresso granita is to dye for, and the cocktails are great. Their house-bottled pimms cup was delicious!The staff was friendly and attentive as well! Saint Austere is s gem!"], ["Caroline G.", "The food, drinks and atmosphere at this place are awesome. In particular the polenta board was a hit among my dining companions. My only hesitation is that as with many small plate restaurants, you don't get tons of food for the price you pay. The presentation for some of the small plates could also be better. But I've been back 3 times so overall a hit."], ["Andrew L.", "Genuinely unbelievable food and service. I had polenta, grilled octopus, seafood pasta, and the half chicken. All of them were simply spectacular. I will be returning!"], ["Elizabeth N.", "Great place to drink and eat. They have a high tables. They have $1 oyster happy hour Monday to Saturday I think. The day we went, there were these oysters from Virginia. Food was pretty good. We had a cheese plate, octopus salad was cooked perfectly, fried calamari/artichoke was delicious. We also had a pasta dish that was great. I love fresh pasta. It was the spinach pasta I believe in a light broth sauce. Portions are tiny and meant to share."], ["Gina S.", "I loved this place.  The staff was so warm and knowledgeable, you could tell they loved their job.  The food was so good and the servings were just right.  We started with the papates which I didn't expect to like so much because I am not a big potato person.  The chef boils them first and the smashes and fries them so they are soft and crunchy.  it is served with garlic aioli and siracha.  We then had the polenta...yum!  Then we shared the spaghetti cabonara which arrives with two egg yolks on top.  My friend was a bit nervous about that but when I mixed it up like the server said it was delicious.  Maybe it could use some salt but still delicious and fresh.  We were too full for anything else.I also had a watermelon gin drink that was phenomenal.  The wine choices were nice as well.  I just wish the seats were a bit more comfortable but I think I am getting old. LOL.I will definitely be back."], ["renje g.", "++++- That polenta, you cannot leave without having this dish+++- House made tiramisu, its very delicious. I wasn't a fan of the icy topping though. The rest of the dish made up for it.- Drinks; The homemade bottled dark and stormy was the perfect sweet/alcohol drink without overdoing it on either side++- Broccoli rabe, it has egg, but not that strong- The mussels get a thumbs up, although I wish there were a bit more- Service. We wanted for nothing. They were constantly coming around, cleaning tables, asking f we needed anything, replacing plates, everything. They should run a waiter school.+- Scialatelli was alright, I should have ordered another polenta though-- NegativeTIPS:- Be careful, those cheap plates add up"], ["Mary Grace T.", "YAAAAAAAAAAAASSSSSS!!!! I took my boyfriend here because I read the reviews and I'm new to the Buswick/Williamsburg area. We went on a night that was pretty packed so waited for a couple minutes. NBD, they asked us if we wanted to put in a drink order so I ordered a Dark and Stormy while the boyfriend ordered the Old Fashioned... FIRST OF ALL- This place puts so much care into their drinks, you can imagine how much care they put into their food. Their D&S is bottled and carbonated on site, their Campari is aged in a french oak barrel. These things make such a difference in the taste and experience of drinks and I wish more people cared this much. Needless to say, we didn't order just one of these delicious drinks... we ordered... several. Everything here is made for sharing, which makes it an amazing date spot or a place for 3-5 friends to gather. Since it's a little more intimate, I think anymore than 5 is uncomfortable. Oh, I should also mention that we went back exactly a week after our date with some friends. I just HAD to. On to the meal(s)-Brocoli Rabe- This was something everyone told us we could not miss. The rabe was accompanied by anchovies, parmesean, and eggs. The combination sounds odd but the bitter rabe, with the salty anchovies and parmesean, was perfectly balanced with the creaminess of a medium boiled egg. This is the dish that has me coming back because I feel like I'm eating something relatively healthy but incredibly delicious at the same time. Patatas Bravas- We went to Barcelona and enjoyed several versions of this dish- It's basically fried potatoes with Mayo and Sriracha, although in Barcelona we wished it was this spicy. As delicious as it was, it was my least favorite because I kept accidentally eating the paper that was on the bottom...WHAT!? It looked like potato skin... -_- Creamy Polenta- And creamy indeed it is. I don't think it needed the pork ragu at all. Both were amazing together, but they would have definitely help up on their own. We licked the bowls clean and wished we had more. Grilled Octopus- The boyfriend and I had some delicious Octopus in Europe and we were taken back to those amazing moments once we tasted this one. Although it was a pretty small portion for the price, the meat was tender and there was a great char to it. Another dish I wish we had more of. Steamed Mussels- Spicy, tangy, garlicky, aMAHzingness- that's all I remember of that but it was yummy. Try it! Tagliatelle- My friends thought it was a bit salty but I love that so I didn't mind. For some of these items we got them from a tasting menu. I think I would have chosen to order it anyways. I wish that the noodles were handmade because I think that a fresh pasta would have held up better to the flavorful sauce. Roasted Organic Chicken- This was another thing off the tasting menu. I don't typically order Chicken because it's something I make a lot of at home. However, this chicken was such comfort food. The garlic jus it came with was a game changer. It was tender, moist, and well seasoned. Something I would easily order again. Tiramisu- Have you ever had a dessert that just blew your mind? (cue explosion sound effects). How can something be so decadent yet light, satisfying yet not heavy? Please meet TSA's Tiramisu. It has all the elements of boring tiramisu with a twist. I think the most important element of their tiramisu was the Espresso Granita. Instead of soaking the lady fingers in that, they top the dessert with this and it makes it cool, light, and refreshing. It's the perfect thing to end a meal with. I should know because I had it end my meals twice. Summary- Go there. You won't be disappointed. If you take a girl there, you will definitely score some points. Get the drinks, get the broccoli rabe, get the tiramisu. You won't be disappointed."], ["Belinda J.", "11:45pm, newly arrived in New York and lost in Brooklyn trying to find dinner. After the hotel concierge sent us to a recommended Thai restaurant that turned out to be more of a club than a restaurant, I found The Saint Austere in Yelp, one of the few restaurants within walking distance that would be open past midnight. I called to confirm a reservation was not needed. The guy (unfortunately, don't know his name) who answered was friendly and said that they could accommodate us with no problems. 25 minutes and 1.5 miles later, we made it to SA, and was greeted by the same gentleman who I spoke to on the phone. Again, he was very friendly and accommodating regarding seating, having us choose wherever suited us best. The two servers who tended to us were equally friendly and helpful.We ordered the Polenta Board ($20), Grilled Asparagus ($12?), Half Grilled Striped Bass ($22), Homemade Cavatelli with Veal Ragu and Leeks ($22), Tiramisu ($8), and the Nutella Zeppoles ($8). The flavors on the Polenta Board were fantastic. The bass was also good but extremely salty as I don't believe it came with anything to offset the saltiness. I was informed they only had half an order of the Cavatelli left and if I would like to substitute another half order of a different pasta, that would be fine. I chose the Bucatini Cacio e Pepe (parm, black pepper, pecorino). While the Cavatelli was good, the Bucatini was not. It came out looking like a plate of plain pasta, no visible black pepper or cheese, with a barely noticeably sauce. What it lacked visually it also lacked in the flavor department. It was palatable when paired with the bass. Both the tiramisu and zeppoles were also good although the orange creme for the zeppoles had no orange flavor.Ambience is great, staff even better, food seems to be hit and miss, and portion size pretty small for certain dishes (zeppoles 3 count, bass). Good for an intimate dinner paired with wine, not so great for hungry travelers."], ["Angela M.", "Yesterday my friend and I ate here. We went around 7pm on a gorgeous night in BK. They had a table reserved for a party at 830pm but said we could use it until then. The ambiance is fantastic, muted lighting, hanging small chandlers, and a large bar. We sat in the back and ordered some cocktails. We settled on a negroni and the watermelon gin drink. For food we ordered patatas bravas, cauliflower with tuna, pork ragu croquettes, and the roasted organic half chicken. The negroni was stronngggg but delicious. Our waitress even gave us a order of the polenta on the house. I was so happy she did because it was delicious. It was creamy and perfect, my great aunt from Italy would have approved. The croquettes with fat and served with ricotta. Crispy and delicious. The patatas bravas were actually sliced and a bit fried with shiracha on them. I had not had patatas bravas that way- it was a welcome change! The cauliflower offered a completely different taste compared to everything else on the table. The tuna was fresh and worked well with the pan fried cauliflower. Last served was the half chicken. At this point we really didn't need it but obviously since it was already there we had to  eat it. It came in a peach lavender glaze and was served with trumpet mushrooms. De-lic-ious. Our bill was around $100 after tip so a bit of a splurge but totally worth it."], ["Randy S.", "We've been here a number of times and I can't believe we never wrote a review.The polenta is superb, do not deprive yourself of this dish. Flavors are so innovative with everything. The mussels are great and perfectly seasoned and the chicken is as moist and tender as chicken gets.I love this place and we will be back again and again."], ["Anthony T.", "Came here on a whim a few years ago shortly after they opened after seeing the dollar oysters sign. Was pleasantly greeted by now friends Fabrizio and Jacqueline, and subsequently urged to try the creamy polenta and other signature dishes. Safe to say Saint Austere has been a go-to ever since. We've brought countless friends and family there over the years and always feel at home. Whether the roasted chicken, steak, meatballs, or excellent pastas (gotta check out sunday supper!) They never dissapoint.And once they got their full liquor license tack on excellent old fashioneds, negronis, and the awesome home made dark and stormy - on top of an excellent wine selection - and u have yourself a fantastic evening!"], ["Eric K.", "Beautiful cozy romantic restaurant. The polenta with sausage was the stand out menu choice. We started off with fresh oysters for $1 each, enjoyed wines from a generous wine menu, and ordered four tapas dishes.Surprisingly large portions for a great price, the roasted Brussels sprouts came in at a close second to the incredible creamy polenta.The staff treated us so nice: we had to wait (it was crowded, always a good sign!), but we were told exactly how long we had to wait, the bartender, John, kept checking in on us, and they created a memorable experience.I'm going back!"], ["Stanley T.", "Creamy Polenta was amazing. Got a really good buttery taste. Patatas Bravas with the sriracha and mayo was a good combination instead of the usual ketchup. What's even better is the pan that it comes with. The grilled octopus was cooked good with the tomatoes. Also had the Tiramisu with espresso granita. Coffee on top of coffee. That was good! The Nutella Zepolles was also good. Kind of reminded of the Ferrero Rocher chocolate candy. Then came the Fried Ice Cream. Usually used to the tempura batter for ice cream but they actually fried ice cream with white bread. Kind of reminded me of an arepa but with ice cream. Now that was interesting. Overall I would definitely come back try some more stuff on their menu. Definitely a good place to go for some good food."], ["marissa m.", "I super love this place. It is our go to spot on date night, but its also a great spot to go with family/friends. The tasting menu is great - reasonably priced, interesting and so so delicious. The creamy polenta is THE BEST, the tiramisu is to die for, and that broccoli rabe-egg-anchovy thing is oddly addictive. I love that the Saint Austere is both laid back and decadent. The staff are also super knowledgable about all things wine, beer and food, and they are extremely attentive and passionate about what they do. A local treasure, this place."], ["Jennifer H.", "Going on Yelp when you're hungry is just a terrible idea. Unless you're already on \"restaurant row\" and surrounded by yummy options at every turn... reading reviews about decadent meals is just torture. The sad leftovers, and browning vegetables in your fridge will only look less appetizing and you'll quickly be on your way out to indulge in a five-star dinner. For me and my roommate, Saint Austere was that dinner last night.My roommate and I wandered off to find this place after we both spent a very long day working from home, looking to get some fresh air and indulge in a meal that didn't get delivered on a bicycle. This quaint little bar has long wooden tables, but was empty enough on a Monday night that we had a corner all to ourselves. I wanted wine, but my roomie wanted beer. This limited my options, since most of the wines that I wanted to try are only available in bottle. Bottle prices were $40-60, but I wasn't in the mood to down a whole bottle by myself. I settled on a German rose that was quite delicious and not too light to be paired well with the food we ordered.We started with a trio of cheeses: one Buche de Lucay (French Goat cheese); one Tomme de Savoye (another French variety, but from a cow); and the Pecorino Rossellino (an Italian cheese made from sheep's milk). All came on a wooden plank with appropriate garnish and adornments of grapes, candied walnuts, or a fruit spread, with toasted bread- which was a little burnt, but we will let that slide. Total cost: ($9)My roomie got the roasted bone marrow ($7) which was supposedly like a thick buttery-cheesy textured bread. Also, the grilled octopus ($13). Being that I'm a vegetarian, I didn't try either of these but I heard that both were delicious. It also gave us something to talk about, in that I could joke around that my dog loves bone marrow and perhaps the two of them could share an appetizer next time. :)I had the suppi al telephono ($9), which was like a tomato rice ball with 3 in an order. These were okay, but I'd probably skip that one next time. I also had the fried artichokes ($9) which were a delicious way to eat your vegetables! It came with a creamy dipping sauce that was kind of tart, and along with the onion straws and fried lemon zest (never thought of frying that!) it made for a rich, flavorful appetizer.We split the tiramisu at the suggestion of the server, who was attentive and knowledgeable. Our water glasses were never empty, and he brought fresh napkins and silverware between the courses. The dessert was very cold, almost like the base layer of rum had been sitting in the back of a cold refrigerator. We ended up letting it sit for a minute which solved the problem. The mousse and cake layers were heavenly. Despite the rich decadence of the prior courses, we cleaned the plate on that one. All in all, a very positive experience. Exactly what we needed after slaving away indoors on a beautiful day."], ["Aimee M.", "Amazing!Just got back from this place with my husband with a gift card, and we will definitely be back. We did the four course option with paired wine for each course (and plenty of it!) and everything was just delicious. The waiter asked me if I did not like anything specific on the menu to ensure that I did not receive that for my course - which I definitely appreciated! The Brussels sprouts were out of this worldddd and the half chicken and terrimisu were delicious! Atmosphere is intimate and I felt very taken care of. Great job!"], ["Kyle H.", "I am hesitant to write this review because this place is MINE but they deserve it. so.This is my girlfriend and I's favorite restaurant.  We have been here probably dozens of times at this point and we always wind up getting the pre-fixe (WITH wine) because it is such a good deal.  My girlfriend has crazy food issues and they are incredibly accommodating.  The food is delicious and consistently prepared.  To top it off, the service is excellent and I know no front-of-house staff that is more on point and professional than these guys.  Cheers, Saint Austere!  Basically the best restaurant in Brooklyn."], ["Rose W.", "delicious food, cozy and a perfect date restaurant! i loved all the food here, particularly the broccoli rabe and creamy polenta.  we just ordered a lot of small plates, and everything was perfect.  from the prosciutto and cheese to the tiramisu (with iced espresso granita on the top), i loved it all. wanted to try  the $1 oysters but didnt seem to go with the rest of the food. though i enjoyed my gin cocktail, i think wine goes better with the food! overall a great experience."], ["Alison X.", "Had dinner here in a group for 4 tapas style! Staff was really great, and made some great recommendations. The had $1 oysters til 8pm wich was awesome! I saw that the polenta was the thing to try but they have a new polenta board thats larger, meant for sharing and has different \"toppings\" including sausage, mushroom (my favorite), grilled leek, meatball and some kind of pulled pork. Definitely recommend getting it!!! We also tried the special - short rib rigatoni - and it was amazing. Fritto Misto is definitely worth trying and if i had to say my least favorite that we tried was the wagyu steak tartar, only cause I thought I could use a smidge more flavor. Either way, definitely want to come back!"], ["Taylor B.", "Polenta on fleek ... Wagyu steak tartar on fleek ... Broccoli rabbi"], ["Mitch E.", "Was looking for a place in Williamsburg that was close to my friend's art gallery and was participating in Dine-in-Brooklyn week. Glad I found Saint Austere. The food was phenomenal. The Broccoli Rabe was done like a cesar salad, great twist. The Creamy Polenta was terrific. Lots of kick to it. The cavatelli was yummy. Shredded pork, mixed in well with sauce, pasta and a meatball. Not the biggest fan of Tiramisu because I don't like coffee but I enjoyed every bite. They serve oysters that looked real good. Next time I come back I'll be sure to get some."], ["John L.", "I love this restaurant.  It is the perfect place to unwind mid week.  They have an insane oyster happy hour, the food is incredible, the crowd is non existent, and the service is perfect!  The staff is very knowledgable about their menu and wine list and helped us pick the best meal!  The must try is the polenta.  Best polenta I've ever tasted.  And that's no exaggeration.  I will definitely be returning!"], ["Malte J.", "Brilliant food, great atmosphere. 10 out 10 would do it again."], ["Ti B.", "The best restaurant in the area. Very good quality of the food in a casual and friendly atmosphere. Highly recommended and don't miss the polenta."], ["Melay D.", "The wine selection is pretty good and they have a $1 oyster happy hour until 8pm weekdays. We had the cheese board and the cheeses were fresh and tasty. For entrees we ordered the pappardelle w/ short rib and the beet malfatti, both were very good. It was pretty packed for a Tuesday night, we sat at the bar as there were no tables available. The bartenders were knowdlegable, helpful, and attentive."], ["Nikole R.", "Fantastic! The food was delicious and the service was great. We have the food and wine pairing option and we enjoyed every minute of it. We felt the main course could have been a little larger for the size, but you do get a few appetizers that are heavy so those held us over. We cannot wait to go back and try some more delicious menu options! The place is small, but cozy, chic and plays great music."], ["Cora W.", "Had dinner there last weekend . I really wanted the food to be as good as the service. First and foremost, the service was great. Waiters were extremely attentive. As for the food... The chicken liver pate was good, the fried seafood was good as well. The grilled octopus was blend and the meatball dish tasted like tomato sauce, nothing special. I really wanted to like this place because the employees are so nice but unfortunately the food doesn't live up to expectations"], ["Hungry Brooklyn Mike C.", "Outstanding, food was fun and tasty.  I'm not a fan of polenta, but this place could change my mind - it is a must get.  Other standouts were pork milanase, fritto misto, bucatini, broccoli rabe...hell, everything we had was great.  We shared all plates which were nicely presenting on cutting boards or in cast iron.  The staff was friendly and professional - keep things fun and moving.  Go and enjoy and great night of food"]], "Aurora": [["Lulu A.", "Went here for brunch with a group. While it is a beautiful place the food is extremely sub par."], ["Alix S.", "This place blew me and my friends away! I made reservations a few days before for 7:45 on Saturday for three people, requesting to be in the garden and that's where we were. It was beautiful! We were surrounded by lush green vines and fairy lights. What a wonderful atmosphere.  We started with the Fritto Misto, fried shrimp and squid, which was very tasty. I ordered one of the specials,  a veal T-bone with roasted potatoes and mushrooms. It was AMAZING. I have a thing for mushrooms and whenever I see them on a menu I basically have to order that item, but Damn! These mushrooms were the best ones I've ever had! They had so much flavor! Everyone at the table tried them and were raving about how good they were. Even the person who isnt a mushroom fan loved them. My boyfriend ordered the Bistecca, strip steak with roasted potatoes and broccoli rabe, and he loved it. I tasted it as well and it was very good.Im going to recommend this place to everyone.  This is a perfect place to take a date or have a nice dinner with friends."], ["Nerina G.", "This is one of my favorite Italian restaurants. Can't go wrong with any of their salads-always fresh and creative. Their pastas are delicious, especially the ragu. Their chicken and steak dishes never disappoint. Love eating in their garden, whether spring or winter (it is winterized). Services has always been attentive, I probably go every couple of months."], ["Jason O.", "Probably the best Italian restaurant I've ever eaten at... amazing ambiance,  incredible food, immaculate service.  Well done.   I'll be back."], ["J. P.", "Good brunch here. Nice, congenial room, complemented by high-ceilinged enclosed outdoor seating, too.Simple brunch menu, heavy on the egg/hollandaise dishes. We started with Pompelmos (grapefruit, bianco vermouth, mint) which were cool and refreshing. I had the frittata of the day -- zucchini and goat cheese -- which was puffy and light, and covered with a well-dressed insalata mista. My companion had fava beans and peas with sheep's milk ricotta, mint and fiore sardo: light, fresh and good.Excellent bread and peppery, bright green olive oil, and good coffee.Service was just OK, though. We had a revolving cast of waitstaff who seemed mildly disengaged and were not particularly warm. Per the menu, coffee comes with brunch but my java never appeared, and when I requested it late in the meal, the runner seemed confused and dubious... it came thereafter. (The table next to us got coffee shortly after sitting down.)Still, well-prepared, fresh food and a cozy, rustic atmosphere - I would go back."], ["N. S.", "Impressive ambiance, great food and reasonable prices. I came here with my fiancé and well loved the food, service, and ambiance. Its nice to find a nice little italian place that still has a nice feel inside. Loved the food!"], ["Kiki R.", "This place is like a good Italian red wine. It gets better and better with time. It's years my husband and I go here for lunch, brunch and dinner and not once we had been disappointed. Their $20 lunch special (soup or salad, choice of pasta, dessert and a glass of wine) Will leave you full and happy for the rest of the day.For brunch you can't go wrong with their egg Benedict with ricotta truffle and prosciutto di Parma. For dinner their menu change seasonally and everything is amazing. You must go for one of their pasta dishes. As an Italian I can say even in Italy it's had to find a pasta so well cooked! For dessert I always order pannacotta (please tell me how you make it sooo creamy).The only thing I can't enjoy here is their coffee. But still you will not find better Italian in this this neighbor."], ["Lorenzo B.", "Favorite italian restaurant The food is really wonderful and the atmosphere is perfect.It reminds me of beautiful trattorie in Toscana and.Every time i go it's a joy!"], ["Robert G.", "Can't wait to return.  Marvelous experience with high quality rustic Italian cuisine.   Love the atmosphere too and just a few blocks off of hip Bedford Street"], ["Al E.", "DelightfulLovely patio, attentive serviceChewy, light bread basket with strong olive oilPeach, goat cheese and snap pea salad with balsamic -- mmmmmmm so fresh and yummyCavatelli with pesto, crab and asparagus was outstanding! Frutti di mare spaghetti -- pretty goodToo stuffed for dessert!"], ["Vivian L.", "Great for brunch.Really nice atmosphere, and a very inexpensive and a totally worthwhile brunch! Totally worth the value. That french toast was absolutely incredible. Will definitely be back!!!! The food was really good, and it was just a pleasant eating experience! I loved the outside patio, the complementary coffee and juice were great. It was such a nice place for families and groups (I didn't come as a part of the group though).  Service was decent!"], ["Michael t.", "One of the best meals I've had in a very long time. The food was excellent. The menu wasn't boring but wasn't overly unusual, either. Every dish ordered was great. For apps, we had a few specials - a gazpacho and a fig/prosciutto/ricotta dish - as well as a radicchio salad with grilled mushrooms. All were perfect. For main course, I had a branzino that was well prepared and served with delicious heirloom tomatoes and other greens. We also had an order of chicory - which was quite good, too. The setting was great - we were seated in the garden area - and the service was professional / pleasant. I will definitely be back for dinner again soon."], ["Paul S.", "Enjoyed this Brooklyn/Wilamsburg gem. Had the red snapper and Burratta with a friend and colleague. Staff was courteous, informative and attentive. Absolutely worth it."], ["David D.", "This is one of the best restaurants in the United States.  Of course, this authoritative statement comes from someone who has dined out at least 10 times in the past 6 months.  In various places.  Well, okay, it's one of the best restaurants I've ever eaten at, I can say that without a problem.In a nondescript building on a quiet street in Williamsburg, this place has it all; taste, atmosphere, quality, friendliness, the stark charm of a dilapitated past, gastronomic industry and creativity, thoughtful touches of romance and vibe, groovy clientele, and above all, a menu full of mouth-watering entrees.  Even the wine list was pretty sophisticated.  I live in Los Angeles, and even though there are 800 places here and another 1500 in NYC that I could try first, I would definitely want to go back there for a meal.  It was late October, so the details are getting hazy, but I have photographic evidence which I will share soon.  Just wanted to give Aurora some Yelpy love today."], ["Drue T.", "Came on a saturday, early afternoon for brunch. First of all, I almost don't want to review this place because I don't want people to know about this hidden brunch gem. They don't need all the bottomless brunch gimmicks to keep me coming back! Totally worth the trip to BK (and for me thats saying a lot). The outdoor dining room is a beautiful green house (heated in the winter) and the inside is cozy and dark with wood tables. I had L'Englese which was simple and delicious. Amazing thick cut bacon. Delicious local sausage. 2 of the most gorgeous eggs I've ever seen. Perfectly grilled mushrooms and tomatoes. $16 but you also get coffee and fresh squeeze orange or grapefruit juice. A friend of mine had the Eggs Benedict with ham and truffles...O.M.G. I only had a bite but it was heavenly. The waiter was sweet and attentive and the atmosphere was perfect. No wait, no loud crowds, just a perfect Saturday brunch."], ["Iris T.", "After many years of beautiful meals at Aurora, my partner and I rented the restaurant for our 70-person wedding this last July. Our wedding was a total dream and we have nothing but glowing praise for this wonderful gem of a restaurant and it's amazingly generous and accommodating staff! After a gorgeous ceremony in the (very photogenic) garden, we had an elegant and beyond delicious feast accompanied by excellent wine and customized cocktails. Many of our guests said it was the best food they have ever had at a wedding and we couldn't agree more -- from the burrata to the grilled lamb to the panna cotta it was all food perfection. The evening ended with a very fun little dance party inside the restaurant. We wish we could have a party there every year! The staff at Aurora is chill, graceful and professional and they went above and beyond to make sure our wedding totally wonderful. As a venue, Aurora is an incredible value (especially given the insane costs charged by other venues in Brooklyn). We really got the most for our limited budget. Simply,  Aurora is fantastic for dinner and even more wonderful for celebrations! If you are planning an \"intimate-ish\" wedding in Williamsburg look no further!"], ["Amelia C.", "Had a great dinner on a week-night here. My favorite dish that night was the vanilla pannacotta - which might have been the best pannacotta I have ever had! Delicious - creamy, yet so light! I couldn't get enough of it. The shortbread cookie went really well with it, as well as the fruity, and perfectly tart (I think it was raspberry?) drizzle surrounding the cake. Doesn't matter how full you are... the pannacotta is a must.For apps and entrees, we split the:Prosciutto and burrata (both delicious - the burrata was amazing)Grilled mediterranean octopus (Octopus was tasty and a good texture, but I wish we had leafy greens instead of potatoes to accompany it)Gragnano pasta with eggplant, tomato, mozzarella, and pesto (tasty, but nothing to write home about).We had a great red wine to accompany our meal, which we chose with the help of our server.Some of the dishes were excellent, others were just good. I think Aurora is deserving of four stars because of the great ambiance, and lovely garden-like dining area that it has. You really feel transported, dining by candlelight and surrounded by brick walls covered with vines. Great for a romantic date."], ["Jack C.", "Very good free bread. Ordered fish of the day (striped bass) which was surprisingly bland."], ["Jose P.", "Came for dinner visiting NY beautiful restaurant.  Food was very good and all home made even the pasta was made there.  Overall I enjoyed everything and the ambiance is very quiet and chill.  Great spot to go on a date very romantic.  And all the food there is very authentic Italian!  Service also was very quick."], ["Layla D.", "I was there with my friend a couple days ago for the first time, and the atmosphere was a mind-blowing. It's a lovely place. I loved their garden (now the weather is finally nice). Every dish was really delicious and fresh, and the service was outstanding as well. I would definitely recommend this place and would go back."]], "Sottocasa Pizzeria": [["Michael H.", "Hands down the best pizza you will find in New York.The service was very friendly and accommodating, and every pizza we tried was amazing. Definitely worth a visit!"], ["Marcus Z.", "Sì! Sì! Sì! Mille volte sì!There's a lot of pizza in NYC. A LOT! And the competition is very fierce. Luckily, Sottocasa Pizzeria stands out on its own. It's by far the best Neapolitan pizza that I've had in NYC.I walked in and was promptly greeted by a friendly Italian woman. I sat at the bar and looked over the menu. The first thing I noticed was decent prices. Thank God! Pizza is pizza. It's not steak. It shouldn't break the bank. I ordered a beer on tap ($6) and asked the waitress/hostess/owner what she recommended. She asked me what I liked. I told her I wanted something different. She pointed me to the Valdostana which is a standard pizza with prosciutto, fontina cheese and sage. It sounded delicious so I got it. Not even 12 minutes later, I was presented with a beautiful aromatic pizza. The smell from the sage was intoxicating. Usually pizza gets basil but the sage took it to a whole different dimension. I went to work eating and savoring every bite. It was perfect. Salty prosciutto and cheese, a hint of sweetness from the tomatoes and the profumo from the sage. Wow! The crust was charred beautifully and had the perfect balance of chewy and crispy. It was a tad bit \"wet\" but that's how Neapolitan pizzas are supposed to be. Note that the pizzas are individual (10\") but can be shared if you get more than one. Un'esperienza perfetta! Grazie!"], ["Lauren D.", "High praise for Luca and the team at Sottocasa Pizzeria, Boerum Hill. My now husband and I wanted to have a great rehearsal/welcome party for all of our close family and out of town guests that were attending our wedding the next day.  I am from Massachusetts and my husband is from Brooklyn.  We thought it would be a great idea to have a pizza party.  I mean it is the \"Brooklyn Way\"!  Luca and his team were beyond accommodating.  They helped us pick the menu with a variety of options.  I wasn't looking for a stuffy sit down dinner but more of a mix and mingle.  Sottacasa was top notch.  The food was absolutely delicious.  All the pizza came out hot and fresh.  Our guests couldn't stop raving about how delicious the food was.  The team at Sottocasa never missed a beat.  Anytime someone's wine glass was empty or beer was low, they filled it without anyone noticing.  For me, the silent service was perfect.  The restaurant was clean and very accommodating to the 65+ people that we were entertaining.  I would recommend the restaurant to anyone.  Whether it is a first date, gathering of friends or a celebration, Sottocasa is the place to go!Thank you, Lauren and Mike D'Alora"], ["Mike S.", "Talk about a cozy pizza place on the lovely Atlantic Ave strip! Although you may walk down some steps to enter, nothing in this place is low level at all! The authenticity can really be felt from the minute you speak with your server. Strong Italian accent followed by amazing Italian recommendations. My buddy and I split two pies and the charcuterie board. The board was one of the BEST I've had. I want to go back just for the choice meats and cheeses. But don't get me wrong, the pizzas are damn near perfect. Nice char(we even asked for EXTRA CHAR) and they delivered. I can't pronounce the name everytime I tell my friends about it, but that doesn't stop us from going and enjoying Sottocasa!"], ["Graziella O.", "What a cozy spot that is easily missed ! My friend introduced me to this resturant and it was a must try.  Being from an Italian family I am judgmental of Italian food. As well as cooking pizza and pasta from scratch I am quick to judge the pizza.  It wad very flavorful and the sause was perfect, only downside I like my pizza not to be soggy or wet on the  bottom , I prefer the crisper thin crust.  I still really enjoyed the pizza! I do recommend coming here with a small group due to the size. It's super cute and the staff is welcoming and caring !"], ["Louis V.", "Absolutely delicious, with great service. I really enjoyed biting into my Neapolitan pizza. It was as if I were back in Naples. My friend from Pennsylvannia said it best, \"you know this is good pizza when you are looking forward to devouring the crust.\" It was like a little cloud of heaven. And the prosciutto arugula mozzarella was definitely enough for two, as it could feed four easily. You can tell they use quality ingredients in everything they make."], ["Kelly C.", "The pizza wasn't bad, but it wasn't memorable either. Ordered the Verdure and the vegetables were cold and kind of raw. The crust was ok but fell too soggy underneath all the veggies. I don't mind a wet crust on a good Neapolitan style pie but this was too wet for my taste. It was also rather bland, so I had to turn to my best friend, red pepper flakes, to kick in some flavor. Ok for the neighborhood but not even close to the best pizza in Brooklyn. That honor goes to Juliana's, just one train stop away."], ["Bunny B.", "Walked in late afternoon on a Saturday and enjoyed a table for two in the breezy back garden with no wait. Comfortably busy and the staff was friendly - the place was full of young families. I saw many tables ordering tasty looking salads but I went with the Boscaiola - spicy sausage, basil, mushroom, gorgonzola was surprisingly light on oil and absolutely superb! Thin crust at the middle of the pie and thick at the outside with nice chew. The pie reminded me of the personal sized pizzas served in Italy. Totally unpretentious, reasonable and the waitstaff chatting with the table next to ours in Italian confirmed this is not your average pizza joint. I will be back!"], ["Lillian Y.", "Cute and cozy neighborhood pizza joint. Stopped by early on Sunday night for a quick dinner and there were plenty of seats open. The Laura pizza was delicious - the speck was so good and it was really simplicity at its best. The quality of the ingredients really shone. The Verdure pizza was a miss unfortunately. The vegetables are piled too high in the center, and they're too soggy for the thin crust to hold up to. I wish the veg topping was cooked out longer before adding to the pizza, it would've been a better concentrated flavor and less watery. Staff was friendly, food came out super fast, small-ish portions (for a perpetually hungry person like myself, it's the size of a personal pizza). Recommend if you're in the area looking for a quick bite to eat."], ["Priti R.", "Came here on a pizza tour - this was stop 1 out of 3. I wish we could've just stayed here the entire time.This over gets hot. And when I say hot, I mean, surface of the sun hot. The oven is between 900-1000 degrees, which means the amount of time it takes to cook a pie is about 1 minute 30 seconds. The outer layer of the crust is lightly crispy, which the inside is the perfect amount of chewy. I wouldn't consider it \"thin\" crust, nor \"thick\", just \"perfect\".We were given the margarita pizza - the cheese. Oh my gosh that mozzarella. It was fresh, so it sustained some water, and that made the pizza so... tasty. They maybe put 3 or 4 pieces of basil on the pie and you could taste it in every bite.And the tomato sauce. I'm not sure how fresh it is, or if it's canned, but damn do they do a good job of making it seem fresh (if it's not). The place we went to after - it was very obvious that they were using canned tomatoes. But this place? Nah. Tasted fresh as could be - with the perfect amount of saltiness that combined well with the watery mozz and chewy crust. I can't give any of these stars to the service - as we were in a tour group, although the guy making pizzas was super smiley and friendly (easy on the eyes, too!). But I would hope they are on the same level of their pizza. HEAVEN."], ["Ellen F.", "Great pizza and service. The back area is quite charming as well. I will definately return."], ["Godley V.", "Great little pizzeria. Had dinner there last Sunday. Our party of ten were fortunate enough to get a large table almost immediately and sit comfortably. It's not a large place inside so we were in luck! Their menu features several great little pizzas. Fresh, tasty ingredients. Well prepared and served piping hot. Whether you like meat on your pizza or prefer nothing but veggies, you have several options. There are other things from which to choose but we all were game to just order several pies and share. That was a great call. NOTE: the Burrata pizza is only available Friday - Sunday and we *just* missed out on it as they ran out of the burrata cheese.Our server was attentive and helpful with his suggestions on what to order. We probably annoyed him a little with our indecision (thanks to also having 4 kids in our group) but he handled it well.Check out this spot when you're in the area."], ["Sam T.", "Truly authentic New York pizza with incredibly delicious Italian ingredients. I really appreciate how meticulous they are with their ingredients. This flawlessly executed pizza will give you a genuine exposure to Italian flavors and real brooklyn pizza! Definitely check out their website and read the rules before you order.I strongly recommend the Salsiccia with that delicious spicy Italian sausage perfect mozzarella and basil. If you are more of a rosemary fan go for the Laura which is also really good. It's true the speck on the Laura tastes like bacon. If you are staying at the NU hotel they deliver via phone order."], ["Bill S.", "You want authentic Italian pizza? In Brooklyn? In an intimate setting? Sottocasa is your place for Italian pizza.The reason why I say Italian style because this place doesn't serve slices. This is a brick oven pizza restaurant using the freshest ingredients.My college son is home for the holidays and wants pizza. Not just any pizza but pizza made with fresh mozzarella. Authentic Neapolitan pizza. I have Sottocasa bookmarked, lets see how it plays out.The 5 of us walk into a very charming and intimate restaurant. We're seating close to the door at the large country French table. We ordered a Focaccia and a salad topped with ricotta to get the party started. Everyone is saying what their pizza choices should be, I don't hear what they're saying. I'm here on a mission!I ordered \"The Laura\" made with fresh tomatoes, mozzarella, mascarpone, speck and rosemary. Oh baby!The pizza is everything they say it is, the Speck (Italian meat) cooked down and tasted almost like bacon, very very decadent.Now our second choice was \"The Valdostana\" which is tomatoes,mozzarella, fontina, prosciutto di parma and topped with sage. What was brought to our table was not this pizza. Maybe it was a mixture, it's dark inside. what was brought to me was \"The Napoli\" I didn't taste any prosciutto but I did taste anchovies along with tomatoes and mozzarella. We were in a rush, my teenager wanted to go to Film Biz Recycling before they closed at 7pm. We left and loved what we ate. Next time we'll get it all straight. This is my last review for 2014. Happy New Year!!!"], ["Miguel M.", "Best REAL italian pizza in NYC. As simple as that. Great selection of cold cuts and cheeses. Cute basement spot for a greeeeeeat dinner. Thank you!"], ["JL K.", "NO ONE can beat their airy, UBER fresh crust but that's it. Diavola, 4 Formaggi & Margherita were JUST ok. Didn't like the smoked mozzarella on the 4-cheese. Diavola had very little flavor, no salty, smokiness. Margherita was the most flavorful, which shouldn't be. There should've been a progression. Won't return. Too many other good ones nearby."], ["Justine G.", "Such an adorable place! Although I would've normally just walked right by it since it doesn't exactly stand out, after finding it on Yelp and seeing all of the great reviews, I'm so glad that I gave it a try. A friend and I had dinner here the other night and we definitely weren't disappointed. Upon first walking in, you see a cute dining area with a wood burning oven where all of the pizzas are made, but it's even better because the outside is the perfect place to dine before the summer's over. The food is also pretty darn good! While I would pass on the salad next time (we got the Insalatina) since it was fairly small and nothing spectacular, I would definitely return for the pizza. We tried both a red pizza, the Reginella (tomatoes, cherry tomatoes, buffalo mozzarella, basil) and a white pizza, the 4 Formaggi (mozzarella, smoked mozzarella, parmigiano, gorgonzola, basil) and I was equally satisfied with both. The crusts, aka the best part, were nicely charred in all the right spots and before I knew it I had almost finished the whole thing! Throughout our dinner, we were also continuously checked on to make sure that we had everything that we needed, which is always a bonus and when leaving almost everyone working there said goodbye, making it feel like a friendly, neighborhood Italian restaurant. Overall, I was pleased and would recommend for pizza if you're nearby."], ["Win C.", "I'm a big fan of Thin Crust Brick Oven pizza joints, but Sottocasa fell short of my expectations. Don't get me wrong, what everyone says (in terms of flavor) is all true. We ordered a red pizza - Boscaiola (consisting of tomatoes, mozzarella, hot italian sausage, gorgonzola, mushrooms, basil) and a white pizza - Tartufata (consisting of mozzarella, home-made truffle spread, mushrooms, prosciutto di parma, basil) and both were delicious. However, what I was really disappointed in was how the pizza was actually made. They were the most SOGGY pizza I have ever had and it was falling apart all over the place. Too bad...flavor was good though. Also, our arugula salad was very fresh and a good balance with all the pizza we ate."], ["Sabrina D.", "Great base, sauce and fresh ingredients."], ["Ms B.", "amazing service, friendly and courteous staff and food that is out of this world. staff is very kind and aware of your needs. they move fast to deliver your food but slow down and take the time to listen and cater to you. cute ambiance and great crowd. the space is quaint, clean and cutely decorated. recommended for a great place for family, friends or a date night. this place will deliver."], ["Jeff O.", "Really good pizza. Blistered crust, quality ingredients. Staff is friendly, setting is nice - dig the photos on the white-brick walls.Only quibble is with the drink offerings -- aside from a couple \"house selections,\" the beers are wildly expensive, generally close to $15 for a normal bottle of Italian microbrew. Wines, on the other hand, are very reasonably priced, but there are only two by-the-glass selections, one of which is a (presumably boxed) Chianti also offered by the carafe. Small booze issues aside, would stop by in a heartbeat next time we're in the neighborhood."], ["Massimo P.", "Well, the ambiance is basic yet pleasant, and they have a remarkable selection of Italian microbrews, which are difficult to find in New York. But the pizzas we ordered came out suspiciously quickly (2 minutes), and sure enough, the crust was nothing like it should have been (i.e., it was soggy). Did they just warm up something they had ready to go? That would be a definite no-no. Yet, some friends keep telling me it's worth a second try, we'll see..."], ["Or L.", "We had the Laura and the Verdure. Both really good, but the Laura is amazing. Only thing is that the knife keeps squeaking on the plates and it's horrible."], ["Shawn B.", "Amazing quaint pizzeria.  Friendly staff, great ambiance and fresh, delicious ingrediants.  Can't wait to go back!"], ["Mary L.", "Came here on a Sunday evening and there was not a wait. We had the appetizer meat and cheese board which came with a Rosemary flatbread (amazing). The atmosphere was really nice, but was a little too bright for a true date spot. I want to note that they do not have air conditioning which made it a little uncomfortable to sit for a while on a hot summer day. Not to mention they have an open kitchen pizza oven. Would definitely come here again on a cooler day."], ["Olivia T.", "The Margherita is amazing!"], ["Lana T.", "I read some reviews from my yelp friends and had to give this place a try.  A bit torn as to how to rate this place.  I ordered the prosciutto crudo and added spicy salami!  It was awesome, BUT it just needed a kick (hint sottocasa, make spicy oil if it had this oil I would have been in love!)Venue (4/5) casual vibe.  The owner and wait staff are very attentive and the atmosphere feels like a neighborhood favorite.  Service (4/5) attentive and knowledgable on pizza!Food: (3.5/5) a bit bland but the crust was good."], ["Erin ..", "We arrived around 7pm on a Sunday, and even though the place was full we were seated very quickly. The staff is very nice and attentive. The interior and ambiance is trendy and welcoming. We had the focaccia and a Italian ham pizza, both of which we're delicious. The house lager is good as well. Highly recommend!"], ["David D.", "Fantastic pizza! We literally stumbled onto, and into, this place during a an overnight in Brioklyn and were overwhelmed!Great pizza and great experience."], ["Justin L.", "The other day I realized that I was in a pizza mood.  Now I've almost completely cut pizza out of my diet at this point, and yes by saying that I know I sound like a bitch (all due deference to bitches).  With one small exception, I hadn't had pizza in months.  I'm Italian.  That's a problem.  To rectify this I visited Sottocasa, which was on my pizza hit list.  Being in the basement of a building, the space was small and intimate.  I decided to sit in the backyard, which has an enclosed patio along with some other open air tables.  The servers are all Italian, which I don't mind but actually isn't that big of a plus.  Namely, my server was kind of a douche and not all that knowledgeable about the menu; I thought at first this may have just been the language gap but it definitely wasn't.  For instance he didn't know basic facts like where the ingredients were from, couldn't make a recommendation outside of a clear upsell, and otherwise relied on his accent and being a \"pretty boy\" rather than actually being good at his job.  That might work with some 20-something girl from the Midwest who just moved to Brooklyn because it's \"cool\", but it doesn't do much for me.  I'd take someone of ANY ethnic background who actually knows what they're doing any day of the week.They talk a lot about the beer list here, which may be the last place in Brooklyn dominated by Italians.  Italian beers, that is.  I actually wasn't that impressed, as I know a few places with better or comparable lists of Italian beers.  There were some good items to select from even if they price gouge out the ass ($12-$15 per glass).  I grabbed Super by Baladin which was great (very nuanced), and their house ale which was just beer (mediocre).  I got the diavola for my pizza, which is a margherita with hot soppressata and olives.  While some elements of this were good the whole thing fell well short.  In particular the olives were applied with a very heavy hand.  The use of olives and their saltiness to enhance the spice of the soppressata isn't a bad idea but they overshadowed everything else on the pie.  The soppressata was standard and very plentiful, but again this overshadowed some good fresh mozzarella.  The tomatoes were mediocre and were rightly lost in the application.  In addition the end crust was good, but the inner crust was far too thick to take on the characteristic \"wetness\" of a prototypical pizza napoletana.  This means you're eating a thick piece of bread rather than the thin, delicate set of contrasts that mark a great pizza napoletana.  All in all there were far too many things that prevented me from enjoying this pizza.  You'd expect some guys from Napoli to do a much better job.I'd go back to give Sottocasa another shot if I was with someone who wanted to try it, but I'm not explicitly going to it again.  It's okay, not even close to great.  And with more and more pizzerias opening it just fades quietly into the background.  Luckily the restaurant seems to be well run enough as they have a decent regular customer base; they'll be fine just where they are.  Classic example of an overhyped pizzeria.Edit (addressing the owner comment): Luca, I'd rather respond to you publicly.  Sounds like you have some problems; in particular you think your customers owe your restaurant something.  Respect is earned not given.  Your pizza was downright mediocre and my experience was subpar.  I've never once flouted my Elite status anywhere for any reason, let alone in your establishment.  Reading it again, I don't have any issue with the verbiage in my review, especially considering it was accurate; if anything I was generous.  I may try to be funny at certain points in the review as that's my writing style, however I think it's clear for anyone reading that I am actually calling out the lack of service I received.  If you don't want to take criticism it's your problem.  I'm knocking this down to 1 star which is where it belongs."], ["laura p.", "Wow! Gluten-free pizza that tasted like pizza! I was very impressed!  I really wish I could have had some of the other pizzas there too...not enough time. The place gives the feeling that you wandered into someone's Italian house and just sat down for dinner or drinks. Not fancy, but cozy, and they have an outdoor patio. Definitely a place to go for fantastic pizza. And did I mention GLUTEN-FREE CRUST that actually tastes like pizza??? Miracle."], ["Noor S.", "EDIT RESPONSE TO OWNER: im not sure what footage you saw but I KNOW what happened. my husband and friends wouldn't lie about the staff not checking up. neither would I! also, does your footage have sound?? were we mic'd? is this a reality show? lol no one asked us about the baby or our needs at all. the only check ins we're to order food and get the check. I wouldn't make this stuff up and I can't believe I'm having to defend my review. ridiculous. we liked the food! we would've loved to go back! but the servers did not give us the attention we really needed. the people who came with us have been to your establishment before with rave reviews and even they said the staff was noticeably rude and inattentive. your response proves what I thought abt your joint: You don't care abt your customers! ORIGINAL REVIEW: I was at sottocasa today with 2 friends my husband and my 13 month old son.  I'm giving them 1 star not for the food. the food was great. we got 4 pies, I had the Quattro formagi and the Buratta. this is prob the most yummy crust since the ones we had in Rome and Florence. they get 1 star because of the treatment of their customers by their horrible staff. we ordered coffees. the waiter came and put a hot cup of coffee right in front of my 13 month old. we brunch a lot. no one does this. no one puts hot food in front of a baby. you know why? because babies grab everything. so what does my son do? he immediately shoves his little chubby hand into a hot cup of coffee before I can move it away from him and spills hot coffee all over him. obviously hysterically crying right away at this point so I pick him right up and run to the bathroom and quickly remove his coffee soaked clothes and run cold water on his hands arms legs and feet. it's March. it's cold. so my husband has to now go to the gap on Fulton and get my son a change of clothes. that takes up about 20 mins. while we waited for him to return, no one, not the waitress or waiter or host or anyone, no one comes to say are u ok? is your baby ok? can we do anything? do u need anything? nope. nothing. instead they AVOID US! they literally walk around and past our table for 30 mins. when we finally waved them down they put our order in and the pizzas came out right away. we ate and chatted and tried to put the horrible hour behind us. people with kids know it takes much longer to finish ur food when u have a needy kid. well before i could finish my pizza the waiter came and took my plate away. I was tending to my sweet baby who had a pretty rough morning! they basically rushed us out the door and wanted to pretend like nothing happened. so first your poor wait staff foolishly puts a cup of hot coffee in front of a toddler. then ignores me. doesn't offer anything to a hysterical customer. then quickly rushes me out the door. maybe I wanted tiramisu? nope. didn't ask. nothing. they literally pretended like all that didn't happen. you could've at least said sorry or checked up on us or let us finish our food! it was so bizarre. I unfortunately will not be going back because even though the food was good the service left a disgusting taste in our mouth."], ["Elisa H.", "Let me start by saying I am a little fanatic about pizza. (And by a little I mean a lot). Came here after arriving from San Diego- sat on the back patio which was adorable! Ordered a glass of sav blanc and started with a house salad. Then we split a pizza with sausage, goat cheese, basil, mushrooms and added arugula. SO good!!! Dough was cooked to perfection and it was freshly baked. Service was on point and we got everything quickly. I already want to go back and it's 7am!"], ["Kimberly K.", "Great summer meal!  Shared a pizza, salad, and small carafe of sangria with my daughter.  Finished with lemon sorbetto for dessert. All delicious."], ["Katrina L.", "The pizza here is amazing. Chewy dough and fresh toppings, can't go wrong with pizza here. I usually split a salad and pizza, which is filling enough for two. The place itself has a lovely rustic look. Service, however, is a bit slow. Like hey dudes, I'm not checking you out. I'm looking at you to get your attention and to get the check."], ["Kara N.", "From what everyone on Yelp says and what Google has told me, the dollar pizza I have been shoveling down my gullet for the last decade is not real Italian pizza. Here I was thinking I was a native New Yorker, pizza connoisseur...Fuck it, I still love my dollar pizza but I love Sottocasa too. It's definitely soggier than other \"pizza,\" but it wasn't like a bad or inedible soggy... ya know? It was actually ridiculously tasty, the crust was thicker and had a good crunch to the outside while the center of the crust was thin and wet with tomato sauce and topped with spicy sausage (definitely the best topping ever), everything tastes fresh and amazing. I'm not sure how this perfection was achieved in like 3 minutes (that's how long it took for our order to come out) but I'm not complaining.Price point wasn't crazy but it wasn't cheap by pizza standards either, it ranges between $9 to $18 for a relatively small pizza, relative being the very important key word here because it was filling enough for the two of us. I know it sounds expensive because you can get a 16\" pie for like $8 nowadays but this pizza and NY pizza is a completely different experience, not even in the same categories of food in my opinion. Non-believers, go give it a shot and if you hate it... then Idk but by the looks of the reviews, the owner is happy to refund the haters.I want to say it's authentic Italian but how the hell would I know? I just know that it tastes really good."], ["James A.", "Awesome pizza, cute/fun/romantic restaurant, and really nice service. I've tried almost all of the pizzas here and you really can't go wrong. Try one of the interesting draft beers to go along with it and you're in for a great night. The tables in back are in an atrium-like space."], ["Yoori S.", "I'm so happy to be reunited with my favorite pizza in the entire world! The restaurant is nice and cozy, and the guys here are great!"], ["Mimi M.", "I had really high expectations for this place, based on so many positive recommendations from friends.  Unfortunately, the experience fell flat for me.  The pizza was only ok- doughy crust that wasn't fully cooked through, and lackluster flavor.  The backyard garden is charming, so points for ambiance."], ["Tyler R.", "Came here because of high reviews on yelp. So glad to have found this place close to where I work. The pizza was delicious (ordered the Popeye) and the service was perfect. The waiter and runners always seemed to show up at the exact right time. My girlfriend has been a food and beverage manager and she was extremely impressed. We ordered the tagliere for the appetizer. Generous portions of Italian meat and cheese and it came with a huge slap of rosemary bread. May get something lighter next time as I barely finished the pizza. We will be back. :)"]], "Panino Rustico": [["C. Marie ..", "Excellent paninis! Delivery service is also excellent. They arrive very quickly and are very courteous.Salads could use some work. I ordered a standard chicken salad with dressing on the side. There were only little skimpy pieces of chicken breast within the salad. The croutons also didn't taste fresh. I will stick with the paninis going forward as they are the main highlight here."], ["Mariana P.", "Amazing paninis! Make sure you bring cash although there's an ATM inside, it charges you a dollar to take out the cash so bring cash with you. Although the place is small the taste is amazing and the service is pretty good too."], ["Alexis A.", "This cute little espresso, breakfast/lunch spot is located right on the corner and it has an outdoor and indoor seating, it can def. become busy and crowded but once you get your seat everything is just happiness from there from your choice of coffees to your salad and choice of having maybe some sweet crepes, a bowl of soup or a nice toasted panini of your taste bud. You can order online for free also and the workers are very kind and attentive to you. I love the tree outside that had all white lights decorated around it also! Bring your own bottle of wine & enjoy it with a nice order of ANTIPASTA with assorted meats and olives which was the cutest presentation when it landed on my table. As you can see in the picture I put up. The meats were nicely cut thin and fresh! I loved the little bowl of olives too, I am obsess with salt and olives are just everything just be careful there pitted. Main dish we had the grilled chicken panini with mozzarella, argula, roasted peppers and pesto dressing with extra pesto on the side! That sauce is everything, just pour it on everything and anything thats how good it was and so fresh! The panini is actually pretty big too so I had some to take home, woohooDessert we had us the sea salted caramel gelato with a mini fresh cannoli and the Nutella crepes! OH MY SWEET SUGA HEAVENS! IT WAS EVERYTHING MORE! Super fresh, taste was impeccable and how can you ever go wrong on Nutella! Its was just the best ending and sweetness to my meal! Lauren one of the owners is a total gem, she offered us a complimentary glass of red wine and she was so attentive and helpful with our food choices and orders, she won be over big time with the choice of the Nutella crepes! Girl you is the bombbb ! LolPrices are reasonable and great and I will for sure be back here! Even if it's for a ice coffee and bagel to go!IF your driving please give yourself a 30 minute or plus open room for finding parking because that will take up hunger pains till you finally found a tight spot."], ["Mitchell M.", "I was there for lunch on Friday,with my daughter and her boyfriend.we sat outside the service was great they asked if I wanted a glass of wine.the food was great and the service is even better.they make great panini's and the crepe's are to die for.i would recommend if you have not ate here to give it a try you will not be disappointed.thx again owner Louie for such a good place in Dyker heights to come to and have good food. Can not wait to go back."], ["Jennifer W.", "I would say this is somewhat a gem in Brooklyn. It's like having a Manhattan brunch without going to Manhattan. The decor is cute and there is outdoor seating.  We had to film a short skit and chose Panini Rustico to be our location and they didn't give us a hard time. I didn't give it a five star because the food wasn't exceptional. It was good but not memorable and the crepe was not very good."], ["John D.", "Home town look, sound ( soft Italian background music) feel & smell ( not quite sure what a hometown smell smells like, but I think it smells like this place). $6 for a bowl of homemade soup is a bit steep for a small local cafe, but the cream of broccoli was nicely medium body creamy ( no cheese) not too watery or thick with the perfect amount of fresh broccoli to satisfy the taste buds and tum tum. $10 for fresh prosciutto, roasted red peppers basil leaves, fresh mozzarella, balsamic glaze on a very unique \"everything\" ciabbatta panini. Quite unique although I do wish there was more meat, in fact it was rather on the slim side and my review does take this into consideration. Tasty though.Now the lunch I had was good yet as I've already explained there was some things lacking ( meat). For carnivore's like me that's a big thing missing. When viewing the menu I saw multiple deviations of the same item over again. In fact I don't believe I saw anything out of the ordinary or any type of a signature sandwich that would make you scratch your head and say \" now that's interesting, gotta have it\". Attentive service and friendly. Very small on the inside maybe 7 tables, but there is also outside seating weather permitting.  Cash only is a big downer in this day & age.So for the higher than average price, slim samich, lack of variety and cash only for what it is, I can't in good conscious give this place more than a strong 3, although I wanted to."], ["Susan M.", "They have really good panini's here. I love to get the    Panini with fresh mozzarella , prosciutto, lettuce , tomato and pesto sauce. That's my favorite one. They also have good crepes here as well. When I used to work by there we would order and I would get strawberry and Nutella creep with there iced latte and it was so good."], ["Jeff H.", "Rarely do you find a place that has the essence of a Manhattan cafe/eatery that is located in the middle of a quiet Brooklyn neighborhood.I finally brought my wife here for lunch, having passed by it multiple times as we live only two blocks away. All the tables were taken inside but we opted for the outside seats as it was a nice day. We ordered the mixed plate antipasti to start off with and two paninis as our main dish. Let me just say, that the food was delicious, our experience was delightful and that we will definitely be coming back again."], ["Thomas C.", "Don't get me wrong this place makes some of the best and only panino di porchetta. After having some in italy I just need to have them in the states. This place makes it within walking distance from me. What more could I ask for?The sandwiches we had were good. But it was drenched in oil. It became 60% sandwich 40% oil. The oil does not drip from the sandwich, it pours. Dick Cheney was outside the door it was so oily. The kitchen staff probably had the mucho mucho  es bueno  mentality but this is where this place lose a star."], ["Tonya B.", "My husband and I were in Brooklyn yesterday for business and we were hungry. After spending several minutes researching restaurants in the area we came across this little gem.  The interior was very inviting and the workers were pleasant. Which was already a plus in my book. We ordered the P20 (grilled chicken, mozzarella, roasted red pepper, arugula & basil pesto) and the P37 (grilled chicken, bacon, pepper jack cheese & ranch dressing). Both sandwiches were very good.  The chicken was moist, the bread was crisp everything was fresh. Traveling from Long Island might be a bit of a journey but I can't wait to try more items from their menu. Thanks for a delightful afternoon!!"], ["Jennifer S.", "This is one of the best restaurants I've ever eaten at. A friend of mine introduced me to it and I've introduced another 15 people to it. The paninis and crepes are to DIE for. I always get the prosciutto and mozzarella crepes with arugula and a balsamic drizzle. Then I get a banana/nutella crepe with whipped cream for dessert. I weep at the thought of both. I also had their tomato soup in the winter and it was really good, and grilled chicken salad in the summer which was amazing. And the cappuccino will keep you up for 3 days, so plan accordingly.It gets busy at lunchtime every single day, so set aside some time to wait. The prices are dirt cheap, too. It's something like $8 for a crepe or panini. I can't recommend this place enough!"], ["Hikari N.", "The food taste deliciously great! I've ordered Roast Beef w/ Fresh Mozzarella Wrap (W4) and Fresh Strawberry & Strawberry Preserve Sweet Crepe (S12) total amount to $14.70.The workers and the cashier are both pretty friendly and positive. Nice place to visit. Good food as well, and I will come back here next time."], ["Dee B.", "The best lunch spot in Brooklyn! Always fresh and delicious! The staff is welcoming and friendly. I'm addicted!!!"], ["Joe A.", "Great little place in Bensonhurst Brooklyn. They have great coffee and crepes. However their panini menu has a delicious variety sandwiches. Also they have whole wheat bread for those who may be conscientious about their diet. When the weather is nice sit outside! It is one of my favorite places in Brooklyn."], ["C C.", "firstly the girl that seated us and took our order was extremely nice the food was also delicious and for the price the portion is great    if I wasn't already full from the paninis I would of called for dessert hahaservice was great as well, staff constantly came over to check up on us and refill our water which is a plus def coming back to try other paninis :')"], ["Mary F.", "Okay, this review can't be that long b/c everything on their menu that is a panini is a must-have. God, I love bread and crunchy bread with ooey goodness inside is just christmas everyday. They do delivery too! Panino Rustico, you may be the reason my abs are leaving. All is forgiven."], ["Jessie K.", "I found this place on yelp a long time ago but haven't got a chance to visit until today. I order P20 which is grilled chicken panini with mozzarella, red pepper and pesto. It's probably the best panini I ever had. The staff is very attentive too. The panini is huge and I  can only finish half of it and take the other half home. I need to try their dessert next time!!"], ["Leo K.", "Seriously this place gets better every time I come here. Aside from the Paninis, which are still the best I ever had since my last review, and a great cup of coffee, the bruschetta here is off the chart! Don't miss out on the eggplant and goat cheese and the pomedoro, you will will not regret it.Wish they were open on Sundays because thats when my craving to come here is at its peak lol"], ["Anna N.", "Really cute little corner cafe with delicious paninis. I've been wanting to try this place for a long time and so glad I did. I do wish there was a panini option with roasted/grilled veggies with olive tapenade or anything that wasn't fish with olive tapenade but no biggie. I ordered the Hot Soppresata, Smoked Mozzarella & Roasted Peppers Panini instead and that was so good. I'm no good with Italian (the language) so I had no idea what soppresata was when I ordered it but was crossing fingers it was a type of meat, which thankfully it was! It wasn't as spicy as I thought it would be but it had a bit of heat. Overall a tasty and flavorful sandwich, which came with a small side salad on the plate. Their frozen hot chocolate was also pretty good on a hot day. Would love to come back and try their other menu items!"], ["Samantha G.", "The panini's are delicious !!!!!!!!!!! Had a few and loved them all. Today I had the bacon egg & cheese panini & that was amazing also. Love it."], ["Ed P.", "Good place to stop and grab a panini....iced coffee is really good as well...Prices are pretty decent"], ["Leon M.", "This place is a true gem, Brooklyn should value genuine businesses like this a lot more.Delicious soup, great coffee and the best panini's I've ever ate. My favorite is the smoked salmon with avacodo, onion and cheese. Awesome place to grab a bite in the summer time, especially with the outside seating. Price are reasonable and affordable, cash only! Respect!"], ["Madison H.", "Yummmmm! It's a welcome variety of food considering all if the Japanese, Chinese and pizza places around here. Panninis are HUGE. Very tasty, and you can tell all of the ingredients are remarkably fresh. Mozzarella bruschetta is out of this world. Staff is very friendly and accommodating."], ["Linda S.", "my favorite neighborhood spot. A cozy old school little cafe with amazing food, amazing variety, REASONABLE PRICES!! (helllllo $20 lunch , where have you been? ) and very attentive staff!!"], ["Geekar L.", "I found this place on yelp and had been meaning to try it out. My friend and I came here for a late lunch. I am well aware that they are known for their paninis, which looked delicious by the way. My friend and I ended up going for a sweet crepe (Nutella and strawberries) and a savory crepe (prosciutto, mozarella). My friend got the frappe, which wasn't overly sweet or overly watered down. I had an iced Americano, loved it! Their coffee is pretty good here!Service was good too, I'd definitely recommend this place for a nice cafe experience and I will definitely be back to try a panini! I also love the fact that it's located in a quiet area so you can sit outside when the weather is nice!"], ["Aneisa A.", "Amazing food and nice atmosphere. It's small and quaint but the service is nothing short of excellent. The menu is so large I often have trouble deciding what to order (never a bad thing though). The one downside which is why I didn't give this place 5 stars is the fact that they do not accept cards. Cash only however they do have an atm in case you don't have cash on hand. The creamy basil pesto sauce is so good I want to order a bucket to go and use it with everything I cook at home. There are chairs outside also for those that prefer fresh air. This place isn't expected where it is as it's located in a pretty residential area but I am so glad that it is. My go to picks are p20 grilled chicken roasted peppers and mozzarella as well as p26 grilled chicken and broccoli raab. Must try if you haven't."], ["Dunbae M.", "Awesome food and menu, amazing and welcoming staff, and a great atmosphere to eat and chat in. One of my favorite places. Their crepes are also delicious and they offer to split an order in half if you feel like sharing with a friend. Can't go wrong here!"], ["Petra R.", "Love this place! True Italian panini, delicious crepes, both savory (hello Prosciutto with Mozzarella, Arugula and Balsamic Crepe!) and sweet crepes, and yummy smoothies. Perfect place for summer dine outs. Cozy seatings outside."], ["Dot G.", "This place has the best egg sandwich I've ever had in my entire life. It is ridiculous. The eggs are so fluffy and perfect and they taste great. I ask them to put mozzarella on mine, which they do at no extra charge, and there is so much of this amazing stretchy fresh mozzarella it's just bananas. All of the food is great, I love a good cheese plate and they never disappoint. The delivery wait time is like 15 minutes every time and the delivery gentlemen are always lovely. Anddd most incredibly they are consistent, it is always top notch and always greatly satisfying.I finished my eggy sandwich as I finished this review and I already miss it. I'd consider obesity just to eat one of these every meal."], ["Deniz O.", "I ordered food couple of times from this place, the order limits were different every time. The last one was $20, it was $12 a week before. The food is avarage"], ["Patty C.", "Cute cafe! I ordered the salmon avocado panini. The salmon was very fresh. I think adding some cream cheese instead of goat would be better for me though. The one flaw is it's a small cafe so when the staff are using the blender, it's really loud"], ["Lucy R.", "Wonderful food. Everything is fresh and taste great. Please don't change ever.My boyfriend and I love Saturday lunch at this spot."], ["Robert M.", "Sandwiches done right! I've been here 3 times and their panino sandwiches and service are always excellent. The place is located on a residential block corner which you don't see often in Brooklyn so it is super quiet if you want to sit outside and eat with your loved ones in good weather. Cash only."], ["Allison K.", "THE LOVE I HAVE FOR THIS PLACE....On the corner of 83rd and 17th you'll find this little gem. The restaurant is small but has outdoor seating for the warmer months. Sitting outside enjoying their delicious food is why I keep coming back for more. Their meat and cheese plates are fun to snack on as a little appetizer. All their soups are homemade and DELICIOUS. I was never a soup person and never will be unless it's here. Their salads are refreshing and their dressings are also homemade. TO THE PERSON WHO INVENTED THE CREAMY BASIL DRESSING: I WOULD KISS THE GROUNDS YOU WALK ON! I really do love that dressing. Now, the paninis, everything is fresh, homemade feel, and smooshed on two toasty pieces of bread. The salmon, red onion, avocado and goat cheese panini is a MUST try and seems to be quite popular. I have tried many of their paninis and can proudly say was never disappointed. This place is also BYOB, which I have yet to take advantage of. It is also kid friendly which I really appreciate (high chair, kid menu and all!)"], ["Tiffany L.", "went today. Had Caesar salad which was a bit salty. Had Grilled chicken avocado goat cheese and balsamic glaze panini. It was pretty good. My husband got the espresso in a coffee cup. Good espresso but if this place says espresso bar on the window it should be served in an espresso cup.  Not sure if maybe they ran out but it wasn't that busy and it was the morning like 1130. My husband also had Caesar salad and the grilled chicken bacon provolone panini and he enjoyed it. The only thing for me that was annoying was the menu. It's on a laminated paper but the font is too small to read and the ink is faded out. It's like a laminated Xerox copy of the menu which I think is kinda ghetto fab. It's better to laminate a better copy on nice paper. Just because this place is nice so the menu should do it more justice. So I suggest you guys change that menu to make it darker so it's easier to see better. Otherwise good food tho!"], ["Derry H.", "Nice place to to enjoy you're panini ,I really like the place nothing to say so clean cash only but not to bad"], ["Silvia L.", "The food was very good. Just got to say that the service wasn't as satisfying as I would liked it to be. First arrived and we notified the girls (employees) we were going to have a seat outside... Okay no more thank 5 min went by  and I had to stand up and wave at the girls ( employees) for attention. Okay I understand maybe they didn't see us. So they give us the menus and we order good so far and our plates arrived quickly again good so far, but the thing that blew me off was that I wasn't offer any utensils nor napkins so I literally got up and got my table  what we needed. I don't go to a restaurant to server myself and if I wanted to I'd go to a buffet. I would of understood it it was packed but they had only 4 tables to serve I don't ask for much"], ["Da G.", "Easy to give this place 5 stars. Excellent choices on a very extensive menu. The bruschetta with caponata and goat cheese appetizer is insane. I've tried at least 3/4 of all the panini choices on the menu and have never been disappointed. It's a small place set in a local, very residential area. Service is impeccable. The girls who work there are very attentive and are always checking in to see if everything is OK. Great coffee, cappuccino and of course espresso. Its one of the last great local Italian eateries that has that real cafe feel."], ["Priscilla L.", "I have ordered from Panino Rustico multiple times now and I am always happy with their performance. The paninis are to die for. My favorite one is the salmon with goat cheese. The avocado is always ripe and everything just blends well together. I have also had their soups before and the minestrone is my favorite. I have yet to actually go the the restaurant to eat in, but if their delivery food tastes this amazing, I can only imagine what it would taste like when they serve it!!"], ["Lea J.", "I don't even know why this place has a higher star than 3. Their panini isn't even so great and is not worth the price. The panini is so dry and hard and they don't give a lot of meat with it. Their menu shows 6 different soup but they don't inform that it's one kind of soup per day. The cashier doesn't even know how to do math and charge me more than what it cost. gosh I'm so irritated!!"]], "Al Di La Trattoria": [["Briana M.", "A long, long time ago, when 5th Avenue was just starting to get \"nice\" I went to dinner at al di la. I was probably 10, and ecstatic. The Zagat guides I read for fun told me that this was a place I had to eat. So my parents took my grandparents (it was probably the other way around) and my sister for a special night out. I remember ordering risotto for the first time. It was lemony. I hated it. Dessert was the affogatto. I had pictured it creating an espresso shell around the gelato - no such luck. I was not impressed. Whenever people brought the restaurant up, I'd poo-poo it. The best part of the restaurant was my grandfather's joy at seeing John Turturro a couple tables away. Flash forward to 2014, sixteen years and many meals later. I chose al di la for my birthday dinner. And guess what? I was not disappointed. The service was amazing - and patient - with my boisterous and scatter brained family, and my cavatelli with goat ragu was incredible. We ordered most of the appetizers - all incredible. The concord grape focaccia with salad was a standout. The flavors were amazing. I wouldn't order steak here - it was good, but I can get better elsewhere. I thought the cavatelli and the rabbit stood out a lot more."], ["Kyle Martin D.", "Bunny or baby cow liver? What to do? As a disgusting, slovenly, uncultured oaf, I ordered both and had leftovers the next day. Does that make me a bad person? It's safe to say it blackened my soul even further, and if there is a sky god up there dishing out karma-related justice, you can rest assured that I'm going to pay immensely in the afterlife for my food-related sins. My friend, a bleeding heart Canadian living in Boerum Hill, watched in horror as I took one animated bite after another in-between swigs of wine. She picked it. It was red. I also had a glass of water and small salad with a piece of meat thrown in for good measure. I don't remember what she ordered, but she was the one who recommended this place. And I'm glad she did.The next time I'm in Park Slope I plan on going to Pork Slope and eating everything on the menu."], ["John B.", "I had the spaghetti neri and my wife had the pasta pork shoulder special. Both were excellent. Great wine recommendation by waitress. Great service."], ["Peggy N.", "We came to Al Di La Trattoria on a whim on  Saturday night. It was past 8pm and the place was full with more customers coming in, so you know this place is good. The maitre'd said the wait would be 30 minutes for 2 but it was shorter than that. The setting of the restaurant was dark and rustic. The ceiling and the walls look like they're falling apart but I think that just adds to the charm of the place.Antipasti: Seppia and Oxtail (Cuttlefish and Oxtail on Polenta)I'm usually not a big fan of polenta but this dish mixed with the black ink came out pretty good. I really enjoyed it; the polenta was creamy and not gritty, and very flavorful.Primi: Spaghetti Neri Alla Chitarra (Homemade black spaghetti with octopus) and Risotto of the Day (Risotta with carrots and Quail)- My boyfriend didn't like the spaghetti dish too much - just not his thing; but I thoroughly enjoyed it. The spaghetti was perfectly al dente and the octopus ink sauce wasn't overwhelming. The dish isn't as heavy as it looks. The basil really complemented the ink as well.- I thought the risotto was mediocre but my boyfriend really enjoyed this dish over the spaghetti. The risotto was creamy but still grainy - I prefer my risotto to be a little more cooked. I thought the quails were a little dry and the risotto could have had a little more season to it.Secondi: Saltimbocca Alla Romana (Boneless pork loins)We thought the pork loins were on the dry side but good flavors. Also, by this round, we were feeling full from the previous dishes. Contorni: Roasted Brussel SproutsThe brussel sprouts weren't anything special. It was just like any roasted brussel sprout dish; it was good though.Dessert: Sorbetti di Frutta & GelatiThey give you 3 scoops of 3 different sorbets. They don't tell you what the flavors are; the waitress came over and asked if we had figured out what they were afterwards. We were able to tell 2 out of 3. The cherry sorbet which we didn't guess did not have the artificial cherry flavor so that's why we couldn't tell. It was tart but good. Another flavor was the coconut one which was light  with a bit of a toasted flavor. The third flavor, which I'm never a fan of , was the dark chocolate.Overall, I did enjoy the food at Al Di La Trattoria an I would go back to try other dishes, such as the Braised Rabbit."], ["Freddy V.", "Had dinner for 4 at Al Di La Trattoria on a Sunday evening Memorial Day weekend.  The restaurant does not take reservations and plan on a short wait of 30 mins. during peak hours.  The restaurant fits around 50 people in total and is a cute spot in the heart of Park Slope.Our party enjoyed the following dishes:ESCAROLE SALAD - 4 ****SMIXED GREEN SALAD - 3***SSALTIMBOCCA ALLA ROMANA - 5*****S (Amazing Entree with flavor galore)HAKE (Fish of the day) - 3***SGALLETTO ALLA DIAVOLA - 4****S (Whole mini chicken with lots of work to eat)CRUSHED YUKON GOLD POTATOES - 5*****SService was great, noise levels were average with a full restaurant, and ambiance was above average.  I would come back again for dinner."], ["Sania M.", "I love Italian food. However, I have to say that this was just ok. Brown butter sauce should have depth and thickness which is part of the delicious rich flavor. This restaurant provided a basic butter sauce and tried to past it of as brown butter. The tortellini was fresh but left much to be desired . The fish special was really exceptional- light and flakey. The squid was remarkable smooth and not chewy- surprising and very delightful. Ceviche squid is the way to go!Overall experience was ok, nothing in particular would have me running to come back for more"], ["Kimi R.", "I'm not sure if Al di La is a 3 or 4 star restaurant?I was back recently for a feast with eight friends, and the food was delicious!Our waitress was very patient, considering the amount of food, wine and time we spent at our table.  Another was annoyed at me standing in her way, while waiting to use the restroom.  (Thanks for the lecture about this being a passageway, etc.)I'm very nostalgic for Carroll Gardens and South Slope during the first years of gentrification fifteen years ago, when out of the way restaurants like Al di La, were as coveted as places in the city.Al di La seems to be on the tourist's radar, a bit like Gramaldi's, and what comes with that is diners in shorts, reading their NYC guidebooks between courses.  \"Things Change,\" I'm often reminded by my best friend, and have to accept that South Slope has been mainstream for a while now.I was happy to have a great meal at an old favorite after a handful of bad ones."], ["Blaire F.", "I was excited to check this place out so I stopped by for lunch with my best friend. We both ordered two different seasonal salads, I had the pasta and my friend had the mushroom risotto. Although the descriptions on the menu made it seem as if we were ordering different salads, they were very similar and unimpressive. It could be that they do not put as much stock in their lunch menu as they do in their dinner.My pasta was good, but my friends mushroom risotto was terrible. My friend has a gluten restriction so she is limited in choice, and this was not a winner. We opted to skip dessert so I cannot review on that. I may come back for dinner to give it another try."], ["Alexandra G.", "Went with my family before a concert and we had a great meal, plus great service! I would definitely go back!!!"], ["Damon M.", "Always a pleasure; the wine, the bread and that amazing chandelier from Murano. Oh, and the food ain't bad either. The don't take reservations so go early or be prepared to wait. 8:30 on a Tuesday also works."], ["Rachel K.", "I really wanted to like this because I had heard so much about it. But alas it was just OK. They only had one fish option and it was a whole fish. I get that most people are probably coming here for the pasta (and I tried my friend's and it was delish) but nonetheless there should be decent meat and fish options. I ordered the whole fish but asked for it filleted. Unfortunately I got a bone in almost every bite which grossed me out and made it hard to finish. Not to mention there was no flavor. Luckily I ordered the roasted squash and cauliflower so I was able to devour that (which was excellent). The service overall was good, the wine was a perfect pairing, but ugh that fish was disgusting."], ["Rick C.", "Came with my family and could not have been more impressed with the amazing food. The starter pastas and entree's were simply amazing. Plenty of food and made for an absolutely wonderful evening. An absolute most if you're in Brooklyn."], ["LeAnne B.", "Choice of four courses, each one excellent. Large portions, two thumbs up. Great recommendation of wine from the staff and the affagato for desert was phenomenal and the hanger steak was done exactly how I liked it. Amazing place, great atmosphere, definitely coming back"], ["Calla D.", "What an awesome experience. It's very rare that I get excited about food anymore. With Brooklyn so over saturated with mediocre so-so restaurants it's hard to find a place with exceptional service and a great menu. We had the grilled calamari salad with cranberry beans and wilted greens and chili. Amazingggg!!!The tagliatelle with ragu - and the spaghetti with clams. Also stupid good.The rabbit with polenta and olives was delicious. For sides we had the Swiss chard stems with anchovy vinaigrette and the roasted squash and cauliflower. And for dessert the chocolate ice cream with hazelnuts and whipped cream - MUST HAVE. Out server was knowledgeable and un-intrusive.Will definitely come back!!:)"], ["elizabeth f.", "My favorite restaurant in Brooklyn for about 10 years straight. If it's full up front go around the corner to the wine bar where there is also seating. My favorites are the Tagliatelle Ragu and the Swiss Chard. All of the Ravioli are really great too. Best bread and butter in town : )"], ["Josh D.", "When a friend of ours told us to check out Al Di La as \"the best Italian food I've had outside of Italy\" I trusted him. He goes several times a year as a researcher, speaks fluent Italian, and can cook up a storm on his own.Ali Di La beat our expectations. Even the wine list has some nice surprises. It's authentic in its approach and technique while still experimenting with new flavors (a fresh pasta with pork ragu and fresh ricotta). Quite simply one of the best places we've eaten at in all of Brooklyn, and I'd put it right up there with Po as one of my favorite Italian spots in all of New York."], ["Daniela T.", "A semi-dressy setting perfect for a romantic night or an intimate friends gathering. I live a few blocks away from Al-Di-La and there is a reason why they are always full during dinner time on any day of the week. It is because they are very good at what they do. The setting and decor of the restaurant is minimal but the tightly squeezed tables (without being nauseating) and the candle lit ambiance make it very cozy. They also have a wine bar wrapping around in the back which is perfect for just an aperitif or to enjoy while waiting for a table. The cuisine is mostly Italian, but I found some French influences as well in their menu, which doesn't actually change that often. They eggplant dishes are always quite amazing. The wine is very good as well. I recommend their selection of whites.! The only reason why I can't give them the full 5 stars is because often times their customer service delivered by their waiters and hostesses, isn't very good. It's a little snobbish, in a neighborhood that is anything but.!"], ["Ashley M.", "This is my go to dinner spot. The pasta is fantastic. The Ragu is to die for. I wish they had more options for main courses though. The whole fish is always cooked to perfection and the staff is always very friendly and professional.. Regardless of the crowds they never rush you"], ["Steve P.", "The food was extremely good. The waitress was present, but not overbearing. However, the hostess was extremely rude/cold as others have said. It ruined a birthday and the dining experience for me.Glad I got to experience it, but it's not worth the trip if you're leaving your neighborhood to eat here."], ["Lauren G.", "I have been here twice, once to the main restaurant and then again a few weeks later to the more casual bar area. I was very impressed with both meals. They were both made with very fresh ingredients and the service was on point. The wine list was also extensive and they had some great priced bottles. Both times I visited I had the black spagetti, both times it was al dente and delicious. Very large portion as well- you could have this as a meal if you wanted. For mains- I had the Saltimbocca alla romana the first time and the Hake special the second time. I was super impressed at the size of the portions-there was enough for lunch the next day.I'm excited for our next visit to try something new."]], "L & B Spumoni Gardens": [["Kerry G.", "Ordered: Square slice and Spumoni icesPros--The slice had a great doughy texture, strong tomato flavor, and sprinkles of cheese. The square slices are in such high demand that they're consistently being made fresh. One of the best places to grab quality pizza. The Spumoni was generously scooped and had great flavoring."], ["Shenese J.", "Best Sicilian pizza I've had in a long time!!!! My little one couldn't get enough! This is def one of my new fav pizza spots....if not #1!"], ["Joe M.", "Nasty customer service at kitchen window.Asked if food didn't touch shrimp said no because of an allergies to shellfish said noThen seen them stacking shrimp on to raw chicken cutlet called him out on it and he got upset. Did not offer to fix situation"], ["meerie k.", "Drove here from Astoria with my boyfriend because we've been wanting to try this place for a long time. Service was super quick. We ordered half a pie which is basically a normal pie at other pizzerias. The pizza itself was pretty good. Sauce on top of the cheese is such a great idea, I don't know why other places don't do it. The square slices are big, thick, and crispy. To end the night we got a rainbow Spumoni. Everyone should try it."], ["Anny G.", "I've been going to L&B for many, many years. I was lucky growing up that it was close by in the neighborhood so I was never too far from a perfect slice. Things I love about L&B:1. It's family owned for over 70 years. It feels like family when you're there.2. You know summer is approaching when you start seeing the outdoor red benches filled with people.3. It's busy but you never have to wait long because they are super efficient and organized. There's a window for pizza slices, a window for pies, a window for ice cream, an indoor area for other pizzeria goodness, and an indoor full italian restaurant.3. The indoor restaurant has a full excellent menu with goodness like their chicken parms and pasta (you can order pizza too). Some nights you can catch the owner walking around and if you're lucky, he picks you to be the special guest of the night...and you will soon find yourself rolling out of the restaurant with a happy satisfied round belly.4. Spumoni Ices and soft serve ice cream. Enough said.5. Last but not least, their PIZZA....namely their famous SICILIAN (square) SLICE. It's just perfection--the tomato sauce, cheese, and thick bread that has a nice crust on the bottom but soft on the inside. Simple and satisfying on every level. If you're craving just the NY thin slice pizza (my favorite kind of pizza), then just get a regular slice - you will not be disappointed. I promise.I don't get as many chances to go to L&B as I used to as a kid, but every time I do pay a visit, it takes me back to my good old Brooklyn days."], ["Annie N.", "I'm from the West Coast and had a craving for pizza. Based on yelp reviews, I came here to see what all the rave was about. This place is the best pizza I've ever ate and their ice cream is delicious. Definitely coming back whenever I have a craving for carbs and ice cream. Lol."], ["Christopher C.", "I dunno if it's just that I had grown accustomed to regular pizza where the tomato sauce is under the cheese, but it tasted odd to me at first. However, as I bit into it some more, the slice of Sicilian grew on me.  The dough was delicious and chewy, with a slight touch of crispiness on the borders.  Sauce tasted like real tomatoes, but the cheese was average.This is a big establishment, they had three different areas that housed pizza orders, ice cream and a full sit down Italian restaurant with pasta.  The lines might look intimidating at first but they are actually pretty fast. There are two lines for pizza, one for pies and one for single orders.  Single slices were quick, service just wasn't the greatest, as they are just trying to sell and move on to the next customer. The popular rainbow Spumoni is a mix of chocolate, vanilla and pistachio icey/ice cream mix. It's not ice but also less creamy than ice cream.  I really enjoyed the pistachio (includes actual pistachio chunks!) and chocolate parts of it. Vanilla not so much."], ["Michelle B.", "Classic Brooklyn pizza! When you come here, be sure to get the Sicilian (square) slice and the spumoni. Their slices have the cheese melted into the bread, then it is topped with sauce and a bit of olive oil. From there, you can always add garlic, red pepper flakes, and oregano. The pizza is here is nice and fluffy and the crust has a crunch to it. So good! I'm not usually a pistachio fan, but when I'm here I will get the spumoni. It had a great creamy texture and great chocolate and vanilla flavors as well. But that's not all - it's cheap too! I came in on a Sunday night with four other friends. It was a little chilly outside, so we decided to eat in the restaurant. It's a very typical Italian restaurant inside, which doesn't match the laid back, summery feel of the outdoor seating area. We ordered the calamari (nothing too special there) and half a pie (12 slices). All in all, it came out to around $10 each with tax and tip. We were all full, and we still had some pizza left. Definitely got our money's worth :) Service was good! We were seated right away and our sever started us off with waters and bread. Our calamari came out pretty quickly, and the pizza was hot and fresh."], ["Brian G.", "I've been here twice and it's really a unique slice that I haven't found anywhere else. Old guy at the take out counter was quite rude. Maybe he needs to retire, but he made us feel stupid. It is Brooklyn so I won't be such a pansy. The spumoni is really freaking good though."], ["Rosemary V.", "Tips: First, decide whether you're eating in or outdoors.If you're eating outdoors, go to the window that says: 1/2 Trays and full trays only. (Unless you're getting pizza by the slice, then proceed to that window). After you order, grab a sit and wait for the yumminess.If you're eating indoors, go inside and give your name to the hostess. If temperature is nice, go sit outside. They will call your name over the loudspeaker when your table is ready.If you're eating inside and with a large group, don't go there during the dinner rush, at least on weekends, otherwise you will wait. Square slices come in single slices, half a tray (12 slices) or full tray (24 slices). If you come with an appetite, expect to eat two slices per person (I had 3; yup I eat like a fat man!).On to the review: I went with five other people at 5:30pm and we only waited about 15 minutes for a table inside.Food: We ordered half a tray of the square slices as well as calamari, rice balls, and mozzarella sticks. The pizza was soo good and just so different than the other Sicilian slices I've had. The cheese is underneath the sauce making the slice soo fluffy. The taste is tangy with a touch of sweet. The corner slices are definitely the best. The Calamari was yummy as well as the rest of the appetizers. After we paid our bill, we got a small spumoni ice cream and it was sooo yummy. Even if you're stuffed from the pizza, have some ice cream, after all, how often will you go there?Ambiance: Place is very family friendly therefore you see people from all ages. Outside they have picnic tables; inside is small, yet comfortable. Depending on your taste, you'll see some Italian eye candy. Bathroom is kind of small.Service: Hostess was super friendly. Our waiter was nice although at one point we had to hunt him down for the bill.Prices are so cheap! This is a good place to go if you need to feed many mouths or if you're on a budget.This place is quite far from Harlem, so I can't say I'm rushing to go back. With that said if I'm ever in the area, I would definitely go back. I'm so glad I got to check this off my list."], ["Irene L.", "I have lived in Bensonhurst almost all my life, so I know good pizza. This is good pizza. It's something I crave every month. I've been here more times than I can remember since I was a kid. The Sicilian slice... omg, the bread is thick and charred with more sauce than cheese ratio, it's just perfect. There's not much else I can add that hasn't already been said about this pizza. If you are in NY, you just NEED to stop by here at least once in your life. The outdoor seating makes this a nice place to hang out, especially in the summer.The spumoni is the perfect thing to finish off your pizza with. Don't be turned off by the bright green color, there are chunks of delicious pistachios in there, they don't mess around with their spumoni! Don't like the icy texture? Try the equally delicious selections of ice cream flavors, or get a sundae (lots of toppings to choose from). The tiramisu ice cream is so creamy and smooth, give it a shot! Can't get enough? Buy a pint or quart of any flavor to take home in an insulated bag."], ["Lina L.", "I came here for Mother's Day. Drove 2 hrs to come here. First we walked the High Line Park and drove another 30 minutes for L & B. Totally worth about $30 worth of tolls. Will come back every year just to come back. I love how we ordered our food (took over 30 minutes for a whole Sicilian pie) then after we ate we got in line for our ice cream. What an experience."], ["Casey R.", "This place is a Brooklyn landmark (I don't know if it is) but it should be, and I would hate to see it go, if you want to experience real Brooklyn pizza, come here, sit outside, and order the squares, which to me is way better than the pizza. As I've gotten older my taste buds have changed, and my craving for a particular pizza has changed. This place gives you just the regular slice, nothing fancy, no brick oven, no thin crust, but it will satisfy your pizza craving. They also have a restaurant inside, I have never tried their regular food, so I can't comment on it. They have a separate place outside for Italian ices, which are very good. As for service, it's a help yourself? Order the pizza wait for it, take a seat, grab some napkins, don't forget to ask for paper plates, and clean up after yourself, pretty straight forward, pretty much the Brooklyn attitude"], ["Zach W.", "You know when you're trying to put yourself in the mindset of the pilgrims, and you try to end up in a far away, isolated place but accidentally find an already populated country, full of pizza? That's what finding L&B is like.It's way out of the way unless you already live there, in which case you already know how good it is, so why are you reading the review? For everyone else, you end up in a very un-Manhattan-feeling neighborhood and discover the pizza Plymouth rock. I've thought long and hard about this and I THINK that it's my 3rd-favorite pizza place in New York, but it would probably depend on the day, because it's unbelievable. Just absolutely delicious. The square slices are the perfect combination of dough, sauce, and cheese, and butter probably, because nothing can taste this good without cheating. I don't want to overwhelm such a simple concept with too many words, so I'll just say that you should definitely get the pizza, and you should definitely not overthink it and get something else. Just sit back, eat some pizza, and celebrate Thanksgiving the old fashioned way - with some slices from L&B. You won't regret it!"], ["elina k.", "Staple of Brooklyn. They have great pizza, with the sauce under the cheese. I have lived in Brooklyn for basically my whole life and bring anyone who comes from out-of-town here. It's great for a slice or two of pizza, as well as a sit down dinner. I have never had an issue with service when I came here."], ["Cindy K.", "Love the sicilian pizza here and how saucy the slices are compared to most places having too much cheese! The ice is also fantastic and you can choose from a wide variety of flavors to your liking!! Definitely a nice spot to come to if you're in the area as they have outdoor bench seating and the ice cream/italian ice is a nice option for great weather as well."], ["Mahina W.", "Came here with friends after a beach day for ice cream. Tried pistachio and rainbow spumoni, tiramisu ice cream, and peach Italian ice. They also had pizza so we ended up getting 1/2 Sicilian with mushrooms (12 slices).The ice creams were all delicious! The pistachio spumoni was a shocking green and quite addicting. The peach Italian ice was very refreshing. The pizza was very filling and could get in 2 squares before feeling extremely stuffed!The atmosphere is very casual. There is a separate section for ice cream and pizza. Even for pizza, there is a separate line for single squares and pies. If you get single squares, they are immediately ready to eat! After you get food, there are a ton of tables of all different sizes. Great casual spot for post beach treats!"], ["Benjamin W.", "L & B's pizzas are really, really tasty. I've only had the squares, and I don't know anywhere else that does them as well. However, they can get overcooked rather easily and therefore I've had a number of misses there. Also, you really only get them plain as their toppings are pretty bad. Their spumoni, as one would hope, is also quite good."], ["David D.", "When in Brooklyn it's worth the ride all the way out to L & B. Be it spring or fall there's less people and just the regulars. I love the pizza's, eggplant parm and meatballs. Don't be fooled by the new and trendy, make the trip to the authentic Italian pizzeria."], ["Rehana A.", "I am a huge fan of pizza. I can't get enough of pizza. It's funny because I am writing this review waiting on my pizza from a different place. Ok let's start with arriving at the location. You probably will need a car because I live in Queens and I will be  damned if I had to take public transportation to come here. Parking is awful because it's only  street parking,so good luck.      My boyfriend was super excited and raving  about the pizza.  I trusted his pizza palate and was look forward to an amazing experience. We stood in line, which seemed long and out the door. However, it was moving quite fast.  The line was only for regular slice and or Sicilian slice. For some reason you weren't allowed to order any toppings on the pizza waiting on this line. I think you have to get on another line for that.        Now for the decor of the place. The place is separated into to three different sections. One for pizza, spumoni and the last section of sandwiches.  You have great outdoor seating which adds on to the experience.        Me and my boyfriend  each got a regular and a Sicilian slice. I must say the regular slice was great. It didn't have the \" ton of dough\" and no cheese taste. The sauce was slightly sweet and tangy which complimented the cheese beautifully.  Even after the slice was done I was memorized by the taste. The crust was not too crunchy but soft and lightly crispy.    Now for the Sicilian slice.... hummm I am not too happy report I did not like or care for it. I actually regretted this choice. I think that slice was nothing but dough . So much carbs you could probably skip two days without eating any. There was no taste, just dough ... pure dough. I was super excited about the Sicilian slice because from what I heard that's what this place was renowned for. I don't want to criticize the taste of great pizza establishment but it was pretty bad. I am hoping may be it was  only that day. I didn't taste the cheese or the sauce. The whole experience  my palate was yearning for was disappointing.   I might just go back to redeem this place but will be only getting one Sicilian slice for both us. I just don't want to have repeat of extreme dough like last time."], ["Agatha D.", "Some of the best pizza in Brooklyn! If you go you should definitely get the square slices. Normally I prefer the round slices at other pizza places but at L&B the squares are their specialty! They also have wonderful ices in the summer time a particular favorite of mine is the peach! If you want to keep it casual you can eat outside or if you want to get together with family for a nicer event you can eat inside. They have great pastas and chicken parm as well!"], ["Tim L.", "It's been a couple of years since I've last come to Spumoni Gardens, but it's delightfully still the same. You really have to be consistent though when you've been in business for as many years as L&B has.The Sicilian slice is what you come here for and of course you have to finish it up with some of their spumoni.   It's always an enjoyable experience here and is perfect for groups, families and pretty much anyone.I'm tempted to say it's better to come either extremely hungry or with a large group just so you can delight in getting an entire pie.The staff are all super efficient and fast and there's quite a bit of seating available. It still gets packed, but the tables turn over pretty quickly."], ["Veronika K.", "Who doesn't love spumoni? what a brooklyn classic for sure!However, it's definitely over priced, huge lines and lots and lots of waitinghowever. worth every second and every penny if you've never tried an L&B square!"], ["Kimberly D.", "Best pizza on earth hands down I eat here, my parents are here, grandparents....THE BEST PIZZA IN NEW YORK, IN AMERICA, ON EARTH"], ["Bunji F.", "I first started going here in the 70s in High School.But the only thing left that is edible is the Sicilian Square Pizzas. All the dining food and even the salads are now inedible. Sorry Spumoni I loved and lost ya.Parking is tough in the small 16 car lot and the crowded streets around here."], ["Aaron L.", "They're famous for pizza and ices. I've never had the ices, but I have had their \"grandma\" slice -- which, if I'm not mistaken -- is a square slice (or Sicilian) that has the cheese underneath the pizza sauce. Some might yell blasphemy at the prose that follows, but I honestly don't think their pizza is anything special. In my opinion, it's overrated. Seriously. It was just okay. Maybe I came on an off day; maybe not. Maybe people wouldn't know what a good slice of pizza is, if a pie hit them in their face. Don't believe me? Try it for yourself."], ["Jenn C.", "We went on a Saturday night and had a short wait for a table for 4. Service at first was slow but picked up considerably over the course of the meal. Pizza and spumoni was out of sight :)  I would definitely come back."], ["Kyle C.", "A legend, nothing less. If you want old school Italian American fare, look no further. The pizza is unmatched, and the spumoni is the ultimate frozen dairy treat. A rite of passage for anyone living in Brooklyn, or NYC, rather."], ["Erica B.", "Great place for amazing pizza, pasta and dessert! This Brooklyn staple is a must. All dishes are family size and great for sharing. Great for families and kids. Not the fanciest place but definitely has a \"home\" atmosphere.Parking in and around here is always busy, so give yourself some extra time.I'm a loyalist to their pasta carbonaro and spumoni ice cream. If pizza is your thing, they are very appropriately know for their Sicilian slice - get one or 2 if you stop by!"], ["Deirdre L.", "I've been coming here for years. My dad would take me and family members visiting from other states (and countries).I have always been a fan of their square pizza slice, the cold antipasto and the fried calamari. Their restaurant always has great service and is very inexpensive.However, when I took my class here yesterday, I was disappointed in the fried calamari. It was good, but it could have been better.Coming to Spumoni Gardens is certainly not overrated. It is an experience. It is the way old Brooklyn used to be and it is continuously preserved with the restaurant's food and prices. Although Brooklyn is huge, you cannot visit the borough and not try Spumoni Gardens."], ["Julie M.", "Honestly when it comes to quality this is one of the best. If you want something special this place is it. Pizza is amazing and the ices will hit the spot too. This place has never disappointed."], ["Fox E.", "I'm sorry, but I think L & B stands for \"Lame & Bad.\" Garland says it's \"Lousy and Bland.\"Every single person I've ever talked to about L & B says it's the absolute bomb. Best pizza in NYC, best in Brooklyn, one of the best they've ever had, and so on. Some people randomly bring this place up when I talk about NYC pizza. And then just read some of the reviews on here.With that sort of hype, it better be utterly incredible to score a 5.Well this was some of the most bland, nondescript pizza I've had, not just in NYC but anywhere. I only had a few bites and then I was done. And my partner in crime at the time was obsessed with pizza, and she had exactly the same opinion. Which was annoying since we'd just bought several slices.I tried to salvage their rating by getting an Italian Ice (Lemon). It was some of the worst, chemical tasting, weird, unsatisfactory Italian Ice I've had.I'd give them a 3 to support family businesses, but the service wasn't very nice either. They were none too friendly, and it's grossly overrated. So that's down to a 2.So if someone tells you this is the best pizza you'll ever have, remember that in my opinion, L & B may stand for \"Lies & Baloney.\""], ["James C.", "The pizza is good. They make a lot of pies beforehand and package it so when you order, you get the pizza pretty quick. I would prefer to have hot and fresh pizza right out the oven though, not ones that has been cooling in the pizza box for a couple minutes. One thing about the pizza is that it is a bit salty for my tastes."], ["Tracy K.", "Finally tried L & B Spumoni Gardens, one of NY's historical and unique Pizza places of yesteryear here today and even more popular.For years as a kid, we would stop off for Albert's Pizza (in Long Island), whose unique recipe appears to have come straight from here!  L & B began in the 1930s, and Alberts on LI in 1950s!  Lol..  maybe they are related or maybe Albert was a chef who came out here with L & B's recipe and became popular from it! Not sure.This  is fun pizza that is square, has a crispy light crunchy crust, cheese underneath a really saucy sauce, with some distinct flavor of oregano, and parmesian cheese sprinkled on top.So its not your classic Neopolitan, expect something different, and good.  They do have round, but people come here for the Sicilian sauce on top.I headed in here on a quiet day  Chrismas week for lunch with  good friend, just to check out some great Brooklyn Pizza, and because of the day/time likely there were no long lines at all.Tip: This place is a few minutes from a classic Italian Bakery Villabate Alba, so when in Rome, check out them both.Both made me want to drive in to Brookyn two days later again.. When looking around at our local bakeries and Pizza.   Brought a half box home &  it was gone quick."], ["Suzanne M.", "You'll never have another slice like the square here.  This place is an institution and rightfully so. You never get a square here that's been sitting around cause there's always a line of people waiting for it. I don't have the same fgeelings about the restaurant. To me I'm going for the pizza and spumoni nothing else."], ["Elizabeth P.", "The pizza is SO delicious and so worth the long haul from Manhattan. Throw in a trip to Coney Island afterward (1 subway stop away) to make your day in Brooklyn 100% complete. The pizza is cheap, fresh and simply the best in NYC. Sicilian slices were fantastic but I have to say the thin slices truly hit the spot. I could have eaten a whole pizza and probably will next time i'm back! YUM! :-)"], ["Christina G.", "Eeeek! I really wanted to like this place. I was introduced to the upside down Sicilian slice as a kid, when my dad would bring us his favorite Sicilian pizza from Rosa's in Queens on his way back home from visiting the city. I have had so many versions of this around the city that compared pretty well to the amazingness that I am used to from Rosa's. I assumed this must have been where it originated and that it would taste similar.  I was sadly mistaken. This pie did not have the robust flavor that I've found it to have at other places. It wasn't particularly flavorful at all and tasted sort of doughy. The crust itself was also too doughy. I feel like it tastes better when it's more crisp throughout. Not a fan of L&B."], ["Lauren B.", "Pretty good pizza!  Granted its only outdoor seating really for pizza.. there are a few tables inside but its REALLY SMALL. There is a restaurant attached for dinner service and parties.  Ive eaten both outside and inside the small pizza shop and inside the dining room and each time it was good.  Ive also had the spumoni and that was good too!"], ["Daria Z.", "Great pizza. I had the regular slices and some square slices. Square slices are much thicker, have a fluffier crust, and less cheese than regular slices. Not gonna change your world if you've grown up in Brooklyn and been surrounded by NYC pizza, but pretty damn good for the price. I had spumoni ice cream afterwards. Honestly, the sizes for ice cream and ices are too small for the price they list, but it's all homemade so I guess that justifies it. If you've never had it before, it's less creamy than ice cream but too creamy to be an ice, and tastes strongly like pistachio, swirled with chocolate and vanilla and the teeniest tiniest hint of mint. Tasty, but probably wouldn't get it again."], ["Wai T.", "Dear Spumoni Gardens, you are one of the reasons I was such a fat stoner in High School and I LOVE U FOR IT."]], "Piccoli Trattoria": [["Felix C.", "A lovely small and intimate dining experience.  Great place for a date, or casual dinner with a close friend.  The pasta was amazing, service excellent, and ambiance ideal for dinner.  I will definitely be back!"], ["Princess W.", "This place never fails to deliver amazing dishes Unique and flavorful combinations for pasta dishes. I've been here 3 times and have been impressed each time.Their grilled calamari and prosciutto bruschetta are a must have.The only thing is they don't have a full barJust wines and their wines are on the sweeter side.Be aware portions are European sizes lol So be ready to orders few dishes if you have a big appetite... It won't be cheap."], ["Jessica R.", "Food was very good. The restaurant is so tiny and it was packed. It was like elbow to elbow eating with strangers. Also, the smoke from the kitchen resonated around the restaurant. I can overlook all of that because the food was very good, but it's not a place I'd go if you want something more intimate. We did go on a Saturday night, so perhaps it could be less crowded during the week. Also, for the amount of people there was only one waitress. She did a great job, but it was hard to get her attention, understandably. Oh! The people next to us.. One guy got the wrong dish and they replaced it very quickly. That's not my problem however whatever he had before looked really good, then they brought out something different and it did not look good. He should've kept the first dish in my opinion. It looked like black muck, caviar soup? I'm just kidding around, but I thought it was worth mentioning because they were very quick with replacing his meal. I may or may not come back here. And for the wine lusters there was definitely a grand selection."], ["Alyssa P.", "Anniversary dinners can be tricky - you want to find a place that brings out the romance ... but also is serving up delicious food, right?  Well this year my Hubs picked Piccoli Trattoria for us to celebrate our four-year wedding-anniversary and I couldn't have been happier with the selection.  4 stars for a lovely four-year-anniversary dinner.Unbeknownst to the Hubs, Piccoli Trattoria has been on my list for a while now... ever since reading that their risotto is one of the best in the city.  All that hype and the dish didn't disappoint, in fact it was quite delicious.  But before we get into the risotto - let's talk about some of the other lovely items on the menu, because those were quite delicious as well.First up for our Italian feast was a Mela Insalate.  For $8.95 we were given a nice sized salad (that 2 of us shared easily) of baby arugula, thinly sliced apples, toasted hazelnuts and gorgonzola cheese crumbles all tossed in a light vinaigrette.  An excellent way to start off the meal.Alongside the insalate we ordered a plate of Bruschetta di Parma.  The plate consisted of a three generous slices of crusty bread layered with fig jam, prosciutto and gorgonzola cheese.   The combination of salty meat and sweet jam was perfect, and I loved the kick of sharp cheese on top.  The slices felt too large to handle so we ended up cutting ours into thirds (I recommend you do the same) bite sized was better.For my main meal I ordered the Risotto Pollaio.  As we discussed earlier - it's all about the risotto at this place.  You've got to order the risotto.  This particular version consisted of spinach, diced chicken and Ricotta Salata cheese ($15.95) in a creamy sauce.  I didn't love the spinach mixed in (too much, too big of pieces) - but overall the risotto was excellent.  Not too heavy, not overly cheesy.  And the portion was huge!  I'm not ashamed to say that I ate the entire bowl, and I'd do it again.Hubs went the opposite route and ordered the Anatra for $21.50 - a pan seared duck breast with pomegranate vinaigrette, corn crema (think mashed potatoes consistency) and arugula celery root salad.  I snuck a bite of the duck and corn and both were so good!  The duck was tender and smoky and the sweetness of the pomegranates made me want to snatch another bite.Oh!  And the restaurant itself is a sweet romantic little spot with plenty of tables for two.  They've got tables outside as well for dining al fresco... but inside there's warm lighting and golden plaster walls with simple rustic tables and chairs.  Staff was tentative but let us enjoy our meal without multiple interruptions.  Piccoli Trattoria is just a darling restaurant - absolutely perfect for date night.  It's only been a few days since we went for dinner and I'm already ready to go back."], ["Anna K.", "I went here last week and it was wonderful. It seemed authentic from the start, and it did not disappoint after giving such a fabulous first impression. We ordered a bottle of red wine, which was delicious and went perfectly with my order of Black Spaghetti with Blue Crab Meat and brussels sprouts!The waitress was very accommodating, and someone was always filling up our glasses of water, which is a major plus when you're a lightweight when drinking wine! 0:) The bathrooms here are gorgeous, too. Which is an important thing and says a lot about an establishment in my opinion! :)The only downside is that this place is pretty small -- but that's just an FYI. It doesn't take away from the experience at all, unless you've had a glass of wine and are trying to slither between tables to get to the bathroom! ;)"], ["Kammi W.", "Squid ink pasta - I believed the chef might over put the vinegar or tomatoes on the dish. It was extremely sour.Seafood risotto - but the seafood risotto was amazing. Def worth to come back for risotto."], ["Deanna L.", "We came here for a family lunch, it's a cute place with nice outside seating.Word of advice - stick with the pastas, nothing else was that great.Grilled calamari was ok, not the best. Arcobaleno salad was tiny, bits of grilled corn, fire roasted peppers tasted like from the jar, tiny amount of greens and parmesano.Eggs from the Brunch menu were quite disappointing as well. pappardelle and fettuccine was ok.The worst  was the so-called panini that was described ON THE MENU to be pressed in an iron presser, house made focaccia, smoked salmon and goat cheese - what was brought to us was appalling. It was 2 pieces of white bread with smoked salmon stuck in between and tomatoes sliced on top. Why this is called a panini or who designed this dish, its just beyond me. This is New York, stuff like this doesn't fly. We should've sent it back instead of leaving it on the table and being charged for it.Overall, we enjoyed our lunch but more for the company rather than food or service. With so many amazing restaurants in the area, we will NOT be back."], ["Dan R.", "Ate at this excellent little Italian place with my girlfriend this weekend. Walked in and got a table for two with no reservations (it was a Sunday around 7). Nice ambiance and friendly service.For our appetizer we got butternut squash, mushrooms, and buffalo mozzarella in a brown butter sauce. This dish is incredible, the squash and the mushrooms are highlighted by the sauce, and the cool mozzarella makes for a delicious contrast.I got the Duck linguini, and my date had the black spaghetti with shrimp. I'd say the shrimp dish was the better of the two, with a great spicy tomato sauce. My dish was delicious, but didn't have that much to it, and not enough sauce for my taste. Meal was about $65 with a glass of wine and tip.Overall an awesome place that I look forward to trying again."], ["Amy K.", "I decided to have my birthday dinner here on a Saturday night and the ambiance of the restaurant was intimate. There was not a lot of seating and the restaurant was small. I would recommend to make a reservation ahead of time. At times, the tables are somewhat really close to each other.  It took the waiters/waitresses a while to see that we were done looking at the menu. My friend even said that they noticed that we were done looking at the menu, but weren't doing anything.When we did get their attention, we ordered the calamari to start. I never had calamari grilled, since it is always fried in the places that I have been. It was really good and I wanted more!! I believe that they give you complimentary bread, which was crisp and nice to eat with the tomato sauce and the olive oil that they served.For entrees, we ordered the squid ink risotto, the seafood risotto, spaghetti alle vongole and rigatoni \"alla Norma.\" For the risotto, it states that it takes 20 minutes. I have never tried squid ink risotto and it was pretty good! Beware that you will have black sauce all over your mouth as you are eating! The seafood risotto was heavenly. The spaghetti alle vongole has a nice seafood taste, even when you just eat the spaghetti by itself! The rigatoni \"alla Norma\" was okay. The entrees are pretty filling, so you might have a little of a hard time finishing it if you ordered an appetizer like we did. The waitress asked if we wanted cheese or anything else. She graciously grated us cheese on our dishes and well as some pepper. However, me and my 3 other friends did not receive any refills for our glasses of water during the whole time we were there. We were a company of 4, and only one of my friend's glass was refilled. At the end, I just ended up eating the ice cubes because of the sodium from the food and I was just so thirsty.I had to minus a star for service. Overall, the food is pretty solid but the service could be a tiny bit better. However, I will still come back!"], ["Stephanie A.", "Great little place in Brooklyn!This place is super small so you will want to make a reservation. I was lucky enough to score a seat at the bar.For apps we had the mozzarella and mushroom  plate which was really delicious. The cheese will practically melt in your mouth. For an entree I had a special which was pork over risotto. The pork was extremely tender falling off the bone and as the other reviews expressed the risotto is very good! I would highly recommend trying out this cute little Italian spot!"], ["Julia G.", "Their risotto...worth the calories.Their steak and the roasted potatoes...yummmm.Grilled calamari...nom nom nomDelicious food, intimate atmosphere, great for a date night."], ["Elisabeth B.", "Small Italian neighbourhood restaurant. A menu card and atmosphere like you would find back in Italy. Service too, was nice but not too present. Like what I'm used to in Europe.Delicious pasta's and nice selection of antipasti. They do some daily specials, entrees and a couple of salads (which I would recommend to only take as a side dish). Feels like their focus is mainly on pasta's and risotto's - exactly what you should take when visiting this place. From the menu selection to the portions and service, it all felt very familiar and genuine.Picture yourself here with family & friends which you love. From the wooden tables, linen napkins, smells coming out of the kitchen, to the authentic Italian food - which is perfect to share. It's almost like taking a seat at \"mama's\" table in her salon, where you would spend the evening for special occasions."], ["Armando Pina Hair Salon P.", "My  wife and I are regular customers at this cozy italian  restaurant !The food is delicious. Some of our favorites:The grilled calamari,  mozzarella de buffala with yellow squash, seafood risotto, grilled pork chops with braised brussel sprouts and the warm chocolate cake with vanilla ice cream! But honestly, all the dishes are excellent! The wine list is very good ,service is very nice and friendly and prices  are  not that expensive! We love this place!"], ["Aya N.", "Risotto with squid ink was to die for! Everything else was also fantastic. I'm definitely going back. Two thumbs up."], ["Thy L.", "As many times as I've been here can't believe I haven't written a review. Brussel sprouts salad is good, buffalo mozzarella served with butternut squash, mushrooms and balsamic is delicious! Salad with corn is a little hard to eat and lacks dressing  Short rib ragu and bolognese pasta are my faves. The fettuccine with duck ragu lacks sauce and flavor. Consistent good spot in the hood."], ["I. C.", "Always great food with attentive service. Love their homemade pastas. Creative appetizers. Many risottos on the menu--all worth trying. This small restaurant is often full between 6:30-8:00; a reservation is highly recommended. The only complain is that the seating is crowded."], ["Linh L.", "My bf and i came here for a date over the wkend. We called ahead just to ask if we need to make rsvp and the lady took down our name. When we arrived, we were seated immediately. We were starving so we kind of over ordered.. But i dont regret it. We tried the bruschetta which was very tasty, they have fig jam served w proscuitto. Never had proscuitto w jam but it was very good!!! We also tried the fresh mozzarella with mushrooms which was also good but just felt the mozzarella wasn't firm enough cos it was slightly mushy.. Maybe due to the heat from the mushrooms (?)I had the risotto and bf had the steak. Both entrees were delicious. The risotto is verrrrrry filling so make sure if u order it dont OD on appetizers (lol like we did!) the steak has the chimichurri (?) sauce over it which was very very tasty!!!Oh i forgot to mention they served this bread with olive oil and balsamic vinegar along w some tomato dip.. we loved the bread!!! And i can see yelpers have mentioned that as well.I wish we had the stomach to try their desserts but next time we come back we will try to slow it down a bit lolOur waiter was also very very nice!!! My bf took down his name.. I believe Vas (not positive) but he was very attentive, knew when to take away our plates, when to fill our water, and checked on us frequently.Overall, this was a good find! Will definitely come back nxt time to try more items!!!"], ["Meg H.", "Holy moly!! The Grandma Bolognese Rigatoni was SOOO good!  Hands down, the best Bolognese I've had thus far.  This place made me realize what I've been missing my entire life, an Italian grandma.  Anyone know where I can get one who cooks like this?!Anyway, the meal tasted exceptional, from the pasta texture to the flavorful sauce. There were carrots in the sauce which I've never seen before so I was skeptical initially, but the carrots gave a natural sweetness to the sauce. Again, sooo yummy! Great service to top off the scrumptious meal.  Also, they have outside seating for those purdy day/night or if you have a furry friend."], ["Tif L.", "As an Italian girl I'm really tough when it comes to ordering anything with \"gravy\" (for those who might not get that it's \"red sauce\"). This place hits it on all points even if it gets very busy. The owners Andres and Andres are sweethearts and go out of their way to accommodate. They make their own pasta fresh AND their own mozzarella....that should tell you about their dedication to excellence.I had the Rigatoni \"alla Norma\" with eggplant, tomato sauce, fresh basil & fior di latte Mozzarella. Out of this world....melts in your mouth. My Neapolitan Grandmother would have approved....and I do not say that lightly!They have a quaint outdoor seating area so take advantage of that while the weather is nice!I have been told (and have read) that they are the best Italian restaurant in Brooklyn....now I see why."], ["Jennifer N.", "I have passed by this place so, so many times and now I hate myself for all the times I could have eaten there and didn't. I came here with my best friend and fellow foodie for a catch up dinner. We usually love simple foods and good wine - and this fit the bill just perfectly. We ordered the Polenta (Grilled organic polenta with wild mushroom Fricassée & Val d'aosta fontina cheese) and Mozzarella di bufala (Buffalo mozzarella with roasted butternut squash & mushrooms with brown butter vinaigrette) to start. It set the tone just perfectly for where the rest of our night was headed. The polenta was cooked perfectly and the mushrooms paired so well with the fontina cheese. There are few things I love more than mozzarella, but eating it with butternut squash has never crossed my mind. Match made in heaven. Next, came our entrees. I ordered Fettuccine cacio e funghi which is a homemade fettuccine pasta with mushrooms and pecorino romano cream sauce. YES. It was like lighter, less overwhelming alfredo sauce. My friend has the Pappardelle which was delicious with a short rib ragu. We didn't have dessert here - we were so full - but I will be back and will make sure I save a little room. My only advice (aside from wear your eating pants) is that this place is tiny, so expect to dine closer to another table than you might prefer."]], "Frankies 457": [], "AlMar": [], "Bella Gioia": [], "Scalino": [["Bill H.", "charming, unpretentious, delicious. food and service this good doesn't usually come without a wait or sticker shock, but we found neither on a Sunday night.the specials list was as long as the menu; more inviting than intimidating. we can vouch for the fried cauliflower and tuna steak (expertly seasoned, cooked rare) if you can still find them, but never fear: their regular menu staple spinach & ricotta ravioli comes out perfectly al dente.dinner out in this city can be disappointing. many thanks to the staff for reminding us how truly nice this can be."], ["Andrew S.", "Scalino is everything you want in a neighborhood Italian joint: very fair prices; excellent, fresh homemade pastas; no frills, but lovingly tacky decor. The two guys who run this place are efficient and knowledgeable, and the service is always perfectly fine.I've never had to wait, though the restaurant is rarely empty. Nicely located on Manhattan Ave. half a block from the train, and they're delivering on Seamless now.Side note: they have a sister restaurant (also called Scalino) in Park Slope on 7th Avenue. If you've been there, very similar deal.4.5 stars here."], ["Robert G.", "As long as your expectations are properly set, Scalino will be a good experience.First of all, like with most Italian food, you need to eat in the restaurant. If you order it via GrubHub, expect it to come mushed up, cold, or not well presented. That's pretty obvious as far as I'm concerned. I am surprised that people leave negative reviews on here based on take out experience, when that's clearly just an ancillary business for these guys.The food is good. Not great. But fresh and well executed. The tomato cream sauce on the rigatoni was a fairly unsophisticated, straightforward mix of exactly what it says. Nothing fancy. The rigatoni itself was a little al dente for my taste, but a fairly straightforward dish.The Jersey tomato salad was okay; store bought tomatoes (not heirlooms), blue cheese crumbles, and arugula. The fried zucchini flowers were tasty, though a bit heavy.The standout dish was the fettucini with fresh lobster. Now this was an excellent dish.The reason the slightly above average food gets 4 stars is the price. These are very reasonable prices for the food, and you'd be hard pressed to find the same quality at this low price. Thus - great value in this reviewer's opinion.The service experience is rudimentary; gruff but pleasant mom and pop operation that still makes you feel appreciated. Though we probably won't be regulars here, I was pleased with the authentic Brooklyn experience, the good food, and the great prices."], ["Jonathan S.", "Background - The lady and I spend a lot of time in Greenpoint and have wandered by this place a number of times. The place is usually at least half filled around dinner time and looked warm and welcoming so we decided to stop in for dinner.Experience - The restaurant is spacious with plenty of tables that aren't right on top of each other which is nice. Lots of wood all over, and a decent size bar with a TV playing sports. The wait staff is all dressed casual (jeans and t shirt) so it was a bit confusing who to talk to when we wanted to be seated, but I didn't mind because it helped the casual feel of the place. Service was fine. I don't recall anything negative, but I don't recall being impressed either.The Food & Drink - We started out with a bottle of wine and shared the fried calamari and the arugula salad. The calamari was nicely fried and satisfying, but the salad was a little small for $9. For our entrees we got the lasagna which was on special, and the pappardelle with smoked bacon which seemed like their signature dish. This is where I was disappointed. While the pappardelle was absolutely delicious, the portion was very small, even by modern pasta shop standards. The lasagna was also lacking. It actually looked sad. It was very thin, maybe 1 or 2 layers of pasta, with a small amount of meat and cheese inside. And it was drowning in a watery sauce.Bottom Line - I was a bit disappointed with this place, but am definitely willing to give it another try, because the potential is there. While this experience may have been 3 stars for me, I can definitely see potentially having a 5 star experience another time."], ["Dana G.", "Really great small spot .. Cool lighting and really great food .. Came in at a 11:00pm and the cooked for us .. Do it"], ["Josh C.", "I called in for a delivery .   Rude little jerk answered the phone, should have hung up then and there..     I order three pasta entrees .    It gets here an hour later even through we are within 1/2 mile radius.    total cost with tip $50 for this small portion slop ?????  GET REAL.    Taglieri I think it was...... could have just bought this in the frozen food isle .      Very Very small portions .        Also ordered the ravioli, which was actually not bad... but again ... giving me         about 8 small cold ravioli in a $50 delivery is not the way to make me happy     Marinara sauce sucks, pasta sucks, cost sucks and attitudes suck.    Avoid this joint and put it out of it's misery ... the sooner the better."], ["Stephanie A.", "I'm giving two stars for the pappardelle being well made, well cooked and paired accordingly. The lack of sauce was an annoyance but the size of the dish was unreal.Had this chef been on Chopped he would have been embarrassed. I called them after receiving my delivery as I was confused whether or not the mistake was mine in ordering an appetizer portion. \"No darling, that's our portion size.\" I'm attaching the photo because it was that ridiculous.The dish was good. The bacon pieces didn't have fat on them which is a rare delicacy, but overall I wouldn't go back."], ["Mary H.", "Superb food and service! Even the bread was the best we've tasted. Finished with the apple tart and ice cream served warm, YUM"], ["Shane H.", "This little comfort spot was one of the biggest highlights of my new york trip. its trendy but in a very understated way and definitely blends in with the whole \"brooklyn neighborhood\" vibe.the portions are huge considering that i grew up in southern california where no one would dare to eat pasta, ever, let alone plates THIS size. i ordered some ravioli i couldn't finish and my friend had to take over because apparently it's not polite to not finish. which i agree, but just can't fit more in my stomach!service is great since the place isn't so big. perfect for good food, nice wine, and good company."], ["Kirthan S.", "A great comfort Italian spot in the heart of Greenpoint. A great lunch special here for $10+ tax&tip which is accompanied with a dressed, mesclun salad, and any choice of pasta. The pappardelle is my favorite. The tomato cream sauce with bacon provides a very satisfying mouth feel, taste, and tummy filler. From classics like fried calamari, meatballs, cured meats, & pastas, to well cooked grilled chicken, braised shanks, & salmon, this place provides an experience which is great to satisfy any group for a bulletproof meal. The wine list is diverse, affordable, and satisfying as well. They even offer a great Sangiovese for under $10 a glass.Better than decent dessert menu which includes an in house made tiramisu. Classic flavor with a great proportion of coffee/espresso without overpowering the cake. Overall, if someone asks me for a spot in Greenpoint, this would be the first spot I would recommend."], ["Peter K.", "Great atmosphere and great food. A pleasant suprize from a traditional menu. The food was delicious. I'm heading back to try some more of the specials. You can tell they are passionate about thier food."], ["Amanda L.", "Before I start, I have to admit I either don't like Italian food or at best don't think it's anything special.Why did I even come here you ask? Because my friends chose this place. It's not bad overall, but I just really do not prefer Italian food. I ordered their ravioli, which did taste good, but you never get much ravioli whenever you order it out. You don't get many and pasta is never satisfying/filling so I just paid $11.00 for what I would consider a snack. Other people who ordered the carbonara loved it and actually got a decent portion. However, it was a special menu item and pretty expensive for pasta. The place is just expensive in general. I would have gotten fish if I wouldn't have felt guilty for paying so much. It seems that this place is very mom and pop- which is cute, but also means there is only one waiter. Therefore, the service is a little slow, but honestly I didn't notice too much because I was chatting with friends the whole time. As other people have mentioned, they try to account for the slower service by giving free refills on wine. The fact that they are cute and do this is the only reason I give this place 3 stars instead of 2. I guess if you really like Italian food then you might want to give this place a try. I just don't understand the appeal of Italian food though."], ["Dorothy L.", "Delicious and affordable. We had the penne with broccoli di rapa and sweet sausage, ravioli and salmon with zucchini, all of which was fresh and light. Our dessert (apple tart with vanillia ice cream) was just the right amount of sweetness to end the meal. The waiter was also very attentive and polite. I recommend this place for an intimate date or a quiet lunch/dinner with a small group."], ["Olivia P.", "Our first impression was nothing short of very good. We dined here on a whim Saturday night and plan on being back. It's a great neighborhood spot for great italian comfort food. This place isn't pretentious and the servers were very friendly, the space is warm and casual and actually conducive to conversation; such a rarity these days! We ordered the eggplant parm, spaghetti bolognese, fried calamari, mixed greens and all tasted great and seasoned well (not under or over - just right) and nothing felt greasy. Definitely come by if you're craving some classic italian fare. Last but not least, the prices are fair and affordable!"], ["James B.", "Okay this place is awesome. Was in the neighborhood on client calls and was looking for something quick. I had the spinach ravioli with Misto salad. Spectacularly fresh. My colleagues had the broccoli ran and a linguini in a tomato cream sauce. All were terrific. Unlike myself, my colleagues are New Yorkers, Italian, and foodies and they were blown away. The service was quick and pleasant and the ambience authentic. The meal was very affordable to round out the whole experience. Thank you proprietors and thank you Yelp for yet another great find."], ["Katie S.", "Absolutely luscious Italian food. The ambience was super adorable and the service was friendly in a very non New York way. How did I live in Greenpoint for 3 yeasts without ever coming here?"], ["Matt S.", "Seeing the reviews here, my wife and I had high expectations.  So - we jumped on GrubHub and ordered 2 pasta dishes.  Disclaimer, this review is not about the taste or quality of the food.  That was strong.  But - when we opened the delivery dishes, our $15 and $19 plates of pasta consisted of maybe 4-5 spoonfuls of food per plate.  spread out in a regular silver foil container, it didn't even cover the bottom of the container.  And it was spread about one noodle layer deep.  It wasn't even an appetizer size portion.  It was more like the amount of food you see on your plate after a meal where you say to yourself \"nah, not worth wrapping that up.  Not enough food.\"  Same was true for both dishes.  While we enjoyed all five bites of food in the container, we feel completely ripped off with the $40 tab that left us opening a couple of cans of soup for dinner.  Never again, Scalino.  Never again.  Thieves."], ["Jin C.", "I have passed by Scalino several times but never felt excited enough to give it a shot. Maybe because it is basic Italian food in an ethnically interesting neighborhood. Maybe the restaurant's spacious yet oddly empty interior never seemed very welcoming to me. Nevertheless, I decided to give it a shot one rainy Saturday evening.I got the prosciutto and melon appetizer, which I thought may have been a lovely refreshing diversion, but the prosciutto lacked flavor and there wasn't enough of it. The taglierini with meat sauce was reasonably tasty, although I would have preferred a firmer bite. I don't think I'll return here - the pricey menu does not justify the average food."], ["T K.", "Came here during the week for the $10 lunch special (any pasta and a house salad) and was blown away by how delicious and simple it was. I recommend the spinach and ricotta ravioli.Came back on the weekend for dinner with my girlfriend and we each got something from the special board. I had pork shoulder and she had lasagna. Both were phenomenal. So delicious and light. I think we ate everything in like 2 minutes. The service was excellent and professional. The food also came quick and the restaurant was packed.Will definitely come here again to try more of the specials."], ["Carolina V.", "What a lovely place! Delicious Italian comfort food in Greenpoint - extremely reasonably priced, lovely staff, and quaint setting. We started with the eggplant parmesean, and shared the spinach ricotta ravioli with the leg of lamb. The lamb was so tender and slid off the bone - like butter. Looking forward to returning and getting the tiramisu!"], ["Drew T.", "Scalino is a fantastic little gem in Greenpoint. Highly recommend digging into their daily specials, as they're all local, fresh and delicious."], ["Angelica N.", "I was very reluctant about going in but I'm Super glad I did. Amazing home style Italian food and a low key laid back style. They have different appetizers each day and the pasta is beyond any pasta I have every had and my good friends mother and grandmother use to cook food for us all the time. The portions are great not to much and not to little so you leave feeling full but not nasty and guilty of what you just ate."], ["Rusty S.", "This place is great. Awesome food and service, one of the best additions to Greenpoint in the last few years. The Calamari is better than most places and the serving size is very substantial. I have tried all the pastas and everyone is good my favorite is the Rigatoni. Great for take out they always give tons of fresh bread with your pasta."], ["Ms. S.", "We had one of the best meals yet from Scalino last night. We order take out or delivery from these guys quite often and the flavors are always on point. Last night's meal was so delicious it prompted me to write a review. We ordered the fried zucchini blossoms, Jersey tomato salad, eggplant parmigiana and the fettuccine with pesto. It was absolutely outstanding! I'm so glad these guys are in the neighborhood and I can't wait for the next meal."], ["Dianne R.", "AH-mazing! My friend and I came here for dinner after putting our names down on the waiting list for 2 other restaurants in the area, and we were certainly not disappointed. Scalino is a spacious restaurant that serves perhaps the BEST pappardelle I have ever tasted! Do yourself a favor and splurge on this delectable menu item! You can't go wrong with either their standard menu item (pappardelle with tomato cream and smoked bacon) or the pappardelle special with truffled butter. I swear we died and went to heaven with each bite! Other standouts on the menu that night were their antipasto Scalino (because who can't have enough meats and cheese right?) and their salmon (with just the right amount of crusty crunch on the outside). We topped off our meal with a bottle of Pinot Grigio and tiramisu for dessert, and for the entire bill to come out at less than $100 for 2 people (without tip) I am genuinely satisfied. Service is also wonderful - hospitable, funny, just the right amount of checking in on you. I will definitely be back, hungry for more!"], ["Anago A.", "We arrived 7pm on Saturday night with 7ppl without a reservation. Luckily we got seated after only 10 mins wait. Then the place got packed in a half hour. Phew! Lucky us!The food was very good especially my dish - thick spaghetti with truffle butter ( seasonal special)  The service was very friendly as well. It would've been great if they played some music during the business. It might be a bit awkward to dine in silent."], ["Francisca G.", "This hispter restaurant has a very cool atmosphere. Very fast service and good location. However, pasta is not so fresh."], ["Sunkyung P.", "Food was great, wine prices very reasonable, and the owners (?) were so personable and warm! It was a great place to catch up with an old friend over a hearty meal. Try to sit towards the front if possible - I was closer to the back/kitchen and left smelling like eau de scalino (not good when their special has anything to do with fish haha) but overall a great meal."], ["Jennifer L.", "This place is ok food wise but the atmosphere is terrible. It has so much potential being wasted. They really need to work on setting a mood here. It's so quiet you can hear a pin drop. Please put on some music and turn down the lights and put some candles on the table. Half of dining is the ambiance. The food is ok enough and the service is great. With some work this place could be really decent. Nobody wants to be at dinner and hear the table on the other side of the restaurants entire order."], ["M D.", "Simple, good neighborhood Italian. Not pretentious, not fancy, just good home cooking in a quiet environment. Highly recommended!"], ["Samantha J.", "Most favorite place in greenpoint ! Keeps getting better and better every time... I will cry if this place ever closes ! Delicious food|great service! Love it."], ["tia d.", "The food is average. The wait staff, Peter in particular, is LOVELY. The man I presume to be the owner is arrogant, rude, and bullies his staff in front of customers."], ["Chantal M.", "Great dishes all around! We had the arugula salad, salmon and zucchini, rigatoni, and spinach and ricotta ravioli. Everything was cooked and presented well! Service was pleasant and food was timely."], ["Bertrand M.", "One of Greenpoint's best kept secrets. Ambiance is amazing: feels like an old school, no frills Italian family restaurant. The pasta is always perfect. I love the Ricotta ravioli and the Carbonara is phenomenal. Don't sleep on that place!"], ["Katie L.", "Dining here is the way dining everywhere should be like. Came here for the first time on a Saturday night with 3 others and didn't have to wait long at all for a table. The decor/ambiance is warm, but not flashy. The service is the best you can ask for and then some -- truly the nicest, most charming people. The food was fresh and delicious, very obviously made with great care. I will be back to try one of everything!"], ["Caroline P.", "Great service!! This place is so underrated. My friend and I ate an early dinner, so the place was empty. Got a lovely window seat. Server charged our wine on the house because the lasagna we requested wasn't ready. So considerate. The pappardelle with tomato cream was delicious! Fresh and creamy. Pre-meal bread w/olive oil was fresh and crunchy. Definitely coming back."], ["Simon G.", "I went here because the reviews were great and let me tell you they were completely wrong. The pasta was flavorless and the calamari tasted like rubber bands.     I would never recommend this place since I'm fairly sure anyone can make better tasting more flavorful food."], ["Thomas O.", "Great food, great service. Enough said. I had a calamari appetizer that was excellent. Oxtail special was also great. More than enough bread. Go here."], ["Mike M.", "Really amazing home-style italian food in a casual setting. Plus they do delivery!Everything hits the mark here, from the complimentary bread to the downright amazing housemade pastas. The desserts are excellent as well - I can never resist the crème brûlée! The service is also spectacular; attentive but not annoyingly present.The only reason I would consider not giving this place five stars would be to keep it to myself, but it's too good not to share with the neighborhood."], ["B T.", "We were visiting Brooklyn and found Scalino after looking for a small place with great reviews. Glad we kept looking! Fantastic food and great down-to-earth atmosphere. We were four for dinner and each of us had an amazing meal. Roast pork shoulder, grilled tuna steak, fettuccini with lobster, and taglierini with meat sauce... all spot on!"]], "Cent'Anni": [["Michael K.", "Great food, good service and a did I mention the food?I'm a regular of the black linguini, but was recently pleasantly surprised by the delightfully acidic kale and bucatini dish. My girlfriend can't get enough of the grandma's ragu and the bruschetta are always a nice treat for the table (though I'd agree that it could be easier to share).As far as service, I've always had a good experience here... Things don't always come out 100%, but I've never had trouble getting anyone's attention and any problems I've had have been sorted quickly and with a smile.Really love this place, just wish I were in the delivery radius."], ["Anna L.", "This place has great brunch options with good prices. The ambience was nice and it feels very urban, but not Italian. I wasn't really impressed with the authenticity of the food (had American influence than Italian) although it was pretty good. We got the squid ink pasta and a breakfast item and chicken parm sandwich."], ["Erica L.", "So, if I were to have written this review a year ago it would have been 5 stars. 6, if that were possible. This was hands down one of my favorite places to eat. The food was delicious the service was great and the prices are well below the average spot on Franklin. I had recommended this place to quite a few friends and organized many dinners here, birthdays, etc. Overall I was very pleased. Over the last 6 months I have seen a dramatic change. The service is now terrible. I get that you are busy but ignoring your guests is not a good tactic. I can even forgive bad service if the food is amazing. However, the food is unreliable. It never tastes the same. The only thing that is consistently good is the Caesar salad. Overall, I am sad to say, I think I am over this place. I really wanted to like it, but after multiple bad experiences in a row I have to cut my losses."], ["Gracie F.", "I enjoyed every bite of my dinner at Cent'Anni. I had just come back from Puglia, Italy and have become a bit of a pasta snob since. Cent'Anni BLEW ME AWAY. I ordered the orecchiette pasta and it was DIVINE. I couldn't believe how good it was. I cannot wait to come back and try the homemade pastas! I recommend this place highly!"], ["Nikki T.", "More like 3 1/2 for now. Potential to be more. Very cute little place... was really looking forward to sitting outside (actually the reason we went there), but we got there too late on a Saturday. Last seating is at 9:15. Very strict seating rules for the tables by the bar (wouldn't give a table for 4 to 2 people and it was then used to fold napkins by the servers). Again, it was late.. bend the rules a little.Normally, these would be huge factors by my boyfriend, who even spoke to the manager... but the food itself was very good. We ended up sitting at the counter by the window and had good service there. We had drinks, appetizers, and pasta dishes all for about $100. Very reasonably priced.Look forward to going back earlier and sitting outside."], ["Amriel K.", "I came here with a large group for a birthday dinner. The inside of the restaurant is definitely cramped but we were seated comfortably in the outdoor covered area in the back.Food and service were both great. I had a homemade whiskey sour cocktail (Paper Plane) that was pretty good. My entree was rigatoni with meatballs and sausage. That was fantastic. Sauce had great flavor, pasta was cooked nicely and the meats were tender and delicious.I still would never go out to Crown Heights voluntarily, but this place was really good."], ["Linda C.", "Ordered delivery (cash only) which was on time and our food was piping hot. We were a bit cautious trying a new place in the neighborhood so we went the classic route- penne a la vodka and rigatoni. Spot on and the perfect meal after a long day hiking upstate. Will have to make a point to go in to try the handmade pastas and report back!"], ["Maggie B.", "I love Italian food, and I love happy hour. Cent'Anni has both.Happy hour is half off wines by the glass, draft beers, house cocktails, and some call liquors. This is an amazing deal. No buts about it.The pastas come out piping hot and are really tasty. You can build your own bowl, or try a savory classic like rigatoni with meatballs and sausage. My husband and I go in here a couple times a week and enjoy chatting with the bartenders and grabbing a bite. Give it a try!"], ["Paul Q.", "I've become pretty regular here because of the consistency and fair price of the food as well as the super friendly staff. Usually eat solo dinners here at the bar, the restaurant can get pretty crowded.Get the salmon(i have a feeling this is really bad for you though), porkchop, or spaghetti a limone."], ["Laura Jean M.", "Been for happy hour, brunch, or dinner. The food is consistently good and the service is great. Whitney (waitress, long brown hair) and Ricardo (waiter, man-bun) and all the rest of the staff are constantly moving, constantly making sure everyone is taken care of. The back patio is excellent for leisurely dining in the summer and the interior is nice and cozy in the winter. My go-to neighborhood spot for solid Italian comfort food or an excellent happy hour."], ["Gina P.", "I've never been here for brunch but have come here for dinner several times. Their house made pasta is delicious and the service is always great. Also, while they don't always have it, the chocolate covered strawberries with gelato are probably my most favorite dessert. If you come here for dinner and they happen to have them as their 'dessert of the day', you should definitely give them a try!"], ["Krishan P.", "The service is lovely; the atmosphere is romantic but still very relaxed. We found the beet salad and the pasta to be delicious."], ["tony m.", "We walked in and walked out because the hostess was incredibly rude. Get a new hostess."], ["Gabrielle C.", "Great homemade pastas and a beautiful outside patio! The staff was extremely attentive and friendly and the prices were reasonable!"], ["Rachel M.", "Mmm, tasty tasty.  Echoing the love for this place.  Had the ravioli with Grandma's Ragu sauce and guzzled it down like there was no tomorrow.  Lovely atmosphere, great service, and delicious food - what more could you ask for? Oh that's right - lemon ice, a cocktail with limoncello.  Divine stuff.Only downside is that it gets pretty crowded, but it's worth it, and the maitre d' was kind enough to come outside a few times to let us know she hadn't forgotten about us, which was a nice touch.  And sure enough, the meal was well worth the wait.  Even something simple like the bread and olives and oil before the meal tasted delicious - probably because the bread, like the pasta, was freshly made.They have a lovely patio area in the back that was unfortunately rented out for a private party, but we'll probably visit it this summer when we return to experience more of the menu - you can bet that we'll be back!"], ["Nicholas D.", "Great Italian fare and great wine list."], ["Lauren S.", "The Seamless Online Order Tracker is both a blessing and a curse.  The food was delivered 21 minutes after being marked as \"out for delivery\" and the restaurant is a five-minute walk from my apartment.  The food arrived cold and with no extra sauce, as requested.  The one extra thing in the pasta I didn't ask for - a long black thread.  Not sure who is sewing in that restaurant, but they should keep it away from the food.  Disappointed."], ["Marlena F.", "Delicious. Their ingredients taste high quality, their service is great, the food is delicious and filling. I can't decide if I love their dinner or brunch more. The brunch is delicious and affordable but the dinner menu has so many good dishes."], ["Donna A.", "I was walking hand in hand with the bf when I saw my friend on Franklin Ave.  I told her we were heading to Cent'Anni for dinner and she shrieked no!  She went on to say how much she hated it, she wanted to massacre it..blah blah blah.  This wasn't going to stop me.  I was hungry and I had my mind made up that I would be eating here.Was her dramatic reaction to my dining at this location warranted?  Not at all.  Did she mention some noteworthy things?  She absolutely did.. The restaurant is dim, rustic, and extremely cozy.  It's a perfect atmosphere for dates, or hanging out with friends and family.  The service was pleasant and timely.The food was ok, but it really lacked flavor.  We started off with the veal meatballs that would have been really good if they had more salt added.The bf had the black linguini which again I thought could use more flavorI had the grilled porkchop which had just the right amount of char to it but as you guessed it...needed more flavor. The side of veggies were really dang good though. I had an overall pleasant experience but wasn't wowed at all.  Maybe the chef that night decided to make it a low sodium night.  I'll definitely come back to see if anything has changed."], ["nikki F.", "A wonderful return for lunch with friends visiting from out of town.Fun, friendly service and a Caesar fit for a Roman king, with perfectly balanced anchovy dressing and generous shavings of parmigiano. True to form I added grilled chicken while the visitors enjoyed an ice-coffee accurately described by our server as 'liquid silk', kale salads (when in New York...)."]], "Aita": [["Gus G.", "A reliable neighborhood fave.Always a solid few vegetarian options on the menu, though I'll forever miss the pasta with the fondue sauce. Sides, desserts and cocktails are also a consistent delight.Please be there always, Aita."], ["Daria K.", "Went here again the other night for dinner and, of course, was not disappointed.I had the cannelloni which blew me away, but the real star was the burrata. I'm still dreaming about it. Finished off with the chocolate mousse and it was one of my favorite meals in Clinton Hill. Not one complaint."], ["Roj A.", "AMAZING! Don't even think twice and just order the avocado Benedict. It was a-friggin-mazing! I loved everything about it. The space is super cute. Woodsy, charming and laid back. I'll definitely be back!"], ["Ev D.", "Fantastic dinner with a party of 6. Totally accommodating--reservation system via their website works well. Thoughtful wine selections and creative seasonal meal options."], ["Rena Y.", "3.5 AITA is a Michelin recommended, casual restaurant with a Brooklyn hipster meets suburban gardener vibe.The restaurant's decor is well-appointed. Fresh flowers are displayed throughout the space, giving you the sense that you are dining in a semi-outdoor space.The menu is well written. There were many dishes that I was curious to check out. Perhaps it was the unexpected combinations. Take for example, a dish that involved butternut squash with coffee sauce. Say whaaat?!Finally settling on a fish burger and \"Pink Paloma\" bevvy, with my guests opting for the Monte Cristo and oxtail burger, I wasn't nearly as excited after the food came out. Of the three entrees, the oxtail burger (sadly, not my dish) was the best. My fish patty in the burger I ordered was too bread-filler heavy. It would have been better if it were a singular filet of fish, but it was a blend, bound together with a mysterious wheat-based binder. It was a nice concept to have salmon blended with a white fish, as it gave the patty a mottled appearance, but the flavour was underwhelming. The cocktail I ordered was decent but not amazing.It's worthwhile checking out if you're in the area. I don't know if I'd be back anytime soon, however, with the multitude of cool looking dining options in the neighbourhood."], ["Lisa L.", "Went there for breakfast on a Sunday morning around 11 - didn't have to wait because we sat at the bar. The service was great and the food was perfect - I wanted to stay there all day and eat everything. Had the jalapeño eggs benedict with avocado and I basically died and my ghost is writing this review."], ["Mars H.", "Very attentive service, comfortable ambiance, delicious food! Recommend the avocado Benedict and the carbonara."], ["Fazeela S.", "This restaurant deserved the 4-star rating the year that it opened. Not anymore. I lived down the street from Aita before it opened and was so excited about this restaurant when it opened a few years ago ... (it opened in a *cursed* spot - no restaurant/bar has ever lasted in that spot).This year, the quality has exponentially decreased. Their frissee kale salad used to be one of my favorites - but they stopped carrying it! They also used to have a spicy habanero infused cocktail - but they no longer carry it. We recently stumbled here after eating at The Finch down the street. (Read: Bad Idea - Should have stayed at The Finch). The dessert that we ate was so bad - we considered returning it, but decided to just eat the cost. The last 3x that I have patronized Aita I was totally disappointed. Each time I thought, \"It's just a fluke, it will be better next time\". I was wrong. I do not plan to ever enter its doors again, unfortunately."], ["Meredith R.", "This place is a nice gem in Clinton Hill.  Went for brunch and the oxtail burger is amazing! Get the fried egg atop the burger and you will not regret it. Tasty and tender meat with hand-cut fries. My friend got the pastrami smoked salmon bene- different and wonderful! we started with butternut squash chips which come with this delightful coffee aioli dipping sauce.Going back for more great food in the future... dinner next time!"], ["mj b.", "Went last night with my visiting/out of town parents. We were really disappointed. The waitress had absolutely no personality, the pasta w seafood was over cooked. My husbands pappardelle was excellent. It wasn't the standard Aita fare. I wonder if the restaurant sold to someone else. It just didn't have the charm and authentic Italian food It used to. I would rank it 4 stars if you never experienced it's original charm but only 3.5 stars for not meeting past expectations of guests that really loved the original authentic Italian restaurant in Brooklyn."], ["Kristian I.", "The restaurant has a unique, rustic atmosphere and a great menu. Highly recommend to try one of their home made pastas, personal favorite is the  cannelloni parmigiana!"], ["Charisse S.", "This is an adorable restaurant located on a quiet corner in Fort Greene. It's nice and cozy, but was still able to accommodate a large party of 8 for a birthday brunch. Two of us came a bit early, but we were still seated. It was tough to settle on an entree because the menu had great selections. I'm told that the salmon hash is really good, but I decided to go with the P.E.B.F. I was worried it would be too much food but the portions were just right. At the end of the meal as we were about to close out our bill, the staff was kind enough to bring out a slice of birthday cake for my friend. Icing on the cake as they say."], ["Shane L.", "Such a cute place! The decor is great. It's like having brunch at home. The server and who I assume to be the owner were very kind and checking to see if everything is ok. The food was good for standard eggs Benedict. Just what you would expect. The Devilled eggs however was more like egg salad. Not what I grew up with. But that's very subjective. The only negative was the server who brought the food to the table. He hurriedly just set the plates on the table and dipped. Overall a must go for a Saturday morning brunch."], ["David H.", "This place has some amazing pancakes and their deviled eggs with whitefish is no joke."], ["Jorge M.", "Aita is a lovely, peaceful place, at least at 2 PM, with discrete Bossa Nova Muzak in the background. The food and presentation make for a great experience. I'm going to try to post a photo of the delicious food. I've just posted the photo-- can you find it?"], ["Nate S.", "Pero, this place is magnifico!Came here for a Sunday brunch date on a rainy day thinking-\"idiots like myself wouldn't be out here\", but I guess I was wrong. Wait time 40 minutes.Since the place is small, I appreciate the fact there is a bar next door that patrons can wait. So we drank some gin n milk, and waited our turn to join in the fun.As promised 40 mins later back into the restaurant we go and I soon as I enter I see a famous actor seated on the far right table..Can't remember his name but I was 2 seconds away from interrupting his meal for an instagram picture.Sat down, enjoyed the warm ambience, dim lighting, very intimate decor. Good look for my date.Ordering time came, at first I wasn't too impressed with the selections, I felt as though the menu was lacking more combinations, even though variety was there. Ordered the oxtail burger (Ya mon), and my guest ordered the salmon hash.Oxtail burger- people ranted and raved about this burger. I bit into the burger and thought two things..this burger is DAMN good and where is the flavoring of the oxtail? In all honesty it just tasted like a really good burger but being Carribbean I expected more of a strong oxtail taste. Regardless, I murdered that burger. Fries that came with meal were pretty good too--maybe better if they were truffle fries?Salmon hash--I'm not even a fan of fish, but this dish was outstanding. The idea of salmon and hash getting married and procreating on the plate really did wonders on the palate. I actually preferred this one a little bit more than the burger.Bill was inexpensive, $44 which included an apple cider and a coffee. To impress a date, meet a friend, or a small group outing I highly recommend this spot."], ["Liz N.", "Siri just heard \"Aita\" as \"I need it,\" so that should tell you something. It is a sweet spot with reasonable prices and consistently good food. The dishes aren't revelatory but I've never had a bad bite and, importantly, they seem to be cooked with love. It's also a cozy space, and always seems to draw an attractive crowd. Seriously! I once sat next to Jason Sudeikis, Olivia Wilde, and their adorable baby there. Some new things were added to their brunch menu, and I tried (and loved) the avocado benedict with jalapeno hollandaise. Home fries, which I often find bland and mushy elsewhere, are delicious here with a lemony Parmesan thing going on. I recommend asking for them extra crispy.They also own Mayflower next-door, which is an equally sweet, tiny cocktail bar. Just be warned that almost everyone in there is on a first date, but the cocktail menu is delightful."], ["stacey s.", "What happened tonight, Aita? You used to care. Immediately after finishing our meal I took to Yelp to see what happened to the Aita of 2014. Sure enough, a couple reviewers felt the same. Maybe there was a change of management. Maybe it was just an off night. Either way, there was a general lack of love this evening from the cold service to the undercooked pasta. I'll try again but fool me once, shame on me, fool me twice, I'll stick with The Finch."], ["Seth B.", "simply fantastic food. we split appetizers around the table... and everyone enjoyed bites of the calamari and potato foam (squid ink is perfectly briny) octopus and tomatoes (octopus was perfectly cooked, which I gather is hard from watching people fail to cook it right on Top Chef) and the green tomato and corn salad (so summery.) We also enjoyed the cucumber smash cocktail. If there's a line, its worth the wait."], ["Ashti D.", "We're back...this time with the Braised Calamari, Hanger Steak and Oxtail Ravioli...So delicious !!! Hands down a great brunch and dinner spot."], ["anabela D.", "The goodCute vintage styled little Clinton hill true Italian gem. Friendly attentive service. Well portioned well seasoned well priced  inventive brunch dishes with an Italian accent .Perfect cappuccino ( true Italy style) with almond milk option for dairy intolerant folks. Interesting refreshing brunch drunk options.The bad My only negative is I had the brunch platter with 2 eggs, blueberry pancake , home fries salad and bacon. Was not a fan of somewhat thick doughy pancake with singular blueberry. No syrup to the table. So I thought that's how they do it but half way through lady next to us asked and got some syrup.In other words super minor issues in a overall tasty spot.Overall can't wait to come here for lunch or dinner with their slew of delicious sounding mains. Would love if they added gluten free pasta options but probably will just take hit and try one of their homemade pasta options. If you are a fan of Locanda Olio a few blocks off, you will love this place."], ["Joey I.", "I wasn't planning on going to Aita, but when my girlfriend and I walked past we decided to make an impulse decision and try it out. Which was a great call, because our dinner was delicious. Course: AppetizerWe Aita...cheeseboard! The cheese board had 5 \"cheeses\". One was a really strong spreadable cheese (don't smell it), one was a pile of brownish mush (I have no idea what it was), one was a stack of what may or may not have been orange rinds (or apricots? who knows), and two were more normal cheeses (really good). It came with three slices of bread, each slice given one at a time, only on request, and with increasing levels of skepticism over how on earth we could need so much bread with our cheese. Overall, it was good but I wouldn't get it again. Course: Main DishWe Aita...lot of pasta! We split the spaghetti, the orechitetta (that's how I pronounced it at least), and a side of yucca fries. The spaghetti was phenomenal, full of fish and shrimp and mussels and spaghetti. Five year old me would have been horrified that someone did that to spaghetti, but I'll go out on a limb and say it was way better than the spaghetti and tomato sauce dishes of my youth. I'm going to stop trying to spell/say the other pasta, but it was full of lamb ragu, peas and carrots, and was in a surprisingly deep bowl. The spaghetti won our pasta battle, but it was probably an overtime victory where anyone could have won and it was all the refs' fault somehow. The yucca fries were a nice side dish but somehow tasted nothing like my how my school dining hall made them, which is a huge point in their favor. Course: DessertWe Aita...nothing! First glance at the pasta made it seem like I'd leave hungry, but I definitely didn't need any dessert after realizing how surprisingly full the portions were. Bonus: BathroomWe Aita...no, we didn't eat anything in the bathroom, or at least I didn't. But fortunately I was able to take a quick trip to the toilette (say it with an eye-talian accent) and play with the super cool typewriter! Gone are the days when a trip to the restroom ruins your productivity, because with the handy typewriter, you can relieve yourself while also keeping up on your correspondence. All together, Aita was a nice find in a cool neighborhood that I would definitely recommend."], ["Chey H.", "I've been to Aita twice now, both times for dinner, and it really is a gem in the area. The decor reminds me of a cute farmhouse and the service is outstanding--both times the waiters and servers were on their game. On my recent trip, dinner began with drinks and bread (each person receives their own portion!). I had the spaghetti, which sounds like a simple dish but the flavors were outstanding, and the mixture of seafood very fresh. My date had the pan seared cod, which was also cooked well. We dined a bit later at night, but we didn't feel rushed, and were even asked if we wanted more drinks or dessert. There were a few small groups sharing bottles of wine and chatting as well. I don't remember all of my meal from my previous visit, but I split the cast iron skirt steak and I do remember that we enjoyed it--sometimes a perfectly cooked steak is all you need. I highly recommend Aita--you're in for a great experience."], ["James M.", "On a corner in a nice Brooklyn neighborhood, this experience was perfect for the mood we were in. Unassuming, creatively decorated, friendly, and comfortable. And the food was outstanding. Our sampling included: A fava bean/arugula salad - Nicely balanced mix of beans, arugula, parmesan, and dressing. Quinoa pesto salad - unique quinoa and basil mixture topping some greens and interesting radish slices. Roasted suckling pig - moist, flavorful, generous portion. Pan seared fluke with sweet potato puree, shaved aspargus and barley risotto - Great flavor combination. Espresso mouse with Sambuca gelatin - best dessert I've had in a while, subtle but sophisticated flavors. I can see why this is a popular spot for people who live nearby."], ["Michelle P.", "Aita is a neighborhood gem and my go-to brunch spot. I've been coming here for over a year and have never been disappointed with the service, food, or the drinks. My favorites are the oxtail burger, the holy scramble, the braised beef hash, the fritatta, eggs benedict, and the pancakes. Aita, if you're reading this - bring back the carbonara! That was the best carbonara of my life. All in all, it's highly affordable, great food with lovely staff. There is always a wait (30 mins tops) so get there early. But, if you have to wait, they just opened the Mayflower next door so you can grab a coffee, tea, mimosa, or one of their lovely specialty cocktails while you wait for your table. They'll bring over your drinks if you aren't finished before your table is ready and they'll come over to call you when your table is ready. Fabulous service. An absolute gem."], ["M M.", "I hesitate to write a review, because then more people will know about this wonderful place. As out of towners, it was pure good fortune to find this restaurant. From waiters to the bartender....superb and friendly service. Will go on my list that I give to everyone I know who appreciates what hard work and skill means to food."], ["Sarah N.", "What an amazing dinner. I've heard that Aita does veggies impeccably, so my friend and I stuck mostly to those. We got the arugula salad, buratta, crispy asparagus, and snap peas with pancetta then shared the poached cod special. We literally cleaned every plate. Every vegetable was cooked simply, seasoned and dressed with the perfect amounts of savory, salty, and acidity. One of my favorite things about Aita is how they are truly committed to the best seasonal ingredients (there were bites of yummy zucchini in different forms in just about every dish) but they are not self-aggrandizing about it like many restaurants who make this same commitment. Service was wonderful--our waitress was charming and friendly and very attentive. I can't wait to go back."], ["Mem R.", "I stopped in at Aita on a chilly January afternoon for a delicious cocktail, after discovering that the bar next door I'd intended to visit was closed. It was very quiet, but it was quite early on a Tuesday evening just after new year.The cocktail menu is short and stellar with a number of drinks that really piqued my interest, a good solid list of interesting combinations. I usually prioritise gin but at Aita I had a drink from the scotch cocktail list (ok, it had damson gin in it too) called a Casablanca (I believe most of the drinks on the list are house specials). It definitely warmed my cockles and fortified me for the rest of the trundle home in the bitter cold!The staff also went to great efforts to assist me inside with my broken ankle, and to turn their liquor cabinets upside-down searching for some Kahlua for my mum's spiked hot chocolate request. Sweeties!"], ["Ben W.", "Went for  brunch, which transitions to dinner at 4p btw. Had the oxtail burger which was delicious. Their fries were amazing with (parsley I believe?) in with them. The omelette was also done right. Coffee was brewed fresh.Very nice waitstaff. Would like to try out they're dinner menu. Will be going back."], ["Anastasia D.", "My favorite restaurant in the neighborhood. I eat here regularly and it's always consistent and superb! Menu changes with the market highlights and Silvia (the exec chef) is a master in the kitchen. Constantly whipping up beautiful, creative dishes. Cocktails are perfect - try the Negroni Sbagliato - wow. Atmosphere is cozy, rustic and romantic. Personal favorites that are constants on the menu - Burrata and Cavatelli. I love the staff as well! Quick service, accommodating and friendly. This place takes up a special place in my foodie heart. Can't speak any more highly of it. Thanks to everyone at Aita!"], ["Angel D.", "I'd been interested in checking this place out and finally did for brunch. I ordered the Oyster Eggs Benedict and surprisingly it came out very quickly. Unfortunately, it was not warm at all, none of it - hence the three stars. This was strange to me as at minimum the Oyster should have been warm since it was fried. The bartender was very nice and after I told him the food was not warm he gave me a delicious bloody mary on the house. I would have loved to try a hot plate but the room temperature food was good too. Make sure it's hot and you've got a winner."], ["Finlay L.", "Sunday brunch was PERFECT. I don't say this lightly, because I am picky about eggs and fanatical about potatoes, so while many brunch places are good, few are great. Aita definitely nailed it. I had the omelette with mushrooms, goat cheese and, who would have guessed, butternut squash. I'd never thought to put squash in an egg dish but it added a delicious, surprising sweet note that really made the dish. The home fries were among the best I've ever had: super crispy and topped with a little bit of parmesan cheese. I was going to eat my dad's (because I'm considerate like that) but he got to them first.This was another parent brunch outing and it also earned the coveted parental seal of approval. Mom had blueberry pancakes with lemon ricotta cream. They were served with syrup but you do NOT need it! The blueberry compote on top was enough. The pancakes themselves were thick and fluffy, the kind I dream about and can never find. You know, I keep telling myself I don't like pancakes, but somehow I couldn't stop borrowing little bites. Obviously just to make sure they were okay, because again, I'm very considerate. Dad got the breakfast plate with eggs and a single pancake (no lemon cream, sadly). I'd report on that but I wasn't allowed to try any.On top of it, the restaurant itself is very cute and cozy. I love the reclaimed windows and vintage treasures scattered around the room - they're charming without being cliche. Even the bathroom is well-decorated -- actually, it's nicer than most apartments, which I guess could be a good or bad sign depending on how you look at things.Overall, a winner. I'll be back soon to try dinner...or maybe just to sit at the bar and eat home fries. We'll see."], ["Deby M.", "the best restaurant in clinton hill. food! service! aesthetics! ambience!"], ["MtPleasantChica ..", "We returned for a full dinner at Aita tonight, and it was fantastic. Every course was done to perfection, service was attentive and we will definitely be back! My husband had pork terrine--served as delicious croquettes with a yummy beet salad--and the braised lamb. Both were cooked well and beautifully presented. I had the octopus appetizer and squid ink pasta with broccoli rabe and clams. The octopus was done to perfection -- tender and juicy, but not overlooked, served with fingerling potatoes and beans. My pasta was exceptional -- blanched broccoli rabe and al dente pasta with a generous portion of clams. We shared the pumpkin tart dessert with vanilla ice cream and cinnamon crumble, which was the perfect Fall treat. Overall, great meal and definitely recommend!"], ["Thiago F.", "Awesome service and great ambience. The food was so good! One of my favorite places in the area."], ["Cuocofelice C.", "Love this place!! I was there for brunch &  decided to go there for dinner last night and Aita does not disappoint. We sat at the bar waiting for a 3rd friend and asked the hostess how long for a table. She was so nice and was able to move things around because we had been sitting there, but didn't put our name in right away. Once seated, our waitress greeted us and was attentive, but not overbearing. The environment is very cozy and the food is great. Can't wait to go back!"], ["Ira B.", "Had a very pleasant brunch. Eggs Benedict with avocado salad and home fries was delicious."], ["Steph G.", "what a great meal on new years eve! cozy, quiet, fabulous restaurant with delicious italian fare. I had the cavatelli and am already thinking about/planning/scheming for when i can return and have it again. I went with a group and we managed to order every pasta on the menu... while all were delicious, the pappardelle and cavatelli were really delicious. highly recommend if you're in the area (especially given its proximity to barclays) or looking to venture to new lands for a great dinner"], ["Nicole T.", "This place is adorable and intimate. I enjoyed a late dinner during an epic snowstorm, and was pleasantly surprised by the cozy vibe. We stayed and enjoyed the view from our booth past closing hour, and the waitstaff was more than accommodating. The food is a bit more pretentious than what you would expect from the decor - small portions and unnecessary garnish. But maybe it was so good that I just wanted more?"], ["Laura M.", "A beautiful, cozy little restaurant nestled on a lovely Clinton Hill corner with an intimate ambience and delicious food! Service was great as well. Can't wait to go back here for my birthday next week!"]], "Rucola": [["JP A.", "Superb pasta, great atmosphere and kind personnel, we loved the evening in this woody brick and mortar friendly restaurant."], ["Hiroko N.", "A lovely neighborhood restaurant. I have visited 2 times for dinner so far, definitely will go back. Great cocktail, nice service. It can get really busy, I would recommend to avoid prime time, the wait can easily be 40 minutes. For the foods, I was a bit disappointed by a pasta dish  (lagu?) which was painfully salty but other than that one dish everything I tried was very good. I especially liked fish dishes."], ["jaclyn g.", "GREAT customer service! The menu isn't bad either!Went here for brunch on a Sunday around 1pm. Pretty busy but we didn't have a wait at all. I will say the brunch menu is a bit limited for my taste but I ordered the bacon/egg/cheese sandwich w/ arugula. Not bad! They brew stumptown too -- awesome! The vibe/ambiance is really great and I think this is a great after work/date spot. No doubt a much more extensive menu for dinner.They accept CCs! Yay!I will definitely be back during the week to try the PM fare."], ["Danielle A.", "Perfect for a low key brunch or a delicious dinner. I've tried the short rib ravioli, phenomenal and for brunch the smoked salmon which hit the spot."], ["Devin M.", "Food was outstanding, had the sausage rigatoni with crispy polenta. Started with the chef's selection of veggies, meats and cheeses which was also great, the pickled onion was a surprise hit. They also had a reasonably large by the glass wine list and the wait staff seemed to be very knowledgable of everything on there, asked for a couple of recommendations which didn't disappoint! Only criticism is that the service was a little slow but we also weren't ready to order at first so they may have assumed that we wanted to take our time (it was early evening on a Sunday after all)."], ["Lenny S.", "Rucola is THE spot. I feel so fortunate to have stumbled upon this restaurant in my travels. The staff was super attentive. Leading the way was the bartender, Lucas, who offered great conversation and attentiveness so that I didn't feel as if I was eating alone. The food was excellent, the attention to detail and execution was impeccable. Every bite I took directly refuted the laws of diminishing returns. Incredible. I was also lucky enough to meet one of the owners, Julian, who sat outside and shared a beer and slice of 420 Blackbirds pie with me. What an incredible guy. It made me really feel at home. As patrons walked out of the restaurant there was a chorus of 'oh my god that was delicious' and 'we have to come back soon'.  I can't rate or recommend this restaurant high enough. If yelp offered 6 stars Rucola would be a ten. If I find myself in Brooklyn again, I will most certainly come back!"], ["Patrick Q.", "The brunch I had here was just OK. I ordered the french toast and the bacon (which they needlessly referred to as \"pancetta\" on their menu), and was still very hungry afterwards - the french toast was delicious, but it was literally only 1 1/2 slices of bread. They took two slices of bread, cut them both in half, and then threw out one of the halves. Why not just make two full slices? It certainly cost enough..."], ["Art O.", "This was our first meal on our recent NYC trip and we were starving after taking a morning nap after our red-eye flight.We found this spot and the hanging plants on the outside and wood interior made it quite inviting.It was a little on the crowded side for lunch but we got a table. Along with some beers we ordered the following:a Cuban sandwich, a salad, a pizza slice, and a few selections of cheese with bread.We figured they'd bring out the easier-to-prepare items first but we waited a LONG time and nothing came out. Other tables were getting their food and needless to say, we were agitated and hungry.Anyway, I finally spoke with one of the servers and miraculously, the food came out promptly. The server I talked to said they were busy but our server should have asked about bringing out the dishes in the appropriate order.I liked that he apologized for the error but we were left a bit underwhelmed with the food and still upset about the wait."], ["Scott W.", "I came here for brunch and it was very pleasant. The food was good and the outside seating was beautiful. I can't wait to come back for dinner."], ["S P.", "Everything was spectacular. Worth the wait. Some of the best Italian food I've ever had."], ["Lauren H.", "Arrived early on a Sunday night, 5;30ish and was seated right way.  Good thing, because by 6 the place was packed, and people were being told that it was going to be an hour wait.  The tables are packed tightly, so be prepared to be sitting on top of your neighbor.   The food here is great.  Especially, the freshly baked focaccia on the table.  Seriously, it was the best bread I have had in a while.   I'm sure the pastry's that they serve in the morning compare, I just wish I lived a little closer to be able to try them. (so cool that this place is open for breakfast and lunch on the weekdays)  We ordered two cheeses and a salami.  the cheeses were super fresh and the waiter helped us pick cheeses that paired well with the meat.  I especially like the Toma Del Rocca- which was a blended cheese.  Also shared the watercress salad, which was light and refreshing.  Our entrees were the short rib special over spatzle and the rigatoni, both were super flavorful and I especially love homemade pasta, but the short rib was a bit dry .  The price point for this place is just right, and most bottles of wine were 40$ and under.  Overall, this is a cute neighborhood Italian spot that has a friendly knowledgeable staff.  Food is excellent, and reasonably priced. The decor is nice, but it feels really cramped when its a full house, which I think is most of the time."], ["Anthony S.", "Damn fine place. We shut this place down last night, lots of screaming and drinking, probably wasn't appreciated, but the staff is always great. The food is amazing, they have a very simple mainstays, which everyone of them are delicious. A bit pricey but it's Boerum Hill so can't really complain about that. Every time I'm over in the are I always make a visit."], ["John P.", "The food was delicious. It was a fixed price menu of $95 on new years eve. We arrived hungry  and left hungry. One mini ravioli,  four  mini carrots, one small but delicious short rib. Also five tiny raw scallops which I don't eat. They were nice enough to substitute roasted cauliflower which was also delicious but not enough. Very disappointing for the price. I've had larger appetizers."], ["Jay K.", "Went for brunch 5/10. It was pretty busy.Service was lacking. Hostess was quite flippant about our need for a hi-chair: \"Like I said, it's right back there and your server will be right with you to get it for you.\" Wrong answer, Missy. Awful customer service. Just get the hi-chair and make your customer happy.Also, 20 minutes for a hot chocolate with no apologies. Food was bland (eggplant sandwich and roasted asparagus with poached egg) and it took about 30 minutes for it to arrive. This place used to be a go-to for weekend brunch. Never again."], ["Melissa G.", "I live in Boerum Hill and have come to Rucola regularly since it opened. It kind of boggles my mind how anyone from the area could give it a less than great review. Most delicious dinner and brunch spot we have, hands down. If anything, the kitchen has gotten better with time, and the owners really care about what they're doing. They occasionally host special events, like a dinner where locals could meet organic farmer Jim Gerritsen, who fights so hard against Monsanto. Just a fantastic place."], ["Laura L.", "This place was DELICIOUS!  The staff was so kind, and the food was outstanding.  We had just come from the Brooklyn Tabernacle, and we did wait a little (it was 10:30), but when they sat us, it was worth it!  We had the fried brussel sprouts (thank you to the customer who recommended it!), the roasted chicken, moist and PERFECTLY cooked, and three of us had the homemade Lumache pasta.  Shared a bottle of wine, it was awesome AND the price was great."], ["Mark C.", "Bruch is very basic but very tasty. The atmosphere is rustic and chill."], ["Christine T.", "This is probably my favorite restaurant in Boerum Hill.  The menu isn't extensive, but everything I have had there was FANTASTIC.  My husband loves their cocktails, particularly the \"New Rider.\" The ambiance is very relaxing, although they get VERY busy during prime hours.  So either get there right when they open, or prepare to wait on a weekend evening.  I believe they take reservations only for parties of 6 or more.  You can also call ahead and ask them to put you on the waiting list.  If that's your plan, definitely consider calling 40 minutes in advance on a Friday or Saturday night!  Oh, we have gone on the early side before and there were quite a few families there.  There really isn't much room for strollers and the like."], ["Saisai M.", "Loved this place. Went here for the first time a couple nights ago for a casual birthday dinner. Great atmosphere, loved the background music and vibes. Food was delicious and the staff couldn't have been more wonderful. Our waitress Jessica was just fantastic. Great recommendations, and I just loved her attitude. Some places hit you with a professionalism that feels kind of cold. I found the staff here to be so warm and welcoming that it felt like home. I seriously wanted to befriend everyone in this place. I can't believe this place is open until midnight. We tend to eat late and often lament that so many of our favorite restaurants don't serve after 10p. We'll most definitely add Rucola to the rotation. What a great neighborhood find!"], ["Juan J.", "Great place for groups as they take reservation for parties over 5 people.  9 if us went there for a birthday party.  Food was good and service was amazing.  I would suggest the cured meat and cheese appetizers for the group and the trout for entree.  The honey and sea salt pie made my day!"], ["Beth C.", "I went here for dinner and it was great! The food was delicious and the service was good. The decor is great, but it is a bit loud. The garganelli was particularly good."], ["S M.", "I always pass this place and the atmosphere looks so nice that I finally tried it with a friend. I had a huge burrito at Fast & Fresh Burrito on Hoyt St.  (that's a separate review) three hours earlier so I swore I wouldn't eat very much. I got the spaghetti with mahi mahi.  I ate halfway through the dish- told my friend I would take the other half home, and then proceeded to eat all of it. I also had the broccoli with garlic oil. It was ok. Had a glass of white wine, the glass could have been just a tiny bit more full. Here's the kicker. The pudding. Thank God we split one. It's rich and amazing. I probably would have eaten a whole portion by myself had we gotten two.  This place gets crowded, so I would go on the earlier side."], ["Calliope C.", "Love their Bien Cuit croissants and yogurt, fruit and granola! Their granola is actually amazing! The service is kind of slow on busy days - dinner is fine but I find that they are more of a day place"], ["Rachel D.", "An absolute gem! Wonderful warm neighborhood feel, great staff, great wines great cocktail, great food, lovely decor. I can't say enough good things! In an area with wonderful food options Rucola reallygoes above and beyond b/c of their staffs attention to detail and accommodating nature. I may start eating here once a week!"], ["M G.", "Really nice, homemade food; all five people at our table loved their dishes. Service was excellent, extremely accommodating. Very cozy, perfect place especially for groups!"], ["Howard R.", "Solid joint. Good vibes. A bit pricy at lunchtime though."], ["Dana T.", "Limited but delicious menu, friendly service, warm and funky atmosphere, full of happy diners ... This is truly the bar/restaurant where \"everyone knows your name.\"  Fresh bread with sea salt pared with the appetizer olives and proseco is a great way to start.  Don't miss the roast chicken on spinach with puréed celery root. Cap it off with the dark chocolate pudding. Heaven. Can't wait to go again."], ["Jess G.", "This review is way overdue, because we went to Rucola back in November, but luckily I still remember how much we enjoyed brunch! The best part? The sweet potato gratin. I realize that sounds weird - and we weren't sure what to expect, but we could've just gotten 5 of these and eaten them and been happy. The sweet potatoes are cooked perfectly (with tons of butter) and spiced very well. I can't do it justice by describing it, but just know that you should try it. We also got the bacon, egg, and cheese sandwich, with the bacon on the side (because my boyfriend doesn't eat it). The sandwich was very good, but the bacon is definitely the best part :) For the sweet part of the meal, we got the nutella french toast. The portion wasn't as big as I would have liked, but how can you go wrong with nutella french toast? The chopped hazelnuts are a unique touch -- I recommend it!The atmosphere was perfect - and exactly what we expected in Brooklyn :) We sat at the end of a long, communal table. Everyone was friendly and laid back. The light fixtures and wood tables were great. I definitely recommend Rucola for brunch - I'd go all the time if I lived nearby!"], ["Bevin B.", "I love this place! I've gone once in a huge group (we sat at the center table), and a couple times with one other person. It is such a nice place. The brunch is great, but I can't stay away from the pulled pork sandwich. I recently had it over greens instead of on a bun and it was on point as a salad.The service is great but not obtrusive and they serve iced decaf coffee. An all around win."], ["Jim R.", "Very very happy. Ordered seemingly boring rigatoni but it was SO good that I can't figure out how they did it with maybe 5 ingredients. Fantastic. The fact that a waitress interrupted me ordering a pear-and-whiskey crumble to be sure that I knew it was not a parrot-whiskey crumble made me laugh so hard I was crying. Easy choice to eat here."], ["Riley H.", "Very cute little place! Great atmosphere and service.One thing we loved: their Toma Della Rocca cheese. Loved it so I had to mention it!Do try. It reminded me of soft goat cheese, but not as tangy... more mild. Really enjoyed it.Otherwise, we snacked on the melon app, the fried cauliflower, salads, and drinks. All was great!"], ["Sydney D.", "incredible service ambience and food. the place is on a residential street corner and it is kind of small. however the ambience makes up for it there is always great music playing and the waiters are  really attentive. The desserts are unexpectedly wonderful."], ["Rebecca M.", "Just went here on the recommendation of a nearby store clerk. We both got the slow roasted pork sandwich, which is served with delicious olives on the side. It was perfect. The atmosphere is relaxed and there was so wait at 1pm on a Saturday. Would love to come back here to try dinner."], ["Amanda F.", "I LOVE the food here, and the decor is super stylish and pretty making for a great atmosphere. I recommend the rigatoni - it's a unique and memorable sauce. So delicious!"], ["Sara K.", "Probably my favorite neighborhood spot for a nice dinner. I love how they are tucked away on a residential block in the heart of Boerum Hill. I've been here several times but recently came with my aunt and uncle on a cold windy night. Rucola really hit the spot. The ambiance is warm and inviting and the staff is friendly and helpful. The wait can get long and since they don't take reservations, come on the early side! Food- we started off with some of the vegetable antipasti, specifically the marinated olives, balsamic roasted beets and eggplant caponata. It all went superbly with the great bread they bring to the table. I don't even like eggplant, but they somehow made it so tasty that even I enjoyed it. For the main I got the sardi- a housemade pasta with butternut squash puree, kale and mushrooms. It was excellent. They have tables for small parties and then they have one long table in the center of the restaurant, good for big groups or just family style seating with strangers. Can't wait to go back again soon."], ["Claro P.", "I adore Rucola! It's my favorite neighborhood spot. I have eaten there many times. Occasionally there's a flaky waiter but overall the staff is really nice - especially the maitre d' who I think may be one of the owners? Not sure. The drinks are delicious and there's always a new and wonderful seasonal cocktail to try. The charcuterie is  great - especially the speck, I also like the grilled octopus, roast chicken, pork loin, homemade pastas. YUM. Great Italian-y dishes. Oh and brunch is good too. The place is small, so the tables are close together and there's a big communal table in the middle of the room. If you want lots of elbow room, this is probably not the place for you."], ["Rahul S.", "Venturing out to Brooklyn last week, my wife and I decided to go to Rucola. Upon arriving, we were told that the wait for a table was an hour and a half. Reluctantly we put our name in and went to a near by bar to grab a drink. After about 45 minutes a table opened up and we happily sat down for our meal. We ordered the meat and cheese plate which was spectacular, my wife ordered a pasta dish which she liked,  and I ordered the dorade for my entree. The dorade was perfect, well seasoned with crispy skin and fresh seasonal vegetables on the side. It was one of the best fish dishes I have had in recent memory. Overall it was a great experience"], ["Shari H.", "My new favorite! Love this place- a neighborhood spot that's becoming a bit of a destination. My favorites: the salads, charcuterie, fantastic wine list and excellent cocktails, and dessert pies all from Brooklyn's Four and Twenty Blackbirds. The service is also above and beyond what I normally experience- I even saw employees walking patrons out to say \"goodnight\" and \"thank you for coming.\""], ["Alejandro A.", "We came to eat and there were no tables taken. The food was good but the staff didn't pay attention at all. We asked for olive oil and never got it and had to wave at them like crazy to get any of the 8 waiters to come and bring the check when we asked for it. Might have caught them at a bad time but the experience was not good."], ["S F.", "I really love this tiny place, I just wish less people felt the same way so I could enjoy it more often! The food is always good- lots of options for vegetarians. But the place is small and can get cramped during busy hours- you are very close to the diners next to you. Still I give it 5 stars because I enjoy myself and eat well each time I go!"]], "PT Restaurant": []}