{"La Goulette": [["Patricia P.", "Heard about this place from a friend. They said it was a little expensive, but I certainly find it more affordable than many places in the area. This time I ordered the falafel sandwich which cost just short of 5$. They have a water dispenser and cups by the front-- easily accessible.As a vegetarian I'm impressed by the options for both vegetarians and meat eaters. There's also a lovely selection of baklava for some sweets.Even though I've usually been here when it's busy, the service is a little slow. The staff is kind and seem to be doing their best, but the wait time even when the place is empty is lengthy and that's why I am only awarding 4 stars. The food however is DELICIOUS! Everything I've tried has been mouth watering good.Location is nice, tucked away from the cacophony of Bedford Ave, and it seems like a place that more locals seem to frequent rather than tourists.Overall a great place to go if your hungry and in the area looking for something a little less pricy,"], ["Fran S.", "Oh my goodness! LOVE this place! I went to this restaurant while visiting New York, and let me tell you...if I lived in Brooklyn, you best believe i'd be a regular here! The owner is super friendly and she truly seems to care about customers. I got a falafel plate and my friend got a pita sandwich with fries. I also got an Americano with milk which was literally the most amazing coffee beverage I've had in the past 4 years...and I LOVE coffee. Let's just say there was little talking and lots of ahhh-ohh ing. Check out my photos and droll :) Absolutely delicious! Best Mediterranean I've had. I actually can't stop thinking about how good this place was!Also, if you're local, this place is perfect to hang out or study with a small group. Has a good amount of outlets and cozy feel to it. I'm jealous of you ;(("], ["Peter D.", "I have a problem:* I want to cut down on my meat intake for various reasons, but...meat is delicious. So when I walk into a new Mediterranean joint, I feel like I should get the falafel...but really I want the shawarma. La Goulette has anticipated this dilemma, and as a result, slapped the Shalafel on their menu. It's exactly what you think it is.This pita full of basically everything was carefully constructed by the friendly guy behind the counter, hugely flavorful, and smashed the spot. I'll do it again next time I'm walking by in need of a massive nearly vegetarian snack._____________*\"Problem? I haven't got a problem. I've got fucking problems. Plural.\" (But for the purposes of this discussion, I'm only focusing on the one.)"], ["Grace P.", "Shared the_ Grilled Chicken Escalope ($12). (Similar to the Halal Guys' chicken platter but this salad is dressed and refreshing.)Decor is nice and simple with Mediterranean blue walls. Seating in the front, side and back. Clean bathroom.Will return for the above / falafels / kale salad."], ["Davide M.", "Ordered several times from there food progressively got worse and so the hygiene-judging from the hair I found in the last  order. Service is unpleasant as well.  Many better options in Williamsburg will welcome your business so why bother with this place?"], ["Ami P.", "Oh my god... I have NEVER had such an amazing falafel until TODAY! I cannot stop raving about this place. I had a veggie plate and it was so beautifully assorted! Yes, presentation means a lot to me and they give such a generous portion for $12. The falafel inside was green!! The tabbouleh, hummus and baba ganoush were SOOO delicious and the pita bread was right out of the oven so it was fresh and crisp and well baked. I'm SO glad I came here on a whim. DEFINITELY COME"], ["Joe B.", "Beautiful, fresh, delicious food. Honestly, this may be the best thing Williamsburg has to offer. (Except Book Thug Nation). Go here, it's too good to miss and worth traveling from afar."], ["Danny D.", "I like this place. Its quality food. Its not bad at all, only reason I didnt give higher score was because food wasnt anything I had not experienced before. The service was good and the price was decent. Everyone should check this place out."], ["Ron L.", "Named after the port of Tunis, the Tunisian capital, I had a fantastic meal from true hard working Tunisian brothers from Brooklyn (Bay Ridge originally). Thank you Karim!! They know how to do it right. Great Tunisian food is hard to find. You can find Mediterranean just about anywhere but to have it done right in a fast but upscale casual setting without seeming cheap?  Very slim.  I ordered lamb merguez. The salad, the lamb sausage and the yellow rice... Amazingly aromatic and flavorful. I finishes the whole plate, and this was after stopping at Crif Dogs barely 10mins earlier! Is that not a testament to just how good it is?I also ordered Turkish Coffee.  A thick amazing coffee that'll sure give you a jolt any time of the day.  The equipment is all behind the counter... You can see them work their magic the whole time. They do a good service to the neighborhood, seriously.  Look them up on Seamless if you're lazy, but do yourself a favor and walk right in.  Service is fast even when they're busy, especially if you're gonna order falafel. Eat it while they're hot!I'll be back!"], ["Margaux C.", "This place is amazing. The food is fresh, tasty and super cheap. I had the Tunisian Carrot Salad: fantastic. The plate was very well presented, colorful and packed with 4 HUGE falafels, super tasty hummus and a delicious carrot salad with red cabbage. I don't post reviews often but this place deserves it. + The staff is super friendly and thoughtful."], ["Rebecca J.", "Great food, great prices, large portions. I must say that I don't know if the chicken shawarma comes from a rotisserie, it tastes sauteed.... Also, I wish they had a  yogurt-free baba ganoush option. It tastes good, but I like to avoid dairy...."], ["Kristina D.", "I came here with a friend for a quick dinner.  La Goulette is a small, casual restaurant.  You order at the counter and find a spot to sit and enjoy.  The staff is extremely friendly and very quick.  I had the falafel over hummus, and my friend had the chicken over hummus.  Both were delicious and very filling.  You get a large amount of food for about 10 dollars and they have a great water pitcher that you can use to refill your own glass.  If you're looking for a casual dining experience and delicious food, this is a great place!"], ["Tiffany W.", "Came here with a friend on a Saturday around noon to try this place out. It was quiet with a lot of space to sit. Definitely liked the ambiance of this place. I got the chicken kabob pita sandwich. It was good, but I wished that it was mixed in a little bit more. If you eat the chicken by itself without the sauces and vegetables you can taste the char on it - which was not great - but the combination all together was pretty good.Their latte was good too - but I've had better. The people are nice with good table service. Overall, I would come back again :)"], ["Jessica D.", "Sweet family run business.  Easy casual  healthy, fresh fast food.   We often do take out but they have ample space to sit in .  And are kid friendly.   Very sweet and accommodating. Great place to order for my visiting family we are all scattered arriving at different times.  Meat eaters and vegetarians.  Easy to order a smorgasbord of items that will please everyone.   The veggies are great,  mixed grill is great,  falafel is great,  fries are cheap and plentiful.   Cauliflower side is yum.  Best of all there is none of the pressure of a more formal environment. Pay up front.  Enjoy the meal.  Easy exit. Love these guys."], ["Lexi O.", "One of my favorite places to eat in Brooklyn! The food is super fresh & the staff is so friendly. Another great part of this restaurant is that it's super affordable. When food is usually this fresh you expect it to be expensive but not here. One of the dishes I love the most is the Kale salad which has the most amazing dressing I've ever had on this planet."], ["Risa H.", "Found this little place because we wanted something quick & cheap - and I will definitely be coming back for more!  We both ordered pita sandwiches - the chicken shawarma ($7) and falafel ($4).  They were both stuffed with chicken/falafel and veggies, and it was probably one of the best I've had in months.  We chatted with the owner on the way out and he gave us some babaghanoush and hummus to try.  I live near the Kabob Shack, but will be waking the extra 10 minutes to come and eat here when I'm craving their food (it seems a little bit more healthy than Kabob Shack)."], ["Michael R.", "Very, very impressive. Authentic Middle Eastern food, incredible prices for what you get and a really cool place!Don't expect to get served at your table, this is more 'Fast Food' style, but it works flawlessly."], ["Jessica C.", "I've been in love with this place since it opened! And lucky for me it is on my way home;)The decor and comfort of the dining room is exceptional, and the food is Fresh and Delicious.I'm hooked on the Tunisian Veggie Plate... Tunisian carrot salad with capers, homemade hummus, and falafel... GF and vegetarian :)Fast Delivery too!"], ["Anna L.", "Friendly staff, great food, close to the L stop. What more can you ask for? Seems family-owned. They have my favorite combination of mediterranean food: rice, chicken shawarma and babaghanoush. AND they serve shawarma on TOP of the babaghanoush.  Mind blown. Falafel is decent - super hot out of the kitchen and very crispy. We also got the special fries - pretty good, kinda expensive to me for what you get. Portions are huge if you get the platter. I'll probably get that next time and get babaghanoush on the side. Lots of seating space. Clean bathroom."], ["Svetlana Y.", "BEST KALE AVOCADO SALAD!!!!! Great, friendly staff, delicious food, favorite neighborhood spot"]], "Darna Falafel": [], "Olea": [["Sue N.", "Wish I could give this 10 stars!!THE most delicious fresh flavorful food I have had!! Charles really took care of us!! The food came fast and furious and we ended with his favorite almond tart!The hot apple cider was a huge hit, perfect for my sneezing and slightly grouchy husband...it perked him right up!!This is my daughters favorite neighbor restaurant! I can see why."], ["Shima S.", "Lovely place , the food is very refreshing and  delicious Atmosphere really feels like a escape from the hustle and bustle of Brooklyn  Been here twice and both times the service was very good!"], ["Chey H.", "Olea knows how the brunch game works--offer lots of options, have decent priced drinks, don't rush your diners, and serve great food. A friend and I were told the wait was 40 minutes on a Saturday after putting our name down, but we waited a little less than that. Service was warm and prompt and never pushy. I had the scrambled eggs Greek style and my friend the Green Eggs and Lamb. Our portions were large (another plus in terms of brunch points) and we had no issue cleaning our plates. Tip: ask for a side of aioli and drip the home fries in it--yum. The eggs were cooked well and the filling wasn't overwhelming and blended in nicely. Didn't get a bloody mary but our neighbor's looked hearty.The decor is super cozy--you really do feel like you're in someone's eclectic living room. If you're lucky to sit along the windows, enjoy those pillows."], ["Marthy S.", "Did I walk into someone's house by mistake?  Love love love the homey decor and ambiance!  I even feel the need to comment on their beautifully decorated bathroom!  They really don't skimp on attention to detail when it comes to decor!  And as much as I wanted to give this place more star power, I found that most of the food and the service was just average.The Good: - Brioche French Toast - I believe that if you're a place who can bang out a solid, simple french toast, the brunch crowd will flock and Olea knows how to do just that. - Fried Olives - yet another super simple dish Olea really knocks out of the park. So savory with each piece of olive with the creamy tzatziki to play down the saltiness and the spicy harissa to cut the fried shell. It's a dish that solidifies the phrase, \"everything is better fried!\"The Average (basically everything else we had):Turkish Breakfast - a good amount of food on the plate for the price but flavor was lacking in the eggs and eggplant.  Same goes for the French Omelette.  There was a lack of seasoning in the dish and a lack of filling.  A bit disappointed.The Green Eggs with Lamb  - eggs were mediocre and under seasoned and the lamb sausage was nothing spectacular to report either.  Drinks/Dessert:The bartender was so proud of their award-winning bloody mary so of course I had to see what that was all about!  Unfortunately, I felt that it their mix was too watered down, which got more watered down with the ice - not a bloody mary to my liking.  Their red sangria is stellar though!  I highly recommend this if you're here for boozy brunchin'!For dessert, If there's creme brulee on the menu, you know I gotta try it!  This fell a bit short too.  It wasn't terrible, however the top was a bit too \"brulee-ed\".  Once you get past that, the creaminess underneath was just alright. To comment on the service, as they got progressively busier, the service also declined which was a downer.  Probably won't be back here for brunch, maaaaaybe for a try at their dinner menu though."], ["Pamela M.", "Today I was in the mood for Mediterranean food and decided to go to Olea. Typically I go to Miriams on 5th avenue which I absolutely love but decided to give this beauty a whirl.The wait for a table was less than ten minutes which was pleasing. There was a bit of a wait time to place an order but nothing to cry about. I ordered the Turkish breakfast and my husband had the green eggs with lamb sausage. We then had to wait for a while for the food.We ordered a coffee and a tea; items which were not listed on the menu so it wasn't clear if they came with the meal. My tea was luke warm at best, yuck! My husband's coffee was too strong. We sat with empty cups waiting for well over ten minutes before we were asked if we wanted a refill....The food it's self was flavorful and worth the wait. I particularly enjoyed the eggs and eggplant. However, the portion was not that generous for the price.... Perhaps more eggs or another piece of pita could be included considering that the coffee and tea are not complimentary with the meal; they are $3.50.I am not sure if I will return, it wasn't horrible but at three stars there are so many other places to try. In addition I like brunch spots with an all inclusive offer."], ["Daniel B.", "I came here for lunch on a sunny day--the ambiance was airy and bright with sunshine, and the decor was heavy on wood and colored tile.  Olea is kind of a chill, boho Mediterranean taverna.A few highlights:- The hearty split-pea vegetable soup was REMARKABLE.  In all caps, yes.  Topped with crisped garlic and a dollop of beet foam that sounded a little weird but worked in perfect complement to the rest, this was among the best soups I've had in recent memory.  The waiter noted the soups here, hot and cold, are all strong.- The service was exceptional.  Yes, they got my order wrong--I asked for Turkish breakfast and got a Tuna sandwich--but they offered to comp what I got and bring me the other dish. I didn't want to waste food so I just took the sandwich, which looked great, and they comped it.  This wasn't expected or necessary, but I appreciated it.Friends of mine live nearby and it's one their favorites."], ["Philip S.", "Sunday night dinner. We got a table for 3 right away. Lots of small plates. I recommend the artichoke hearts and olives. the vegetarian paella  was unique; served in a cast iron skillet. the red sangria was a bit bland. But all around a good meal and reasonable prices. Excellent service."], ["erica g.", "Absolutely loved this place. Didn't give it five stars because parking was horrible (which I get it, it's Clinton Hill/Fort Greene) and the bench could've been a little bit more comfortable. However, service was wonderful, food was GREAT (and massive) and they sat me right away. I got there first from a table of 8 and asked the waiter for a drink that doesn't look like alcohol because it was a business meeting, he completely hit the nail on the head with the spiked lemonade and even got me a refill without letting the beans spill! I will definitely be back!"], ["Amanda B.", "Olea is one of my favorite spots in Fort Greene for brunch, lunch, happy hour, or dinner.  It's a tiny spot with a bar space and tables inside and on the patio (weather permitting).  The food is mostly mediterranean inspired and consistently delicious and fresh.  Some of our favorites include the appetizer pitas with various dips (spicy feta, romesco, tzatziki), mixed green and lentil salad, and the lamb sandwich with the potatoes.  The owner is very sweet and a visible presence in the restaurant.  It's a great place to go on a date, as well as to meet up with friends for happy hour.  I've seen numerous (well-behaved!) children at the bar with their parents during happy hours so it seems to be kid-friendly as well!Tips:Olea is one block from Saturday's Brooklyn flea market so is a good place to grab a bite or drink before or after you explore that!$5 sangria (white or red) during happy hour (M-F, 4-7 PM) is a must-try.It can get crowded very easily during weekend dinner and brunch times...plan to get there on the early side or to have a bit of a wait!A gift card to Olea is a good last-minute gift for anyone that lives in the neighborhood...you can buy them online or at the bar."], ["Anum A.", "Found this spot while roaming about trying to find a good place to satisfy my hunger pains for lunch. Walked inside and immediately fell in love with the ambiance. The colors they have chosen set a warm tone, making guests feel at home. Now, for the food.The patatas bravas- WOW. The sauce which is drizzled on top of the potatoes is spicy and just delicious. I had the chicken club sandwich sin bacon and my friend had the lamb meatball sandwich. My chicken sandwich was just DIVINE on brioche toast. My friend's lamb sandwich had a slight Italian fusion to it, made with yummy tomato/cheese sauce.The service was a 10/10. Our waitress served us in a very timely manner, even though the restaurant was closing soon for a private event.Last but not least, lets talk about the bathroom. The cutest bathroom in all of BK, hands down. Eclectic times 12. All in all- a MUST TRY. Please, for your own sake.Looking forward to trying their brunch and dinner menus."], ["Cassidy P.", "Came here with a friend on a Saturday morning and only had a very short wait (15 minutes). I ordered the French omelette (goat cheese, smoked salmon, leeks) and my friend ordered the lamb hash ($18). The omelette came with salad, potatoes, and sliced baguette. The lamb hash was huge. We were both very satisfied with our meals and the attentiveness of the waiter was amazing. Great place, will be back."], ["Kay Ashley M.", "Olea is such a great brunch spot. I immediately admired the decor and how it matches with the surrounding brownstones and nature, with a Mediterranean feel. Our waitress was immediately welcoming and friendly and her service was on point throughout the entire brunch.The prices were reasonable and the food was very filling and delicious. I loved the small details such as the raspberry preserves packets in the glass jars. The pomegranate lemonade drink was good but very sour. We tried the pomegranate lemonade drink spiked with tequila but it was not as strong, possibly because the sourness overpowered the liquor.The drink menu was impressive for a brunch spot, but a little pricey. Hopefully next time we can try more of their drinks. We ordered the green eggs and lamb and Parmesan toast; both dishes were very yummy and great in presentation."], ["James T.", "Had business lunch here at Olea. We order the white anchovies with almonds and arugula, the 3 choice deep and the cauliflower gratin. The food was ok it's nothing special, I was expecting a wow.,the place is always busy so I though will be great. The service was horrible, we had to ask to refill water all the time, they were 2 servers on the floor running in both directions the management should hire extra staff for sure, we had to wait even for the check and for them to swipe our cards and the servers didn't had time to be polite they were always in a rush."], ["Jason D.", "I love this place, the food, atmosphere, and the drinks are great!"], ["A U.", "Cute neighborhood restaurant. Amazing squid ink paella and fresh kale salad. Ambience is nice and lay back. Would definitely come back and try more!"], ["Raven C.", "I wanted to love this place so much, I really did! I'm new to the area, researched the spots to eat in the area, and this one stood out for Mediterranean. Alas, the food left me wanting more.Went here for dinner with a guy friend- we were seated immediately. Really loved the vibe, the ambience, the decor, the lighting, all of it.. really set a cozy, chill mood. The waiter was very attentive and dealt super super nicely and patiently with our indecision when it came to ordering drinks and tapas. I ended up just drinking red wine, my friend had margaritas. Both were fine, and the wine was about $8/9 a glass I believe.That's probably the best part- the drinks, the ambience, the venue, etc.The food :( I don't know if I ordered the wrong things... I really must have, even though I ordered things folks were highly suggesting #OnHere. I uploaded pictures of what I had (presentation was lovely too) but the flavors were just.... blah! EXCEPT for the fried oyster slider things, which came in a pair, they were so tiny you finished them in 2 bites. They had a delicious slaw and a yummy bun, and the oyster was fried perfectly. We started our meal with this, and it seemed like all was going to be amazing.... but then, it wasn't after that. The falafel crusted artichokes were just.. not it. Way too much falafel, no texture, no exciting flavors, the dip was blah, just.. don't order it. It's a waste of space in your belly. Second round, we ordered lamb meatballs and the poutine. The meatballs came in a red marinara of sorts sauce, with another sauce over it. Everything again was bland and without a good texture- the meatballs were just very dense, dry, and not flavorful. The poutine could also have benefited from a better dressing of the other ingredients besides the fries- the duck bits were very crispy and dry. I wouldn't order any of these items again, aside from the oyster sliders. For desert, we ordered the special, which was an ice cream sundae of sorts. This was pretty delicious, and was the saving grace after a meal of disappointments.I would honestly go back again to try other items on this menu, because I loved the service and the space, just think I ordered wrong... if anyone has any suggestions, I'd love to hear them!!"], ["Mandy L.", "Came here for a late lunch with some friends.Pros:- Love the decor - very hygge - A heavenly smell hits you as you enter the door and makes you hungry for food Cons:- Waited close to 45 min for food - since the place was so small I figured we get our food faster. However, the most upsetting part was that people who came in after us got their food before us. - Ordered the Turkish Breakfast and some parts of the dish was great such as the eggplants and scrambled eggs but everything else lacks flavor - was disappointed especially reading the previous yelp reviews"], ["Olga D.", "Just unbelievably good food. Every single dish that we tried had like 17 different complex flavors that were somehow perfectly balanced together. And so did the wine! I don't trust Organic wines to not have a weird aftertaste, but this Moroccan Syrah was like my dream of what red wine should taste like. For dessert, we had the waiter's recommendation - I think it was a pear tart? And then I died of taste bud happiness."], ["Jessica W.", "I'm giving three stars for the food and 1 star for the service. The service was god awful, after a long day it was disappointing to feel as though we were inconveniencing the waiter by being there . This place is really small, and the tables are spaced very closely together so you better hope your neighbors are having an interesting conversation. I ordered a skim latte, but they don't have skim milk..so instead I opted for a diet coke. Our server was Brett, he was too busy chatting with a woman sitting at the bar near the door.. To pay any attention to empty glasses, missing silverware and to bring us the check once we asked for it.I ordered the hanger steak sandwich, with potatoes and a salad. The potatoes were friend but good, salad was average, my steak was salty, way overcooked (well done/med when I asked for it med rare ) not an ounce of pink to be seen in the meat! I'm pretty sure it was 17 dollars and it was filled with gristle... How unappealing!!My mom had the cilantro eggs with potatoes, pita and roasted veggies. She was fairly happy with-the dish.  But also appalled at the service.  We had to ask twice for the check, ask for water refills , and diet coke refills, and more napkins... Maybe we could find a better time to come that doesn't inconvenience him. Needless to say, I won't be returning !"], ["Molly P.", "I'm not sure about all the five star reviews on this place.  Maybe my error was going for dinner instead of brunch.  However, after my experience I can't say I'm very inclined to go back at all.  Let's start with the positives, shall we?  This place is adorable.  The interior is very homey and there are tables outside as well which is perfect for a warmer evening.  The staff was attentive and service was fast paced but not rushed.  The house white wine was lovely, particularly at the price point.  Sadly the food left much to be desired.  We ordered the bacon wrapped dates, the croquettes, and the patatas bravas.  I honestly wouldn't recommend any of them.  The dates were passable with good flavor but the bacon was fatty and chewy.  The patatas were undercooked and some of the potato was starchy.  The croquettes were huge which meant you were essentially just eating lukewarm goat cheese.  I would give this one a pass- but perhaps with brunch you would fare better."]], "Mazzat": [["Ginny F.", "Whenever I visit family and friends in Brooklyn, I make sure I stop by Mazzat for an authentic Mediterranean meal.  The falafel is the best, the service is friendly & welcoming.  Looking forward to my next visit in February!"], ["David W.", "I was really tired one day after a grueling appointment schedule when i encountered Mazzat on Columbia street in Brooklyn, NY.  This place is a NYC hideaway secret to some incredible food prepared I found out by Owner Jimmy Bakhoun. Absolutely some of the best Mediterranean dishes I have ever eaten, combined with a delightful decor experience I probably had the best meal in many a day...Since my first encounter here...i have been back many times..You will not be disappointed with the atmosphere  and truly pleased with the meal....Thanks Jimmy....made my day!!"], ["Keiarra L.", "I've walked, drove pass this place so many times because it is near my job. So lately I've been on a Mediterranean cuisine frenzy so I thought to give this one a try also. I went to get lunch here at about 5pm maybe. It was totally empty. Nice interior, dim light and a bar but empty. I ordered the chicken kebab wrap in a whole wheat wrap with hummus with a side if salad. The wrap wasn't bad at all. It was an okay lunch meal. But I honestly expected way more. It kind of lacked a variety of flavor. I mostly tasted chicken, a little hummus and the wrap though there were other foods in it. There wasn't any spark for me like other places I've tried. (Other places you got to choose what you wanted in your wrap, not here I guess because it's \"restaurant setting\"). The salad was just lettuce and spinach leaves lightly coated in some random dressing. This definitely didn't do it for me. It was like eating wet leaves and grass. Overall, for the moment of being hungry that day I just ate the food because I was hungry and already paid 11 bucks for it. But I doubt if return here for lunch when I'm at work. Not worth my flavor craving taste buds...and money."], ["marina m.", "Husband and I passed by and stopped by very nice bartender. She was very attentive and friendly. The food was ok. Small portions with ok prices."], ["Katharine D.", "Great food! Love the falafel wrap, hummus platter and the banana dessert.  Really good food.  Also nice atmosphere for casual dining.  I enjoy the sangria.  One of my favorite neighborhood spots"], ["Lena D.", "An adorable place that I found by total chance. Everything that we have ordered was fresh and delicious :)"], ["J R.", "After researching several Brooklyn venues and caterers I fortunately contacted Gamal, the owner chef of Mazzat in Brooklyn.  I questioned him about hosting our son's wedding rehearsal dinner at his restaurant last week and found him accommodating and excellent to work with.  Gamal closed his restaurant for our party of approximately 60 and prepared our selection of Middle Eastern dishes that wowed guests who were familiar with Middle Eastern food and those who were \"newbies.\" The staff was efficient and friendly and the server/manager, Lynnette, was a wonderful \"go-to\" during the dinner. Throughout the evening, our guests raved about the menu that he worked with us to put together: bacon wrapped dates, chicken \"cigars\", feta & olives and falafel appetizers during the cocktail hour.  The appetizers of hummus, baba ganoush and tabouli salad were served family style, and a buffet of chicken, salmon, fettucine & garlic shrimp, lemon potatoes, rice and fatouche salad were plentiful and cooked to perfection. Gamal's  dessert offerings of chocolate cake was a rich torte-like hit and his baklava moist and buttery.  Gamal's portions were generous and prices were great.I absolutely recommend Mazzat as a wonderful site for rehearsal dinners, or parties of any type.  The restaurant/bar has a beautiful old brick interior that has apparently been used as a \"bistro\" site in the TV series \"The Amerikans\".  Obviously it is also just a great spot for anyone looking for a tasty dinner with a full bar.  I have eaten at many Middle Eastern restaurants over the years (as have many of my guests), but none have compared to Mazzats."], ["Olivia L.", "Really tasty authentic food, a little on the pricey side for what you get. Their falafel sandwich for $4 at lunchtime however is Delish and good value."], ["Brian M.", "Mazzat offers a lot, including delivery, which is perhaps why it's often empty. Like, completely empty sometimes. But, USE THIS to your advantage, people! There's been more than a few times where I've walked in with parties of 4, 5, (and on one very \"aren't I Mr. Popular\" evening) 9 people on a weekend night, and was seated with no problem. Not sure if Mazzat is a well-kept secret, or just considered too out of the way since it's over the BQE, but I can confidently recommend everything on the menu.Major Menu Standouts: Dates wrapped in bacon.Garlic Lemon Potatoes.Chicken Cigars.Chicken KabobFrench FriesGrilled Chicken Dinnerand THE BEST BURGER in Carroll Gardens, in my humble opinion. \"The Mazzat Burger\" is a GIANT. Huge burger, double cheese, mushrooms, bacon. Indulgence on a bun. GET IT.So, and I know this goes against everything you believe in, even though it will be empty when you're walking by ... just go in, and enjoy some of the best food in the 'hood. Live a little."], ["Sean S.", "On a recent Brooklyn culinary adventure, I lassoed my lovely companion to the land of the Red Hook.  By way of the F train we stopped off at Bergen street, then after turning ourselves in place three times clockwise and three times counterclockwise, we oriented and moved off in the direction of no mans land.Walking through the gorgeous streets of Cobble Hill, I pointed out some lovely architecture, carriage houses, and quiet treelined streets.  She seemed to notice that the windows had no blinds, and was eagle eyed for naked derrieres.  I can only guess what kind of subconscious urges drive this lovely mind.Crossing the Gowanus Expressway, we spot a super cute pooch who is wagging his tail like crazy.  He obviously knows who is coming his way, and we stop for a little pet.  Now in the homestretch of our walking, we reach Columbia Street, and walk up to Pok Pok.  Peering in the window, we realize it's closed, and that means it's time for Plan B!Heading further up the street I point out Alma, but knowing that we're steering clear of Mexican, we head across the street to the Yelp beloved Mazzat, for some middle eastern tapas.  When the *average* yelp review is five stars, we know we're in for a serious treat.  The place is cute, and quiet, and the bartender & host offers us any table we'd like.  Towards the back there is a large olive tree in the middle of the room, it's branches extended towards the skylight, and we grab a corner table behind, and settle in.As the appointed master of ceremonies, I make the choice of dishes. Drawing from a wide sample of Mediterranean samples, I pick Hummus to start with.  This should set the needle as it is the benchmark of taste across the middle east.  Wars are fought, and peace resolved by the taste of the Hummus!  Next I pick Mousakaah though without revealing it's ingredients, Tabouli and Fattoush Salads.The food comes out dish by dish, and I gaze hungrily at each while my lady friend looks aghast and in fear at each unnamable concoction.  So I just push some items onto her plate, without telling of what or where they come.  The food is excellent.  It all comes with various kinds of bread from your basic pita to a very thin wrap type, and also some pita chips.  The eating continues, on and on as if it's never ending.  We both agree it's quite delicious, though my friendly purveyor of taste decides the pillows are tacky!  LOLAll in all a great plan B choice, and an excellent start to the Red Hook adventure that is Tuesday night!"], ["Allegra L.", "Mazzat is just ok. It's pretty expensive, and the chorizo was tough and chewy. I've only ordered delivery, so it might be better dining in, but I don't think we will be taking the chance. However, the bacon wrapped dates are very good!"], ["Cody C.", "Went with a big group for an engagement party celebration and ordered bottles of wine and just about every tapa/appetizer on the menu... in multiples... and there really wasn't one item that I didn't like.  Place was a bit empty (not sure why with such great ratings and location) and service was excellent. Favorites included the dates, Merguez, Vegetarian Middle Eastern Platter and the kebabs.  Great wine selection as well."], ["Marie S.", "The real deal!! Unpretentious, simple, authentic, very reasonably priced - by far the BEST middle-eastern food on the quality/price ratio in this part of Brooklyn ! Bravo and thank you!"], ["Rick E.", "Just a great neighborhood place with great food, atmosphere  and service. My family in Brooklyn did take out frequently, but after our last eat-in dinner, this has definitely becomes destination spot."], ["Gabriel E.", "I never write reviews, but I needed to write this one. The food was exceptional, and a great value. The service was friendly and attentive without being intrusive or overbearing. The overall experience was delightful and I want this restaurant to see the extra business it merits. I will be coming back.A friend joined me for drinks and dinner. We started off with some of the best hummus and falafel that I can recall. We shared a salad which was tasty, and would have stood on its own at another restaurant, but was completely overshadowed by the other offerings. I had a chicken dish which was delicious, and I got extra tahini sauce and drizzled it over the whole thing. Sorry, but I can't remember the specific name on the menu. My friend had the salmon (with some sort of cilantro sauce I think) and, to my surprise it was even better. I'll remember to order that the next time through. Whatever you try, it will probably be delicious. It's certainly cheaper and better than the majority of the places I've tried in the last two months."], ["Polly H.", "I found the waitress friendly. I ordered the feta salad which was great.  It came with bread and pita chips.  The pita chips were crunchy and garlicky.  I was pleased. In addition,  I found my platter of seafood tagine amazing.  The flavors pop in your mouth.  There were pieces of salmon, scallop, and shrimps inside my dish. It came with rice which was great with the sauce of the tagine.  Yum!"], ["Amador A.", "I like it here the atmosphere is homey, waitress was very attentive and friendly and the food was excellent. Its located on a pretty cool street in Red Hook not too far from the BQE. Coming here on a Friday night I thought it would be a whole lot busier but it wasn't, it was just a few people at the bar and my girlfriend and I having some great dinner. For an appetizer I had the sauteed garlic shrimp and the kibbeh and what made these appetizers good besides the actual food itself is the sauces it came with. The kibbeh had your typical yogurt sauce but there was something about it that made it taste different from the others and the Garlic Shrimp came with very good garlic and oil sauce. All went well with the free pita bread that came with the meal. Dinner I had the lamb shank and the description on the menu did not fail when it said that the meat will fall right off of the bone. As a side it came with basmiti rice which was moist and flavorful. All meals came in good portion and was freshly cooked. The chef actually brought out some of the food himself. I really like it here and would come back if ever around the area again."], ["Philip S.", "Dinner of small plates here on 20 November. Everything was tasty. I especially liked the warm feta dip. Good prices on wine list. Found the restaurant by chance after being told it would take a century to be seated at PokPok down the street."], ["Z A.", "Not honoring the paypal offer"], ["Reina B.", "Always great lamb shank, always great ambiance, always great service. One of my faves."]], "Dar 525": [["Caroline S.", "This place is pretty much always empty, so I have avoided it for some time. But tonight me and my husband went here for dinner and it was so good. We had falafel and it is by far the best I have had in the city. Woooaaaahhhhh. Can't speak for the rest of the menu but falafel sure is good."], ["Ashley L.", "I have been ordering from here on Seamless about once a week for the past 2 years. The hummus and garlic bread are to die for. The chicken soup and salads are amazing too. The restaurant itself has a great atmosphere and customer service. A hidden treasure!"], ["Natalie K.", "Note: this is my experiences ordering off of Seamless.I order from here at least 4xs a week and I have to tell my fellow Yelpers that Dar 525 is the best Mediterranean food I've had in NYC by a very long shot. The chicken shawarma and the lamb kebabs are to die for. My mouth is watering just thinking about it!The delivery time is always less than what they predict and the food is fresh. Thank you Dar for being reliable and dependable... Not to sound like a desperate girlfriend or anything, but please... Never leave me. I don't know what I'd do without you."], ["Tamar K.", "Dar is a delightful restaurant with scrumptious food and a great atmosphere. They have ample options for vegetarians, and the best falafel platter in Brooklyn!"], ["Martin G.", "This is probably the place I order from most often. Such a good value. The hummus tastes really home made and fresh, I always order a big one to keep around the house so I don't have to get store- bought hummus. The chicken soup total blew my mind recently, very aromatic with herbs and lemon. But the falafel platter is totally my staple. This place is a neighborhood favorite for sure."], ["MC L.", "Dar is really the only place I go for Mediterranean in Brooklyn. I have had takeout and dinner in many times and must try the brunch. The food here is delicious very flavorful and not over priced. The hummus and baba ganoush, kabobs and falafel all ...always perfect, even the Pita bread fresh and hot from the oven is so good. It has concerned me that the place never seems full as I would be quite upset if they don't stick around a long time but I think they do heavy delivery business.  Also the bar is great with very nice bartenders and I always love the music."], ["Neil R.", "My goodness I have no complaints, only compliments!  Came here for lunch not sure what to expect.  Voila - everything was awesome.  Ordered the $8 chicken kabob platter - wow for that price (or any price for that matter) - it was great.  The portiions were very generous as you may be able to see from the picture.  From the chicken being cooked virtually perfect to the baba and hummus.   Even the rice was tangy and the salad was a great complement.   And then, of course, is the pita.  Its unique in my view and quite amazing.  It kind if looks like a naan and has a light consistency.   The service was good and so is the interior.  They have a happy hour that seems pretty legit but did not partake.   I would be curious about the falafel as I have found many places that cannot cook that right.  That is for another day."], ["Romena G.", "Love this spot! Food is amazing, service is great and very attentive. You will not be disappointed!!!"], ["Michael P.", "the traditional syrian fare is hot shit, real deal delicious. I keep coming back for the couscous. tajine is damn good too. never done the pizza that seems stupid. why get the pizza? gimmicky."], ["Josh S.", "I went through a phase where I was ordering from this place once a week. I'm not sure it is the perfect restaurant in all honesty. The falafel is pretty good but not amazing. I'd say the same about the chicken and lamb kabobs (although the hummus/baba ghanoush and side salad that comes with the platters are awesome). The reason they're getting my first 5 star rating though is because of the chicken soup...it's perfect. Lemony and spicy, it's everything I want from a soup. I don't order from Dar unless I'm getting the soup. The pizzas are also really, really good. So you can't really go wrong with this place. Delivery is consistently fast and food is always fresh. These people should be proud of themselves."], ["Christy S.", "I've eaten here several times (in person and ordering online) and the food has always been tasty. Recently ordered the Chicken Kabab lunch special for $8... Good deal! I was worried the lunch specials might be smaller with the reduced price but it was enough for 2 meals. The only negative is that they should've given 2 pitas since I had a separate order of tapas, but only gave 1.My only other complaint is that while they've been delicious every time I've gotten them, the Tagine and Chicken Couscous both lacked a good amount of chicken and were overall kind of small for $12-13."], ["Ashley F.", "Love this spot on Grand Street! Dar is so damn delicious, and at a great price. You can snag one of their platter lunch specials for $8. I love the falafel platter, with which you get hummus, babaganoush, rice, salad, and pita. Everything tastes fresh and I love the side sauces that come along with it. Mmm. sauces.Just beware, I asked if they offered gluten free pita, to which the server looked confused and slowly said...uh, yeah. Then my pita came out looking exactly like the non GF pita. So...uh yeah, not sure about that one, and I didn't try to find out. Pita or no pita, the platter was still delicious."], ["Sadie W.", "I love the 5 salad plate! I usually get two orders of the Labne because it's the best!They are very accommodating and will listen to what you need and try to meet those needs. I called super close to their closing time and they still delivered in 15 mins! Thanks!!"], ["Lizi C.", "To start we ordered the assorted appetizer with various dips and hot bread.  Every dip on that dish was excellent. I'm not sure what some of them were, but everything was super tasty and savory.We also ordered the meat combo kabobs and an individual \"seafood\" shrimp and calamari pizza since various Yelpers seemed to be raving about the \"seafood pizza.\"The kabobs were good.  Flavorful and cooked appropriately.  It came on a delicious bed of greasy rice, side salad and also had a side of babaganoush and hummus with bread.  If I stopped here I would have given this restaurant 4 stars.However, the seafood pizza was a culinary disaster.  When it arrived on the table the shrimps looked nearly translucent and raw surrounded by a mess of melted cheese.  We sent it back to be cooked more because we didn't feel safe eating it.  The pizza came back and the shrimp were cooked, but in the process the pizza had become really soggy and gooey in the center and pizza crust was hard and chewy.  The calamari was also chewy and overcooked at this point.  The tomato \"sauce\" on the pizza was really disappointing it tasted more like thick tomato paste spooned from a can. The cheese on the pizza was also strange it think it was a combination of mozzarella and cheddar which did not go well.  Dinner ended with a nice little blocks of some sort of free dessert which was a nice touch, but by this point the shrimp and calamari pizza had ruined us. The appetizer was excellent, the kabobs were good, the shrimp and calamari pizza should be absolutely avoided at all costs. We won't be coming back.  Order wisely and you'll probably enjoy your meal."], ["Arlie D.", "Wow!  Amazing meal!  Almonds were delicious, pita as well!  Chicken kabob was great!!  Loved the spices and favors!  Couscous was flavorful and rich!  Fresh humus was great!  A definite!!"], ["Hayley N.", "$8 lunch special is BOMB! So much delicious food! Big fan and loved the chicken schwarma platter."], ["Z Z.", "This place is great for both delivery and dining in. I have never been disappointed with anything I've ordered. Big setvingHighly recommend. Also great for big groups as it's never very crowded."], ["Meaghan L.", "My friend and I had brunch on a Sunday afternoon.  The food was good. The menu is quite extensive.  I had an omelet and my friend had a vegetable kebab.  There is an option for unlimited drinks for $24.95The atmosphere was pleasant with exposed white brick. This is a reasonable and tasty spot for Mediterranean food. It was also helpful that there was no line."], ["Alexis R.", "I love Mediterranean cuisine (and can we agree, it's strange to lump together so many admittedly awesome foods into this category?) and Dar has some beautiful food. I stopped in on an off hour with a friend and ordered a mixed plate (\"assorted plate,\"  I was corrected!). There were several excellent standouts: muhamara, which I see infrequently on offer, was amazingly flavorful. The labne was--dare I say--luscious. And if you're a soccer fan, they might have your match on in the front of the restaurant. There was a very boisterous and jovial crowd on the weekend I visited. Will definitely come back soon!"], ["Matt E.", "Dar 525 is a gorgeous space that feels very open and classy while being completely casual. The prices are lower than you would expect for a place that looks like this where prices range from $7-18 (most in the $8-13 range). I got the Safiha ($11) which is a traditional pizza with ground lamb, beef, tomato, parsley, onion, spices, and a hint of pomegranate molasses. I've had the same dish from 4 different places, always called something different and it always tastes slightly different. This was my second favorite right after the Bedouin Tent Restaurant in Boreum Hill. It could have used a bit more seasoning but I won't complain much because it was delicious and a great deal. There are reviews that mention it's BYOB but it's not any more. They do have great prices on drinks though, especially if you take advantage of 20% bottles of wine with dinner (any day except Friday and Saturday) or 12-7pm happy hour with $3 draft beers and $4 glasses of wine."], ["John L.", "I stumbled upon this place with my friend last weekend, it I must say, fate was kind that day.  We were sick of waiting in line for another brunch, so we checked this place out instead.  There was no wait, an unlimited drinks deal, and an awesome ambiance.  It felt like we were eating in some kind of bazaar.The food took a bit of time to reach the table, but the taste more than made up for it.  We split the Breakfast Pizza and the Herbed Eggs.  Both entrees were incredibly flavorful and unique.  Both of us were talking about the meal for the rest of the weekend!  For a relaxed, quiet, fantastic meal, definitely keep this place on your radar."], ["Kohinoor M.", "The flat meat pizza was pretty good - 1st place among the rest of the food on the table.Humus and baba ganoush were a tad bit too sweet for my taste.Lamb kebabs were alright, a bit too chewy.Interior decor was nice, there's lots of space; could be made cozier.. Or maybe it felt like so since it was practically empty when we went in there.Staff was very nice and attentive."], ["Alejandro B.", "Generous (hey, who am I kidding) enormous portions of delicious food for a great price. A sample platter here, showcasing 5 appetizers, goes for $11-- wow. Anyplace that has a solid mouhamara is already awesome in my book. Add some fresh pita bread that's as big as your head, right out the oven, holding in steam like a baloon, and you've a solid deal. The outdoor section was great for people watching and playing that ubiquoutos game of \"Spot the Hipster\" (double points for me: I saw one on a bike and sporting that mustache that hasn't been popular since the 1840s; I guess hipsters really are old school).Anyways... the calzone was also huge but it was amazingly crunchy. I'll definitely try the pitzas (pizza + pita) next time I'm here, they looked great!Good job Dar 525. You're well worth the trek from Manhattan"], ["Tanya D.", "This place was good, but nothing special. Very empty. But hey, fast service! We split the falafel platter and the chicken wings. Both were quite tasty, no complaints. The three glasses of wine we ordered were actually more expensive than the food, so the meal was definitely reasonably priced. Nice atmosphere and liked the middle eastern music, but kind of weird because other than us there was only one other table with people. It was totally fine, I just somehow feel kind of indifferent towards the place. Had a nice meal there, but beings as it is not in my neighborhood I doubt I'll make a trip back."], ["EJ B.", "My favorite restaurant in the neighborhood, and definitely one of my favorites in New York. Flavorful Mediterranean food at very reasonable prices, and it's even a nice place to just chill at the bar with the staff and watch whatever soccer game is playing on the TV above it. I've never had an issue with the delivery from here, though I prefer to eat at the restaurant when I can. For the life of me, I have no idea why this place isn't packed every night, but there's currently always seats available. I can't stand shouting conversation over dinner,or feeling like I'm sitting in other diners' laps when I go out, but the noise level here is low and there's plenty of space between tables, which makes for a great space for conversation."], ["Elise P.", "AVOID DELIVERY AT ALL COST !!Food arrived in loose and sloppy containers, everything was covered in oily red sauce, really gross... (50 minutes to be delivered by the way...)The starter was made with a can of old beans that have been sitting open for a while and just dumped in a blend sauce.The shawarma's pita bread was soggy ( almost slimy), the chicken itself was terribly salty and tasted rancid : so bad it let us to a non digestible downward spiral.The tajine was, at the best, \"average\", extremely watery though -we thought it was a soup when it came...The $9.00 fattoush salad was just iceberg with old fried pita bread chunks. (Even Mc Donalds have been  better and cheaper!)All that for the modest price of $40.00 !"], ["maria b.", "i believed the previous reviews and decided to order online for my husband and I. Got the lamb and the falafel platter. The delivery was what earned this place the one star I am giving it because it was relatively fast. The food was disgusting. Everything was flavorless, but the lamb was just insulting. It was tough and full if fibers, so bad I had to spit it out and threw the rest away. Not even the dressing in the salad was good! I mean, seriously, who is writing these rave reviews? Not even if you gave me this food for free would dare to eat it again. Eat at your own risk, my dessert after this disaster of a meal was peptobismol, goddamit I want my money back!"], ["Vanessa D.", "The food is delicious. We had the chicken Kabob, chicken couscous, grape leaves, chicken pizza which were equally scrumptious. The service was great and the drinks were refreshing. The prices are fabulous as well as the atmosphere."], ["Abdullah C.", "Mediterranean food done right. Platters are hefty, soups are hearty, bread is baked to order, and the sausage is house made. The dining area offers a unique atmosphere. Service is good and the food meets a reasonable standard of quality and consistency. The restaurant scene in lower Brooklyn is expanding and seems more refined than ever. Keep it up-"], ["Ramy Z.", "Came here for brunch for the first time, and I gotta say, great food, staff, and atmosphere! Also reasonably priced, along with bottomless drinks, so I'm sold. Will definitely come again!"], ["Zac Z.", "One of my favorite restaurants in the neighborhood. Food is very fresh and has a lot of flavor. Reasonable prices, especially for lunch specials, and the restaurant has a nice design. Go for the platters, salads, and soups. Sandwiches are good, but plain since they lack Dar's awesome babaganoush and hummus."], ["Uuu B.", "The first time I went here, it was great. The 2nd time was much less - the lettuce was yellow and they gave me straight tahini rather than tzatziki sauce as described in the menu. I admit that I didn't mention it to the waiter, therefore not giving them a chance to fix it, but the waiter didn't exactly seem very eager to hear about how I felt re the meal...he barely said a word to me the whole time...and never once asked if I needed anything, etc. And the place was practically empty at that time, so it's not like he was super busy, so...??"], ["Kaya W.", "This place is very tasty, the staff is attentive and friendly. I first discovered this place with a couple of lady friends. The staff was very nice to us (even after I'd shown up very late, causing our trio to monopolize our table for about three hours). Since then my boyfriend and I have gotten delivery and take out from Dar. Delivery has been very prompt (under 30 minutes and food was warm!), when we get takeout they always bring us water, and on the chillier nights mint tea. Overall, very nice restaurant. Homey feel, while also offering consistently classy and delicious food. I highly recommend the chicken shwarma wrap. Deeeelish."], ["Tiffany L.", "This is the best middle eastern food I've had in NYC. Our group of 7 headed over on a Sunday after church. It's a mid-size restaurant and completely empty on a Sunday afternoon. Loved the hanging tapestry and decorations in the back restaurant area behind the bar.Everyone in the group ordered either a sandwich (like a giant pita gyro) or a platter (same ingredients as the gyro, but with salad, tabouli, and hummus on the side). They bake their pita to order and you can taste the freshness. Their falafel is also the BEST falafel I've had (outside of Greece!). Super crispy on the outside and spiced perfectly. The falafel sandwich is also HUGE and only $5! The platter is also a steal at only $8. This is probably the best value on the menu. Hubby also tried the sausage and my friend had the chicken kabobs. Props to their talented chef for making such a juicy chicken kabob! Great restaurant, highly recommend!"], ["Helen M.", "Triple thumbs up for this middle eastern food. Everything came out nice fresh and hot. Amazing experience. The waiter (james) was a sweetheart the owner gave us free desserts and a complimentary bottle of wine bc I was a friend of friend. You must order the shrimp and camri pizza was a OMG moment.  It was superb amazing.  A must try. The chicken was just perfect as well. It wasn't oily it was deep fried first and then baked. You didn't need the sauce it was just right.  If you love I mean really LOVE garlic.  You have to try the garlic bread that looks like a pizza. And they are very generous on the garlic drizzle with olive oil and parsley.  In heaven.  The portion of the food is just perfect.  Pita bread amazing as well wasn't dry like other places.  Free wifiI could list everything what we ordered but I rather not.  You have to go check it out yourself and have that amazing experience.  The music was great.  Wasn't to loud but it wasn't to low as well. We're able to hear each other and still enjoy the music.  Will definitely come back and plan an party there."], ["Chloe' S.", "I cannot recommend this place highly enough.$25 for unlimited, non-stingy drinks and not to mention delicious and authentic Middle Eastern food = best boozy brunch ever.Go for the bellinis, not the sangria.If you get shakshuka, you'll get pita with homemade hummus done right: creamy, warm, oil in its valleys.I got Meditteranean breakfast, a little tour of the cuisine: two eggs; hash browns with peppers, well seasoned; generous portion of labne (sour cream-ish yogurt delicious on bread, potatoes, or by itself); and shepherd's salad (tomatoes, cukes, feta all diced). AAAAND, huge zaatar bread- also great with labne.On a Saturday morning it was calm and service was great. I have not had Middle Eastern food this good since I was IN the Middle East."], ["Lauren T.", "Very interestingly decorated, all in a good way. The food is good, and prices are great. I had the chicken kabob platter which had a little bit of everything. The pita bread is pretty amazing.They also give you free cornbread at the end, drizzled with honey. That made me very happy.Only issue is my friend and I wanted separate checks since mine was technically a work lunch. The server made up some weird story, saying he could not do it even though the checks are hand written. Both of us work in the industry, so we really can't be fooled with stuff like that.He was still very nice though, but don't ruin it with something silly like that!"], ["Mere T.", "Been for brunch, sat outside. Their coffee alone makes me want to go back. Good service. More hummus."], ["Amanda L.", "So, I did enjoy this place, but it seems like every other Mediterranean place. Fortunately, my family, boyfriend and myself went on a Sunday evening and got served right away (we were almost the only people there). My family had no complaints, they seemed to enjoy the food. I did like my food, but I probably should have asked them to take out the tomatoes. I don't think there was anything wrong with them, I just really don't like tomatoes. Anyway, like I said, the food was generally good; I just wasn't \"wowed\". My boyfriend said it was because I didn't have a meat dish, but whatever. If it's of any help, apparently the lamb is superb."], ["Grégoire B.", "Ordered for delivery once and can't wait to do it again. We got some lamb pieces, salad, 4 huge pita breads, one hummus, one tahini and one amazing stuffed aubergines. We not only had too much to eat  and saved some for the next day, but everything was also very tasty. It really had this middle eastern flavors we were looking for when we ordered. The delivery was fast and somewhat inexpensive for such quantity of food and such quality and taste. Really recommend it."]], "Taci's Beyti": [["Devon P.", "Easily the best meal I have had in ages! The hummus, dips and spreads are staples not to be missed - shepherd's salad was fresh and well dressed... the small is pretty big so if you're sharing start with that. Lahmacun was absolutely delicious - the dough was light and fresh, and the seasoning was perfect. I'm used to buying them in the city and freezing them so it was lovely to have fresh out of the oven.Everything we had was flavourful and made to perfection. The portions are pretty big, we ate the leftovers for two days. The staff was very, very nice & helpful (I think there were more people working there than customers). The atmosphere was good - i think we were sitting in a newer part of the restaurant - it was busy with people of all cultures chatting away in lots of different languages enjoying their meals. I will most certainly make the trek out there again, and next time I will bring more people so we can try, taste and share more!"], ["Ameenii R.", "Yes yes yes for this place, been there countless times; I actually alternate between taci and Gino's for a quick delicious meal.Shepard salad is a must, and do your self a favor and try to dip bread in the Ayran (the sour, salty drinking yogurt)Mixed grill is as the name indicates a little mix of everything. Hands down one of the best Turkish restaurants in NYC"], ["Marland V.", "This place is just always so damn good. I've been here like 10 times in the past year and it just doesn't disappoint.The trip I am reviewing is my most recent trip. We had the hummus (delicious), shepherd salad with feta cheese (delicious and fresh), and I had the chicken kebab entree.The bread which came was hot and delicious which is so important when eating things that must be dipped like hummus or salad for that matter. The chicken was juicy and moist and perfectly grilled. I've in the past ordered fish there as well which is also amazing (I recommend the filet branzino) which is delicious!Pretty much you can't go wrong here. The food is amazing, the service is divine (sometimes they can try to rush a bit but I know how to keep them in check ;) but seriously extremely nice waiters. I'm surprised to say that but it's true. Good food, good service, decent prices. If you're still complaining you probably were a brat growing up Just kidding on the last comment, but seriously."], ["Jennifer D.", "BEST TURKISH FOOD EVER!All the desserts were amazing!Calve's Liver appetizer was to die for.  Highliy recommend this restaurant."], ["R G.", "Considered the best Turkish restaurant in Brooklyn, this  place is as authentic as it gets.  I always get the hummus, eggplant spread and shepherd salad with feta cheese, and a chicken kebob.  Their service is really good too."], ["Wolf W.", "Amazing place and meal. Very hard to find the table for 2 at nights. Especially on Friday and Saturday. Very popular place."], ["Dee L.", "If you are looking for an authentic Turkish restaurant with great delicious food, friendly atmosphere and have the experience of your life, then you must try Taci Beyti.Nothing you order in this place will disappoint you. Wether you want a main course dish or just a bunch of appetizers,  the food is always made fresh to order.A few of my favorites are Shepherd salad with cheese, Sigara Borgei, Spinach pie, lentil soup,  Lahmachun (meat pie), Broiled Branzine, Shrimp sautee, Beyti Kebab, Mixed Grill.. my mouth is watering just thinking of all that food. Yummmyyyy!!"], ["Whats On NY ..", "This place was okay. The service was good and the food came out quickly. The place was big and filled up pretty quickly for dinner. It was unfortunate that they don't serve rice or salad with their food like other Turkish restaurants that charge the same. They charge you $3.50 for rice or small fries. The complimentary Turkish bread was good but did not include any olive oil."], ["Doris C.", "Staff was nice, but service was kind of frazzled and very disjointed. I had to ask for a water refill after many servers passed our empty pitcher on the edge of our table.  I was asked if I wanted a drink, but we weren't given a drink menu. The guy goes to get one, but it's actually a food menu and I had to ask again. They place a basket of Turkish bread to eat it use with your dips. The brass is stale and unpalatable without dips.The hummus was smooth, kind of standard in my opinion. The eggplant spread was smoky enough, but the texture is more chunky and thick than what I'm used to. Overall, the appetizers were kind of disappointing. We ordered the whole branzino, lamb saute, Shish kebab, and gyro in yogurt. The while branzino was great, a nice white fish that was juicy enough with crispy grilled skin and a side of greens. The lamb saute was my favorite, lamb cubes with tomatoes onions and spices on a sizzling platter. The Shish kebab was tender and marinated well, but again, nothing beyond standard. It came with three half pitas, a grilled tomato, pepper and onions. The gyro in yogurt was my least favorite dish. There was sliced the gyro meat on top of yogurt and pita chips. The pita chips are mixed in with the yogurt....why would you do that? It was a terrible surprise for me. They obviously bake the dish before serving because the meat was mostly dry. However, the tables are roomy and the place doesn't feel crowded. The place was almost constantly full. The food is ok but I think you really need to dig to find the winners."], ["Eric S.", "It's not just about what the food looks like. But what it taste like really give me the bumps. I love this restaurant. Will come back with my friends with me."], ["Klim K.", "This place is equivalent to crack. Not that I've ever done crack. But not like I'm making fun of others that do crack. Look, what I'm saying here is try this food, and don't do crack."], ["Kamran X.", "This my shitttttttt that's all! Chicken is amazing Lamb? Bruh lamb is like sex and sex ain't even that great if your girl don't know shit but this lamb I'm telling you is better"], ["Basak T.", "We just got our order. We ordered lahmacun and kazandibi... Lahmacun was the best that I had in NYC. For the kazandibi, they added cinnamon on top of it, which suppressed caramel taste. I like to keep traditional tastes as they are. You are supposed to get caramel taste and milky pudding, not cinnamon.  So 5 stars for lahmacun, 3 stars for kazandibi... Overall 4!"], ["Mike O.", "This is a hidden gem. The food was amazing and the service was top notch. This was my first time to have Turkish cuisine, and I had quite the best experience from this restaurant. I will definitely be coming back here again."], ["Duygu A.", "I love this place for their food. Their service, on the other hand, is not so great. This place is extremely busy on weekends. The waiters rush you to leave all the time so that there is room for other people."], ["Sam S.", "İt s wonderful place to eat traditional Turkish foods and deserts. Service is so fast and on time. Staff is so friendly and warm."], ["Dilruba S.", "Finally I discovered a really good Turkish spot close to home. Everything was great. The staff was friendly and food was delicious."], ["Manasree P.", "I am not familiar with authentic Turkish food to say this is as best as it gets but the food here stands far apart in terms of flavor from the ones in Manhattan that I have tried. Went with the reviewers recommend options of fried cubed livers & eggplant with tomato for appetizers. They both tasted delicious, even better when eaten together. Scoop an eggplant piece , layer up with a liver cube(after it has cooled down a bit) & pop into your mouth. A beautiful symphony of favors await you.The mixed grill gave an insight into the kebab world of lamb here. Each item was delicious and stood apart in terms of the spices used as well as how perfectly the meat was done.Turkish tea, great to gulp down after all that meat. The only meh was the apricot dessert which was just plain apricots stuffed with an almond each & a scoop of ice cream. But it wasn't described as anything else on the menu. The place is huge and was packed . Service was fast. They might not come & ask you if everything was ok and how you are doing but they have an eye on each table & knows when to clean away the empty plates & serve the next course. A must to try if in the neighborhood. Definitely in my to go back list to try other items."], ["Stan S.", "I am a regular here for many years.  The food is always good, always consistent.  Only avoid scallops if they are small - they may come out dry.  The serving staff may not be a five star, but they are fast and attentive."], ["John R.", "Taci's BeytiKing of NYC's culinary destinations. Worthy of one's last meal. Not to be missed:shepherd salad with cheesepan fried calves liversigara boregieggplant in spicy tomato sauceiskender kebab lahmachuna selection of dessert items turkish tea The service is not the best, but it's perfectly fine for this type of restaurant.Go here. You will not regret it."], ["Tamoor H.", "Best Turkish food anywhere in Brooklyn and trust me there are many options like Sahara, Memo etc which come close but Taci Beyti holds their own. The meat is always fresh and tender. It's a little expensive as compared to Memo but the food makes it worth it, it's always busy on the weekends especially so make sure to make a reservation."], ["Roman M.", "We have been coming to this restaurant for years.  I just tried to make reservations for Saturday for 6 people for 5 pm.  Was told that they don't take reservations for 6 people for this time of the day on Saturday.  That they usually have tables available.  There may be no wait or might have to wait a little.  Well, we can't wait, which why I'm trying to make a reservation.  My father is in very poor health, walks with a walker and carries an oxygen tank.  He can't stand and wait, which I explained to them and was told they'll give us a chair. He's also in a lot of pain & if he goes out, he can't spend that time sitting around waiting.  We're celebrating an occasion and are trying to spend minimal time in the restaurant, because it's hard for him to even sit in a chair.  I asked if they can't make an exception and was told no.   I need to know for sure that there will be a table ready for us when we arrive, not play a guessing game and wait or have to go somewhere else looking for a table. This is unacceptable and I'm very angry.  They just took the joy out of the celebration.P.S.  I just called Liman and Nargis, and it's not a problem making a reservation at either place on a Saturday.  Guess where we'll not be going?"], ["Hussien A.", "More than 5 stars , this restaurant is amazing, the food is delicious, amounts are big, the have variety of options.Its my favorite"], ["Nimita L.", "Brooklyn's best Turkish! Turkish is one of my all time favorite cuisines! Their food is by far the best, mixed grill, shepherds salad, hummus, that's all I need in life. Next stop Turkey!"], ["I B.", "I've been coming to this neighborhood restaurant with my friends and family at least twenty times over the course of nearly a decade. Although I have went to nearly every famous establishment in the city, this place continues to be my favorite due to the combination of delicious food and a reasonable price. This place really lacks for nothing, so it's about time I wrote a review for it.  Here's a little tip: You can order a delicious gyro sandwich to-go for $5.70. Most people don't know this, however it is the single best bite of food you can get in NYC for that price. I also highly recommend the Eskender Kebab, which is in my opinion, the tastiest item on the menu."], ["Nino S.", "Amazing food. The service could be nicer, it was crowded and the waiter kept rushing."], ["Julia F.", "The fried livers...oh my god, the fried livers. Reminds me of the stuff my grandmother used to make. Since Turkish cuisine is the kissing cousin of Greek, I will happily cheat on my culture anytime here. The wait staff's English skills are a little spotty, but who cares when there are FRIED LIVERS. So, good!!!! Squeeze a lemon on it and call it a day."], ["Correy K.", "Always a crowd and guaranteed good food. bYOB. Parking is difficult. Best turkish food in bklyn."], ["Lianne W.", "BEST LAMB EVER.Came here with a friend just this afternoon and I have to say this again..BEST LAMB EVER. You have to try their fried liver cubes as an appetizer and order their Lamb Shish Kebab. The lamb was juicy and tender at the same time. My friend ordered the Doner Sautee which was great too. The cheese under the meat tasted familiar. It's the same cheese used in lasagna and ravioli. A good touch of sweet and salty. The manger was also excellent with his service which is always a plus. He made us a Burma for dessert on the house! I recommend coming here if you haven't had Turkish cuisine or want to try something new."], ["Fafa N.", "This was the first time we tried this Turkish restaurant, We enjoyed Kebobs and lamp chops was so tender, the tabouli was so fresh,The cigar boregi was so tasty also. We'll be back for sure."], ["Ellina D.", "Nothing to write home about, the food is mediocre and expensive. We were a group of 7 and I tried many dishes. Not going to return. They give you very little for what you pay. A shrimp entrée that was 19 bucks came with no side at all. It didn't taste very fresh, tasted like frozen shrimp that has been in the freezer for the longest time. Not very appetizing."], ["Joe A.", "It has become a tradition in my family to eat Taci's. We try to eat almost once a month here and the food has been consistent ever since they first opened their doors. The must haves at Taci is their fried liver, shepperd salad and their famous pastrami hummus. The meats are well seasoned and cooked thoroughly. Most turkish restaurants cook kebabs well done and burn the meats. I prefer medium to medium well and Taci prepares it perfectly juicy. The perfect night at tacis starts off with a small bottle of vodka and a bottle of yeni raki that you buy across the street. The small bottle is for the pre game while you wait to be seated on line because most of the time everyone is hemmed in to a small entrance so people tend to wait outside and it is brutally cold outside in Brooklyn in the winter. The big bottle of Yeni Raki is for all of the wonderful cold appetizers they got make sure you try them all. I must say as a Turk this is the only place that stands up to authentic Turkish food standards and they hold the throne in NY as the best Turkish restaurant."], ["Nikita S.", "This restaurant is legitimately THE BEST RESTAURANT ON EARTH. I have been going here for ~10 years almost every week and food is consistently phenomenal and staff is great. Favorite dishes: shepherd salad; sting beans; adana with yogurt; shrimp sauté; turkish tea; yakut wine."], ["Adrienne B.", "Whenever I come back to Brooklyn my parents always seem to have a new \"great\" restaurant they've discovered that's better than a place I really liked when I used to live here which really frightens me because it usually is terrible.  When my father tossed me the take out menu to browse before we left the house and I looked on Yelp I was feeling hopeful, but still nervous because after all they do have a terrible track record.When we arrived at the restaurant I was pleasantly surprised at the \"A\" rating and a bit taken aback by the decor which to me looked a bit like the lighting at the pirate ride at Disney.  We were promptly seated, and given a basket of bread.  And then we waited and waited until we finally had to tell them that yes, flat water from the tap was fine for us.  Being that I no longer reside in New York, I was a bit sad when I ordered an iced tea and it was in a can, but that's because 10 years away from the city will do that to you spoiling you on fresh brewed iced tea.We ordered the white bean salad, hummus and a small Shepard's salad with feta as well as a shish kebab and shish kebab in yogurt sauce.  The white bean salad was served cold in a red tomato based sauce and lacked flavor.  The hummus was very good and creamy.  The Shepard's Salad was served at the perfect temperature, but had a bit too much dill on it for my taste and I would have preferred for the tomatoes and cucumbers to be cut to a smaller size like I have had at other restaurants.The shish kebab was served with grilled onions and peppers as well as tomatoes and a hot pepper and grilled pita bread.  The lamb was cooked to perfection and you are able to get tzaziki to go with your food by asking.  The shisk kebab in yogurt sauce comes over cubed toasted bread with sliced pepper on top in a creamy yogurt sauce with some tomato sauce mixed into the side as well.  The lamb in this dish is not as good as the regular shish kebab, but I enjoyed the sauce.  I enjoyed the fact that it did not appear that we had a designated server and everyone appeared to be working together to ensure that the tables were taken care of.  We were brought bread, and checked on through out our meal, and our plates were cleared in a timely manner. I was too full to even try to eat another bite but if I had a chance to go back here before headed home, I definitely would."], ["Lana S.", "The place is AMAZING!!!!  I don't exaggerate when I say it is the best Turkish restaurant in the area. I don't even know where to start when it comes to my favorite dishes. Must taste dishes: mixed grill, grilled branzino fish, shepherd salad with cheese, and baba ghanoush. Those are my favorite. The place itself is a little small and noisy but if you are willing to oversee this small inconvenience, you won't regret coming there. Definitely, worth trying!"], ["Angela Y.", "Families of 10- 20 of all ethnicities finishing of bottles of top shelf BYO(beer, wine, liquor)  with amazing food. What a great experience. Put this on your must visit list."], ["Sam H.", "I've heard so many great things about this place! and every time we drive by it looks so crowded. So i finally decided to take a trip with the Mr; I got the salmon kebab entree and it was amazing ! my boyfriend in the other hand wasn't happy with the place, he thought the waiters were rude and not being very clear. I do agree, they were a bit rude but I guess it also didn't help that they got his ordered mixed up and he ended up not liking his food as much. I believe he got the beef/lamb kebabs. The atmosphere is nice it can get loud in there but overall it was a good experience,unfortunately I don't think he and I will be going back together to the restaurant. But I am a fan!"], ["Laurie J.", "Hands down best Turkish food in nyc. Everything is seasoned-bread, salad, dips, cheese as it shoukd be. Fresh delicious food with the most eloquent flavors. Pure sumptuousness. It's a great spot for large groups of 10 or more. Bring your own wine and there's an awesome liquor store across the street. Get there *early* lines wrap around the corner. For those of you bound by subway lines. The trek on the bus is more than worth it!"], ["Ana C.", "So yummy! I love this place and have been going for many years on different occasions. One of the best local eateries and the food is always fresh and delicious"], ["Beran B.", "This is the first time I had Turkish food and I must say it was great. We were quickly seated and the good came out a bit slow at first, but we loved every minute of it. It's a very intimate and cozy place. For sure I will go back.  Shepherd salad.....very good my20month old baby enjoyed it."]], "Zaytoons": [["Peter S.", "By New York standards, Zaytoons is a mediocre middle eastern restaurant (at least this location).  The food is good, but not great.  It can stand improvement, and the things that are wrong with Zaytoons are absolutely silly.  They're things that could be improved with the snap of a finger, like telling the chef to make sure the falafels fry enough to be crispy or adding more onion to the tabbouleh.  If anyone was paying attention or critiquing their own food, these would be no brainers.Alas and alack for us, Zaytoons is the only middle eastern place in the area, so there's no competition.  They don't need to strive for greatness.  Place another middle eastern place next door, and I'm sure you'd see some improvement quickly (and they'd probably start taking Visa!)Appetizers: Meza / Salads====================Pita Bread: A-Fresh and tasty.  A tad on the bulky / dense side, but fantastic flavor, and when warm, is stupendous.  Unfortunately, because the bread is so dense, when it cools down, it's not so good.Lentil Soup: AFANTASTIC soup!  A little ham or bacon and more \"pulp\" would knock this soup into the A+ region, but even without more pulp and smoky flavor, this is a wonderful soup (I understand about the pork, LOL, but it's still *my* preference).Hummus: B-A few Yelp reviewers wrote the hummus here was bland and nothing special.  I couldn't believe it, so I ordered the hummus.  Well, they were right and I was wrong.  The hummus is depressingly mediocre.  I'm far from loving it and can't bring myself to hate it.  Texture is ... meh.Moujadarra: C+It came cold, hard, and mealy.   I understand it's served at room temperature, but it shouldn't be served *chilled*.  Note that a few other reviewers also had the exact same comment about the moujadarra.Foul: A-Nicely spiced.  You get a lot of foul for the money, but more importantly, it's high quality tasty vegetarian food.  Loved it.Tabouleh: B-It was OK, but there are brands in the supermarket that are better, and that's shameful.  This tabouleh needs more bulgar or couscous.  It also needs more olive oil, garlic, onion, lemon juice, and tomato.   Basically, there's too much parsley.   It tastes like eating a mouthful of parsley with a little flavoring from lemon juice and tomato.  I can't tell if there's any olive oil or garlic.Fatoush Salad: BGood but unremarkable.  Maybe more dressing / more lemon juice would've kicked it up a notch.Garden Salad: B-No dressing at all?!?Spinach Pie w/Mozz & Feta: BVery tasty and handmade.  The spinach and feta should be mixed together instead of having a layer of spinach on top of a layer of feta.  You get \"bald patches\" where you're eating nothing but spinach and dough, or a mouthful of feta and dough.  Large: unlike other spinach pies, this could easily be a meal with a small salad.8oz Burgers=========Mediterranean Burger: BI could pick out the lamb and onion (which was really nice!)   They apparently forgot to put the hummus on the burger.  The garlic sauce was very creamy and I liked it more than I thought I would.  I asked for medium rare but got medium instead.  it was a tad dry.  It was good, but doesn't stack up against great Mediterranean burgers I've had in the past.Sandwiches and Platters====================Falafel: C+Awful.  A falafel should have a crispy outside, and should NEVER be soggy.   These were soggy.  They were also mealy as if the basic ingredients were not cooked or prepared correctly.  They didn't have that great falafel flavor.  I was supremely disappointed because falafel is one of my very favorite foods.Chicken (and lamb) Shawarma: B-Nice flavor, but it was missing something.  I can't put my finger on it, but it was definitely bland.  I would've order it again; there's definitely better chicken shawarma in the city.  Too much uncooked yellow onion.  If you put uncooked onion in food, it should be red, not yellow, onion.Kibbeh: B-I didn't care for the kibbeh; I found it bland and too soggy.  Not enough cumin and garlic in the meat.  I had to coat it with raita and tabouleh to add flavor to the meat.  Kibbeh from the streets of Dominican Republic are a hundred times better.Desserts========Muhalabia: B+Very good dessert to complement Arabic coffee.  Great flavor and consistency.  A tad bland, so it's a nice \"partner\" for the coffee.Baklava: B-This is a large piece of baklava, but not as sweet or flavorful as the smaller variety of baklava.Hot Beverages============Arabic Coffee: AOutstanding, but I'm not sure I've ever had bad Arabic c"], ["Claire L.", "Nothing special. My mujaradrah was soaked in oil. I make mujadrah all the time at home and I grew up on the stuff-- it doesn't need to be soaked in oil. It was rather tasty though. The mixed appetizer was good but again, nothing special. I'm sure it's a great place to go if you live in the neighborhood but I do not live in the neighborhood."], ["Stephen M.", "The food options here are amazing.  I was here just a few days ago and we had more than our fill with two of the platters.  The service is a little spotty, so don't be afraid to wave down a server or whatever, but they crush it with the menu, so don't overlook this place."], ["Nirmala S.", "Food is very delicious and you get a lot per meal. Very causal. I didn't like the 'plastic looking like glass' cups for water and too much  noise, we had to talk really loud to hear each other. Waitress was very helpful to help us choose our dinners and appetizers. The menu online is easy to choose from but the in restaurant menu has so  many option and was kind of difficult. Yelp has the right address but the in between streets are wrong...the restaurant is actually on the corner of Vanderbilt and ? Now I forgot, but it's definitely not between Dean and Bergen. All in all food is very good, the atmosphere could improve."], ["Milo G.", "Garden is lovely and the food is good and cheap. Staff are generally friendly but the hostess I think it is? has a really bad attitude every time we're there - if we eat inside we honestly feel like an imposition."], ["Mitch K.", "Basically all you need to know is go and bring cash. All the middle eastern staples are there. Home made pita is worth going alone. Service is fast but not so friendly. Easy to overlook though."], ["Jason G.", "Love this place. Always order delivery from here. Tasty, healthy, and fresh. Favorite dish from them is the oven roasted chicken."], ["Sarah N.", "Yum, the combo platter is the way to go! So cheap."], ["Brianne S.", "Pretty decent. Babaganouj was great. Couscous was just okay. Cash only. Tuesdays are BYOB!!"], ["Bassil Y.", "3.5 Starshad the Lentil soup and the kefta kebab platter with hummus.They were both really good. Cons:-Cash only-Service was ok."], ["Tim H.", "Dump"], ["Sulemany S.", "Huge fan of this place, when i go there i get the meat.  Hummus  MalphoufMoujadarraIts cheap and great service."], ["Aaron T.", "Dear jesus on a kabob stick. I think I just found my shawarma haunt. $5 glass of wine, I may just never leave. Service: Someone was a no show, so the tall server with the insane dreads and denim covered platform shoes had the whole restaurant and never missed a beat.Yes. We will be back.Often."], ["Kirk H.", "I m so disgusted with this place. I have to say that I was formerly a huge fan of this establishment, until this evening.Soon after ordering my meal for takeout i noticed one of the kitchen hands in the eating from what was meant to be my chicken shwarma platter with his bare fingers. He picked up a piece of chicken from plate, put it in his mouth and while chewing proceeded to continue arranging things on my plate. Thank goodness i had a view into the kitchen at the time that he did this. I am not surprised that this place has a B rating. it is unhygienic and the staff could use a real lesson in cleanliness."], ["Saad M.", "This place is a very pleasant surprise in Prospect Heights. First off the portions are HUGE, you will be full and most likely take your food to go. Secondly, the prices are amazing, great bargain and great atmosphere. I got the sampler with 6 different meze and that was beautiful. The babaganouj and hummus are creamy and smooth with the warm pita being a splendid accompaniment. The lamb kofta was cooked just right and the service was amazing. Our waiter was on top of everything and refilled our drinks just as we finished them. His recommendation of the tea was superb and kept us warm on a cold night. If you're in the area, you must try this place. Its also BYOB in case you want to pre game before a night out!"], ["Mitch E.", "Great middle eastern food at a good price. Obviously going to a guy at a cart is going to be a better deal but this is a nice sit down place where you can get some drinks and enjoy the nice setup. They have all your basic middle eastern food and make some nice middle eastern style pizzas. Zaytoons has several locations in Brooklyn, but this one I believe is the best."], ["Omar B.", "This place is unreal ... omg...  the service is one of a kindthe food is one of a kinddon't waste anymore time reading reviews just head straight to this spot and eat eat eat..."], ["E O.", "Consistent, consistent, consistent! I've lived near two of their locations (Vanderbilt and Myrtle Ave) and they're food is standard Mediterranean grub. I love their spinach pie, dips/salads, pizzas and all their platters which are hearty portions. It may not be the best Mediterranean fare but they're consistent (sorry there's that word again) and that counts for something. I've dined in (Vanderbilt location has a wonderful garden) and ordered take-out which would be my only grip. Delivery can take 5 minutes or over an hour.  I know for a fact that I'll be back within months."], ["Nyota W.", "The food here is pretty straightforward, the service is acceptable and you can easily walk in get seated and serviced pretty quickly on most nights. You can also see the kitchen staff working hard cooking meals in the exposed kitchen. They don't have a bar, but do you really need a cocktail everytime that you go out to dinner? Don't answer that. I had the equivalent of lamb meatballs. Everything was pretty tasty and my favorite thing about Zaytoons is that the prices are so dang reasonable. Going out to eat shouldn't always have to be a $100 event (not having a full bar makes it easy here). Sometimes, you don't want to eat at home, don't want fast food, but want to sit down and eat with some friends. Try Zaytoons."], ["Nicole W.", "Whether dine-in or on seamless, I can't get enough of this place. The food is delicious and really reasonable. The service is quick and friendly, and they've never gotten an order wrong.  The chicken shwarma and vegetable pitza are my favorites."]], "Cafe Mogador": [], "Miriam": [], "Faros Restaurant": [["Michael C.", "Another excellent meal.  The mussels, though small, were perfectly flavored with tomato and feta.  Pasticchio remains crusty and creamy and delicious. A salmon wrapped in phyllo excelled."], ["Julia F.", "What started off as a search for a Greek dinner spot in the Slope, ended up drawing me in for a Hellenic brunch.Much like Batman sees the bat symbol as his call to action, so did I see the golden \"Phi\" pressed in mylar calling my ass to a table. Just catching the very end of the brunch special, I saw the magical combination of halloumi and lountza on the $15 pre-fixe side. This side of the menu consisted of massive egg dishes served with your choice of fries or greens, toast with sour cherry and quince preserves as well as a scoop of butter, a cup of fruit, a Mimosa or Bloody Mary and coffee. The other pre-fixe was for $20 and consisted of more substantial sandwiches with proteins and cheeses coming with the same selection of items listed above. For those of us who want to keep it authentic (err, ahem...obviously) $5 extra will allow you to replace the \"American\" coffee with a nice strong demitasse of Greek coffee. What I found rather odd, considering the quality of the food and service, was how empty it was. There were only two people when I arrived, and remained that way for almost an hour. Even at departure, there were just three diners total. With all the weekend foot traffic on 7th avenue, why weren't more people called to action by the \"Phi\"? Ainte, Brooklyn! Look up from your smart phones...and into Faros."], ["Robert V.", "New place my wife and I tried for late lunch. Overall a great experience. Good greek salads and entries. Moussaka was tasty and freshly made as was the Arni Youvetsi. Felt like we were in Greece (was even feeling sorry for the state of affairs over there.)Highly recommended. Check them out now."], ["Priti R.", "The selection and price can't be beat here; however the quality is a little below than what I'd expect. We got a to-go order here and it was ready super fast. Arugula salad with halloumi cheese and fennel. The halloumi cheese was a bit tasteless actually (if you've ever had it before, it's typically saltier than most cheeses). The dressing was a basic balsamic.We also got the Pikilia - a sharing platter of 4 different spreads. The hummus is super fresh - a bit chunky and smooth at the same time. The orange cheese one ( I think it had feta?) coupled with the white one were the BEST. The bread they give you to eat with it is delicious."], ["Lily F.", "Came here for lunch and it worries me that it was so empty BUT the food was good so I can't complain. I had the chicken shish kabob with rice and a salad. I forgot exactly which one it was but I remember it was enjoyable. Definitely worth a try if you're around the neighborhood and want a nice quiet sit down restaurant."], ["Ilona K.", "My boyfriend and I have been here 3 times and we were never disappointed. The food is traditionally simple but very delicious. In the past we had their meatballs, which were moist and flavorful, as an appetizer. We always get the saganaki (cheese flambeed table-side) and the octopus. The saganaki was really good, plus it was a show for all of the diners. The octopus had perfect char marks and wasn't the slightest bit rubbery. This time, we also ordered the mussels in lemon garlic sauce, as an appetizer, and grilled shrimp, as an entree. Since both dishes were lemony, they had this fresh taste that only citrus can create. Shrimp were perfectly juicy and the lemony broth was amazing with the mussels. We will definitely return."], ["Jeanine Z.", "I went to Faros tonight with my boyfriend. I found this restaurant on yelp. We ordered two appetizers: mussels in a lemon garlic sauce and fried cheese. Both were delicious. For dinner my boyfriend ordered the grilled pork chops and I had moussaka. Both were very, very good. We also had baklava for dessert. All the food was great and the service was good as well. We also ordered a Greek bottle of wine and I should note the wine prices were very reasonable. I would love to come back! Monday-Thursday they offer a 4 course pre fix menu for 30 dollars. It's an amazing deal so I will definitely be back for that!!"], ["Ajay R.", "The Greeks are perhaps my favorite of all the Europeans.  Down to earth people, friendly, not pompous, and man they know how to cook... simply and beautifully.  Faros is a reflection of that.The grilled octopus was as good as everyone says.  It's still not as good as Taverna Kyclades, but I don't really know who can top that.  This is a good 2nd.  It was tender, sliced and tossed with olive oil, capers, red peppers and some other little bits of deliciousness that I couldn't quite decipher.  The lamb shank was also excellent.  Falling of the bone as all good shanks should be.The staff here is wonderful and accommodating.  They will chat if you strike up conversation, or leave you alone when you won't.  I very much appreciated the attentive distance they stood at while we slowly finished our gigantic glasses of wine... good value there.This is now my Brooklyn Greek fix.  Just go already!"], ["James E.", "Fantastic restaurant.  Great food.  Nice ambience.  Friendly staff.  What a great neighborhood find!  Yay!"], ["Jimmy M.", "Amazing. Fantastic. Wonderful.It was a cold night and we wanted some Greek chicken soup (avegolemono) and salad.Faros did not disappoint.The soup is great. Creamy with the right little pieces of chicken and rice.We ordered a Greek salad that was tomatoes, bell peppers, red onion, cucumbers, olives and oil and vinegar. Really fresh like it had just been chopped.In addition - we ordered some pita bread with a side of hummus and tzatziki. Really fresh and wonderful.They also delivered in under 30 minutes. We'll be ordering from there again."], ["Leo K.", "Look out uncle Jessie Katsopolis, I found my new favorite greek. From start to finish this place hit all the notes.The service was some of the best I have experienced in a while. We had a large party and our waiter was not only funny and patient but also made sure everything was up to par at all times.The interior was very nice and elegant, a mix of modern and classic. There are two floors here, however the 2nd floor looks to used on more crowded nights.The food was outstanding, we ordered a little bit of everything and all the dishes were full of flavor and all around impressive.Food Favorites:Moussaka, perfect amount of meat to eggplant ratio, potatoes were soft and flavorful.Saganaki was mouth wateringSpicy hummus and pita, delicious and spicy as the name suggestedMy mouth was literally watering as I wrote this, i think that's as good an indicator as any on whether you should go here"], ["Jackie S.", "I'd like to begin this review by thanking my fellow Yelpers for giving this place good ratings.  I had never been to Park Slope before, and during a mother-daughter bonding day, my mom asked me to make a reservation at a restaurant in the area, so knowing her love for octopus and a good glass of wine, to Faros we went!Upon arriving, it was 6:20pm on a Saturday evening.  Many restaurants were already filling up quickly but Faros was pretty empty, maybe only three tables were filled.  My mom was skeptical but I assured her this place had good reviews (plus I already knew what I wanted to order after studying the menu for two days, so my selfish heart was set).When we sat down, we were brought a bread basket with three little noshes- a bean salad, a bean hummus-like dip, and olives drenched in olive oil.  Yay for free things!  We then proceed to order two glasses of white wine (both were very light and crisp).For the appetizer we ordered the keftedakia, Greek meatballs with a side of tzatziki sauce.  THEY. WERE. DELICIOUS.  Upon first bite, the first words I uttered were \"wow these taste like I'm at a grandma's house and she just finished making them.\"For my mom's entree, she ordered the Oktapodi Skaras, char grilled octopus.  She claimed she would've liked her dish to be served a little hotter (personally I enjoy cold octopus, but that's just me), but it was very good and the two of us destroyed our bread basket dipping slices of it in the octopus-infused olive oil.I ordered my favorite Greek dish, the Spitikos Mousakas and it was the best one I've ever had.  It came served in a clay pot, it was piping hot, and oozed and melted in my mouth.  It had the perfect balance of meat, veggies, cream, and love.  What I would do to have another bite.For dessert we ordered my favorite, the galaktoboureko.  It was very good, with just the right amount of honey and creaminess.  My only criticism is I would've liked it better at more of a room temperature (it was a little on the cold side).Overall, this place is fantastic.  The food is authentic, made with love, and you feel like you're getting a true Greek culinary experience.  The service is excellent.  Our waiter was so friendly, knowledgeable, and helpful.  The restaurant itself is charming too.  From the brick walls, to the fireplace, to the Greek music playing in the background, I will definitely come back next time I'm in the area.Oh, and in case you were wondering...by the time we left (around 7:45pm), the place was packed."], ["aubrie t.", "Please don't frequent this restaurant.  I was just told my small holiday dinner party for the non-profit special needs group I volunteer with (down syndrome, autism) was unable to be accommodated for (less than 24 hours before the dinner!).The owner just called me and said that our party's budget was too low ($30 a person for family style dining, drinks not included), again, less than 24 hours BEFORE the event!He informed me that they had a, and this is a direct quote \"a very expensive party for $90 per person upstairs\" that they would rather cater to.  He went on to say that if my budget was higher--for a middle end greek restaurant--they would accommodate me, and the conversation with his wife was in no indication that I actually reserved the space.  Full Disclosure: I booked this kind of last minute, but with enough time to email the entire group.I will now attempt to find another location for my group of special needs adults within 12 hours.  If you are one of the $90 buck-a-headers, please consider spending your money at an establishment with better business manners and community sensitivity."], ["Josephine Z.", "There are few reasons not to take a trip to Faros. Unless you despise authentic Greek cuisine and abhor a refreshingly sophisticated ambiance, then by all means, avoid this place. But if you are not those things, then a trip to Faros is worth your while.The zucchini chips are basic but easily a crowd pleaser. Fried, but surprisingly light, they prepare your palette for the bold flavors of your entree. By bold, I am referring to the moussaka with ground beef. Laden with potatoes, eggplant, and cheese, this dish is heavenly indulgent but worth it. Try not to let the layer of oil that has accumulated on the bottom make you regret this dish, you and I both know you'd do it again. If you favor something lighter, yet still delicious and authentic, go for the spanakopita (spinach pie)--flaky and light(er), it would make a good meal for one, or an appetizer for two. As usual, it doesn't hurt to top your meal off with a glass of Faro's sangria, served by their charismatic bartender, Bobby."], ["Yuriy B.", "Went here last night for a big birthday dinner for a good friend of mine.  I don't know how this place did not have a wait outside the door. I know it's Park Slope and some nights are busier than others, to the point of confusion but if Faros was in the city, I don't think there would be a chance of getting a seat here during the weekend. Since I had such a great experience here with very few complaints (the complaints I do have are only for the sake of adding some realism to the review and I don't think they are truly even valid as much as nitpicking), I will provide a categorical breakdown, which I rarely do. It's usually more effort than its worth. Interior : Classic, romantic, and overall pleasant. It truly does have a very authentic Greek feel to it which is accented by lanterns, assorted wine racks throughout the restaurant, and floor lamps blended with the dim lighting that makes you want to slow the experience down.Service : Flawless service. We had a large party of about 20 and we went about ordering in a very confusing way; our waiter was professional, courteous and pleasant. Food is where Faros impressed me with every plate that hit the table had something new and different to it. Turkish food is on the rise in my area and I feel like there's one of those spots springing up on every block. Since there is some culinary overlap between the Greek and Turkish cultures, this was refreshing beyond words. Even the hummus felt homemade; chunky and rich texture at the same time that you won't see every day. I never order spinach pie in  restaurant because I'm stubborn and I believe that no spinach pie can outdo my grandma's. However, I tried a piece from my friend's plate and had to ask for more. So make sure to try the spinokapita (spinach pie). Mussels made for a delicious appetizer as well. My entree was the arni yiouvetsi which is shredded lamb with red sauce mixed into orzo. I was full halfway through the meal but kept going until I hated myself, because this was one dish that was very hard to step away from. Girlfriend had the lamb chops done to a perfect medium. There is a pretty extensive wine list, and a few great drafts including Blue Point Toasted Lager , which I have loved for 4 years now and see a lot of bars drop it for its 'mainstream' status (as compared to what) but it makes for a delicious dinner-time beer so Faros scored big on that with me. I believe there were two more craft-like options and a Sam Adams available as well. I want to go back right now."], ["Marina S.", "YUM! This is the ideal Greek spot. So many Greek restaurants unfortunately are not my top choice for dining because the food is sometimes lacking, but NOT HERE. 1. Spicy hummus and pita was so flavorful yet light. 2. The Moussaka was so hearty and delicious, I only had a bite from the boyfriend's plate but I wish I had more.3. Mosharaki Kokkinisto (spiced cubes of filet mignon over pasta): A+ does not do it justice.The staff was so accommodating and polite, it felt like we were dining among friends. The interior is very elegant; it's perfect for a family dinner, a quiet date, a night out with the girls, really anything!"], ["Richelle R.", "Came here for a quiet date night while walking through 7th avenue. Overall a great experience. The food is simple but very delicious. Highly recommended. Would definitely come back again."], ["Natalia S.", "Everything I had was truly delicious! Specially the pan fried kefalograviera cheese. I have no idea why this place is not busier. Give it a chance! Great food and very nice ambiance."], ["Alexandra K.", "I can only add to the glowing reviews here for Faros, because my dinner here last night was reminiscent of great Greek home cooking, which is one of the highest compliments I can give to a rustic-style Greek restaurant like this one. I loved the decor; warm exposed brick, fireplaces, dim romantic lighting. Add to that a glass of the surprisingly good, Merlot-esque Kouros red, and I was primed for a great dining experience. I followed the recommendations and ordered a small horiatiki salad, a pikilia (selection of Greek spreads served with warm pita and a lettuce chiffonade), and the oktapodi skaras. I shared these with my cousin, who also ordered the keftedes for herself, and everything was both delicious and satisfying. With the check, the waiter brought out two shooter glasses of what I'm almost positive was rakomelo (a really good one too, extremely smooth). The service overall was great, the waiters very cordial and attentive. One of the nicest Greek restaurants I've been to in New York in a long time for sure."], ["Maria Felisa S.", "I chose Faros for my friend's birthday treat for me and we ordered the appetizer sample, the Greek salad, moussaka and grilled bronzino and every bite was exceptionally delicious and authentic!!! Had lunch at the back garden and it was just delightful!  My only regret is that I didn't know Faros has been here for 4 years and I live a few blocks from it!  Will be bringing my family soon!"]], "Opera Cafe & Lounge NYC": [["I G.", "The delivery was lightning fast. Only 15 minutes from the time I placed the order until it was delivered. I don't know how they delivered so quickly but it was great. The food is good, particularly the hummus and fresh bread. Kebabs also very good."], ["Thy L.", "A great replacement for El Greco Diner which is gone.  We sat inside but the space felt like open air with the big windows and breeze.  Food comes out fast, less than 5 minutes even during a Sunday brunch.  My husband's turkey omelette was kind of flat seemingly like it lacked egg.  I got the turkish omelette which was more tomato than egg and served with nothing else so I paired it with the bread on the table.  Fried calf's liver was tasty but small portion.Kunefe dessert is delicious - try it!Overall, I would give the food a 3 but the space gives it another star."], ["Jewel A.", "I love Opera! This place is so much better than Rocca by a long shot!Prices are similar but the quality, atmosphere, decor and service are unmatched. The ambiance is casual elegance, contemporary-Turkish and breathably spacious.We came by around noon on a weekday to have lunch and began with their small meze sampler platter. The presentation looked beautiful and tasted just as yummy. If you enjoy Meditteranean-style dips and variety, I recommend getting the meze sampler(the small is good to be shared by 2-3; comes with pita) but leave some room for the entree.Had ordered the grilled salmon that came with salad and a side of potatoes. Everything about my meal was cooked perfectly. The salmon filet was delicious with a little bit of lemon juice and salt. The salad was fresh and dressed well and the potatoes were snacky-good savory. My friend had ordered a chicken kebab dish that arrived with rice and a salad; said the chicken pieces were juicy and seasoned well.We ended our meal with Turkish tea that came in a standard size tea glass. Was hoping to be served in a teapot but they didn't offer. Overall, our expectations were met and dining experience went smooth.Our receipt came out to close to $70 for 2 people: (1) cold starter, (2) entrees and (2) Turkish teas with tax and tip. Yes, for an everyday meal it's a bit on the pricey side but worth splurging a bit if in the area and you want to go grand.I was very happy to have left Emmons Ave redeemed after a poor experience from another \"Turkish\" restaurant nearby(Rocca).Will happily return again!"], ["Freddy V.", "Love coming to Opera when in the Sheepshead Bay Area of Brooklyn. They serve traditional Turkish Food cuisine.  I always order the stuffed baked potato with sausage pieces on top, Mediterranean salad with feta, cigar cheese sticks, and a killer Margarita cocktail.The place is huge and can fit well over 250 people at one time. Ambiance is on point and seems like it's the big brunch spot for South Brooklyn."], ["Marina S.", "quick service. flavorful dishes. never disappoints. get the branzino, liver cubes, hummus, and the kanafe for dessert."], ["Danielle C.", "This is my go to restaurant for breakfast lunch and dinner ! Beautiful venue and great hospitality! HOGHLY RECOMMEND!!"], ["Dona F.", "For starters, when I eat at Italian or Mediterranean restaurants the first thing I look forward to , yes ladies---- is the BREAD!!!  When I opened the napkin covered bread basket , there was 4 little pieces of very unimpressive bread. Wasn't even tempted to try. The opera salad with shrimp was very good. Al the salads coming out looked nicely prepared with a good presentation. Fried liver cubes with purple onion- very good Sigora boreki - fried rolled up pieces of phyllo dough with feta were also very good. Both are very standard fare for Turkish places. Desert was eh! Luke warm coffee and run of the mill baklava. I walked out thinking the meal was good but no great need to do a repeat performance."], ["Marat and Jennifer S.", "Love this place. It's always busy, even late on a Sunday when I seem to always end up here. The food is consistently delicious and the decor and atmosphere are just so cool. I've never had anything bad here but our faves are the kumpir, the shepherd salad (with cheese of course) and all of their fish dishes. Oh and the meze platter. You cannot go wrong with opera!"], ["William C.", "Eat here once or twice a week. Love this freakin' place. Last summer, I didnt even realize there was an indoor area... which is a major understatement! It's huge and beautiful inside! Everything done right. As for the bad rating by Maria, I have no idea which place she went to. We go here in groups and the food is always top notch.The salmon, despite likely not being wild caught, is still super delicious and comes with a nice salad and more. The breakfast options are available in both turkish style (menemem) and regular american style.I will agree that prices are high here, but it's worth it. Staff is also very on point (our favorite dude is the guy with the epic Rollie Fingers / Yosemite Sam mustache.)This place has me as a lifer."], ["Michelle Y.", "Opera is located in a prime location-right on Emmons Ave across from the bay. The menu is extensive. The restaurant is large and well decorated. However, execution is lacking.My friends and I came for a weekend brunch. We were seated immediately. Being a lover of Turkish cuisine AND breakfast, I opted for the Turkish Breakfast Platter and it was indeed very similar to the breakfasts I enjoyed in Turkey: various cheeses, salami, olives, cheese omelet served with tea and sides of honey, jam, and clotted cream.Despite being a table of 6, my cheese plate was served first, followed by my omelet, and then everyone else's food. The food should come out at the same time...No one wants to eat alone or wait for everyone else to finish eating. I did enjoy all the items on my platter especially the fresh jam and cheese which were reminiscent of my time in Istanbul.  The pot of tea seemed never ending. I don't love tea usually but something about Turkish tea that makes me want to go back for more.2 of my friends ordered an eggs benedict dish and neither of the eggs came out poached...they were basically hard boiled eggs. That is not eggs benedict.With a little work, I think Opera could be a great brunch destination."], ["K L.", "Food is pretty average.  Chicken Kebob is pretty good, hummus is not bad but I wish it will come with pita bread instead of regular bread.   The seafood pasta I ordered with white sauce is too heavy, too much butter and heavy cream, I can only ate a quarter of it."], ["Sally N.", "Such a wonderful experience dining here. We shared a mixed grill - the meat is great but the rice? It's butter!!!! So good. I then ordered the stuffed apricots for dessert. Completely off the chain delicious. They have a special Turkish cheese and pistachios inside.  Beyond the food, the decor is stunning. The lights are straight out of Istanbul. The best part is how long it's open. Even on a Sunday night. My husband brought me here for a midnight birthday surprise and we were pleased with the wonderful service at such a late hour on a Sunday. We encountered quite a few staff members from the hostess to waitress and others and everyone was incredibly nice and happy to be working there, which says a lot about the management. Highly recommend it!!"], ["Nemesio R.", "So my wife and i have seened the advertisement quite a few times in the B and Q train station and always wanted to try this place out.  No kids this weekend so we figured let's have a breakfast date.  Loved it. Immediate seating,  great service,  classy environment and the food was quick and amazing.   The waffles were covered with fresh fruit and the eggs looked just like the pictures on the advertisement.   My wife was happy so I was happy and we can't wait to go back and try the dinner menu."], ["Jeffrey T.", "Great food and service. Lacked on the alcoholic frozen drinks. Didn't really taste too much."], ["Pavel V.", "We've dined here at least a few dozen times over the years - since before they expanded.  The food is always very tasty and feels fresh and well handled.  The staff is always extremely courteous and represents the place very well.We have been here with and without kids, with small groups and large.  These folks are always on the ball.  We will continue to dine here and highly recommend it."], ["Senol Y.", "Opera Cafe is a hugest restaurant in Brooklyn We came here for my birthday celebration they are kids friendly my friend have 9 years old boy the server was very talkative to him they brought him crayons with driving books that way kid didn't get bored even on tv cartoons playingThey made great decor I wish I could find this Turkish hand made light for my home This place great for groups .The food is 10 stars I got salmon scallopini yummiest salmon i have it The price were so reasonable for 10 people we pay 380$ we got cold appetizer salads entrees dessert coffee bye the way Opera has good cocktails the bar very chic I will defiantly be back to Opera Cafe highly recommended this place"], ["Massiel G.", "His place is awesome! As soon you walk in you feel that Mediterranean vide. The service is great and the food is of the hook. Highly recommend this place"], ["Tiana M.", "I had a bad luck to f*ck up my evening here. The owners must be embarrassed by their staff and managers and the quality of their establishment. Our food was delivered to the wrong people, we got tea but ordered coffee. The staff seemed they didn't speak English at all cause it was EXTREMELY difficult to get finally the food we asked for. When we complained our waiter argued back that the restaurant was busy instead of just making an exuse. And the worst was a manager as I guess who was staring at my friend's bust !!! Disgustiiing !!! P.S. I blamed Opera's kebab in terrible bloating I had all Saturday night((("], ["Selena S.", "Very nice and cute spot! Food is delicious! Service is outstanding all the waiters smiling and helpful! Def will come back here again!"], ["Nataliya K.", "We stopped at the place for lunch yesterday. We've ordered chicken shish wrap($10) and mediterranean salad with feta ($9) both dishes tasted sooo good . The chicken in the wrap was juicy and salad was freshly made!"], ["Tarek S.", "The place is really nice and great for families. I got the Chicken Soy Sauce which was really good. The service is also great and the food came out quickly so would definitely recommend it."], ["Fiona C.", "Cute place for weekend brunch with a group of friends right before heading to Plumb Beach with your dog! Place is very spacious and sitting outside gave us a nice breeze in the sunny weather we have been having. I had the egg's florentine which was pretty decent. My friends ordered a few omelette platters which they were happy with. Service was attentive, mostly because we sat right by the waitstaff's computer - they even offered my dog some water!"], ["Elina A.", "Not a bad place if you're looking for something to eat in the neighborhood. The ambience of this restaurant is great, it is right by the water the restaurant itself gives off a nice Mediterranean vibe.Food is tricky it's either hit or miss pending on your palette. But it's always a go to for a weekday brunch. In the evening and weekends this place gets packed out and service weakens."], ["Victoria R.", "I love that this place is open very late and most importantly, has outdoor seating for summer nights! I am a fan of the food and the overall laid-back but elegant ambiance. Go with a group, drink wine, get full and never feel like you are being rushed out!"], ["Tomi C.", "Great ambiance. I went to Opera with a friend. I was a tad bit skeptical, as I don't dine in Sheepshead Bay, but it was a great experience. Outdoor seating. Reasonable prices. Dress up or dress down. Good amount of food. I had the babaghanoush. My friend had the avocado chicken salad."], ["Romaine S.", "A perfect afternoon- sitting on the patio on a breezy summer day in July eating delicious Turkish food. Love the decor too, especially the colorful lamps. Service was great and prices were reasonable. Only complaint was that it was a bit noisy, but this was a minor issue. We'll definitely be going back!"], ["volkan m.", "Today I was at the opera caffe lounge for dinner and they have lats of the choose with, finally manager mustafa helped us to order mix grilled platter which is comes with beef, chicken also lamb this plate was really huge even two person can have it after good meal we left the place smile on our face and appreciated to all hard work they effort to make us happy,,,,"], ["Raya S.", "Come here pretty often. They have a great menu selection for throughout the day. I came here last week for breakfast and the poached egg selection was very good. My cousin got waffles hard to mess up waffles and ice cream. The offer both indoor and outdoor seating. Ambiance inside is great, but since it was a beautiful day we opted for outdoor. The only downside is service can be slow and i literally had to wave down someone to serve us. Their dinner options are pretty vast as well. The seafood pasta is very good. I'd say there is something for everyone on the menu. Overall it's somewhere I enjoy coming."], ["Maria B.", "Expensive bad diner food, in a stinky, despite high ceilings, place with no airflow and uncomfortable seating layout. Loud music so great if you don't want to speak to your fellow diners. I seen many dates enjoying this type of quiet, sourpuss faced type of dining. Looks like a lot of money went into this place but zero thought. Same goes for the food. They're trying to be creative, and you order this weird stuff and it totally doesn't work together at all. Like their opera salad for example. One thing that did work was the semolino desert.. Didn't know what to expect, but it was surprisingly great. Unique and actually worked. If this was a bakery or a small cafe I'd come back to have it again. Also, the Russian hostess chick was cute and sweet despite the chaotic atmosphere, I give her props for that."], ["Gladys L.", "Living in Sheepshead Bay, I always searched for a perfect place to get breakfast.  My family and I tired of Diner food decided to try out Opera. Due to its Turkish/Russian customers it can be a little akward.But I love this place and we've decided to make this a weekend breakfast/lunch spot.  Food never disappoints and service is spot on.  Some may gripe about the price, but you get get what you pay for.  The lamb is marinated well, I love the Baked Potato Dish, desserts are good.  A great experience overall and a great family place."], ["Didem K.", "This review is STRICTLY in regards to their delivery. My boyfriend and I eat at Opera at least once a week and we absolutely love their food. So we decided to order in tonight for the first time...I don't know where to begin. I ordered a chicken shish with salad and fries on the side. My boyfriend ordered kofte with fries. Now here's the problem: we received exactly half of everything we would get at the restaurant. The lavash bread that usually comes with the chicken shish didn't come. They gave 6 pieces of chicken and a tiny side of salad. They also FORGOT the fries. I'm sorry, if you can charge the same price for the meal, I expect the exact same portion to be delivered for takeout. Of course we called back and they bought the fries. The fries were not the same fries we get at the restaurant. I was anal about the fries because I love their fries, and then for my luck we got a completely different kind. I was just absolutely so upset by their delivery service that I would never ever order again. If you eat at opera and expect your order to be a certain way, don't. It will NOT be anywhere near the way you expect it."], ["Kadyrova A.", "Nice food, and nice service  but I guess it can be better, because waiters don't pay full attention to the customers."], ["Amador A.", "Over rated. Food is mediocre, drinks are wayyyyyyy over priced....$7 for a Guinness that's not properly pored, service sucks, house bread is blah. Menu is simple and over priced. I guess if you're in this area and have outdoor seating it's ok to have overly priced bland food.  Also turn up the AC especially when it's hot out. It's not comfortable sweating and eating. Maybe close the big front doors for the people that want to eat in an Air Conditioned room and leave everyone else outside."], ["John I.", "If you are looking for authentic turkish food, then skip this place!!!Location is great, that's the only reason they get a star otherwise a big 0Cooking is done on a fast food assumption and consumption.The service sucks too, my friends had to ask for bread several times and many mishaps as well                 Skip it!!!"], ["Adrienne G.", "I have eaten at my fair share of Turkish restaurants and Opera is by far the best.  For me, yes the food is extremely important but so is the atmosphere and customer service.  Opera has risen to the top in all these categories.First the decor, the atmosphere in Opera is very comfortable and cozy yet very elegant as well.  It is a place to have dinner and drinks with your friends, and even take a date.  Next,the staff, the staff was amazing in explaining and recommending dishes.  They were very attentive but not overly so that you were constantly interrupted. Finally, to the part you all want to read about, the amazing food.  Our table had a variety of appetizers and entrees.  I highly recommend some of my favorites, Arnavut Cigeri (fried calf's liver) and Karisik Meze Tabagi (mixedmeze plate).  When you come here try to sample dishes you never tried before. Because everything is so good it is best to get plates a variety of entrees as well to try.  The Lamb Shank was very tender and cooked to perfection, and I am picky about lamb).  The taste was on point! Our table also ordered the Mixed Grill which was a great combination of meats, all cooked to perfection.  For the people at our table who had never tried Turkish cuisine before, the Mixed Grill was a hit.  We also had one person play it safe and ordered the Tavuk Sote, chicken saute.  She loved it and was not disappointed.   It is really hard to explain this place...Please try it for yourself.  You will not be disappointed and worth every penny.  And don't forget the night is not over until you drink Turkish Tea."], ["Tammy W.", "came here last night for a work dinner with ~25 people.  the place is huge and very nice decor.  since we had so many people, we had a pre-fixe menu (appetizers, entree, dessert).  we had so many appetizers, i don't know what was what but everything was delicious!!  i chose chicken/mushroom fettuccine alfredo for my entree and it was ok.  the chicken wasn't that good but the rest was fine.  the dish was huge too, so i only ate half and too the rest home.  for dessert, i had the napoleon and it was really good, not too sweet and a generous portion size.  I also tried some of my friend's kunafe and that was really good too.  overall, everything is really good.  i will definitely come back"], ["Miguelito J.", "I thought the food was just so good especially dipping it into the yogurt sauce. I got the mixed grill which is enough to split for two. It comes with different grilled meats and kabobs such as lamb, beef, chicken, and Adana. It was so good and the speedy service."], ["Nicholas K.", "My family isn't exactly full of adventurous eaters, so getting them to try Turkish food took a bit of convincing.  The restaurant is really clean and nice, and the service is efficient.  The best part of it all is the food though.  After eating here, my parents are sold on Turkish.  All of the kebabs were tender and juicy, the food was spiced well, and the rice was great.  Definitely come here if you want Turkish food with a classy sit-down atmosphere."], ["Irina K.", "They have great food. I would recommend it to a friend.  I had dinner with my freinds and loved it. I love their liver. I love the view."], ["Lena L.", "They have a great food. OMG... That lentil soup!... Service is pretty good too. Will visit this place again for sure"]], "Black Iris": [["Luv2 L.", "The food here is really not that good. I think people are obsessed because it's BYOB. The grape leaves were tough (which is the LAST quality you want in grape leaves). The servers were nice, when they forgot to bring our tea they comped it. Otherwise, yeah the ambiance is better than Falafel House, but the food doesn't compare.Cash Only cuz ugh"], ["Melissa B.", "Black iris is a great place to have as a go-to. The menu is interesting with some middle eastern classics, and some interesting spins! The food is reliable, and fresh, and healthy!It's a nice ambience, it's cheap, and it's also BYOB!"], ["Bilal A.", "Though this place has a lot of good reviews on Yelp, I was really dissatisfied with the food and service. Also, the seating was a bit uncomfortable. My food came half scorching hot, and the other half ice cold. Not to mention, there was no effort at decorating my food. The wait was okay, but the waiter wasn't the best at being prompt and nice. ~The only good thing about this place was the noise level, which was pretty quiet!"], ["Emily B.", "I love good middle eastern food, LOVE IT, and Black Iris is good middle eastern food. It's also BYOB and there's a wine store conveniently located directly across the street making it that much better.Ordered the stuffed grape leaves to start and when given the choice between a small or large I thought why would someone want more than 8? Boy was I wrong, these were by far the best stuffed grape leaves I have ever had the pleasure of eating, perfect texture and combination of flavors - just absolutely incredible - don't make the same mistake I did, get the large.For our mains we ordered the Lamb Chops and the chicken kabobs both were excellent but I'd def go for the Lamb if you are a fan, they do it right here.Cash only, so there's that, come prepared!"], ["Bill S.", "Very good Lebanese, something this city happens to boast quite a bit of. I recommend the beet salad and ALL the meat. The combination platter was amazing. They do merguez really well here. The pitas are also off the chain."], ["Laura M.", "Black iris is high quality middle eastern food with low prices and excellent customer service, including speedy delivery.I usually get the falafel sandwich, which is delicious. The chicken pizza is also awesome, as well as the garlic bread. The food is always fresh, I have no complaints. I order once a week!"], ["Josh A.", "It's remarkable at what it is - a plain, middle eastern fare with large, reasonably-priced portions. It's convenient. I believe it's BYOB. Sometimes flavors are a bit bland/subdued, and the waitstaff is terribly slow, but come in with cash and reasonable expectations and you'll leave full and satisfied."], ["Sandy E.", "The food was delicious and we got excellent service. My date was having tea so the server brought me one too! I had those ground lamb kebabs with double salad. the meat was moist, delicious and perfectly seasoned. They must have had some extra baked goods in the back because our server brought us complimentary dessert."], ["Daniel L.", "BYOB and cash only.  Continue...Have a lazy lunch here on the weekend or come by for dinner - date or friends - the food at Black Iris is top notch and the staff are some of the nicest people on Dekalb.  One of the less glitzy storefronts on the Dekalb restaurant row, the delicious middle eastern food is all reasonably priced and full of treats.  Some favorites not to be missed are:-ZATAAR BREAD (pita topped with olive oil, sesame, thyme)-GREEN PITZAA (leeks, scallions, fenugreek, with olive oil and light mozzarella)-LENTIL SOUP-CHICKEN OUZI (wrapped phyllo, stuffed with grilled chicken breast, basmati rice, carrots, peas, almonds and raisins)Also, most dishes are great for sharing.  Experiment around and order a few things to try them out.  Don't forget - BYOB and cash only.  Pair your affordable dinner with an affordable bottle of wine or beer from the nearby grocery (nearby as in across the street)."], ["Andrew P.", "Ordered the shish kebab with babaganouj and salad and pita. Everything was fantastic. The shish kebab tasted smoked perfectly, and the babaganouj was creamy."], ["William C.", "Great time eating here with my vegan brother and his non-vegan girlfriend! So many options with great service and everything was right! Def coming back again!"], ["Allison R.", "I'm not familiar with Middle Eastern food, but I like an adventure. Black Iris is a treat. I ordered falafel with rice and a salad. The food is seasoned nicely and delicious. My waitress was pleasant and attentive. The only complaint is there wasn't any heat in the restaurant. I sat with my coat on. Would I visit again for another dish? Absolutely!"], ["E S.", "My go-to neighborhood place. Everything is delicious and their hummus and house made, straight out of the oven pita is transcendent. Really friendly staff. BOYB. What else could you possibly need, want, and/or desire?"], ["Jonathan M.", "on mother's day we polished off a pint of georgi in fort greene park b4 i suggested food. steve and i rejected greg's recommendation for Sushi D (his old favorite) bc we were hungry and concerned that sushi wouldn't fill us up. the menu at black iris passed our inspection during greg's guided tour of dekalb. we were seated and given menus immediately, but it took the wait staff about 15 minutes to take our order, even after we closed our menus to get their attention, like at applebees. i ordered falafel and hummus and a pita appetizer. the waitress said it came with pita already and i said ill take the pita appetizer anyway. the bald guy gave steve dirty looks. i got up to wash my hands and when i came back greg had already received his pita and yogurt appetizer. i expected my pita any moment. it never came. BI is BYOB (a pleasant bonus), so greg sent neil to go buy him beer, since neil chose just to drink water. he returned before our food arrived with two 24oz Heineken. By rote our waitress brought out drinking glasses and greg shared his booze. when i saw greg's lamb pitza i was grateful for not having ordered it myself: it was finely ground like it was dumped from a can, making the pita soggy in a bad way. it reminded me of the best cat food i'd ever sampled. conversely, i would recommend the hummus and pita and olives and onions and falafel. there wasn't a speck of food left on my dish. (I even ate the olive pit.) it wasn't a race, but steve finished his plate well before me, and we were all talking about his sister as we ate, so he must have been the hungriest."], ["Fishgrease J.", "I think the food here is good We had the garlic bread lentil soup chicken gyro and lambajin pitzaa all are good.   BYOB on beer and wine which rocks only thing is that the decor is dated and drab.  I would come for take out or if I wanted a quick place to down a beer with some tasty middle eastern food."], ["Michelle B.", "I found the food to be very flavorful.  The owner acted a little strange and not very friendly initially, could have been due to the fact that they were a little short handed in staff.  My girls made little pigs out of themselves and had a great time,  glad j had wipes on hand between the nicely warmed pita and rice and lamb they made a mess!"], ["Katherine C.", "Really delicious, really fresh, simple home-cooked Middle Eastern fare. Prices are brilliant for the quality, it's BYOB, and the interior is cozy, comfortable and relaxed. Perfect for a casual meal out that won't break the bank!Portion sizes are generous, and the meats are always grilled to perfection. We especially love the pitzas! And the Leg of LAMBWICH! :) The only niggle is the hummus - a bit too runny for our tastes. But otherwise, fantastic - a real neighborhood favorite."], ["Amber A.", "The food is pretty good, but not amazing. Fresh & tasty. I had the shish kabab plate. The flatbread that comes with it is more like Indian nan than Green pita (just as points of reference).Probably would've given this 4 stars if it weren't for the service. The guy brought me my food (but forgot my iced tea), then ignored me. Like, didn't even look in my direction. And was mostly back in the kitchen, where you couldn't flag him down. When I finally got his attention, he brought the check...which included a charge for the iced tea I never received. I told him, he apologized and brought back a corrected check, etc. But this slowed down an already long-delayed bill-paying process, which was quite frustrating. I wish they'd pay a little bit more attention to their guests. You know, at least glance around the room and see if anyone's trying to make eye contact with them, or something."], ["Stephanie H.", "This place was really good. I brought a Mediterranean noob here and she liked it a lot. There is quite a bit to choose from, even for those of us picky eaters. The Black Iris pizza was declicious! We also split a kebab platter and it was very good and a generous portion to boot. The hummus was very bland to put it mildly but the pita bread that comes with it is amazing. Our service was attentive, yet oddly slow. Maybe because we were both blonde? ha haThe prices are incredibly reasonable, but unfortunately this is another place in Brooklyn that is cash only : (  but I would come back."], ["Wanda N.", "This review might be slightly skewed cuz I was hungry.  Not like \"oh i think I'm hungry\" but more like \"Damn I'm F'ing Starving\"!!   I was fiending middle eastern food.  It's been a while and Black Iris did not disappoint.First off, the decor has seen better days..ok who cares.  The middle eastern music put me right in the mood and calmed the crazed hungry nasty beast about to start slinging stuff if I didn't get some food in me soon...It made me dance.  I wiggled in my chair and pulled out all my belly dancing moves (sans belly, just my arms and shoulders really) to both my server and my boyfriends delight. AND I kept right on dancing as I enjoyed the Tabbouleh, babaghanouj, the lentil and bulgur, and the grape leaves....oh yes and the yummy falafels with some of the yummiest rice I have ever tasted ( I said I was hungry).Top by incredible Turkish coffee.....mediocre baklava.  Service was great and I had a blast.  This place was just fun and easy and oh yeah....cheap and delicious!"]], "Tanoreen": [["Jim P.", "Really, I was underwhelmed by this place after hearing about it for years.Excellent hostess and seated quickly, but the simple order of chicken kebob for sharing, took about a half hour to pop out of the kitchen with only one or 2 other tables occupied for this Saturday lunch.First taste of the hummus was good, but decided it was a little too thin and creamy, with too much citric taste.The citric taste overpowered the main entree of chicken, salad and rice.That's just not a taste I like to dominate my food.When considering the food, I can't really say it's worth the premium.Nice place for a small group for dinner, or if you have out of town guests, but too many other options for me to re-visit."], ["Michelle C.", "I am so happy that I tried this trendy spot for my mother's 45th birthday, it was a slam dunk.We actually arrived a half hour earlier despite the terrible parking situation in bay ridge, and they were more than happy to hook us up with a table early, the place itself was packed for a Sunday, a lot of locals were seated by the bar and in all tables, reservations are a must here.The menu consisted of middle eastern dishes , from babaganoush to hummus platters, various salads including feta cheese, mini pies with lamb and cheese, various soups, small rice platters like a pilaf, and tons of bread, really delicious soft and fresh bread, we must of had 3 baskets with spices added to the bread , and the hummus had amazing flavor, it wasn't too oily which was a plusthe feta cheese salad was excellent, it had the perfect amount of spices and cheese, it was so freshalso the fried cheese wasn't too salty or oily, also major plusthis place doesn't allow you to bring bottles from outside, but they have a fully stocked wine bar, with top shelf options available too, on average the wine bottles are 30-50 dollarsthe service was excellent, the waiters were friendly and professional, and very polite, they were more than happy to go over the menu with usRawia was such a sweetheart, she introduced herself and gave us a background of where she was from, with Palestinian roots, she has mastered this style of cuisine, where it really hits home since my family is from IsraelShe even sells a cookbook that has these same recipesThis place services a lot of lamb dishes, its a staple, whether its a lamb pie, shepherds pie, or lamb shank, or grilled lamb, the spices that they put on the lamb is perfect, not too over whelming. Nor was the meat too dry in any of these dishes, shepherds pie thus far was the best dish, the amount of garlic and butter that was baked into the piece was perfect, and the lamb had excellent flavor, it also came with a salad on the side with a lot of mint added, and there was even almonds added to the piece, as a matter of fact a lot of the dishes had almonds added, it was a very nice touchmy father had a tilapia dish which had almonds added to, im not a seafood lover but he really enjoyed the fish, it was fresh and not too overdonethe best has to be the desserts, oh my god, don't even get me started, I think we loved the desserts more than the entreesfirst we got mint tea, it was perfect, not too strong, it goes well with any dessert on the menuthe deserts listed included baklava, Arabic ice cream with pistachios on top, kharissa which is a coconut cake, and knafeh which was featured on food network with a wait time of 15 minutes since it is freshwe decided to go with the kharissa and knafeh since our stomachs were about to explode anywayoh my god, the kharissa was gone in less than 5 minutes, it was that good, it was light yet so flavorful and sweet, the texture was on point!the knafeh was fresh, it was oozing cheese, and it was very crunchy on top, it wasn't too sweet or too salty, it was the perfect balance, and it wasn't too heavy, no wonder everyone raves about it, next time im getting a large !I think the only thing that holds me back from giving this place 5 stars is that the options for kids are limited, there was an option of chicken and fries, and my sister wasn't too crazy about it, they should offer some sort of kids menu for those picky eatersthe bill for 4 people with drinks included was 200 dollars, it isn't cheap but you get what you pay for in terms of portions and quality, there was so much food left we took it all home"], ["Chase Y.", "It's unfortunate that I came to see the day that this establishment would \"fall off\". And it wasn't a bad day because I returned on two occasions before writing this review to make sure.So to the food.The dips such as the babas and hummus have not changed so not much to talk about here.The kibbeh no longer had the crispy exterior that I urged to devour, but tasted as if it was sitting in the fryer for too long. The falafel came out the same way as well, too oily with no crispy exterior. Quite a bummer After we got to the mains: from the shish to the chicken kebab they both had a chew and were way over cooked. My jaw had the crazy post workout pump from all that chewing.On to the most disappointing....the knafeh. I was so very upset that this came out bad because I've had this the very first time I came. I was divine (the right amount of melty cheesy goodness that left me wanting more)But this one came out like it was sitting around. They suggest to order this with your meal cause it takes so long to make. I was expecting the same as last time.You could tell it wasn't the same as it wasn't served on the metal bowl it was cooked in, but rather a regular serving plate. Too bad I won't be returning here. This place used to have such a special place in my heart."], ["Amy N.", "Restaurant Week '14.It's a quiet Thursday afternoon, strolled in for lunch with the hubby and bro in-law today.There isn't a separate menu for Restaurant Week, you choose your 3 course meal from the entire menu! I've been here a couple times, so it was a surprise when I saw them on the list! HUGE portions and had to take it to go, almost everything. Our waiter was a very cool guy who was very knowledgable in the menu items, also, he looks like Howie Mandel, to me at least LOL.The interior looked modern and romantic, towards the back there is a couple of tables along a long window wall, best seats in the house during lunch!Appetizers:1. Eggplant Napoleon: Haven't been here in over a year, and this dish is still my favorite! Crispy eggplant layers with hummus and embedded in a pool of tomato salad. All the flavors, the hot crispy eggplant warmed up the hummus, goes perfectly well together, such a great dish! Portion for this dish was so big, not kidding, that it could've filled me up if I ate it all myself.2: Tabouleh: Again, potion so big, we all could't finish. Big bowl of green yummy salad, so lemony and minty. We kept it with us throughout the meal and used it as a side.3. Sujok: Dry sausages sliced and sautéed with garlic and a hot chili pepper sauce. A bit over seasoned, but the complimentary pita puts a cut on it.Entrees:1. Artichoke Beef Stew: Big chunks of artichokes and beef cooked in a yummy stew, but a bit on the salty side. The sauce was very beefy, and artichokes had sorta like a potato texture. 2. Combination Platter: Three different types of meats including chicken, beef, and lamb. We found the dish on the salty side as well. Ordered the meats to be cooked well done, cooked too well that the meats were very dry and tough. Dessert: 1: Mediterranean Ice Cream: The scoops of ice cream that includes pistachio, chocolate, and ashta (sweet cream). Not sure if the flavors are homemade, can't really describe the texture of the ice cream, had a melted cheese texture, but still really good settled flavors.2. Knafeh Harissa Crossover: This item is off menu and is on a daily special. It's a fusion of their most popular dessert, Knafeh, missed with another one of their dessert which is the Harissa cake. Lovely combo, but I still preferred the Knafeh more. The coconut cake is soaked in a  rose water syrup which made the dish very elegant. Overall food was good, despite most of our hot dishes were a bit too salty for us. But the food portion on the other hand is well worth the $25 per person! All the dishes put together could have easily fed 6 people! Thats a lot of food, at least I can take it to go, I love leftovers!"], ["Geos B.", "I have nothing bad to say about this place!Service and atmosphere are superb, and then the food and drinks arrive! I have never had a bad mouthful in there, the food is just wonderful. You really need to try this place, you won't go wrong, it is middle Eastern cuisine at its absolute best!"], ["M S.", "This place is amazing; you will love the atmosphere and service. Food is tasty, and fresh, try kunafa as a dessert it'll blow your mind...."], ["Lilia B.", "One of my favorite restaurants in all the five boroughs. I don't mind the trek to Bay Ridge from Queens because the food is simply amazing. Try anything on the menu and you'll love it (except perhaps the Mlookhia leaves which is really an acquired taste). The lamb melts in your mouth, the vegetables are tender and full of flavor and the rice is rich with delicious aromas. Service is equally excellent and Chef Rawia always watches with kindness over her customers. GO NOW!"], ["Diana H.", "Wanted to try this place for a while now. Came with one of my girlfriends on a Wednesday night and it was pretty busy. A lot of reservations were made(we didn't make one), but saw reserved plates on a lot of tables. However, we were seated instantly. So ++++ being that we didn't make a reservation. Our waiter(didn't get his name) was very attentive and checked up on  us when needed.Now the food. Baked Kafta - We got this in the tahini sauce which went well with the lamb and potatoes. He let us try the tahini sauce first too, to make sure we liked it! Great guy, great guy! Great flavor but the tahini sauce got a bit overwhelming after a while. But still amazing. Bell Peppers - This was so good. It was filled with flavor. Basically stuff peppers with rice and meat in tomato based sauce. You get a red pepper and a green pepper. Weird to say but I like the red pepper more, perhaps the red peppers are sweeter and adds a kick to the rice? But very good dish overall. We didn't get to finish everything. I was looking forward to dessert but I overstuffed myself and didn't space room for dessert. How does someone not have room for dessert? I know. Bummer. I will be back next time to try it though!"], ["Ryan L.", "If you have bad service, it doesn't matter how good the food is.Overall the food was good.  We ordered the baba ganoush, fatoosh salad, and mixed grill.  The cracker-like pita and regular pita were the best parts of the meal.  The meats of the mixed grill were over-salted and average.Onto the service.  Don't you hate going into an almost-empty restaurant and the hostess asks if you have reservations?  She then proceeds with a \"ok let me see\" and makes a face as if it's going to be tough to seat us.  I know this restaurant is pretty famous now, but get over yourself.  There were nice 2 seat tables with one sided booth seating, and stand alone 2 seat tables by the window.  The hostess proceeded to seat us at a 2 seat table not by any windows and sandwiched behind a large 6 person party and in back of another 2 seat table.  We decide what we want and close our menus.  The waitress is busy chatting with another server.  5 minutes later she takes our order.  I've never had a waitress or waiter start the interaction with so much attitude.  No hello, just what do you want with an attitude, eye squinting and grabbing the menus from us.Throughout the entire meal, the waitress does not come check up on us.After we are finished, we place our utensils in the plates and sit back to chat.  We chat for 5 minutes, no one comes to take away our food.  We chat for 10 minutes and no one comes by.  Finally after 15 minutes, we hail another waiter who comes and takes our food.  We receive our leftovers to go and have a plastic bag sitting on our table.  The waitress doesn't come by to give us our check.   Finally my girlfriend waves at her and asks her for the check.  She glares at us, doesn't say a word, and points to someone else who is apparently getting us our check.  There are much better mediterranean restaurants around - Cafe Mogador in East Village, and Fatoosh in Brooklyn Heights are both awesome."], ["Conni M.", "The restaurant exceeded all my expectations from the appetizer to the dessert.  My girlfriend is Lebanese and her mom or auntie made many of the dishes we had for dinner when she was growing up, and she vouched for the authenticity and they flooded her with warm memories as she ate.The meal started with toasted pita and some pickled veggies and then we ordered the red pepper and walnut dip with pomegranate molasses and the appetizer special which was chicken wrapped and fried in a filo dough.  Both were pure perfection!  For the entree, I had the lamb stuffed eggplant and she had the chicken kibbee.  Both were amazingly delicious and perfectly seasoned.  For dessert we had the wheat encrusted baked cheese with nuts and rosewater and we scrapped our plates clean.Service was polite, friendly, courteous and impeccable.  It felt like every waiter in the place checked in on us to ensure our happiness.  Bravo to the chef, owner and staff!"], ["Susie H.", "You can't go hungry here. Nope. Not possible. We starts with a cold appetizer sampler in which you get to pick your items. We did cauliflower, Brussels sprouts, hummus and some red pepper dip/spread. I don't even like cauliflower but this was good.  But it pales I'm comparison to the red pepper dip. That was lick your plate good. We also did a flatbread with spiced chicken which was really good. I did the small falafel for my entree. And after all those appetizers I could barely finish it. But it was good. Service here was superb. Nice clean atmosphere. Can't wait to come back. Heard the mini pies were good as well as the stuffed cabbage."], ["Judy F.", "I'm saddened to learn they changed the menu and chef. They no longer have the option of making a sampler platter from its appetizers menu. The rice noodle pilaf that accompanies many entrees is now soggy and lacks the flavor that previous chef had achieved. The cucumber tomato parsley salad that is served on every entree lacked flavor. Granted, they cooked and spiced the chicken kebab harmoniously and deliciously. The Shepherd's Pie was dry.The Short Rib is/was delicious.The restaurant decor and ppl are still nice. If you're going there on a Friday or Saturday evening, Call to make a reservation. It's full house."], ["Matthew G.", "Tanoreen is easily my favorite Middle Eastern spot, and also one of my favorite restaurants in all of Brooklyn.The food like others have said is just something you have to experience. Everything I've ever had at Tanoreen has been off the charts. Their hummus and grape leaves, two staples, are always fresh and always on point. They have a great menu from appetizer to dessert. It's really a great place for a quick lunch or a nice sit down dinner with a date or friends.I've never had a problem with the staff, and the owner is almost always visible walking around and talking to her customers making sure everyone is satisfied. All in all it's a great experience.Tip: Leave room for dessert and order the homemade Knafeh. It takes about 15-20 min since they make it fresh, but it's worth it."], ["Rocío F.", "I don't know what it is about this place but every time I come here with my husband no matter what plate we try it is DELICIOUS, every single time! We love this restaurant! Staff are so friendly, very nice environment and don't be surprised to see the lovely owner stop by to ask you how you're doing! She's so nice! Wonderful place A+ My favorite place in Bay Ridge"], ["Jesse F.", "I haven't dined in at Tanoreen yet, but it's become a go-to Seamless destination. The delivery guy usually shows up in a car, so waits have only been about 30 minutes. On the cold appetizer side, the brussel sprouts and the cauliflower with the pomegranate-yogurt sauce are divine. I think the hummus is delicious, and it comes with a very sharable amount of pita. The falafel is denser than I prefer, and the seasoning is not my favorite, so I usually skip it and binge on vegetables instead."], ["Christine M.", "My boyfriend and I went here after we walked around to see what we were in the mood for. This was one of few places that actually had people in it. We were pleasantly surprised. Loved the eggplant Napoleon- fried very well. We also had the kippe (so?) that was his favorite. Loved the kebab platter as well. Chicken was seasoned just right but was a little on dry side. The staff couldn't have been lovelier. Would definitely go back!"], ["Yy F.", "Found a really long hair in my falafel sandwich when I was almost half way through it.  it was so sickening. Its still haunting me.  I can't believe they didn't see that long hair when they were making the sandwich, the hair was at least 14 inches long."], ["Joyce C.", "Overall 3/5: Not sure they would be as popular without the Food Network review.Food 4/5: Kudos to the cooks.  Flavorful, large portions, and well cooked (ie. nothing chewy/under or overcooked/over salted, etc.). We had musakahn, fisherman's meal, and something from specials menu with lamb and goat cheese yogurt sauce.  I liked the lamb most...it had a good tang from the sauce and the meat was tender. The fish came with a really tasty sauteed rice with really yummy spices (consider it a Mediterranean fried rice).Drinks 2.5/6: i personally would skip fancy drinks and go for  a vodka soda. If you're into fufu drinks....get the martini with grapefruit.  It reminded me of a slightly citrus-eey red Skittle candy. Really sweet drink, but watered down from over shaking (honestly a sad excuse for a martimi...perhaps don't call it a martini).  They need better specialty drinks (or a better bartender...)Staff 2/5: This is their biggest flaw, and the biggest reason for not more stars. Hostess was not well trained and rude with greeting me at the door. Other than my waiter the staff looked like they didn't want to be at work. This was a Tuesday night...wasn't crazy busy, and there were enough of them working, so there's little reason to look so miserable and angry.Price: More expensive than typical Bklyn restaurant. You can argue that it's a lot of food, but anyone who cooks knows adding a side salad and an extra cup of sauteed rice does not cost that much more and in that case....the experience is what counts and lack luster staff makes me question their pricing model."], ["Rayhan S.", "Given that I've had middle eastern food from a majority of restaurants in New York, I was truly looking forward to my date night dinner at Tanoreen. However given the hype and price, I was grossly disappointed. First off let's get the positives out of the way. The ambiance is great and works for both a large gprup outing or a more intimate dinner. The walls were adorned with middle eastern decorations. The service was great and the waiters were very attentive at refilling the water and knowledgable about the dishes.Now the negatives. The food is bland for the most part...period. We had the eggplant Napoleon which was overpowered by the baba ganoush. The second appetizer was the Mushkaan which is a pizza topped with chicken flavored by middle Eastern spices...this was truly delicious. The main course was the mixed grill platter which consisted of paltry cubes of chicken and beef and two small lamb sausages served in a sea of rice and salad overpowered with lemon. And that bit costs $21. I've had food at zaytoons and at Istanbul in Brooklyn as well as various restaurants in Astoria. But Tanoreen was by far the worst. If you want a nice ambiance with dry and bland food that will leave your wallet lighter then give Tanoreen a try."], ["Wojciech R.", "My wife and I were visiting NYC from Canada and we found Tanoreen based on previously-written online reviews.  This is a wonderful Middle-Eastern restaurant and indeed it is worthwhile to make the trek down to south-western Brooklyn for this food.  The restaurant has a nice interior decor, and when we were there, on a Saturday late afternoon, it was busy --- always a good sign.  The waitress and staff were polite and helpful.As for the food, well, we had two appetizers and then two main dishes.  The cauliflower salad was amazing.  I admit that I am partial to this vegetable, but it was wonderfully carmelized-fried and the pomegranate molasses was a nice touch of flavour  And then the hot appetizer, Musakhan, a flat-bread with chicken, wonderfully-fragrant (with sumac) and with toasted almonds.  Both my wife and I could have eaten second and third servings of both these appetizers without hesitation, but we still had the main courses coming: my lamb with yellow-rice was very nice and my wife had a generous portion of chicken with potatoes --- all with lots of delicate spices and herbs.  Excellent food and large portions (we had to ask to have some of our food packed to take home).  As I said, if you live in NYC and you want to try first-rate Middle-Eastern food, head to this restaurant; and if you are visiting from out of town, dinner at Tanoreen is well-worth the trek out of Manhattan into an otherwise non-descript part of Brooklyn.  I look forward to eating at Tanoreen on my next NYC trip."], ["Carole S.", "I ordered take-out food since I  wasnt able to get their.  Normally I ordered from Sally & George on Third Avenue but they were closed for renovations.  The food I pursched from Tanoreen found its way to my garbage can almost immediately.   The Fatoosh, hummous, baba ghounagh must have had my family (from Damascus and Homsey) rolling in their graves.  Im not sure how they got they rating they did - they must have paid someone off.Do not waste your time or money to dine at Tanoreen."], ["Maria S.", "Just tried the well known restaurant. I have ordered a pick up. I got chicken shawarma sandwich- which is not good. I has pickled cucumbers- tastes awful. Pita is not fresh. And extremely citric. Its more lettuce, few tomatoes shreds and a lot of oil. I guess from chicken. Also I got not fresh babaganoush- which has tht much vinegar tht makes it impossible to eat. Plus what u can really taste is oil. Nothing to compare to Pita Pan which serves fresh only!! The most amazing food."], ["Jewel A.", "First time I came here I wasn't in love with their rich cream-based entrees but oh gosh, they grew on me and I miss their delicious starters. If you are coming here bring a family or large group, their dishes are great for sharing.The hummus and harrisa and pickles are all so yummy. I wasn't so fond of the chicken fetti at first(nauseatingly rich, heavy and mild/bland) but it has grown on me. The crispy chips on top make it a nice textural contrast and the platings are beautiful.Service-wise, it's a bit cold/impersonal but not outwardly hostile. There was one weekend lunch where we attempted to flag a waiter/waitress down for the check but ended up meeting the gaze of the blonde hostess(Marilyn Monroe perm) who completely ignored our call despite having greeted and seated us earlier.It seems Rawia is the only one who puts a smile and indulges in idle pleasantries with her customers, the waitstaff just seemed uptight or not in a sunny disposition as she was. Either way, this doesn't detract us from enjoying the food. I would love to give Tanoreen a confident 5 stars but the service leaves something to be desired."], ["Sonny S.", "Definitely one of my favorite restaurants in NYC. For me it's a place for special occasions because it's a bit on the pricey side, but worth every penny. I'm a vegetarian and love the variety of mezze they have...all so flavorful and fun to eat. I prefer sharing a bunch of small plates versus the veg entrees. The absolute must eat here is the brussel sprouts. I'd be happy eating them every day. The cauliflower salad and red pepper spread were also memorable. The fatoush salad is the best I've ever had. And for dessert, the knaffe...oh the knaffe. A special experience for sure."], ["Britney F.", "So, I'm new to Bay Ridge, and I decided to try this place out.First of all, IT IS AMAZING!!! We got the Brussels sprouts which had an amazing tangy sauce and cooked to tender perfection. Second, the lentil rice (Mujadara) was spiced well and cooked great. The crispy onions gave it a nice texture. The kabob sampler was nice and light with the perfect amount of citrus to chicken and spice to meat. New favorite place, and if you're gluten free, THIS IS A BLESSING. I would totally order this once a week. Such a treat!"], ["Britney F.", "So, I'm new to Bay Ridge, and I decided to try this place out. First of all, IT IS AMAZING!!! We got the Brussels sprouts which had an amazing tangy sauce and cooked to tender perfection. Second, the lentil rice (Mujadara) was spiced well and cooked great. The crispy onions gave it a nice texture. The kabob sampler was nice and light with the perfect amount of citrus to chicken and spice to meat. New favorite place, and if you're gluten free, THIS IS A BLESSING. I would totally order this once a week. Such a treat!!"], ["Jeremy M.", "Really good mediterranean food.I went there for lunch on a Saturday with my israeli father-in-law.  We ordered too much so we could try a few dishes.  Everything was tasty and flavorful.  Better than most mediterranean restaurants I've been too.  Only negative is that the prices are a bit higher than I would like for lunch ($18-25 lunch entrees) but the portions were huge and we both had leftovers."], ["Stephanie L.", "I always knew I liked Middle Eastern food, but Tanoreen just turned my love up a notch.  This place looks nice and walking in I figured \"sure, they probably have good food\", but holy smokes!Two of us stopped in for lunch and decided to share two appetizers and one entree.  First off I'll acknowledge that after the appetziers we were stuffed.  Portions are generous across the board.  The decor was nicely done and definitely a middle eastern vibe.  There is booth and table seating, and I think it's friendlier for parties of 1-4 though I'm sure they can fit larger groups.The Eggplant Napolean I'm pretty sure is the food of gods.  When asked the \"what would your last meal on earth be\" question, I'm adding this to my answer.  Crispy breaded eggplant layered with baba ghanouge and a side of refreshing tomato basil salata, it's rich and well textured with the perfect lemony/ herbal zest of the salata.  Let me repeat, this is AMAZING.  Go, eat it, you can thank me later.Musakhan was our other appetizer and also fabulous.  A crispy flatbread topped with seasoned chopped/pulled chicken.  I'm not typically a big time meat eater, but with so much flavor and the crunchy flatbread it was sensational.We tried working our way through the grilled combo, but as mentioned, the appetizers filled us pretty well.  If, rather, when I go back to Tanoreen I'll probably stick to the appetizer menu so I can try a larger medly of the fabulous treats they serve.NOTE: There's also a walk-up take out window to the side of the restaurant.  Apparently the shawarma sandwiches there are epic."], ["Anne Y.", "Great food with great staff. Every dish I have tried has been amazing and I have nothing bad to say about it. The place is usually packed and parking in Bay Ridge can be quite difficult."], ["Alicia F.", "We came here late one evening on the recommendation of a friend. I had never had Lebanese food before, but I generally like most Mediterranean/Turkish cuisine and had heard this was similar. Upon walking in, this place was much more upscale than I anticipated--I think I was expecting a take-out type place, but this is much more of a nice sit-down, date night type restaurant. Appetizers start around $10 and entrees are in the $20 and up range.The menu has a TON to choose from: hot and cold apps, entrees, daily specials, with every veggie/meat and non-meat combo you can think of, plus a wine list and 961 brand Lebanese beer. We started off with mhammara, a red-pepper dip served with both crispy and soft pita breads. It was delicious! The crispy pita bread was like a thin pita chip, and definitely my favorite part of the appetizer, haha. This was followed by schwarma sliders, which came with tomatoes, parsley, red onion, and yogurt sauce on the side for a customizable slider experience. We then had makdous, a cold app consisting of eggplant in olive oil stuffed with walnuts. For our entree, we split the lamb shishbarak, fried lamb dumplings served in a yogurt-based sauce and served with vermicelli rice. So hearty, so filling, and so unlike anything I've ever had. Left here stuffed and dreaming of crispy pita bread... if you're looking to break away from the usual Thai or farm-to-table cuisine for an evening out, head to this place."], ["Dona F.", "Been here a few times. Very nice atmosphere. When the owner is there she walks around the tables getting feedback. If youre a vegetarian you may be pressed finding a non meat entree . You need to love lamb, however there's enough non meat appetizers. The best part was the za'atar crackers which is their version of bread. Dips as well."], ["Mj L.", "I've heard so many wonderful things about this place.  My first visit was this past Friday during the 3rd Ave summer stroll.  The food was excellent.  I ordered 2 apps as an entree, the lentil & Brussel sprouts.  Both were very, very tasty.   Considering it was an extremely busy night because of the outside tables, I'm going to give the service a break but it was painfully slow & took forever to get a drink.  I will say prices are a bit high especially for Brooklyn but overall it was a great meal.  I'd definately go back & recommend for something different then the several northern Italian restaurants in Bay Ridge."], ["Gina B.", "We order take out from here all the time.The brussel spouts are to die for!  Same goes for the carmelized cauliflower.  Yum!We also love the eggplant napoleon."], ["Michael G.", "Okay so I love spicy food, I add layers of chili to my foods and I love Thai and Indian cuisines.  So if you are coming here .... it does not contain that.  So if i am literally addicted to chili why am i giving this place 5 stars.  Because Tanoreen is excellent in its own right, and is not about spiciness but about a balance of flavors aka middle eastern spices with lemons and middle eastern herbs and it is the best in the city.  This food is well spiced NOT spicy.  It is so flavorful and delicious and is even worth the pain in the a** parking wait in bay ridge.  So here is what i would recommend.Muhammara - pomegranate infused pepper-walnut dip.  Sweet, cuminy, delicious.Eggplant Napoleon-cool, smoky from the babaganouj, basily, tomatoey, garlicky, and simply delicious.  Turkish salad-lemony and red peppery and oniony, described as very spicy by the staff but trust me it is NOT AT ALL SPICY (then again i have a high tolerance), but i still loved it.  For me it isn't spicy, for others it might be spicy.  Musakhan - OMG, This dish right here is so amazing that it can bring world peace.  No seriously, the toasted pita, delicious succulent sumac-allspice chicken with parsley and almonds might be one of the best things I have EVER eaten. So come to this place expecting authentic food that one could easily find in Lebanon, Palestine, and Israel.  This is not a halal cart stand or a bar so please ignore the reviewers who are basing this place off of those preconceptions.  This place is for the appetizers.  Bon appetite! PS,  I do not eat lamb but my father loves Lamb and thinks the lamb shank special is the best lamb dish of ALL time."], ["Nadia Z.", "Mediterranean food at it best! From crispy and delicious Halloumi to mouth-watering Baby squash stuffed with lamb, it delivers perfect balance of spices and cooked just right.Great selection of drinks, impeccable service and exotic decor - all came together to enjoyable dinner.It does get very busy even at early hours, so reservation is suggested - you can make reservation straight from yelp app if you on OpenTable, very convenient.Did not have room for desert, but will definitely try next time - Knafeh was looking delicious!"], ["Barbara S.", "We ordered the feta cheese salad, the hummus,  and, funny enough, fried chicken and french fries. The feta cheese salad was fabulous.  I had asked how good the hummus was and I was told it's the best in the area, however when I tried it I didn't believe it was as good as at least two places that serve them. I love prosecco so we each had 2 glasses. It was delicious.  I could have had a lot more. We ended the meal with baklava and harissa, a coconut cake. Baklava is my favorite dessert of all time if it's done the way I like. So in my opinion the baklava wasn't very good; a little dry. The harissa was superb, however."], ["Mariana P.", "Good Mediterranean restaurant, they have a lot typical Lebanese dishes and I really like their salads. I went on a Saturday afternoon to have lunch with my bf around 2:00pm and it was have full (Saturday nights its when it gets crowded) the service was implacable but the food took a little long. My boyfriend ordered the lamb dish (sorry I forgot the actual name of the dish lol) and I ordered the Mediterranean grilled chicken which was AMAZING the lean but extremely flavored juicy chicken breast marinated with the basil pesto was extremely tasty, the presentation was nice but the flavor was simply outstanding. I ordered my dish without rice and I asked to trade it for more \"Arabic salad\" that's basically chopped lettuce, mint, parsley, herbs, tomato, cucumbers, onions and a magical lemon seasoning. Unfortunately my bf didn't like his dish a lot, he said it was not that bad but still not good enough. Definitely my advice my advice would be to ordered the chicken :)"], ["Julie T.", "Just finished a marvelous meal of only hot & cold appetizers, a mezza if you will, & SO delicious!  Great atmosphere & fine Middle Eastern food. Nice to enjoy on a summer evening. A terrific Bay Ridge establishment, CONSISTENTLY EXCELLENT"], ["Julie B.", "After today, I am convinced: Tanoreen is my favorite restaurant in Brooklyn.  We have tried many of their dishes, all of them divine, incredibly flavorful, balanced, fresh, warming...the eggplant napoleon, the brussels sprouts, the kabob...honestly, I hesitate to suggest any one particularly dish because they are all wonderful.  I will say that the most enjoyable way to eat here is to think of it more as a small plates place: have a bunch of the appetizers and just one main. You'll thank me for it.We'd eat here every week if they'd open a location closer to Park Slope. Thanks for another wonderful meal (which included great service as usual).Tanoreen is a gem!!"], ["Yuval K.", "The best high scale middle eastern food in NYC.I've been here many times, never disappointed.The owner is usually around making sure her guests have a good time.The appetizers are great, and good to share with a group - try the roasted Brussels sprouts and the cauliflower.we usually take the main dish to go as we are full by the time they arrive."]], "Bedouin Tent Restaurant": [["Arlene P.", "I was getting lunch and ordered the leg of lamb plate. It was very good. I loved the salad. It was so fresh, and crisp. I loved the tomatoes and green lettuce. Now the lamb. It was good also. I am a salt person. So I like when my meat is salty but this was seasoned so well I didn't even want to put the mint  mayonnaise on it. It was not needed."], ["Piotre W.", "Best hummus in Brooklyn! Their food is consistent and fresh! Why not get a huge bowl of freshly made hummus here than go to a grocery store!!! Ps: it's actually cheaper!!! Love this spot! Their pitzas are great too!!!"], ["Jennifer C.", "Their pitas are amazing!!  The pita is baked fresh on the premise, and it truly transforms a humble pita wrap into an extraordinary thing.  I had the lamb pita, and the first bite was a revelation.  As I continued eating it, I soon realized that I didn't care much for the chewy lamb meat, and instead, I was more enraptured by the fresh baked pita casing.  And unlike a folded up piece of pita bread, resembling a taco shell, they rolled up the thin, hot pita like a burrito, and it made it a lot easier and less messy to consume.  I need to try to chicken pita if I'm in their hood next time.  I expect it to knock my socks off!"], ["Aaron C.", "I can't say this is the best middle eastern food I've had, but it was certainly good. The lentil soup is worth it enough to come back, so tasty! Falafel was nice and moist, though a bit too uniform in texture. The hummus was really good and and vegetables used in the sandwichy gf had and on the plate I had were really fresh. However, the meat was a bit dry in her sandwich and the bread that the meal comes with wasn't particularly amazing. We tried the harira soup which had cinnamon in it, something I don't think either of us have experience in the variety of food we've had before. Was pretty good, though the lentil soup was much better.Almost forgot, we had the stuffed grape leaves which tasted good, though were drier than expected. Could be the more authentic way, though would have preferred them to be a bit more moist.I think we'd come back, though I would probably stick to certain things. At the least, this place helped turn my gf onto middle eastern food, so cool beans there."], ["Ella R.", "Legit falafel sandwich. The bread really makes it.. so fresh and delicious! Will definitely come back to eat in the restaurant next time!"], ["Christine B.", "I heard the place was good but for some reason I wasn't really feeling it when I walked in.  I was in a rush b/c I had to go to the airport in a little and it felt like the food was taking forever (probably actually 10 minutes) but then when I got home and ate my fresh pita with chicken plate, it was undeniably delicious.  Will definitely be going again.  The end."], ["Meital B.", "Very good authentic middle eastern food and the house made pitas are lovely. Being a vegan, this place defiantly offers many good yum options to choose from The service on the other hand, is terrible. You need to yell to the waiter to make him notice you even when it's barely busy. And when he does, he is not really interested in providing any service at all. I don't accept this. Don't see myself coming back but who knows.."], ["Joe C.", "Great authentic no frills spot. the falafel and hummus were great. The pita is made right there and smells amazing. Update: I went back a few days later and tried the pitza with marinated chicken, so good! The pita bread is so fresh and the spices are amazing. I was planning on only eating half but.....ate it all"], ["Adrien P.", "I walk in to find old, moustached dudes making fresh pita in a big ol' brick oven. Kinda already sold.Old school and to the point: fresh and simple ingredients, rustic and inviting. VERY reasonable prices: Big felafel sandwich for under five dollars? Bang.So glad I came upon this place. I'll be coming around often."], ["Richard C.", "Very good food. Fresh pita, Love the hummus. Lamb gyro delicious. It would have been 5 stars if not for slow service. 1 server for the whole restaurant."], ["Darlene H.", "Always fresh ingredients make this a lovely weekend lunch choice! I'm never disappointed in the food, although the decor and service could use a step up."], ["Juan J.", "The spinach and cheese pie definitely deserved a 5 star.  Their freshly made pita bread was awesome!!!  The best thing is the tiny garden in the back that is full serendipity.  We will definitely be back!"], ["Chayenne S.", "I had heard so many good reviews about this place that I was looking forward to some good middle eastern food when my friends suggested we go.I have to say though that the service we received was poor, poor, poor. The server came to ask us if we were ready to order and when we said we just wanted hummus and pita to start with he became very short with us and seemed to get annoyed. How many pita did we want? Well, we didn't know how many to ask for. Would one be enough? Two? So we ask him how many we should get, how many people can eat one pita, etc. and he kept cutting us off and asking the same things. Did we even want hummus? All with an attitude.So eventually he comes out with probably the best pita I've ever tasted and then leaves...where's the hummus? I ask him next time he comes by if the hummus would be coming out and he says \"You did not ask for hummus!\" And I say, \"oh, okay well then could we get a hummus please?\" He stalks away annoyed even though we clearly ordered a hummus.Then, the fourth member of our party showed up just as we were placing entree orders. He hastily orders the chicken plate from the menu so our server wouldn't have to come back to him after taking our orders.15 minutes later our food comes out. No chicken plate though. So we guess that his will be out shortly. We wait and wait and wait and deduce that this food it NOT coming. So he flags down the server as he goes to help another table and says \"don't worry about the chicken plate, just cancel it.\" And the server just says \"ok\" and keeps walking. So our friend sat there with no food while the rest of us ate because of a rude server who he didn't want to piss off anymore.Also, the lamb sausage sandwich was just okay.I want to say that this was just a one off bad experience but having worked a long time in food service I can't excuse this truly terrible service. I hope other customers have a better experience."], ["Nga C.", "You really can't beat a place that can make their own pita from scratch!!!A few of us came here for lunch on a Sunday and saturday at their back patio. It's not the greatest patio but it did serve it's purpose as the weather was really nice that day and we weren't being distracted with by a passerby walking on the street as we're eating.I ordered their grilled chicken sandwich with tahini. Unfortunately the chicken was a bit rubbery and it wasn't grilled as advertised--very disappointing. Instead, it tasted more like saute chicken with paprika, nothing special. Normally, I would have given them a three-star rating for this, but when I had the chance to try both my friends Pitzas, I was immediately taken back and thought WOW! Their Green Pitza that include leeks, scallions and fenugreek with light mozzarella cheese was so good. It had a light onion smell but not too strong with a mild after taste. They also did not skimp out on the toppings so the pitza was really rich and cheesy. Their Lambajin middle eastern pitza with lamb, onion, tomato, parsley and spices was just as yummy. It wasn't gamey and left a sweet after taste from the veggies, tomato and spice. Overall, I really enjoyed my time here and watching adorable sparrows popping in and out of the surrounding trees was delightful and tranquil."], ["Clemens W.", "I was on a mission in Brooklyn yesterday to eat a nice brunch with my gf and then play GTA V for the entire day.  Instead of stopping at a place with a \"brunch menu\", my gf told me she used to love the backyard seating here and freshly made middle eastern pitas.  Sold. I had been craving hummus and lentil soup for some reason and this satisfied all my needs.We ordered:* Garlic pita - huge chunks of garlic toasted perfectly (probably bad for dates because I smelled like garlic the entire day)* Hummus - creamy and fresh* Pita - I love it when it comes served all poofed up and I get to pop it. the little corners that I peel off create pockets that soak up the lentil soup and make little middle eastern soup dumplings* Lentil Soup - creamy and lentily.. as expected* Lamb leg sandwich - the tastiest $7.50 lamb sandwich I've ever had. It's seasoned well and a great portion.We wound up taking home the rest of the garlic pita and the extra pita that came with the lentil soup. Snacking on oven reheated pitas while playing GTA V made me more than happy to write a good review about this place. I think I'm just in a really good mood."], ["Vinny M.", "The best Mediterranean food in downtown Brooklyn.The decor is bit rustic & its a cash only place but the bread is fresh, food authentic & too good.Went with a big group for lunch & all of us came back groaning after running through the menu. Its difficult to work after a lunch like that."], ["Goonersainter D.", "I took my two sons there after it was written up in Gothamist as one of the best falafel places in New York. It was really good! The service was excellent and attentive and the food was fab. I had a falafel plate and the boys had lamb \"sandwiches\", which came in pita bread wrapped tight in foil. I'd go back there again."], ["Jennifer N.", "So this place has a bird problem.  You'll discover it quickly if you sit in the lovely garden as we did today. You will be sitting, perhaps chatting with a friend, when the pooping will begin.  We saw the woman next to us get crapped on, and we thought, \"that's too bad,\" and then we started to get crapped on.  It turns out that this lovely garden space with its fountain is a bird-magnet, and we all know that birds love to bathe and love to poop.  All of this to say, I can't recommend sitting outside. Then again, I can't really recommend sitting inside either.  As many have said, the service is leisurely, which would be fine if the food were extraordinary, but I had exactly what I normally get at Black Iris on Dekalb-- the veggie platter-- and I can honestly say Black Iris is about 500x better. Beoduin featured tasteless beets, very sour baba ghanoush, teeth-chatteringly cold grape leaves, and some fine tabbouleh.  It is true that Bedouin is cheap, and that their warm puffy pita is delightful, but everything else is just mediocre."], ["Marques J.", "I stumbled onto this restaurant after leaving a nearby coffee shop. The smell of the \"Pitza\" peaked my curiosity, so I stopped in. The wait staff was extremely friendly, and the food was amazing. The spinach-cheese pie is arguably the best calzone I've tasted, and the Vegetable Pitza was outstanding as well. Their fresh ingredients, generous portions, and welcoming atmosphere made for a memorable lunch. I will definitely be back. Highly recommended."], ["Patrice H.", "Pretty darn good!! I wish I had more time to enjoy my meal. Decent middle eastern food at a reasonable price. This is a great little restaurant to duck into for a nice little meal. I recommend the pitzas, hummus, and sharing a salad with someone else!"]], "Zizi Limona": [], "Istanbul Park": [["Heather B.", "This is one of my very favorite delivery options. I haven't been to the actual restaurant so can only speak about the food, which is delicious and comforting! I think my favorite things are the zucchini pancakes with dill dipping sauce, Turkish bread- which I admit I order to freeze and then serve with pasta since it's so good and only $1.50 (!) and the amazing rice pudding. I love the pudding so much I've commented that I wonder if it would be weird to just place an order of lots of rice puddings. I've tried the chicken kabob- delicious! Served over seasoned rice and chickpeas. Chicken is nicely charred but still juicy. Also had the Sultan's Delight - roasted eggplant purée with cheese, cream and chunks of chicken. This was very flavorful but a little heavy/rich. My Greek salad could have had a bit more feta cheese last time but it's still all very delicious, fresh and comforting. Recommend!"], ["Jazmin W.", "I ordered delivery from here last night. There aren't many late-night seamless options in my area, and I was surprised to find Istanbul Park on the list. I ordered the Chicken Sauteé which came with rice and Turkish bread. The menu says it's supposed to come with lettuce and some other veggies but for some reason that was not included. I was expecting the dish to be reminiscent of halal cart food from the description, but in actuality it was more like a stew. A little disappointing because I had a different picture in my head, but I was not disappointed by the flavor of the food. The chicken and veggies in the dish were cooked well, the \"sauce\" (liquid part of the stew-like dish) was good too. The bread seemed really fresh for it being delivered at 12:50 am (well within the estimated delivery time, another check on the list). I think the dish was a little pricey especially since the description didn't match the outcome, but it was a nice portion. I would definitely keep this in mind for future late-night delivery places and try something else with fingers crossed that it looks like what it's described as on the menu!P.S. They charge .25 for \"white sauce\" and hot sauce. The white sauce doesn't really have any flavor, and didn't compliment my dish at all. The dish should come with white sauce so I wouldn't add extra to your order. Hot sauce was okay."], ["Bader A.", "The food was delivered quickly and it was delicious. The only thing that I found that food tasted somewhat salty. This doesn't mean it wasn't delicious, I just don't like noticing the level of the salt.I recommend for sure"], ["Nancy N.", "Two words. eggplant salad. Instabul park also catered my son's birthday party. Large portions, good flavor and reasonably priced."], ["Mira M.", "You can tell the ingredients used here are fresh. I ordered lunch for the office & everyone was pleased! Definitely would recommend :)"], ["Leo L.", "Excellent Turkish food.I love to eat in and take out, I do both very often. The food at Istanbul Park is very fresh and healthy. They offer lots of Fresh meditereanean salads, Humus, Eggplant salad, Yogurt Dip, Spinach salad etc. If you want to try them all just order the \"Mixed Salad\" Platter which comes with a lttle bit of everything.They Turkish bread is off the hook, they serve it hot and unless you are familiar with Turkish bread, you've probably never had anything like. The bread is complimentary with most meals your order but if you want extra it will cost you about $1.They Lamb Gyro and Grilled meats are also delicious and fresh tasting. Start with the Gyro platter which comes with rice and salad, then work you way to the mixed grill platter which comes with a little of all meats.I love their lentil soup, their lentil soup is a must, light and flavofull.They are open everyday and deliver late, passed 12am, if you live in the neighborhood you are in luck, they will deliver late and everything arrives to your door fresh."], ["Oli G.", "I have ordered in several times from this location, they are fairly consistent with the quality of the meals. However the last time the chicken in my order was not completely cooked, which surprised considering it took over 45 minutes before my order was delivered. The red sauce was flavorless compare to other times. All in all I would probably try it again because the there aren't too many options (mediterranean food) near by that delivers at a fair price."], ["C. J.", "Great food and great customer service. Only complaint would be waiting over an hour for the delivery but I think most places in PLG wait for more orders to come in before making the deliveries. They even gave us complimentary trail mix with our first order-how sweet :)PS-the rice pudding is amazing!"], ["Zenovia E.", "Crunchy balls of fried falafel, hummus atop a little bed of shredded salad and perfectly cooked rice with chickpeas = more please. The falafel dinner rocks, but pita isn't included. Say what?$5 wine options. No, they're not going to win any awards in Napa or elsewhere, but did you catch the $5 part?Food is pretty inexpensive.Now, the not so good:-Zucchini pancakes = Dense, sweet, too greasy and huge for an appetizer-Fried calamari = No seasoning-Service = Fine, but slow at times since there weren't many customersIn general, a fine option if you get the falafel."], ["Hannah M.", "Yum yum yum. Our family decided to have a picnic put in Prospect Park since it has become warmer now. This place is situated ideally just 2 avenues away from the park. We called ahead about 30 mins and only had to wait a few minutes before the food was ready. They were super helpful in adding plates cups and utensils too.We ordered a lot of food for 6 people and the price was not too bad. We had 4 appetizers and 4 entrees and it was more then enough food, we had a lot of left overs. It also came with a ton of pita bread. The only reason I give it 4 stars instead of 5 is that one of our dishes was way over cooked and not very tasty. That was our shrimp shish kebab. We also ordered chicken shish kebabs and lamb shish kebabs and those were great, but the shrimp was not seasoned well and was too dry. Next time we get hungry near the park this will def be our go to spot."], ["National H.", "Really solid option for Turkish/Mediterranean in Park Slope. I get delivery through Seamless from here too often because it always satisfies. As others have mentioned the zucchini pancakes are great, as are the Mediterranean Salad (surprisingly fresh and substantial), and the Spinach Lunch Special. However, by far my favorite thing to get is the cold appetizer sampler. What you get is a container absolutely bursting with a wide assortment of hummus, babaghonush, haydari (a thick yogurt with garlic and walnuts I'm obsessed with), stuffed grape leaf, and several others, all with their hot & fresh Turkish bread. The small is big. Get it and serve yourself some over a couple meals or share with the table.*I've never been to their location but I walked by and it looked nice."], ["Marcus Z.", "I absolutely love Turkish food. Even before I went to Istanbul this past year, I was hooked. And what's not to love? It's so flavorful and unique. That Ottoman legacy really did the trick for Turkish cuisine.Park Slope residents are lucky to have a Turkish restaurant in their neighborhood and a good one at that. Istanbul Park offers traditional Turkish dishes at a great price. Upon our arrival, we were promptly greeted by a friendly man who I assumed was the owner. He took our beverage order and brought us some delicious Türk cayi, or Turkish tea. For dinner, we started with a small cold appetizer sampler. It came with more or less all the cold appetizers on the menu in small portions accompanied by Turkish pide. Each individual meze was delicious in its own right and definitely freshly made. My husband actually filled up on the generous portions of the appetizer sampler but I was still hungry. I decided on ordering the Turkish classic dumpling dish known as manti. These are little dumplings about the size of a thumbnail filled with seasoned meat and served in a garlic yogurt sauce with spicy butter drizzled on top. For not being homemade (and by that I mean made by a cute Turkish grandmother), they were delicious. Just the right amount of garlic and seasoning. However, they did need a little bit of salt. I was thoroughly pleased with this place and I actually can't wait to eat here again in the future!"], ["Camille H.", "Delivery came in 35 minutes so that was great - I got the falafel and hummus, zucchini pancakes and baklava. It came with a huge pita bread and a bunch of sauces (tzatziki and salsa).The zucchini pancakes were delicious albeit a bit oily (you get 3 large pancakes), the falafel and hummus platter was huge - you get 9 pieces of falafel, a salad, rice and hummus. The only thing i didn't like is that they put the hummus in the plate with the food instead of on the side even though I specifically asked sauce not be put on my food.The baklava was delicious - you get 4 small pieces. I didn't have the pita or rice but the rest of the food lasted me two days of meals. I enjoyed the food and the price is reasonable - would definitely return."], ["Melissa G.", "Fast, fresh, reliable. In my top 3 Park Slope delivery restaurants. Order the chicken kebabs (served with rice and salad), Mediterranean salad, hummus, and/or lentil soup. Not sure about anything else on the menu, but those are my go-to's, and I've never been disappointed."], ["Christina M.", "I'm a huge eggplant fan.  If I can find god eggplant in any form - parmigiana, rollatini, caponata - then I'm in.  So, I'm thinking about this place from an eggplant perspective and, I have to say, the sauced eggplant and warm Turkish bread  earns an A plus.  The Turkish break is kind of like Indian naan and it goes well with everything. Also, this place has its delivery game down so it's a nice reliable place to order from in the hood.  I like their hummus and you can get a fresh, healthy meal pretty quick.  I've also eaten in and got the lunch special for $10.95.  It comes with an appetizer or salad and a sizeable entree, which is a pretty good deal.  We got a Mediterranean salad and the falafel dinner platter, which came with rice, falafel, salad and hummus.  Not bad.  Hit it up."], ["Matheus C.", "First time ordering here. Food is great. 4 stars for having to call them twice and for waiting one hour and a half for the deliver."], ["Michael C.", "A recommendation from a friend.  Excellent babaganoush and yogurt dip.  The other dishes fell flat a bit, but were still good.  Kataif- my favorite dessert- was a bit dry.  I'd return again, but if I don't love it a second time, there won't be a third."], ["Ariel S.", "I was desperate for something new on Grubhub but as usual in my East Flatbush section of Brooklyn you better play it regular than venture out as most likely it will disappoint and cost you.   I had been reading the reviews for this place and decided to finally give them a chance after careful reading of the reviews. I was advised to try their bread and that their fried calamari was a safe bet. The calamari looked rubbery and had a pale shade I wasn't feeling. The lamb kebab while tasty seemed to be missing some meat and sat atop some depressed lettuce and rice. (Sigh). The Falafel and Hummus platter didn't look great either and lacked any flavor although upon reheating for lunch the next day I got full off the hummus and rice while the falafel tasted like a sponge. Last but not least the infamous Turkish bread..........the highlight of the meal which isn't saying much. Can you believe when I opened up my order the bread had been tossed inside on top of my food containers without any paper napkins or foil or anything to cover it or seperate it. It literally looked like the bread was tossed in as an afterthought. I can compliment the nice cutlery that came with my meal, stable/sturdy plastic utensils with a wet napkin packet emblazoned with Instanbul Park. That was the nicest part of the experience. Maybe it just wasn't for me but for what I paid I did expect better."], ["Sherri H.", "My fiance & I frequently order delivery from here using Grubhub or Seamless. At first I was worried about delivery after reading other reviews, but I've never been disappointed. It always arrives within the stated delivery time. Sure, 45-60 minutes may be too long for some, but considering the distance of our apt it is reasonable and they tell us upfront so we know what to expect. We haven't been in person so if the portions are smaller when delivered, I wouldn't know, but the portions are HUGE. A small gyro platter is enough for a meal with leftovers, especially if you eat some of the fresh (and always still hot) homemade Turkish bread that comes with it. The lamb gyro is definitely my go-to favorite. It's addictively delicious, so tender and flavorful, and so are the salad and rice. They put chick peas in the rice which I personally love but my fiance does not, so extra chick peas for me! I'm also a huge fan of their lentil soup (with tons of lemon!).  YUM."], ["Cat A.", "I love this place!  So far everything I've ordered has been really great.  I got the Mediterranean salad with chicken and it was big.  The falafel and hummus is also really good.  My roommate ordered the chicken kebabs and he said they were awesome"], ["sara s.", "So glad I found this place. First, my husband and I often look for a place to get good food past the time of standard dinner time :) Second, the food is delicious and oh so fresh. Third, the owner is really nice and sweet. We had the falafel plate, liver, bronzini fish, and lentil soup. Everything was perfectly cooked. Note about the bronzini fish: it has bones. But it was worth all the bone picking. The place it interestingly decorated and very clean. Stop by for sit in or take out. You'll be happy you did."], ["Cali D.", "I ordered takeout of the chicken kebab. The dish was mostly rice with some ok seasoned chicken and some soggy veggies. The bread was the best part of the meal. The tzaziki was good but the takeout cups only arrived half full. I also ordered manti, otherwise known as Turkish ravioli and it was not good because there was no garlic yogurt sauce, mint or drizzled butter with pepper flakes."], ["Maeve O.", "First- great yelp offer that allows you a free glass of wine !!!! after checking in. They were super courteous when myself and my sister both took advantage of the offer, and even allowed my sister to show the promo on my phone after hers had died.Otherwise- the service was enormously friendly, though a tad slow. Us two and a table of 6 were the only ones there. The waitress urged us to order the zucchini pancakes - and I mean urged, it seemed from her description there was only one appetizer on this planet, and it was the zucchini pancakes. After all that fanfare, I can only report, meh. The food, similarly, was good, but not great. Standard meat / salad / rice combination that you find at Turkish places.If you ask me, Turkish food is always good, so what really separates a great Turkish place from an OK turkish place is the flavors, tenderness of meat, and overall freshness of the meal. I can only say that Istanbul Park comes in at OK for all three of those criteria. With all the other options in Park Slope and a terrific Turkish place around the corner from my apt, I don't think I'd go back, but thanks for the free vino."], ["P. D.", "Yummy large portions. The service wasn't really good by any means but I suppose that's too be expected in that sort of place."], ["Jane R.", "For the record - this review is based on delivery only.I've walked past this place plenty of times but have yet to go in. I ended up ordering from here one night because a similar restaurant didn't deliver to me. I ordered via Seamless.Ordered sigara boregi, gyro, and baklava. OHH SO GOOD!Sigara boregi is filo dough that has feta cheese and parsley inside. Think like a large eggroll except cheese inside. Was pretty good, came in 5 pieces. I ordered the \"small\" gyro which was $8. 75 and it came with rice, veggies and a delicious piece of turkish bread. It was definitely enough for 2 meals so I would assume the large would be for 2 people? It was a lot. Meat was tender and had great flavor. Also came with tzatziki sauce.The baklava was a good portion but came in little pieces, like it was pre-cut already. There were 4 pieces, maybe 2 bites per piece or so. Would most definitely order from here again!"], ["James W.", "Food is good here. But, delivery is horrible. The concept of delivering food isn't very complicated. As long as my food is delivered within the estimated time and comes to my front door then I'm happy. My food came during the expected time frame, but then I received a call from the delivery guy telling me that he couldn't find parking, and that he needed me to come downstairs to pick-up my food. I was in the middle of a work phone call and was very busy that day. When I got downstairs, I saw the delivery man standing outside with my food. He could have easily just walked into the building, taken the elevator up, and handed me my food. I have no patience for this kind of half-a*s delivery service. However, I would probably dine-in next time. Let's hope that the dine-in experience is better than their delivery service."], ["Nick J.", "I like this place. Fresh, tasty, and natural ingredients. I add a lot of hot sauce, but then I add a lot of hot sauce to everything."], ["Molly R.", "I ordered a chicken adana sandwich and a mediterranean salad for delivery, and both were very soggy when they arrived. The sandwich was cold and I had to warm it up before eating. I ended up not even eating half of it because of the sogginess. However, my husband liked his doner sandwich on the homemade bread. I bet the food would be better eaten at the restaurant instead of delivery."], ["Kevin F.", "Disclaimer:  The scope of this review is pretty limited since it was delivery and I only ordered one item.But hot DAMN I was psyched about this meal!Timing:9:32pm - Seamless order placed9:34pm - Order confirmation received9:57pm - Food arrivesService:  Definitely a step up from your average delivery guy.  Big smile and sincere thanks!Food:  The only thing I ordered was the Falafel Dinner Plate w/ Hummus which turned out to be a vegetarian home run.Basically what you get is a platter with like 10 perfectly-cooked falafel balls, a big helping of salad, and a giant glob of delicious hummus.  This is served with a large disc of some sort of heavenly bread which which is reminiscent of focaccia.  Everything was really delicious and the falafel was packaged in such a way that it stayed mostly un-soggy.  It was enough food that it EASILY makes two meals and I am SO excited for lunch tomorrow.  I feel a new delivery favorite coming on.  Wootywoo!"], ["David M.", "If you are looking for healthier options, avoid the gyro menu items. My favorite things to order are the Chicken Chops and the Lamb Sautee. All entrees come with bread and rice. The free salads are a complete waste of lettuce and they taste terrible; the restaurant owners should stop serving them and enjoy the higher profit margins."], ["Sandra M.", "I want to eat here every day!! The kofte kebab is awesome. As is pretty much everything else on the menu. The service is typically very good as well. It's one of my favorite spots in the neighborhood!"], ["Heather S.", "Went here to celebrate with friends and was not disappointed. We ordered falafel and zucchini pancakes for appetizers and I had the adana kebab for my entree. They also give you a bread basket, which is delicious. All the food was fabulous. We got our food pretty fast and the staff were all very friendly."], ["Judd S.", "Having recently moved to South Slope, Istanbul Park has become a regular place for me -- in fact, it is the only restaurant to get my 5* home award in the neighborhood. It does not get 5 stars for awesome presentation, atmosphere or creative chefing. It is not a place you come out of the way for. But Istanbul Park deserves 5 stars in its category - it does the standards well and in a very relaxed, easy going setting.One of the major reasons for this is that I tend to dine late and it is open until 1 AM, in a neighborhood where many places close at 10 and everything closes by 11. But that alone does not a good restaurant make. The food is always fresh and delicious and the space relaxed and pleasant. I especially like the Turkish bread and they have a number of unique hot vegetarian dishes that are great. One unfortunate recent change was to the lightbulbs, which used to be at least somewhat warmish and are now those 1000 watt extremely white compact flourescents, which just give the place and awful hue and give me a headache. Nevertheless,  It is Istanbul Park that has come to define the neighborhood and is now a comfort food basion."], ["Ralph d.", "Twice we have called this place with an order to deliver to our pharmacy. Both times we called back after an hour and were told they have no record of our order. The second time we received the food 2 hours later because \"they found\" the order sheet. The food was tasteless and very small for the price.  A coworker also believed there were little flies in the food but I think it was a spice with something that looked like wings. Never again"], ["Julie B.", "Pretty disappointed - had high hopes based on the reviews!When I went to order the lunch specials, I was told that the sandwich options are not available as a lunch special, despite what is posted on seamlessweb.  I was not offered the option of a platter, which I suspect would have been the route to go.I was told that the sandwiches would take 15 minutes, and I returned precisely  at that time. I live less than a block from here, and the sandwiches were cold and soggy by the time I made it home. There were 4 pieces of stringy, tough lamb on the kebab sandwich and a ridiculous amount of lettuce, tomato and onion covering up the shamefully small amount of meat. I specifically asked for no lettuce as I loathe lettuce on a hot sandwich, but sure enough, there was tons of it on there. The doner sandwich was similarly un-generous in terms of the meat - 3/4 of the sandwich was lettuce and tomato.If you must eat here for lunch, perhaps try the platters. The sandwiches were a huge disappointment."], ["M N.", "Great good but more importantly great ambiance. We've been there twice. The first time it was a to-go order and since the wait was quite long the owner gave us free soup. Second time we dined in and ordered lamb sheesh kabab (chunks of meat) and it was delicious. The restaurant itself has nice decoration, not like other halal places that are more like joints rather than restaurants. The servers are just okay ... Not extremely friendly but still friendly."], ["Vanessa M.", "This place was absolutely horrible! I went in for an early dinner and there was only one couple seated in the restaurant (that should've been a red flag). I always like to ask the waiters what their recommendations are before I order. I asked the waitress when she came around to take my order what she liked best, she then replied with an attitude,  \"I'm not good at this, last time I recommended something they did not like it\" (yet another red flag). However I was super hungry and decided to play it safe with the Chicken Adana. They brought the food out quickly which told me it was already made. I took one bite from the chicken and almost threw it up; the texture and taste were disgusting. The salad was not fresh, it was soggy and very cold, as if it had been sitting in the refrigerator for a few days. I told the waitress I didn't not like it and I wanted to order something different. She took the plate away and I order humus. The humus was edible and also the only thing I ate. The check came around and I noticed that they charged me for the Chicken Adana after I had sent it back nearly untouched. I told the waitress that I didn't like it and she went to grab the manager. Jason the manager told me he was the owner and that there was nothing he could do if I did not like the food. I told him I didn't want to pay for something that I did not eat. He then started to yell at me and threating to call the cops. The bill was 20 bucks, which I paid just so he would stop crying. I felt so ripped off! I only had water, bread and humus and I paid 20 bucks for that. Seriously, DO NOT gives them your business. This place gets two thumbs way down."], ["Maria R.", "This place is delicious! the Sigara Boregi had the perfect flavor and the falafel was to die for."], ["Elena K.", "Nice cozy place, loved the service there. My favorite dish so far is Sultan's delight. Also tried manti, unfortunately didn't like it."], ["Nina F.", "The food was very delicious. Tender and juicy meat (my favorite: the sultan's delight with lamb) and great vegetables. The desert menu was small yet delicious (Another favorite: baklava). A nice place to go to dinner with family. The atmosphere was nice. The service was decent but not perfect. I recommend this place to meat lovers, Mediterranean lovers, or just families looking to have a nice dinner."]], "Mimi's Hummus": [["Vegajitsu Y.", "Nice small joint in ditmas park, very cozy. We had the mushroom hummus which was really good, Mujaddara (interesting also good), and Shaksuka (nice and light without the sausage). I'm vegetarian BTW. Also friendly service."], ["Nathan N.", "For the past several years, I thought Hummus Place was the best in NYC for casual Israeli dishes, but I was proven wrong a few months back when I biked to Ditmas Park to have lunch at Mimi's hummus and have since made this a regular stop. It's a classier affair than Hummus Place, set in a small spot with cute tables and classic jazz playing in the background. The food is excellent -- I particularly am in love with the lamb kebab bowl served with mint rice ... LOVE. My only wish is that this place was a bit closer, or if they were to expand to other parts of Brooklyn, that one would open up in my neck of the woods (Clinton Hill!!!). We desperately need something like this here and it would do so, so well. Order the homemade lemonade, and of course the hummus. I also am in love with their shakshuka with merguez sausage. You can't go wrong with anything on the menu, honestly."], ["Kimberly W.", "Mimi's Hummus is my family's favorite place to get brunch in the neighborhood. The customer service is AMAZING, and I've never been disappointed by anything I've had on their menu. If you dislike hummus, then come to Mimi's Hummus and try some of the best hummus you've ever had. I think my go-to dish is the Shakshuka Merguez, but, as I said, everything's tasty here. FYI: Very small space. If you want to come here with a group of four on the weekend for brunch, then be at Mimi's Hummus at least 10 minutes before they open!"], ["Marisha Z.", "Cute place, fresh delish food, friendly service - what else can you ask for!? Try their humus and other dips, everything is really good here. The place is pretty small, so it wouldn't work for a large parties."], ["Nina M.", "Cute and simple place, with good Hummus and healthy food. I never met the owner, but i hope i will one day so i will be able to tell her that i just the place. They also offer take away and it remain fresh even 2-3 days after.One thing i didn't like, and that is the quality of the pita-bread they gave me, which didn't feel fresh enough, and kind of a contradiction to the fresh feeling the place give you."], ["M D.", "Awesome food. Shakshuka eggs, hummus with mushroom, braised beets. All delicious. It's a super cozy place and I love the woodwork in the space!"], ["Jay D.", "Mimi's has been one of my favorite places in the neighborhood for a long time! But last night we were disappointed to discover that the menu had changed, and with it came the removal of several of our favorite Moroccan dishes. As a vegetarian, it became a lot harder to order. The new dishes included vegetarian options but all of them were highly acidic and used eggs or cheese as the protein. That worked for me, but not my date. When we asked if we could still order something from the old menu, we were told that we could not.  Also, that they'd been removed to make the menu more \"sophisticated,\" which was a hard thing to hear as a person of Moroccan descent, because three of the absent dishes are beloved to my family, such as Burekas and M'jedra. Also a confusing descriptor, because while the new pita pockets were delicious, they were served without a plate, wrapped in wax paper, which reminded me of food truck presentation. Not more \"sophisticated\" in my book, but why make that kind of comparison in the first place? Mimi's, did you want to create a hierarchy within your great tasting food?So I'd still recommend Mimi's for delicious food and great atmosphere, but if you're a vegetarian/vegan/have dietary restrictions, look at the menu before you decide to return. Or maybe they'll reconsider something that other restaurants do, which is keeping the new menu but allowing folks that have been coming so long that they know the old menu to order the great dishes that are no longer listed."], ["Ragina A.", "Recently (last weekend) I brought a friend visiting from out of town to MiMi's and I must say, the visit was pretty awful. The service was slow moving as molasses, and when I got my dish (beef kebab with herbed rice) I was rewarded with crunchy, undercooked rice. The waitress quickly amended this issue but, c'mon...undercooked rice?!?My friend had the shawarma and was fairly underwhelmed with the seasoning level of the dish. I think the sweet spot for Mimi's is the shashuka, which I've had before (with similarly slow service) and was completely delicious."], ["Emily H.", "I loved this spot. Small and intimate, with awesome food that isn't a budget drain. The vibe is what stays with me most, a place where you want to go and talk and eat and hang."], ["Tracy C.", "The food is very fresh and yummy! The pita bread is warmed up and the hummus is smooth with extra favor from the mushrooms! The place is cute and small but very hot with no ac! I recommend this place for a good healthy meal!"], ["Ro C.", "Mimi's Hummus would've gotten a 5-star review if not for:1) Missing the mark by not including falafels on their menu. Seriously, hummus but no falafel? It would have been amazing to eat both together. 2) Our waitress who instantly went cold when I asked about gfree items. Listen, I'm not being trendy or whatever and if I am why the hate? I have an autoimmune disease that can potentially give me GI cancer in the near future; so please rearrange your judgmental face and try not to ooze skepticism when I inquire about such things. I'm not trying to change the menu, just gonna order what I can be allowed to eat w/o getting sick.Those israeli chocolate balls for dessert were the bomb tho."], ["Annei B.", "Annoying waitress. We felt rushed about ordering. We haven't put the food yet in our mouths then she came along asking how the food was. What the??? We felt rushed to finish our food. Their food isn't that great. It's a slab of tahini sauce and some meat and some eggplant here and there. Their tables and plates are tiny in contrast to their huge silverware. I kept on dropping my fork. No disposable napkins either. We got stuck on using the cloth napkin for everything. Cheapskate! Save your money and avoid this place!"], ["Raymond B.", "Simply amazing!The best labne I've ever had.  Possibly the best hummus as well.  Great service.  Cozy table in a window.  Open on holidays."], ["Kristina D.", "Mimi's Hummus is a really great and reasonably priced place to get delicious Middle Eastern food.  There aren't too many places in the area that serve hummus this good.  It's a very small and quaint space, so I don't recommend going with a large group.  Service was great and our server was very friendly and attentive.  We started out with the tahini hummus which was amazing!  I could have eaten that alone.  Next, I had the chicken couscous which came with chicken patties, couscous, zucchini, and asparagus.  The vegetables were so fresh and perfectly seasoned.  I didn't get to try anything on the dessert menu, but everything sounded amazing.  I'll definitely be back!"], ["Alexandru G.", "Loved this place. Came here with my fiancee and her aunt. Tried a few things:Mint&Sage tea : awesome. I make it at home now every day.Hummus w beef & pine nuts. Awesome. I eat hummus quite often, but can't say I enjoy it. I loved this and it was very flavorful, a bit of Moroccan flavor to it.Eggs poached in tomato sauce & lamb sausage which came in a small cast-iron skillet that kept the food warm : again, great, and a hint of Moroccan flavor to it in the sauce which was great; ordered an extra side of lamb sausage due to the awesomeness.The decor is minimalistic, but since it's a small lunch place, it makes sense."], ["Kevin Z.", "For what it is, it is great. A place for date and easy food.Would I consider this place the best food in the area. No way. Price is omg overpriced? First time going to a Mediterranean place where it's more about the ambiance then the food. Great date place for sure but definitely not a good dinner spot. Go a few block off on Ocean pkwy and there's  a strip of real Mediterranean food for 1/3 of the price.This is a small spot with bench outside where you drink your coffee and watch the hunky firefighters across the street. With many 2 seat spots, we have no problem finding a spot on a weekday. I will ask the waiter for suggestion or just go on yelp and look at the picture. It's not the food; it's just the ambiance. I will just go for 1 appetizer and a main course since they are pretty big portion for dinner. Have fun."], ["Dave K.", "I love this place.  The food is consistently great and the waitresses are the friendliest in town.  Some of my favorite things to get are the mushroom hummus, labne, shakshuka, chicken w/couscous, and kebab.  The only way you'll be disappointed is if you can't get a seat because space is limited."], ["Lindsey S.", "I've now had brunch and dinner here and I think Mimi's has been cemented as a neighborhood favorite for me. The flavors of the food are just awesome. I had the Iraqi breakfast brunch dish today and it was an arrangement of simple ingredients with varied textures and flavors to great effect. Fresh pitas are puffy and delicious. Space is cute and the seating arrangement is good- they fit a good amount of people in a small space without feeling like communal tables. Will be back!"], ["Julia F.", "This place is so darling, as is their staff and their Mediterranean twinged Middle Eastern cuisine. This is why it hurt my heart to learn a few days ago, that they were held up at gunpoint. Despite the trauma of that very recent experience, our waitress/hostess had the biggest smile on her face and was genuine in her love of the food. My friend and I were the sole people in there, after coming in an hour to closing time. I felt peckish; my friend ravenous. Both of us were satisfied with our choices. Loved the carrot and Bulgarian feta salad - salty, lemony and full of coriander seeds making it have a semi-pickled flavor. My friend's cauliflower salad and choice of hummus with black beans seemed to satisfy him fairly well. What was truly amazing was the wine he ordered. A wine so \"oak-y\" and earthy, it tasted like an old church in France. Name: Chateau Maris (Carignan, 2012). Find a way to acquire a bottle. It might change your life!My only meh moment was the Turkish coffee I ordered. It wasn't very robust; more like the watery \"Elite\" brand my ex's Israeli mom used to pass off to me as \"the same as Greek coffee.\" Um, no. I'm a spoiled, snob with that stuff. Refer to the Guloglu review. Otherwise, I want to envelop this place in a huge, protective hug. May it stay successful and a part of Cortelyou's fabric for years to come."], ["Cori C.", "This is a tiny, cosy little spot, but you're in luck if you manage to snag a table. I think by now I've had everything on the menu and it's all been delicious. My dad loves to eat out, but always wants something healthy, so this is his favorite spot when he comes to visit. Not a lot of places on Corteyou serve dessert (which causes me much heartache), but this is the sort of the place where you should just order all the options and split it. The service is always good, since the staff is always within 20 feet of you, so it's not like they're going to forget about your table."]], "First Oasis": [["Diana M.", "The waiter is amazing, the business is family owned. The food is so fresh and delish, there is no room to complain. I usually get the magic combination, enough food to fill two people. They started to have a belly dancer on saturday nights .I believe it begins at 8 or 8:30. . Fun to watch.I come here every other monthk, and brings several of my friends. Always a satisfying experience. =)"], ["M F.", "This area actually has a fair numberof options for middle eastern food, and this is one of them.  I havent  actually eaten in the restaurant, but had done take out many times.  The food is actually quite good. However, expect to wait a long time.  Everytime we ordered, the delivery took forever.  The fatoosh salad is good, as well as all the apps ie. stuffed grape leaves.  The soups are my favorite though.  very very filling and very tasty as well."], ["Erika M.", "My husband and I order from here ALL THE TIME!  Everything is always fresh and beyond delicious.  Delivery takes a little longer but its always worth it!"], ["marie m.", "Lately we've been ordering from First Oasis a lot, and we're very impressed and happy.  Ultra-fresh food, prepared with great care, and served in ridiculously large portions.  The meats are well-seasoned and juicy; the salads are well-composed and very fresh, with yummy little added kicks; the falafel is possibly the very best I've ever had (yes, I know I also have previously said this about a place in lower Manhattan, but First Oasis beats Alfanoose handily, on everything); the hummus - well, it's creamy, garlicky, and just a little taste of heaven.  We have enjoyed absolutely everything except for one dish - chicken kofta that I found surprisingly gamey; I thought we might have been given the lamb my mistake, but they swore it was chicken, so whatever - and we are happy to wait a little longer for our delivery: First Oasis begs your patience, as they say everything is prepared to order, and I believe it."], ["Randy B.", "Gave this place a try thanks to a discounted gift certificate from restaurant.com and was glad I did.  We started with the falafel and it was really yummy (as was the mint-infused salad it was served with).  As for the entrees - the meats were ridiculously tender (could cut with the side of your fork!) and well flavored...but the side dishes left a little to be desired.The restaurant is intimate, clean and nicely decorated - would have given it 5 stars for atmosphere if it wasn't for the random middle eastern music videos blaring on the mounted flat screen TVs.  Will happily visit again...even without a discount. :)"], ["Patrick J.", "The food was good, but the service was slow even though we were the only ones in the restaurant.  I guess the kitchen and wait staff was busy filling take-out and delivery orders."], ["Chris G.", "Expect to wait awhile for your food but that is because they take great care in how the dish is prepared. The food is very fresh indeed and will not disappoint in that regard. The waiter is very nice  as well as the chef who takes great pride in the dishes he serves."], ["Joolie T.", "ooooooooooo belly dancers!i really enjoyed my experience here. i strolled by one Christmas evening and thought it would be nice to celebrate New Year's 2007 at this establishment. the owners are extremely sweet and accommodating. the hummus is amazing and fresh... the Falafel could be better- but it's still pleasing. the grape leaves are memorable and finely prepared. the belly dancers are very interactive and fun. they grabbed random people from their tables and had them dance! i love that. =)"], ["Tom Z.", "My wife and I tried First Oasis about 2 years ago on the Brooklyn Dines Out offer. So we had the combo meal which came to about $20 and we were stuffed. Nice sized portions.I recommend the ouzi which is sort of like a middle eastern shepherds pie. The other thing is everytime we go inside it looks brand new meaning that they keep the restaurant spotless.Finally while First Oasis is great to sit down and have a wonderful meal the take out can be a bit of a nightmare. It took over an hour for 1 ouzi and a beef gyro. Other than that I have no complaints with them."], ["steph d.", "This Mediterranean restaurant is incredible and the prices can't be beat.  I have been here a couple times as well as ordered delivery.  They have a lot of great choices that you would expect, such as hummus,  Falafel, Babaghanuj and Mussakka.  My favorite is their grape leaves, they are homemade and served warm.  I usually get their hummus which is very tasty served with warm pita bread.  For entree I love their lamb cous cous.  It has chunks of lamb stewed with fresh vegetables and potatoes in a red sauce served with a side of cous cous which is prepared with raisins and nuts.  The thing that makes this dish is their homemade spicy red sauce that you have to ask for, its that amazing.  They make great fresh mint tea which is a great addition to this already excellent meal.  They offer free delivery and accept credit cards.  The dining room is cute, but both times I was in here it wasn't very busy.  They used to have this restaurant in Manhattan but had to leave due to the cost of rent.  I would highly recommend this restaurant for in house dining or delivery.  You can def share all the meals and eat like a king for under 20.00."], ["Adam K.", "We order in from here almost every week.  Huge portions, very tasty and reasonably priced.  I've tried many items on the menu but have to say the lamb ouzi is my favorite.  It is lamb, rice, carrots, peas, nuts and raisins covered with phyllo dough and served with a yogurt sauce on the side.  So good.  May have to order it tonight."], ["Amanda H.", "This is one of the best restauarants in the area.The food is great,the prices are good and you get good portions.If your really hungry the mixed grill is amazing,Thier hummus is great here too,in fact-everything is great here!"], ["Jeffrey K.", "Best tasting & most consistent Middle Eastern food. Love the vegi combo's. Big selection. They let you mix hot and cold appitizers with out over charging.  Everything is delish. The falafel is crispy on the outside and moist on the inside and sprinkled with seseme seeds. Try the ouzi. A fried rice with pine nuts and peas wrapped in phyllo dough. You can get the ouzi with lamb, chicken, beef or vegi. It comes with yogurt cucumber salad. Ive only seen this dish on one other menu before. A good dish for sharing. The spinich pie is very different then anyone's I ever had. They use a lot of onions to get great flavor. The tubuleh salad is perfect  for me when I want to eat light. I also love the hummas, Babaghaunuj and the mjaddarah. My meat eating friends are crazy about the chicken and lamb dishes. They come with a very delish rice. The rice is cooked in a vegi broth that gives it wonderful flavor. They make the hummas fresh everyday & chop the tubuleh salad only after you order it. That is extra work and not common. Parking is usually found with in 10 minutes. You can get parking valitdated for only 3 bucks right accross a street. We love the waiter Tyrek and owner chef Saheed. They aim to please and do a good job. I eat here at least once a week. Ive taken over 30 people there in the last 5 years and they all agree with me. Try it and you will see what i'm talking about.DaFoodlum"], ["Beehive H.", "This place is great.  Awesome food in a relaxed atmosphere.  Never a rush and always plenty of food to go around at a great price."], ["Igor M.", "Food is great. Service is a bit on a slow side but staff is very polite. I was waiting for my party to arrive so they offered me some tea. The place is not very big and cozy. Food is mostly Syrian and general Mediterranean. They do serve wine."]], "Tutt Cafe": [["Lisa M.", "Very unassuming place. We came in the earlier side of the evening, after walking over the Brooklyn Bridge. No one was eating inside so we were a little suspect. But we decided to give it a try since there were many positive Yelp reviews. So glad we did! Everything was delicious!! My husband got the merguez plate and cleaned the plate! I shared the shrimp pitza with my 8 year old and also ordered a small falafel plate. Don't expect your standard type of pizza! It's better! Definitely going to come back when I am in the hood and try different things."], ["Asavari G.", "It's a small, relaxed, no frills, sit-down cafe. The food was delicious. We got the 5-salad appetizer which came with tasty (but somehow not overly-filling) pita bread. The \"sandwiches\" were packed with meat and flavor. You get a good amount of food per $, especially compared to Manhattan. CASH ONLY"], ["Matheus D.", "I hate that I wasn't that hungry when I came here. I was showing a few friends the city and decided to catch a breather here. Very easy location to find. It was my first time here. We ordered chicken sandwiches and were not disappointed. Pita was incredibly fresh and the chicken was full of flavor. The only complaint I have of the sandwich is that I would have liked some more sauce, sandwich overall was a bit dry but still good nonetheless. I really wanted to try their falafel plate but unfortunately really wasn't that hungry hence my first sentence. The waitstaff was incredibly friendly, I ordered a loomi (Egyptian drink) and it was my first time having it. After I tried it the waiter came up to me and said that if I didn't like it he would exchange it for another at no cost! A friend had the hibiscus drink which was really delicious but I didn't mind my loomi drink. They also gave us cornbread on the house which was really generous on their part. Decor leaves something to be desired but don't let that keep you from going in and trying the food!"], ["iya d.", "First time going in at 7pm last Thursday. I wanted a falafel as I don't eat meat or chicken.  I was told they were out of falafel. At 7pm on Thursday? It's the like the Pope saying he's out of prayers. Make some more! Then i asked to just buy a pita cause I was starving and needed a snack to make it through my journey to find food elsewhere. I was told he could not make one pita, it took too much time. Huh? Are they rolling each one by hand? Is that why they don't have time to make more falafel? As the young kids would say, FOH.I wish I could review the food, but unfortunately, I was not given the opportunity to buy any. The attitude was bad enough to kill my appetite for anything this place has to offer, especially when an amazing middle eastern spot called Fatoosh is just on the opposite end of Hicks (by Atlantic)."], ["Undercova A.", "So, I returned to Tutt a couple weeks ago and had a fantastic mesl.  Thinking it was a fluke, I returned.   Not a fluke, Tutt rules once again.   They make their own pita, making all the difference in their pitzas and wraps.   Get the spinach and cheese pie.  It's hot, puffy and scrumptious.  The pitzas are hearty and served with a variety of toppings.  No longer BYOB, but I forgive."], ["Pau A.", "The food is amazing ! Loved it all! The 5 salad plate for 10$ Is great! Highly recommend the soups too!"], ["Sadia H.", "Had the lambajin and chicken pizza, no one liked the lambajin, the tomato sauce kills it but the chicken was good, so was the feta salads and stuffed grape leaves. The meat sandwich wrap was also ok but nothing was mind blowing. I've been to the middle east and i absolutely love manakeesh, but the pitza (manakeesh) here is nothing like that experience.  The place is quiet,  mostly empty,  The guy behind the counter is nice but It's not a memorable experience. It's okay for a bite."], ["Pam H.", "This place was hoppin' on a Saturday late afternoon. I got the salad platter (choice of 5 salads) and the dish was very pleasant... until I encountered a hair in my dish. I guess things like this happen? I did think the pita/bread that they serve with the platter was on the harder side than other Middle Eastern places and I prefer the softer pitas.If I happened to be in the neighbourhood again and was hungry, I think I'd come back here? ... I'm unsure, but its a possibility."], ["Jeanne L.", "Delicious! So much food for a great price and nice service. Came for lunch with a group of co-workers. We shared some dishes and each ordered our own. I tried a little of everything and it was all great!"], ["Thomas M.", "Just a great combination of a good mediterian food for great prices in such a great location. I recently got transfered to this neighborhood and was looking for such a place. Thank God this place is here. The look is pretty casual with great and friendly personel. Food is always fresh. Highly recommend visiting it when around this area."], ["Brownstone P.", "What a delight to find good affordable Middle Eastern eatery on Hicks Street. Yes, it's no frills, but it's clean and the food is great.  The staff was friendly and attentive.  The Hibiscus drink was refreshing and fruity without being too sweet. The Chicken Pitza was filled with flavor and was juicy. It was too much for me to finish and I asked for a \"doggie box.\"  My meal ended with a delicious slice of complimentary Basbousa (Semolina Cake). The spices and flavors of my pitza made me smile all the way home to Bensonhurst.  It was still delicious the second time around tonight at dinner."], ["Kayo N.", "A very casual middle eastern eatery with outdoor seating and good middle eastern food. And very good home-made pita bread that arrives to the table like a poofy balloon.  It's all about this bread, folks. That and the availability of outdoor seats in a very pretty neighborhood block."], ["Steven N.", "Good food and reasonably priced. Felt like it was my first time eating real middle eastern food.  Generally very aromatic tastes with spice forward (not to be confused with hot) flavor.  Well made. Their pita bread came out steaming hot. The falafel was full of flavor but my taste buds wanted more salt. It was well made with a nice crispy outside and moist crumbly inside. Chicken pitza was our other dish which is as also good. Again my taste buds wanted more salt but the food was definitely spice forward. Not sure what spice but it wasn't a cumin base. Heavy on the peppers. The green onions were also a nice compliment. The pizza bread had a subtle smoky flavor. Crispy crust with a nice doughy base. Ther was no cheese to hold things together but it was still a well made pitza in my book."], ["Crystal A.", "Why didn't I discover this place sooner! It's a cheap Middle Eastern food in Brooklyn Heights. I am a huge fan of the chicken plate, comes with hummus and a salad. The staff are really nice and the food is cheap for the area. The ambiance of the restaurant is casual and the staff are really friendly. Definitely try this place!"], ["Mariam S.", "(Lambajin pitaza: 8.00$) I have a couple of things to say. When they say pictures are deceiving ... They mean it ! Looks great huh? That's what I thought too but meh not that good at all ! Tastes like tomato paste and onions barely any meat. On top of that the service was horrible! He was constantly on his phone and we had to keep asking for things that weren't on the table (ice water, napkins...) he barely waited us and had the decency to tell us after we payed \"where's the tip\" ?!? no."], ["James L.", "The pita here is to die for. It's so fresh and fluffy. I ordered the chicken plate which comes with salad, hummus, and pita. The \"white sauce\" is the real thing--tahini based, not that sour cream/mayo crap that you find at other places. $10 for lunch sounds about right in this area. The only problem is that I wish it was a bit closer to my work place. It's a bit of a walk from Dumbo, especially in the winter."], ["Tiffany O.", "Great service and chill vibe. But be advised that their style of mediterranean food is not the same as other places. It is Egyptian...a little grittier, not as much flavor. Still good and fresh though. Also warning that they will insist on a 17% tip."], ["Angela C.", "Great food and staff is very friendly. Had the lamb plate which came with sliced lamb, salad with a lemon and oil dressing, freshly baked pita bread, and your choice of hummus or babaganouj. The babaganouj was delicious and the pita bread was my favorite part. Friends ordered the chicken plate and the chicken was delicious, will definitely order next time. Food came out quick and service was great. Tried turkish coffee which was very strong as opposed to what I'm used to drinking but smooth, for sure something to try if you havent already. And to top it off we had the baklava which had just come out of the oven and it was amazing. Nice place for a casual lunch or dinner with friends. Will definitely be coming back :)"], ["Liz D.", "Great meal especially enjoyed the beet salad and chickpea salad.  Great and personable service."], ["Wilson Z.", "The party I was with ordered a shrimp and a chicken pitza which was not bad. Interior was ok, kinda small. And baklava was yummy. Overall ok, I'd probably go again if I was in the area."], ["Briggs S.", "This no-frills place has cheap, great mediterranean food. We go quite often since it is down the street from our apt, and it is consistently good.The decor is nothing to write home (or yelp) about, but it is clean and there is always a table if you decide to dine-in. In the summer, there are outdoor tables and palms on the sidewalk for people watching.Service is friendly, but a little slow; the reason it seems to be slow is because everything is made to order, including each pita. When we order (usually for take-out) we see them start with pounding out our pita and popping them into the oven; when they come out, they are super fluffy and puffy delectable carb clouds! Great fresh pita! And usually one of the staff serves complimentary tea while you're sitting and waiting for the food.Note: no alcoholic beverages served here; signs are posted everywhere, almost comically.Also, CASH ONLY (with ATM inside)Best food we've had here:***Chicken sandwich (this is our standard, go-to here)***Pita and [fill in the blank; humus, babaghanouj, nothing but pita]***Spinach cheese pie***Beet salad***Merguez sandwich (although kinda greasy)"], ["Susan F.", "Amazing service! Most friendly servers, make you feel like family. George is the best! Not to mention great food. Try the chicken plate!"], ["Emily P.", "My favorite neighborhood place for a quick Middle Eastern lunch. The food is inexpensive, with good portions and arrives quickly. The staff have always been friendly. It loses a point since it's kind of a dive and the tables are wobbly, but I will definitely be headed back again."], ["Tony L.", "Great service and food was pretty good. Falafel was... Subpar, but this is because I worked in the middle East for a year. The babaganoush and beet salad were great, the humus was okay. My friend and I ordered the 5 choice salad dish, and a 10 inch chicken Flatbread pizza which was enough food for both of us without breaking the bank. They give you a LOT of chicken, but it could use some marinating /pizza. Lifehack - put some babaganoush on top of the pizza for major deliciousness!"], ["Cheff W.", "After taking hundreds of Brooklyn Bridge Park photos in a hot summer day on  September 04, I really need a cool and relaxed evening without lots noise or large crowd.I really want a fresh cold dish and just a quiet place to sit.  This place was it.  I took the fellow \"Yelpers\" recommendations and ordered the lam sausage with fresh green salad and hummus dip (you have egg plant as other option).  My best friend had the chicken felafel.  Lam was dried and tasteless only gets good with the hummus dip.  The chicken felafel was very juicy and tasty.  So why 4 stars?  Because the staffs were very friendly, and genuinely nice.  We didn't order any drinks but we've got a pitch of ice cold water with fresh slice of yellow lemon.  Very affordable price, fresh food, quiet, calm, and good hosting brings me back to chicken felafel for the next time.  10 minutes waking distance from the Brooklyn Bridge Park entrance.  (NYkers walk, not a touristy walk). Let's go back to the \"tasteless lam\", hey if you're on the \"low fat, low salt, low cholesterol\" diet, get this!"], ["Angela D.", "The food is delicious and the service is excellent. The chicken plate was outstanding as well as the fresh pita and feta salad."], ["Juan J.", "I tried their sample appetizer, chicken pizza, and pita bread.  Everything is freshly made and we enjoyed our tiny outdoor table.  Food is 3.5 star but I am giving it a 4 because I know I will be back (it is minutes away from my apartment)."], ["Alexandra C.", "Thanks Yelpers!  Would have passed right by this place from the side street we were on thinking it I just a regular bodega or something.Not!Had THE most delicious pita ever here.. Not your normal pita.  Served piping hot, so soft and flavorful.  Have never had a pita like it!Also THE best baba!  The beet salad was very regular.Good prices, good service and simply delicious and fresh.  A sure bet for a great lunch to walk over to the Promenade with!"], ["Jacqueline M.", "We had soup, hummus and a chicken sandwich at this quiet casual eatery in Brooklyn.  I enjoyed the hospitality and kindness along with the pita bread."], ["Christopher R.", "If the place is going to advertised their delicious stuffed pitas, you would expect them to put some more care into them. My lamb pita consisted of some sparse sauce, sad tomatoes, lettuce, and some very bland lamb. Considering that the man at the front desk recommended the dish, I was especially underwhelmed."], ["Dawei L.", "Tutt Cafe is a great dining option if you're in the Brooklyn Heights neighborhood. A great place for a sit down meal or takeout, It's a cheap but delicious option that was really necessary in the Heights area. While I did have takeout, I noticed on a Saturday lunchtime how packed the place was. There was young families, older individuals, and some more college aged kids all dining. The place is very relaxed a there were a lot of kids. Their menu is very affordable and I like how they offer pizzas and more traditional Middle Eastern fare.I had the lambajin, which can be described as a lamby spread on pizza dough.  A large pizza for 1 (it's approximately 10 inches), you will be full afterwards, though it does taste significantly worse after the first bite. I loved my first bite, but it slowly lost it's appeal as the crust was not as crisp near the center and was not as good when it was not piping hot. The topping was something like a middle eastern sloppy joe (with lamb) and you'd really have to try it before you explaining what it tastes like.All in all, I think it's a 3.5 star joint, but I think its prices and its uniqueness gives it that extra bump up to 4 stars"], ["Bee C.", "I've only been here for takeout. The hummus is good, the pita is good, the spinach pie is great, the falafel is bland and the foul is nothing special. It's a good, quick reasonably priced takeout option in the area, but I wouldn't go out of my way to go here."], ["Greg C.", "A friend and I stumbled in here a few months ago, and it has become my go-to haunt ever since.Let's just dive right in, shall we?1. The ambiance -- It's tucked away in this quaint part of Brooklyn Heights. The atmosphere is a little kitschy, but in an absolutely endearing way. It's unobtrusive  and charming all at the same time. 2. The food is a pleasant surprise. I've probably sampled 80% of the menu and everything has been fantastic. The falafel are really good, but their 'pitzas' are truly remarkable. The Green Pitza gave me convulsions (in a good way!)3. The service is warm and friendly. This is a consistent theme every time I've been here. One of the servers remembered us from last time. Totally awesome. Way to go, Tutt. You've got yourself a regular."], ["Shakir T.", "Omg this place is so cheap and soo good! The seating is not the best but you can always buy takeout and go near the Brooklyn bridge promenade and eat while enjoying the downtown manhattan skyline view! The falafel sandwich and the merguez sandwich are really good. The green pitza is by far THE BEST in NYC! I've tried at 4 other places and nothing comes close to this!"], ["Jamylin W.", "The falafel wrap was pretty good. Not amazing. I've had amazing. Many selections available on the menu. Cheap. Middle Eastern music blasting in the background. Fairly large portions, be careful not to order too much. Menu has lots of pictures. Not easily accessible by public transportation. Can sit there for 3 hours, no one will rush you. Will probably go back again for takeout."], ["Katy H.", "Food is cheap and good. I ordered the falafel platter which came with salad, 6 falafels, choice of hummus or babba gahnoush for only $6.Great lunch place or pick up food to go."], ["Polly H.", "Amazing place!  During this last visit, I decided to try the hirara soup and the garlic bread.  Both were outstanding in flavor and fresh taste.  I am a big fan of Tuff Cafe due to the affordable prices, the nice waiter, and the huge fluffy pita pillow that is provided with most of my meals. I will upload some photographs so you can see the interior and my soup and bread.  This establishment also have a fantastically clean bathroom.  If I live longer from all the delicious food, then I will be back. This is a guarantee!  Did I mention that it is great for groups?  and you can bring the family?  the kids?  and grandparents?  There is outdoor seating if you do not mind the sun.   =)  Thank you for being walking distance from Brooklyn Bridge Park."], ["Kimberly L.", "I ordered delivery, despite not being able to see a menu!  I called and the guy was friendly so I decided I couldn't go wrong with a falafel plate.  I ordered it with hummus and then got a garden salad with feta.  The bill for 2 plates and the salad was only $20.  The plate was really good it came with salad, 4 falafel balls, pita bread (warm and fresh!) and a scoop of hummus.  I couldn't get over how much food we got for the amount of the money!  I could definitely order again and try a different sandwich or one of the specialty pizza's!"], ["Vanessa O.", "Anything with the chicken is good. I thought their food was ok. Unfortunately when I arrived, there was one waiter scrambling around. I don't think this place is byob anymore. I heard the pizza was good so perhaps I should have ordered differently. There is outdoor seating but it is a little awkward to sit."], ["Vanessa T.", "Great local spot that has simple delicious food at very reasonable prices. We tried the salad platter (you get to choose five different salads) and the lamb platter which came with either babaganoush/hummus. The salads I tried were the feta, beet, hummus, babaganoush, and falafel balls. The falafel balls were not as crunchy as I liked but they were well seasoned. The hummus was so good I ordered a large to go! The pita comes out like a pillow and deflates as it cools. Tutt cafe has some of the best middle eastern food I've ever had. Love this cute cafe."]]}