{"La Slowteria": [], "Don Chingon": [["Karen H.", "New in the hood. Mexican food ( yet another but nothing like the others).  I have tried their   Chicken taco platter that came with nice side portions of rice and black beans.Let me tell you I was not that hungry but There were no leftovers for the cats ;).It was simply delicious. In particular the Tacos that were just the right texture. All of it tasted really fresh. I am not a big alcohols fan but their bar looks intimate and nice, great place for first dates and groups.The place is Well designed with a very cool motif Mexican modern style. It's a great addition to the neighborhood. Prices are fair for what you get. They also have some original Mexican soft drinks that was nice to see ( if you ever visit Mexico you would know ).Don Chingon  - I will be visiting you more..."], ["ZACK R.", "Not sure how to explain it...the food here is amazing! I'm a bit of a connoisseur of Mex food, and this is one of the best spots in NYC. HOLY CRAP! Try everything!"], ["Adriann B.", "Stopped in with a friend to give Don Chingon a try......I'm glad I did! The fish tacos were fresh, very tasty and had a hint of spice. Even the rice and beans were delicious.  Needless to say, I'll be back!Marco was our waiter and he was great....very attentive and gave great drink suggestions."], ["Jennifer M.", "Best margarita I've ever had in my life. Jalapeño infused, a little kick, but not overly spicy to ruin the tequila flavor...come here for margaritas...anywhere else is a waste of time"], ["Charles R.", "Delicious, delightful and always good service. Why can't more spots in this neighborhood be like this place? Both the quesadillas and burritos are fantastic. Margaritas are B+...never really all that memorable. I'd stick with beer. But solid choice for Mexican food in this area."], ["Marcello D.", "The food was amazing here! We had fish tacos which the waiter kindly recommended, steak quesadilla and guacamole! Everything was so fresh and delicious , for cocktails we had the strawberry mint margarita which were delicious I would def recommend this place to friends. Great atmosphere and decor!"], ["Christine C.", "Dear lord, tasty tacos, strong margaritas, high quality tequilas, fresh salsas, handmade tortillas and excellent Guacamole (with grapes; sounds weird but was actually delicious). Myself and 2 other friends went there before the Madonna concert at Barclays and decided to split a selection of things. We had the queso (good), guacamole (excellent!), carnitas tacos (amaze-balls), steak quesadillas (great), and chicken tacos (good). My favorite, hands down are the carnitas. Must order! Steak quesadillas and chicken tacos were also really delicious. We each had a couple margaritas which were strong, with fresh flavors/juices and well made. Not sickly sweet like some of the 'ritas in this town tend to be. One of my friends who came with us was very knowledgeable about tequilas and was impressed by the selection. All around a great experience! Oh, and don't forget to get your picture in front of the Don Chignon mural outside!"], ["Jon S.", "Great food, service, and vibe. Totally worth a visit, even if you have bushy eyebrows."], ["Lori M.", "We got the chicken (only dark meat) and steak burritos and they were delicious. It comes with black beans and rice along with sour cream, guacamole and Pico DE Gallo on the side. The burritos are grilled and tasty. Drinks are a little pricey. The house Margarita comes with a chili pepper. It was a little slow to get served but the meal itself made up for it"], ["Sonny T.", "Pollo Burrito is mouth watering! The staffs are great and the place itself is tiny with a bar. It's  more for really small group from 4 or less. But the food will leave you full and satisfied."], ["Andrea M.", "Walked over for lunch on Labor Day after spotting the menu the week before. We are vegetarians who love Mexican but it's often hard to find new, interesting options so it was a nice surprise to see tempura avocado tacos and the potato, spinach and poblano pepper burrito. The service was great, the margaritas were delicious and the husk-on elote corn on the cob was perfectly dressed with crema and spices. We will definitely be back and will recommend to friends!"], ["Dan W.", "Since my last review of Don Chingon got removed by Yelp for not being lengthy enough, here's another one to show my love for this place. When I first moved to the area 1 1/2 years ago, there was a serious dearth of quality Mexican food. Then Don Chingon opened, and my life changed immeasurably for the better. My first bite of the pomegranate and grape guacamole shook me to my core. I probably get their quesadilla platter delivered to my apartment more often than I should. One of my favorite discoveries happened a few weeks ago when I was browsing the menu and couldn't decide between rice, black beans and refried beans because (to be honest) I just wanted all three. Then I saw the trio. For $4.00, you get all three!In summary, Don Chingon is unquestionably the best Mexican food around."], ["Shari J.", "Awesome place to come for a bit to eat. The meal was flavorful and savory. I had the chicken quesadilla words cannot explain how good it was. The black beans , it felt like I was eating a hint of heaven.The bartender George amazing and attentive, lovely guy. I didn't have a drink because I came on my lunch break but the water was ice cold and amazing. Very chill atmosphere."], ["Luis F.", "I've been eyeing it since it opened across the street from Bark & Bergen Comics. Stopped in here with a group of friends for my wife's birthday as sort a casual last minute thought. We had never been before. The seating is limited and very casual but it was perfect for what we wanted. The service was fast and friendly. The food was very tasty and came in a reasonable amount of time. Everyone really enjoyed their meals and at the end of the night we were all happy we decided to stumble into Don Chingon. If you're getting a margarita I'd favor the Dulce & Caliente over the house margarita. The house was decent but the D&C was more of a flavor experience. I can also recommend the carnitas tacos & the house salsas. Good stuff all around."], ["Guy I.", "I don't get the reviews of this place, blows me away that people are saying this is a great place. We walked in thinking we'd have dinner at 9:37, not knowing that it closed at 10. Now granted the bar tender who sat us could have said \"hey, we close at ten\" but he didn't and instead seats us. We were the only people in the joint and when the waiter comes over informs us that their kitchen closes at ten, no mention that they close at ten. so we both order a margarita, he asks \"the house one\" we say sure, i was beat and just wanted a drink. and while sitting there looking at the menu i my spider senses started tingling and at the last second we decide that no, we wont order food. thank god we didn't because the house margarita that were served to us were possibly the worst i've ever had in my life. Nothing but sour mix in a small glass that was mostly ice, mixed weakly i may add. while sucking down this abomination as fast as we could it became clear that not only does their kitchen close at ten but they were in fact shutting down, and that pisses me off because they were essentially going to let us order food and then break down the place around us. not a very conducive setting for a chill night. but i'm sure the waiter figured they could force in one more order than rush us out the door. so we finished and i just stood up and told them to close me out and while doing that the bar tender has the balls to tell me we could still hang out if wanted? why so I could pay another $22 bucks for total shit? yeah fuck that and fuck this place."], ["Katy C.", "Not sure I understand the predominance of 5 star reviews here, to me, 5 stars means I was blown away by the food, service, ambiance, all while factoring price into the equation. Our experience warranted 3 stars, 4 for food, minus one because we left feeling like we were overcharged.Hubby and I came for lunch and our server asked us if we wanted drinks or apps almost as soon as we sat down - felt a little pushy and eager to bulk up the bill. Hubby ordered the chicken burrito off the lunch menu and said it was quite tasty, the burrito tortilla was nicely browned on the outside but from my perspective it looked small. He added a seltzer to his order, which came in a small glass and no refills for $3.I wanted tacos but the lunch menu only includes chicen tacos so I ordered three tacos a la carte, the avocado, the fish and the carnitas - all were quite tasty and the soft tortillas were slightly crispy and didn't fall apart as soon as you picked them up. Somehow the server put in my order as a combo plate with rice and beans, which I didn't ask for, and which wound up costing an extra $3-4 from what the 3 tacos by themselves would've cost. I figured I'd try the rice and beans that I wasn't expecting rather than complain, the rice was herb-y, the black beans were ok, in retrospect the experiment wasn't worth the $3-4. I should've asked our server to fix the order.They've done a nice job with the amibiance/decor for an awkward sized space that can feel dark, it's nice that the windows on the Flatbush size open.All in all, given the mis/overcharging, I don't expect to be returning soon/often. Also, Calexico's lunch special is a much better deal and offers more taco variety."], ["Kingludy S.", "Interesting. Flavorless. There is nothing like poor Mexican food, especially when it comes to the only thing you really have to offer. The tacos were smaller than most dollar sized pancakes and served with watery pico de gallo. Not much going on in here. The coolest thing was probably the wall paper."], ["Brandon R.", "This place is our new regular spot!! The salsa appetizer is fantastic, my favorite is the habanero.  The tacos could not be better.  Each taco is the perfect proportion of meat to tortilla.  Our margaritas were perfectly balanced, not too sweet, not too acidic.  Vic, our bartender was friendly, helpful and attentive.  He recognized us from dining there 4 months ago.  Go. There. Immediately."], ["Anne B.", "Serving seven people before a concert, with people arriving at different times and each with varying degrees of hunger and dietary needs to boot, I imagine is the food service industry's idea of at least one of the seven circles of hell. But the staff at this awesome little find handled our meals beautifully. This is a very inventive take on Mexican - everything has a twist of some sort which even when not to my traditional taste was really really wonderful, and that's saying something.... ...because what I don't like much in cusine is food that's sweet. I'm eastern european - the first time I saw stuffed cabbage with raisins I almost hurled. I grew up in a house where fruit was for sangria and dessert - with savory in between; take your grapefruit segments and melon soups and shove 'em. Seriously - anything beyond a splash of lemon makes me trepidatious with all but the most assured of kitchens. So imagine my surprise when I found damned near everything Don Chingon put before me accented with some sweet spin - and it worked damned near all the time. For ME!We sat at their communal table, and tucked into their warm chips and knockout guac - sweet #1: Of the three salsas the one that hit home for me was their pinapple jalapeño, with the charred tomato salsa a close second, and the very traditional verde still memorable. Sweet #2: The guacammole arrived with accents of pomegranate and grapes - yes, GRAPES. Son of a bitch - it WORKED. Might not be something I'd make myself, but it was a refreshing surprise on the first truly hot night in Brooklyn.I opted for the taco trio for my main course. These are not big tacos, but they are of a thickness closer to a blini than a traditional taco, and were varied and delicious. I chose a tempura-fried avocado taco that was unusual and delicious, a chipotle chicken taco beautifullly complimented with an avocado salsa, and a tempura-fried pollock taco (a fish special, and sweet #3) with more of that killer pineapple salsa. It was just enough for me. Three of the friends closest to me opted for the fish of the day, which was a very un-Mexican salmon. They all loved it. Further down the table one of the latecomers waxed raphsodic about her tortilla soup. One of my guests received an entree she didn't order, but I think it was nobody's fault. Truly. And the meal came out in record time, a burrito so large she couldn't finish it. Another friend loosened his belt and helped her, pronouncing the dish 'spectacular'.The one instance, ironically, where the sweetness (#4) proved too much for me was the margarita; even without the simple syrup, it was a Cointreau overdose. Maybe had I opted for the salt it would have helped, but next time I'll probably stick to a tequila w/soda and lime, like one of our party had; I tried it and preferred it to my own drink. The decor is awesome in this small and unusual piece of real estate, with one of the coolest bathroom sinks I've seen in ages.  The manager (?), Vic, met us outside and chatted with us as we waited for our taxis - a great guy  who cares for his customers and his staff. They should all be around for a good long time.  A truly surprising and satisfying dining experience. I'll be back to try more, especially the corn and that soup.  Let's see if this place will come to earn that fifth star. They're close."], ["Blue N.", "I love the tacos, they are chingones! The dough is made from scratch, and the spiciness is spot on. The margaritas are definitely worth trying. I also like the atmosphere and the music selection.  I'm glad this place opened up in the neighborhood."]], "Tacos El Bronco": [["Kwai L.", "Authentic Burrito from a truck with great ingredients, made to order, great prices.  Chipotle lost my loyalty once I discovered Taco El Bronco.  My only wish is that there were more trucks and the one nearby did Burritos in addition to Tacos.This truck is great for getting an authentic taste of the Sunset Park neighborhood and its food and culture.Old men sit on lawn chairs outside in front of the truck waiting for their burrito in the summer and even at 11 pm when you need a Burrito fix you can find this truck surrounded by locals.Perfect for eating after leaving the bar and the weekend subway dropped you on the other side of town \"snack\"."], ["Michelle X.", "OMG the tacos here are so good and cheap!It starts at $1.50 for the small tacos, there are a lot of fillings to choose from.We ordered 8 tacos, a tostada, horchata, and a mango smoothie, it came out to $23 total.There is a lot of seating in the restaurant. You also get complimentary chips&salsa. :)The bistec tostada was amazing, so crunchy, and so flavorful. It was weird though because the bistec for the taco wasn't as flavorful and tasted differently. so they might use a different batch of meat for tacos/tostada or everything else in the tostada made the meat taste so much better.All of the meat were delicious and moist, only the spicy pork was a bit dry and disappointing. If you like very soft meat, try the veal head!Their horchata is a bit watered down. The mango smoothie had a lot of milk in it, wished i could have tasted more mango.I would love to come back for more tacos and to try some of their entrees."], ["David R.", "Unreal tacos for NYC. Great prices, with just the right amount of fuck-you attitude.The shrimp sauce was on the next level and the salsa is spicy and the cactus is out of this world. Get in before the hipsters ruin it."], ["Ny'ker S.", "Don't know what the fuss is about. Their chicken tacos are the worse in the neighborhood. I got it from the truck on 5th Avenue."], ["Kristin M.", "Really delicious little joint. We tried the regular (with guacamole, cilantro, and onion) tacos with carnitas, roast pork, chicken, and steak. I especially loved the carnitas and roast pork, but they were all great. I think next time, I'd probably go with the small tacos (no guac, cilantro, and onions), but for an extra buck, they were very generous servings. No wait for dinner on a Thursday night. The place was spacious and service was great. I'll definitely be back to try the chorizo y queso!"], ["JL K.", "Come hungry because you're going to leave rolling out; full and sleepy! Mostly everything is seasoned well with succulent meats that don't need extra sauces, except their steak. It has been a while since we have found an authentic Mexican restaurant which has seasoned their steak without drying it out. You can douse it it the delicious sauces provided. The rice is coated with just enough oil to not be dry and gives good tomatoes flavor that doesn't acidulously cover the beans and fresh lettuce and avocados. Unless you have a bottomless stomach, I can only eat either the breakfast (Huevos Rancheros) or lunch. Since its a good truck and they don't open their restaurant anymore, I take goodies home and reheat. Still delicious! They get you in and off of the line quickly so don't walk too far."], ["Chris E.", "Some of the best tacos I've ever had in my life! Everytime I searched for tacos in Brooklyn, Tacos El Bronco always came up in my results. After seeing it listed so many times, I had to FINALLY visit! It was like a subliminal message was placed into my head to go!Unfortunately, the restaurant was closed for renovation when I came here, but luckily they operate a truck as well and the truck was parked right outside their restaurant on the corner of 4th Avenue. When I approached the truck, I noticed the friendly atmosphere as there were many people sitting around in chairs and hanging out next to the truck (most of which were of Mexican descent, quite possibly families enjoying an outdoors hangout/dinner). I took a glance at the menus, as they have one for tacos and one for burritos. The menu boasted quite a long list of tacos and burritos, but being it my first time I was not planning on holding back (especially when the tacos are only $1.50-$1.75)! Can't beat that!There was a young woman taking orders and the flood gates opened as I ordered 8 tacos! --- 2 Steak, Tender Beef, 2 Chicken, Spicy Pork, Roast Pork, Mexican Sausage. It took a few minutes for the order to be ready, but I opened the 2 boxes of goodness and was automatically transported to taco heaven! The taco shells were soft, with 2 shells wrapped around the meat and there was a very generous amount of meat encapsulated within each taco. Each taco contained chopped onions and lettuce with a lime slice on the side. To bring it all together, they gave a green sauce that was amazing! It had a spicy kick to it, but it was the perfect condiment/sauce for the tacos! I put it on every single one of the tacos I ordered and quite frankly, I wish I had more!Hopefully, the next time I come back, the restaurant will be open, but for now I'm more than happy to settle for their truck!"], ["Joy Y.", "The tacos are good. I got veal tongue, spicy pork, tripe and tender beef, all in small size. For some reason it took about 30 minutes for my tacos to arrive. The tacos were very uneven in portion; I probably ate four times as much pork as tongue, which I only received a bite of. A problem I had was I didn't know how to stuff the whole onion bulb and big slices of cucumber and radishes into my tacos, and the lime wedges were tiny. Granted, all tacos tasted very good and flavorful, and the tortilla had such wonderful texture. Horchata was unfortunately quite watered down. Service was cool."], ["Faz A.", "Killer Mexican food, chilaquiles are as good as LA, fantastic service. I've come here for breakfast and lunch and it's always a treat. If you're craving great Mexican food this is the place to come."], ["Elise B.", "Most impressive food, when taking into consideration the price. Very reasonable and great for a cheap eat. The hype is real; authentic and satisfying.Be prepared to wait a little if it's busier, of course, but seeing the locals flock here is indicative of a great spot, if nothing else."], ["Anya T.", "Its nice that the restaurant start you off w/ some chips & salsa for the customers, tacos are cheap and tasy, and wait service is nice, but very VERY SLOWunfortunately my $7.50 mexican hamburger was served with AMERICAN YELLOW CHEESE- c'mon that is terrible- they should at least serve it w/ MEXICAN CHEESE- I know they got that queso blanco or queso oaxaca cheese!! its  A MEXICAN HAMBURGER!! Throw in some MEXICAN CHEESE AND AVOCADO SLICES POR FAVOR! my $2.50 horchata was SOO BLAND, especially with a mountain of ice. it just taste like water w/ a hint of sweetness. the $3 papaya smoothie tasted just like ice cream.. seriously? there isn't any papaya in there. IT was quite a disappointment. we are not driving another 30 minutes to come here when they serve this kind of subpar food :("], ["Minh M.", "The best tacos north of the Texas border. The portions are very generous for the price and they have the best chorizo I've ever tasted.This is a great find in Brooklyn and I will be back here everytime I visit NYC!"], ["Billye D.", "The food is good but the waitresses are about as slow and dumb as a backwards turtle. If you call to take out make sure you speak slow and clearly and have the genius taking your order repeat it back to you. Its been numerous times they messed up my orders and I spoke to them in Spanish so imagine how it will be in English. Other then that enjoy"], ["Coby G.", "Everything you'd want from Mexican street tacos. Good tortillas, meat, and salsas. They give you cucumbers, radishes, and a grilled onion with your tacos too (which is a huge plus). They have two salsas -- roja y verde (green and red). Tacos are priced at $1.50 each (a good price anywhere)They're serving from a truck, so you should expect to stand while you're eating, or find some curb space. The horchata is cold and comes in large quantities. I had al pastor (grilled pork) and asada (steak). The al pastor had piña (pineapple) and came with the tradition white onion and cilantro. The steak came with white onion and cilantro."], ["Elder M.", "This would be a five star review BUT the waiters are so serious and not too welcoming. Smile more maybe?! lol What I do appreciate is that they wear hairnets, which indicate that they are hygienic. I greatly admire the artwork that the restaurant has on its walls, it's amazing! For the food: TOUNGE tacos are BOMB.Horchata is great . That green avocado salsa is addicting and can be build-able to spicy.All other stuff like burritos & tortas are standard but good.Definitely recommend this place for late night crowds. On weekends they are open till 5 am!!! Recommend & Will be back!"], ["Spede K.", "Solid but nothing to write home about. but given the options in my nabe i would hit these guys all the damn time if i was closer."], ["Monica P.", "Best authentic tacos in Brooklyn! This has been my go-to for some cheap delicious tacos especially late night. Taco matamoros use to be my taco-craving spot many many yearss ago until they fell off the few recent years.Their tacos are loaded with onions, guac and cilantro on top, simple and just how it should be done while their meats are very flavorful!! My favorite is the tender beef... Which is clearly very tender! I just had the fried pork last night which was tasty as well but very dry... I think I prefer the al pastor more than the fried pork one. My boyfriend's favorite is the lengua (beef tongue)."], ["Steve L.", "Finally, top-notch NYC Mexican!Made my way down the R into Brooklyn seeking the elusive good NYC taco.  Found it in the form of the taco el pastor.  Made with a secret meat recipe including just a hint of pineapple and topped with a unique homemade guacamole (lighter, brighter than expected), the soft taco explodes with flavor.  So good that I didn't regret skipping the old favorite carnitas, which are also tasty.Hidden jewel is the consome de chivo - goat soup.  Large goat chunks melt in the mouth, yet maintain excellent flavor.  Garbanzo beans (and rice dumped in off the books) combined to make this a hearty, filling meal.  Although described as a traditional hangover cure, the soup works just fine for dinner.  It'd be a shame to leave having just eaten tacos.Takes credit cards.  No liquor license - yet."], ["Urayoan M.", "This place is great, but given the neighborhood - it the 3rd place taco spot in sunset / NYC"], ["Khanh T.", "My boyfriend and I decided to get some grub at 3am on a Friday night, this joint is what we needed. Inexpensive and very fulfilling. The regular sized tacos will fill you up. My boyfriend ordered the bistec burrito and it was humongous. The guacamole were authentic and flavorful."]], "Bar Bruno": [["Alicia G.", "Omg, I love great customer service!! It was so good I almost want to move to this neighborhood.My friend and I came here to eat at the outside portion because of the dog she had in tow. We were told it might be a long wait, but we didn't mind. The manager on duty was soooo nice and kept on checking on us to make sure we were okay with waiting. When our table did come he was so accommodating in letting us move to a more comfortable table. The server was also pretty great, coming and checking on us constantly. I can't really comment about the food, we just had drinks and guac, but the service was really great. I'll be back!"], ["Glenn K.", "Food was good but that is all I can say.  Not above average.  Also,  the drinks weren't as good as other Mexican restaurants."], ["Diana D.", "I'm a huge fan -- Period.  Nicest staff.  Great locals to start up random conversations with.  And, the best Mexican food in the neighborhood.  What more can you ask for?!  My secret tip:  everyone goes for the tacos because they an obvious delicious choice, but if you really want to taste perfection, order the chicken.  You won't be disappointed."], ["Josh Q.", "Pretty good guacamole for Brooklyn. The service (outside on the street no less) was pretty. They've got a solid selection of South of the Border drink concoctions."], ["Mike B.", "Delicious food. I came here with my wife and with another couple, we were not really expecting much, but now I can not wait to go back. The menu is mostly mexican themed, and I think everyone in our group went with some form of burrito. All the meals were very tasty and everyone was very pleased. I got the pork tacos and would highly recommend. My wife got the kale salad and fish tacos, and she has been craving them since.On top of great food, the service was spot on. I would 100% recommend trying this place out."], ["Jonathan B.", "Great drinks, good food and solid service. Fun place."], ["Amanda G.", "I really love this place.  It's a charming little spot with delicious food.  I've been a few times and keep promising I'll try something else, but can't help myself from ordering the fish tacos.  They really are that good.  Also would recommend the Carne Asada or the Shrimp tacos.  I've sampled a number of their appetizers and haven't been disappointed by one.While the service is mildly slow, the staff is really very friendly, so I can't really complain in that department.If you're looking for standard Tex-Mex, you won't find it here.  Here you will find a small menu with a series of well-executed dishes.  Nothing drowning in cheese and beans.  Bar Bruno is definitely worth a try."], ["M D.", "Came here for dinner the other night and loved it! Really cute atmosphere and friendly staff! Fish tacos and frozen margaritas are great!! I'll definitely be coming back!"], ["M M.", "Unlike my fellow yelpers below, I won't comment on the chairs or the hand dryer in the bathroom or the fact that they are busy or not or that they don't have enough Mexican food on the menu. Because...who cares? I don't think those are fair measures of a place. I've lived two blocks from here since it opened and it has always been solid. I've been about 6 or 7 times, and ordered delivery even more often.For brunch, the frozen margaritas (which are just about perfect!) and the variety of micheladas (which you probably can't find many other places) are great additions to the food. But this is not why I go. I go for the pancakes (and I even claimed I didn't like sweets, but their butterscotch pancakes are incredible!!!), the burger, the tacos, the queso fundido, the large salads, and the decent (though inconsistent and admittedly not-stellar) service. I will note, however, that I tend to be extra nice to waitstaff, and this waitstaff reciprocates, even if they are a bit slow. Bar Bruno also happen to be awesome at delivery--fast and yummy, with never a mess-up. For this price, the food and atmosphere, are terrific. And if you can't stand using a unisex bathroom or sitting on a \"school\" chair, ask for a booth, pee before you leave the house, or go somewhere else."], ["Stacey N.", "So the food at this establishment is pretty good, however, bad service will always trump good food at a restaurant. The waiter I had was insanely rude and short and not very attentive at all! He made my friend I very uncomfortable while treating others better in front of us! I will never go back to this place even though there food was pretty good and so were the margaritas with the chile rim."], ["Molly O.", "Seeing as I live around the corner, Bar Bruno has quickly become my neighborhood spot. Awesome selection of micheladas and good fish tacos. Great neighborhood ambiance: a good bar to meet friends for happy hour but also full or families (not necessarily a downside in my opinion). Service can be a bit slow, but this place fills up on weekends and during soccer matches, so it's to be expected."], ["Jackie K.", "I came here for dinner because I heard they have awesome margaritas and they def do!  I got quinoa burger and it was pretty good but the cucumber margarita on the rocks with a chili salt rim was perfectly refreshing and not too sweet.  I can easily say it's one of the best margaritas I've ever had. I got a Paloma and it was awesome too. Also a plus, I came here with a group of 4 on a Friday around 7 and there was no wait.  I had to go back about a week later for drinks and the bartender lady was super sweet and adorable. I tried my friends' pineapple and hibiscus margaritas and pretty sure every flavor rules.  I will def be back for the drinks!"], ["Lisa H.", "I have to admit, the drinks and the food is amazing. I had the guac with chips, carnitas and shrimp tacos. Soooo GOOD. However, they do not have happy hour (bummer). Additionally, for a carafe of Margarita is about $20 and it give about 2 1/2 worth, which to me is super wack. It was a disappointment, while I said the food and drinks were excellent, it is too pricey in my opinion."], ["Zack B.", "Wow. Absolutely rough experience. We had the Mexican mojito and caparihna cocktails and amazingly they both tasted the same. The result of way too much sour mix. And I never knew a mojito had sour mix. We ordered guacamole and a kale salad, both of which were forgotten and never mentioned by our server until I reminded her. Our food was \"okay\". I has the hearty stew which was terribly salty with too much like and my fiancé had the chorizo sandwich, and the bread was stale. Servers were kind but completely inattentive. Rough service night for sure. Will definitely not return."], ["Rose M.", "What a terrible excuse for a \"Mexican\" place. The menu is very limited and serves more sandwiches than Mexican cuisine. We tried two different kinds of the tacos - fish and carne asada each served with a bland side of rice and beans. Was the rice cooked yesterday? Because it sure tasted like it. Overall, the food was overly salted and bland. Nothing to come back for. Service was also awful. The waitress was curt and useless. There are way too many places in the area to ever go back here. Bleh."], ["Lou B.", "Great Margaritas and fish tacos. The outside seating is fantastic when the weather is nice and the cantina interior is great year round."], ["Roy K.", "I'm not gonna lie - I was a bit skeptical of a place serving Mexican food while featuring a George Best display. Seemed like a bit of identity confusion. But after trying their burritos I'm firmly a believer. Long live the Queen.They have nice outdoor seating and a stylish-warm indoor decor, so you can't go wrong with either. Highly recommend the grilled shrimp burrito. GREAT flavor. Pair it with a can of Tecate and you've got yourself a winner.I will definitely come back again."], ["Becky G.", "I would give 5 start for the brunch which is fabulous.  Dinner is 4 stars. Delicious, fresh and authentic Mexican fare. Hip, lively, understated atmosphere makes for a great Brooklyn neighborhood spot."], ["Mimi S.", "We stumbled on this place accidentally when Pok Pok had a two hour wait.  We were so surprised with the food.  It was great!  The tortilla soup had the perfect amount of spice and giant avocado pieces.  The kale dip was a pleasant alternative to guac or spinach dip.  The pork belly tacos were crispy and had a spicy end - but not too spicy.  The waitresses were super nice and accommodating!  We can't wait to see what they have for us next time!"], ["Lisa Y.", "This little place is one block from me and I have never visited until last night. The food is excellent, fresh and very flavorful. We started with chips and guac, wings and then had some fish tacos and an organic chicken sandwich. Everything was delicious. The sangria was really good too. I highly recommend."]], "Fonda": [], "Taqueria El Puente": [["Shirley D.", "This place is a hole in the wall, but an awesome find. Authentic and fresh mexican food with friendly and nice owners/workers. You don't have to venture to sunset park for authentic mexican food, it's here in Bay Ridge. The price is perfect for the great sizable portion you're going to receive and eat.Did I say authentic, from the tacos,  huraches, tostados  etc. The Pico de gallo is so refreshing on all levels. You want spicy, just say it and they'll give it to you.Byob. It'll get hot in summer, no ac just fan blowing...so take food 2 go n eat in park. I rather be a regular here than ho brah...too over priced there.This wil be our new spot when we're in mood for mexican n we're within the area."], ["Diane Z.", "The tacos were ok, nothing worth making a special trek out for. They are also on the pricier side for the amount of food you are getting.There are a few tables in the dining room, but it's not the most comfortable spot to eat. I wouldn't come back to eat in, but maybe takeout if I were in a pinch."], ["Geekar L.", "A good Mexican eatery has finally made it to Bay Ridge! I usually head over to the Sunset Park area to pick up some good tacos, burritos and the works, but no need to go so far anymore. This place serves up simple delicious food in their open kitchen, no frills. The first time I came here, it was pretty cold outside and my friend and I decided to sit in and grab a very casual dinner. There was only one person working, but he was super friendly and offered to turn on the heater for us, but it was warm enough, so we were fine. We ordered some tacos and rice and beans to share. Just like that...I was stuck on their fluffy rice and flavorful beans.The tacos were good too of course, none of that dry meat or oily situation and the ingredients were fresh. On a more recent visit, I ordered a vegetarian taco and a lengua huarache, yum! The food here is consistently good, so I definitely think they deserve a try. Overall, a really good option if you're craving Mexican food. I will be back for sure to check out the rest of their menu! One thing I do have to mention is that there can be a bit of a wait for the food. So try not to go when you're in a rush, you'll just end up hangry!"], ["Jim P.", "Ordered take out from here for the first time, and it was simply amazing.  My fresh shredded chicken torta was one of the tastiest things I've eaten in a while.  I will be returning.  Great addition to Bay Ridge."], ["ML C.", "Came here on a week night, wasn't sure whether it was strictly for takeout, or dine in as no one behind thr counter paid us any attention. We went ahead and took a seat at the nearest table. Decided to order their guac, a pork burrito, and their Chicken quesadilla since it was recommended on Yelp reviews. The chicken tasted a bit bland, had to add a lot of green sauce to it. The pork burrito had just way too much beans for my liking. The quac was okay, had better ones elsewhere. Total cost for the three dishes $24, price is decent in Bayridge Brooklyn."], ["Cat M.", "Calling all Burrito lovers, Ridge has a new spot where cheesy goodness over flows. Despite the winter chill that would make a snowman cry, my friend and I trekked out to taqueria el puente for casual dinner . There's about five wooden tables  that seat two and also a counter-- so yes some what of a small joint but it does not seem crowded with furniture. Around the windows are sombreros and tiny lights that create a warm glow inside at night time. They are a cute addition and something to daydream on when you find yourself too hungry to focus on your partners conversation. We placed our orders at the counter to the cashier who was shy but a true trooper after we took our time deciding what we wanted. Hunger will not last long because your dishes come out pronto. I ordered a chicken burrito and my friend ordered tacos with a side of chips &guac .The burrito was so big! Seriously the size of your head. Cut it open and smell of rice and chicken steamed through the air. I could barely finish it. ( I did though cause it was that savory.) I also searched for the most sugary drink I could find which was fruit punch. All their drinks come in glass bottles which I like- somehow tastes better. They give you plastic cups and plastic utensils which can be a tad unusual to match with the glass plates -- but that's just the charm of El Puente. They did not rush us at all which was good . I could take my time eating, talking and watching Spanish soap opera on their flat screen.  Behind the counter the phone was ringing nonstop. This place was getting delivery calls every ten minutes. I'm going to get take out from here now on. The food proved itself worthy.A place to try if you ride the r to the last stop!"], ["Kayla V.", "I made a trip here in search of some authentic Mexican.  I ordered a chicken burrito and requested raw onion, queso fresco and jalapeño inside the burrito.  The chicken was just plain shredded chicken, no flavor, beans rice and jalapeños. They put the queso fresco and sour cream on top (I asked for the sour cream on the side). The red sauce tasted like dried chiles just ground up with nothing else.  The green sauce was good.  I ordered one burrito but they made two and charged me for two.  I didn't say anything because I figured I would give it to my friend.  I was just not impressed.  I really wanted to like it but I was let down."], ["Stephanie A.", "Ive been wanting to try this place for quiet some time now and I was finally able to make it. Im glad that I did because this place is certainly a good eat. The staff if very friendly and on a nice day they open the large windows to give it an outdoor feel. Based upon the pictures I decided to go with the Steak Burrito. That thing was packed to the max but in a good way. The steak was good and so was the rice and beans. I also tried the chicken tacos and I really liked the chicken a lot. I will definitely be returning here to try some other dishes! The best part of it all is its super affordable, highly recommend!"], ["Cynthia C.", "Great vegetarian tacos piled high with all the fixins. At $2.50 a taco, three can fill you up easily (and cheaply). We went on a gorgeous evening, and with the front windows open it was a great place to sit and people-watch for awhile. Prompt and attentive service as we were the only two people in there, but they seem to do a good take-out/delivery service and handled the orders efficiently. Would definitely go back the next time I'm in the neighborhood!"], ["Tessa D.", "Got takeout for my boyfriend and I for the first time the other night and it was alright. We got the chicken quesadilla and the steak burrito. My burrito was 8$ and I wound up saving half of it for breakfast the next morning, that's how big it was, and it seemed to be mostly rice and tortilla. It didn't really have a lot of flavor, kind of bland and one noted. We did however love the green salsa, it was the perfect level of spice. Although everything was well priced I found the food kind of forgettable. I'd rather walk to 86th and get Chipotle in all honesty."], ["Ron L.", "Taquería El Puente, an innocuous Spanish reference to the Verrazano Bridge, due to its proximity, stands as the only taquería this far south in Brooklyn Bay Ridge.  As such, they are as authentic a Mexican restaurant as you'd find in Sunset Park or anywhere else.What may seem like a veritable hole-in-the-wall, is a hidden gem of Mexican food at the end of the R-line. In the summer, the large windows open completely to let in the most light and air the diminutive restaurant can afford.  Patrons amongst the few tables and the high bar may have to dine under dimly-lit lighting after sunset though. (I've yet to verify, but i have walked by at night)Most customers however, order out.  If you do decide to eat-in, you order from the counter, sit, and they'll bring the food to you. Mind you, if you're not squeamish about such things, when you're done and ready to pay, you'll have to bus the table yourself.Their tacos are on point (just right, not too salty and double tortilla), and their guac and chips are good too. I ordered the steak burrito this time around and it was served up ginormously on a plate coated with cheese.  It is impressive however, the lack of silverware is a bit disconcerting.  Guess what happens when you use plastic fork and knife? Yep, it was difficult to work with.Price? You guessed it, affordable- even in these parts. While that may lead you to believe that you're getting short-changed somewhere, no, you're not. The cheap eats here, my friend, are the real deal."], ["Brownstone P.", "Authentic Mexican food that's fresh, delicious, and cheap! They even added fresh cheese to my mushroom quesadilla. Very convenient location to the R train and buses. Will be back . . ."], ["Alex L.", "Decided to stop by as it seemed as a great spot to hit before my trip into SI. Tried out the tacos to scope the new place out and it was great. Have the salsa verde too, you won't be disappointed."], ["Rocco G.", "I work close by and this is definitely a place we frequently buy lunch from. All I can say is Authentic flavorful and well priced.I would recommend the chorizo tacos....there bangin"], ["Kyri K.", "Go here. Get the burrito. We went on cinco de mayo and although it was busy, that didn't take away from the experience or food. This place is legit. Big portions, good price, nice people, and DELICIOUSNESS."], ["Zack A.", "Now, imagine a venn diagram that has 3 categories: Mexican, authentic, and tastes good. Most other places fall within two. Either they're Mexican and authentic but taste bad or taste good and Mexican but the food isn't authentic. That's not the case here. The food is absolutely delicious and portions are plentiful. The price is just right although I was surprised a bottle of coke is $2.50. I'd much rather take a can and save $1.50. Anyway, highly recommended that you eat here. The chicken taco and burrito are to die for. Will deff be returning."], ["Christine H.", "Great food,great service n great owner....my fav place to eat in bay ridge. I go there almost everyday. The owner Josefina would cook me delicious Mexican food that tasted very authentic and sometimes I would have my tacos custom made, everytime is a pleasure!"], ["Marie T.", "Hallelujah! A taqueria that serves Mexican food that is authentic and it's in Bay Ridge, Brooklyn!  Very good tacos and tasty sopas. The wait may seem a bit long because there's only 2 people preparing food.  Well worth it.  You can order at the bar for food to-go but you can get table service if you want.  There are only 4 small tables though.I am coming back !!!!!!!"], ["Richard S.", "I have a new addiction - I want to eat at El Puente every night. Authentic Mexican food at a reasonable price. If you're looking for a scene, drinks, atmosphere, just go to Ho Brah (which is really good, if you can get in there.) If you're looking for a good, quick Mexican meal made with fresh ingredients, then this is the place for you. I'm working up the courage to try the cabeza (pork head) but I'm not there yet.BYOB, and they don't serve coffee in the warmer months. Plenty of Mexican bottled soft drinks here...my favorite is the guava flavored BOING! Try it!"], ["Robert G.", "Guacamole is insanely delicious. Tacos and burritos are mediocre at best 6/10. FYI for locals...an item is not authentic if its drenched in crema and crumbly cheese, or is packed with lettuce and tomato.  I heard the east coast didn't do Mexican food well, and if this is a 4.5 out of 5 via yelp, I might have to move back to Southern California."]], "Taqueria De Los Muertos": [], "Mesa Coyoacan": [], "Rocco's Tacos & Tequila Bar": [], "Taqueria El Patron Mexican Grill": [], "Mesa Azteca": [["Mackenzie S.", "The good- Margaritas are great ( small)The bad- It was freezing inside! I could not enjoy my food. Slow service food was not great maybe it was the day."], ["Pearl R.", "I had the chicken in poblano sauce quesadilla. I asked for black beans in it. The quesadilla was ok but I've definitely had better. My friend had the chorizo scramble. We shared the elote, which was good but for $5, you can get two in one order somewhere else. This place is overpriced for average Mexican food. They also only take American Express, extremely odd! Maybe they want people to pay cash. There's plenty of better quality decent priced Mexican restaurants. Would not come back here."], ["JE R.", "Way overpriced for basic Mexican Food. I went there for happy Hour and the service was barely there.  The server was too busy setting up for dinner that he forgot to attend his current clients! He didn't know any of the specials and I had to get up, go outside, read the specials sign and tell them to the rest of my party. Never again."], ["Loria N.", "Excellent frozen margaritas - come for happy hour!  The guacamole was delicious and I ordered the enchiladas suiza which was a lot of food but wonderful.  The outside patio is spacious and there sometimes is a mariachi band giving it an authentic atmosphere."], ["lauren g.", "There's no way I can fully express my disappointment with this place. I live in the neighborhood and had only been here one other time about a year ago and only tasted the guacamole and it was fantastic. It really stuck with me and so I decided to finally go back yesterday. Usually I frequent Los hermanos. You can't beat the quality or the price. Anyway, I decided to finally have a full meal at meza Azteca and I regret it so bad. We started with the guac. Worst guac I've ever had. First off, they charge 9.50 for the smallest amount. Second, I'm almost 100% that it was prepackaged and the added some fresh tomatoes to make it look home made. The texture is just not something that can be achieved when making guac on your own. It was like mush, not a single chunk of avocado in sight. It was almost slimy if that makes any sense. We also had the Mexican corn. It was alright but the entire corn was black...way too charred, and I've had way better for 2$ less. Then we ordered a fish taco and a grilled veggie taco. The fish taco smelled and tasted fish and texturally was uninteresting. It wasn't inedible but it certainly wasn't something that was enjoyed, and for $4 it was a complete waste. The grilled veggie taco was the worst and it was the one thing that was inedible so I sent it back. The majority of the inside was sautéed spinach. You can't even grill spinach so why would it be in a grilled veggie taco?? It had a little bit of soggy steamed squash and that was it. The whole thing was pure mush and was so unpleasant. Everything is overpriced and the taste and quality is lower than mediocre.  Save your money and go to Los hermanos down the street. They may not have all the options but at least the food is delicious and underpriced. Same thing with any of the many taco trucks around bushwick. The only thing I liked about this place was the decor but unfortunately it can't compensate for my terrible experience. Never again."], ["Mabel R.", "WOW service has REALLY dwindled here.  From a 40min wait 4 food 2 a FULL 2 hour wait (with a CHILD no less) & the managers nonchalance about it is more frustrating than the wait! Does it really take 2 hrs 2 make 2 burgers? And they now ONLY accept American Express?!?!?!?!?!"], ["Christina R.", "Sangria was good, enchiladas grrreat, i loved the sauce. Tacos blow the tres hermanos out of the water. Very very pleased and will definitely come back for mariachis with some ladies."], ["Sasha T.", "Don't bother. This place is overpriced and the food is mediocre at best."], ["Jay B.", "Went back in a few weeks ago. The food was ok. Had a margarita which wasn't as good as it had been the past several times I had been there. Also-the chips were stale.  I was so impressed with this place. What happened? This was my go-to and I don't even LIVE in the Neighborhood!!! :(    I was very disheartened. The worst was when we explained the situation with the chips to the server. She told us that the area where the chips were stored was not sealed all the way so they were basically left out all night and were not the freshest she brought us a new batch that tasted not much different and then still charged us $5 for them.  I didn't complain as we did nibble at them and just hoped that this place would go back to the way it did.  My fondest memory of Mesa Azteca was on 5o de Mayo when they had the mariachi band and I asked them to play El Rey and they obliged....."], ["Adèle W.", "Awesome food, cocktails and service. There even is animation as mariachi on weekends nights :)Great place for reasonable price!"], ["Sarah M.", "My boyfriend and I decided to give this place a try on a whim and it hasn't disappointed us yet. Brunch, lunch, or dinner it's amazing. The staff is wonderful and the food is sooooo good. Speaking as a Mexican from Texas, this is the best food I've had since I've moved here. My abuelos would be proud."], ["Kristen C.", "Mesa Azteca has good food and great margaritas. But thats....about it. The service is pretty shitty. They were on our case to order quickly - before we even had a chance to look at the menu, and then following dropping our food off, the waitress never came back. It took 20 minutes to flag down the waitress to get our check (we are trying to PAY you! Why are you ignoring me?). And there was hardly anyone there. Reasons it still got 3 stars:-Real good guac - order it spicy! Good amount of it, too. Enough to split between two.-Frozen margarita pitcher is the way to go. We got mango, so good. Strong without tasting strong lol. Plus if you're drinking, it's definitely the more economical choice.-Cute outdoor dining area. Quiet and casual, with cute, soft lighting.-Tacos were good. The steak was the winning choice. My date had the enchilada and that looked BOMB.-Fairly affordable, at least for the smaller dishes.Would I go back? Maybe. I don't find myself in Bushwick often though, so I feel like I'll try somewhere else next time instead."], ["Owen K.", "Great Mexican food and a large full service bar. I only found this place recentlya nd stopped in for lunch. It looks like it has a fun night life as well but I've never had the chance to try it out."], ["Lisa P.", "AMAZING!!! Everything we had was amazing. Definitely would come back and recommend. We had their corn, nachos, chicken fajitas, steak quesadilla and it was all amazing."], ["Krish S.", "I'm not sure if it's because we went on a really busy night, but our experience was awful. I'll start with the positives: - Plenty of margarita flavors, and fair priced pitchers. We got strawberry, and between 2 people it served its purpose. - Cozy atmosphere- Tasty Mexican Street Corn. This was the highlight of my night. It was flavorful and fresh, but pricey for one corn on the cob. And these are our negatives:- It was REALLY busy, which is fine, and made us even more excited to try the place. However, management didn't seem to know how to handle the volume. We patiently waited 30 minutes, only to have people who came in after us get seated first. After we told the manager, and he realized his mistake, he did not apologize/recognize his mistake. - Once we were seated after waiting, we did not get menus & utensils for close to 15 minutes. - We never got water, even though we asked for it two times. - We ordered 2 Mexican corns, and only got one. We told our waitress a few times, and she still had two on our bill, which we had to dispute. - We didn't get chips and salsa, a standard at most Mexican restaurants, until after 45 minutes of being seated. - Our food took over an hour to come out. My order was wrong, under cooked, bland, and cold. Ultimately, I just moved to the area and after seeing so many positive reviews, was excited to try the place. I may give it a second try on an off less busy day, but with so many places to try in the area, it's hard to justify paying close to $70 for a meal you did not enjoy."], ["Rebecca G.", "This past Saturday my friend and I got here early to take advantage of Happy Hour. I started out with a $4 frozen watermelon margarita, and it was just what I wanted! With heavy pours, Mesa Azteca's margaritas are both strong and flavorful, and will not let you down. And my friend started out with a $3 ice cold Corona with lime, which also hit the spot!We then ordered round two just before Happy Hour ended at 7:00, and another friend joined us shortly thereafter. As entrees we ordered the vegetarian enchiladas and chicken burrito respectively, and while my friend said that the burrito was to her liking, the vegetarian enchiladas left me wanting. Luke-warm and filled with previously frozen, bagged veggies, one was filled exclusively with green beans. However, the sauce was tasty, as were the rice and beans.I'd definitely return for Happy Hour and frozen margaritas, but I wouldn't order the enchiladas again. Also, while the service began well, by the time that it came to pay, no one came to run the cards, so we had to walk them up front. Then, it even took awhile longer before we were attended to. Don't you want your money?"], ["Linwood Y.", "I had a desperate craving for fish tacos and asked a friend if she knew of a place in the neighborhood. She pointed me here and I'm glad she did. The tacos were amazing. I also got a shrimp taco which was equally delicious. While I waited for my food I ordered a Pina Colada and it was delicious. The interior is gorgeous as well. Everyone was super helpful. I definitely plan on going back to eat in instead of just ordering to go."], ["Rachael C.", "Ok so the food isn't that great nor is the service. The drinks are great though so go there to get drunk and order a taco for the road you won't even know! Service can be erratic but everyone is really friendly. The backyard is really adorable as well.  I can't help but keep going back."], ["Leila N.", "This place is a treasure! Amazing secret garden, delicious micheladas, yummy food. I would stay here forever if I could."], ["Briana M.", "Love this place. In recent first world problems news, I've been without a car for about a week. It's forced my dude and I to explore eating options in Bushwick beyond Seamless. Glad we gave this spot a try. As soon as we walked in there was a mariachi band setting up - good sign. The band was fantastic, played my favorite classic (Cucurrucucú Paloma). Food and margaritas were as good as the entertainment, even after filling up on chips and salsa. I got the Shrimp Burrito, which was awesome, and he got the Enchiladas Suizas, equally awesome. Their refried beans were very porky. I loved, but vegetarians beware. I think I'm going to try every burrito on the menu this year. Dream big."]], "Blue Agave": [], "Xixa": [], "Chavela's": [["Y S.", "My girlfriends and I were there Friday.This place is not your authentic Mexican restaurant its more Tex Mex.The bartender was okay,not the friendliest.I must say our waitress Selina was not very attentive.She tended to a party that was seated after us,we're weren't told of any special for the evening.We order the guacomole and chips as a starter not knowing that its not a sharing portion because it comes with one tortilla.I order the plato Don which was okay,not wowed by it.My girlfrien order the steak which was bland.Needless to say we agreed that there was no need to return to Chavelas with so many other restaurants that we can patron with better service and food."], ["Davin A.", "I don't like writing long reviews. So I'll get to the point. I like this place.Nothing better than cheap food and inexpensive drinks. I lived the Mexican heritage decor. I wanted to steal one their glasses butterflies onto the wall. Lol (Please don't tell management because i plan on coming back many times this summer.. )"], ["Amy L.", "Yummy! The food was great! I went on a Saturday in the middle of the afternoon and the place was packed. I well definitely go back on a week night to check out their happy hour. Chavela also has a really nice environment!"], ["A U.", "Absolute favorite Mexican food in NY!! Been here couple times, everything we try we would get surprised. Chef would come out and ask us if food is good. A place that care about food quality. Amazing cactus salad, guacamole, shrimp plate, tacos, and cucumber drink!! Can't wait to try the don next time!!!"], ["Mini R.", "Food and drinks were amazing and the prices were incredibly cheap. Good vibe, good atmosphere. Waiter was great."], ["Alix D.", "Pants-splittingly delicious. Best verde sauce I've ever had. Highly recommend the Don Pepino cocktail."], ["Danielle R.", "Came here for brunch, and I have to admit I had my reservations. As a bonafide Cali kid, I tend to be very snobby about Mexican food, but this place was delish!I had chilequiles, and although they were not the best I've ever had, the flavors were pretty tasty and the sweet mexican bread they brought to the table made me nostalgic. Yumm!I still have my reservations about good Mexican in NYC but I'll def be back again to try a few more menu items out!"], ["Kelsey B.", "Get the esquites! The red sangria trumps the white by far. The tables are a bit close together, so if you are looking for a private conversation, I would consider other options."], ["Jon C.", "Waitresses and waiters won't walk into your selfies even if you are in their way. So respectful. Thank you.Tiny quesadillas but wow great. The waiter with the cute voice can dance good. Shakira playlist, she's sitting next to me. The chef has nice shoes. Cute bathroom.Get the fish taco plz with the red sauce not the green sauce. @shakira"], ["Matt C.", "One of the best restaurants in the area! Great Mexican food. Service and vibe are also great. However, it can get quite loud when they are busy."], ["Alan C.", "I ordered three tacos. The hongo was hearty with a little heat, the aguacate con queso was tangy with a smooth beany taste, and the pescado was sweet and creamy. Excellent and flavorful tacos."], ["Mattias A.", "It's ok. I went there for lunch special and had half a chicken. Expected a bit more because of the Michelin recommendation."], ["Double A.", "Went during happy hour last year: great customer service, my friends loved their drinks (I had the nonalcoholic sangria that the bartender cut with lime, his recommendation that was well prepared)The chicken mole was okay. The pork taco was tasty.  Fish taco was amazing!! I had several of those.I would definitely recommend and come back."], ["Dorene S.", "Friendly staff and great drinks! Intimate setting perfect for you and your friends or your special someone.  The food was delicious at great prices. I definitely recommend."], ["Rich P.", "Really good authentic Mexican food. Great service as well. If you are a lover of Mexican Food, this is a must stop. I enjoyed my meal and my time spent there."], ["Remington M.", "Decent spot for tacos and beer. Get the steak tacos!"], ["Jordan D.", "Sad to say--it is resting on its laurels.  For the price point, the service was really strange!(The waiter came up behind my friend and whispered in his ear, \"chug! chug! chug!\")  Did this turn into an Irish pub?  Can't be, because the Don Pepinos which we paid extra to have with mezcal didn't even taste boozy.  If it were a pub, we could taste that.  We tried several of the specialty cocktails and they all tasted too sweet.  Hopefully just an off night?  This was a place we always regarded highly for drinks.The mole enchiladas are still good, but why is the presentation just a plate of brown?  Can't they put some radish slices on there or lime or something to give it a little color other than brown?Seems like I'm going to have to start looking past Chavela's and maybe past Crown Heights for Mexican food.  Is it time to go to Brownsville now?  Is the Starbucks opening on Franklin bringing everything else down in its sweep?"], ["Brad D.", "Fish. Motha-humpin. Tacos, y'all! This place is awesome. Wonderful staff, cheap, a la carte tacos, and a great atmosphere. I love this place. Lacking: beer selection (only \"mexican\" beers...) and the margs were pretty weak. But the food is a bargain and quite good. Cool crowd, def a neighborhood place. Give it your attention and ye shall be repaid!"], ["Bria A.", "Went here for happy hour and literally the best thing was the drinks. Mind you, I only chose to have a beer. So I did notice this place has a lot of great reviews, maybe these people just know what to get at Chavela's. I went on a cruise and stopped in Mexico where we had food, so I don't know what can be more authentic than that. Plus our cruise line cooked Mexican food for us that night, great!I like to keep it simple when I go to a new place. I ordered a Chicken Quesadilla, one Chicken Mole taco and some rice and beans. My boyfriend ordered 3 Chicken Mole tacos.The mole tacos were not bad but not what I expected. My boyfriend had to force his self to eat them because he hates to waste food. He seemed not to like them at all. I was so glad I only ordered one. The taco had a sweet flavor and even though I added a little pinch of salt to it, it still seemed to be missing something. I ate that and I knew that I would never get it again.The rice came with black beans which is one of my favorites. The rice was actually good no complaints.To the quesadilla, the chicken smelled like it was boiled in baby poop. The flavor was oh so bland. I took a bite with my fork and had to spit it back out discreetIy. I asked the waiter for something else.I decided to try the fish taco, it was the best thing on the menu that I ate, by far. I don't know if this was just a bad experience but my boyfriend said \"You can't get me to come back here ever again.\"I really wished that my experience was better. Everyone else there seemed to be enjoying their food except us. :( 2 stars..."], ["Giulia A.", "Very niiiice!! :) cool ambience and very welcoming!Guacamole is so good! We had enchiladas and chicken salad, so tasty! Had a good time here, come back soon!"]], "Jolie Cantina": [["Matt B.", "My first meal in Brooklyn! Local friends were taking me around and this was our first stop, and I can understand why! The margaritas were great. I had a five citrus one and then a ginger one. Go for the ginger one (sorry, can't remember their names...problem of having a number of drinks). For an app, we had mussels in a broth that begged for some bread to soak it up. They give you French fries but that just doesn't do the trick. Then, for dinner it was two lobster tacos. They were great! At least, that's what the margaritas were telling me. In all, a fun spot with good food and great margaritas!"], ["Michelle R.", "My boyfriend & I continue to take friends and family to Jolie Cantina for brunch and drinks.  The food is always very good and everyone leaves full & happy.I recommend the croque madame, steak sandwich, jolie burger, any omelette, pancakes (simple but very good), and taco entrees - yes, we've been there enough to have tried these entrees and more.... though, the one item on the menu I would not recommend, unfortunately, is the lobster roll.  It's probably because I'm a lobster roll purist, but their version has several extra ingredients (rajas, muenster cheese, spicy mayo) that take away from tasting the actual lobster meat, which should always be the star ingredient on a lobster roll sandwich."], ["James W.", "One star deduction: They only accept AMEX. Other than that, I'm a big fan. I would definitely return to try the other items on their menu. I came here on a weekday and they have some great lunch specials. For $14.95, you can get an appetizer + main course + drink or a combination of a main course + dessert + drink. They also serve $1 oysters all day long. This is a great deal at a great restaurant nestled in the heart of Cobble Hill. My friend and I shared a guacamole which was made in front of us. It's nice to know that the $12 guacamole didn't come out of a can. We also tried their $1 oysters, which was tasty. It's hard to get raw oysters wrong. So as long as I didn't get sick from eating them...I ordered the lunch special which came with French Onion Soup + Grilled Hanger Steak (Medium Rare) + Hibiscus Iced-Tea. The total for my portion came to $27.50 (includes tax + tip). I'd definitely love to come back for the lobster chilaquiles and the kale ceasar fish salad."], ["Katerina B.", "I discovered this cute place on one of my trips to Brooklyn. I must say their guacamole is A-a-amazing and you should definitely give it a try if you there. I ordered Hot Mama cocktail and it was a perfect choice to accompany my Eggs. Also, I love their decor, it's a perfect place for a brunch/lunch date or meet up with friends. This French Mexican cuisine alliance should be on your list if you ever in Brooklyn."], ["Peter D.", "Every time I eat at Jolie Cantina, I end up asking myself the same question: \"Why don't we come here more?\"*The service is good. The music is good. The specials are better (various lunch specials, dollar oysters, etc.). And the food is always the star. The Mama Nachos are gorgeous, perfectly proportioned (never too many chips for the toppings, and plenty of guacamole), and a meal unto themselves. The brunch options never fail, from benedicts to steak and huevos. The oysters are always fresh. My new favorite dish? The Spicy Fish & Mango salad. Well-balanced, flavorful perfection. The dressing is addictive, the fish perfectly cooked, the bits of mango and avocado seasoned well, and the sunflower seeds an excellent textural addition. For gods' sakes, they even make me like vegetarian things [when I very rarely order them]. Yes, it might gall some of you to pay $12 for a plate of two tacos, but this is a beautiful sit-down restaurant in the expensive part of expensive Brooklyn, and it's a full meal (comes with beans or rice). A damn good one, too.Basically, some things are great, and everything is good. Perhaps that's one of the reasons I don't always think of Jolie; they don't have one cravable dish that's my go-to. Rather, I want to try a different dish each time I walk through the door, because I've never really been disappointed. And when you think about it, that's far, far more impressive. ____________*The answer is probably laziness. It's a little bit farther from my apartment than I want to walk on a regular basis."], ["Kamael S.", "Siblings and I love Brooklyn eats.  A hot Friday night called for some cool wine and spicy Mexican.  We had the oysters - on the small side, but super fresh.  Next came the beef nachos.  They were amazing - light (!), flavorful and oozing cheese and guacamole.  We all got tacos and they were delicious!  I highly recommend the vegetarian ones - so flavorful!  Dessert was a home run with the trio of creme brûlées!"], ["Erdal A.", "Great food. Friendly service. Our waiter was great. Ordered the spicy guacamole. Freshly made in front of us. Great! I got the spicy chicken enchilada. Very tasty. Partner got the oyster app and octopus cerviche. They enjoyed both. Would recommend if you are in the area and want Spanish food."], ["Danny I.", "French?  Mexican?  Both!I'll be honest I'm not a fan of fusion but this seemed to work.  Probably because they didn't over do it trying to marry the two.We stopped in for lunch and really enjoyed it. We had the guacamole which was prepared fresh table side (as it should be), chicken salad and the kale Cesar,  All really good, filling but not overly heavy.  That being said we also grabbed churos to share for dessert.  The Mexican chocolate sauce had just the right amount of bitterness and was complimented nicely with the crema."], ["Kimberly Q.", "The food was ok, and very overpriced. I grew up in California where we have amazing Mexican food. I probably won't come back to this place, unless I was absolutely craving Mexican food and had no other option."], ["Chelsea S.", "My first Yelp review!Went tonight with a friend. Everything looked divine and it seriously took me a solid 15+ min to decide what to eat. Ended up with the bouillabaisse and it was exceptional! My friend and I discussed after we left and we both agreed that we would return here in a heartbeat. Absolutely delicious! The only reason it gets four stars is because the waitress could have checked up on us more, but even still, she was friendly and polite and helpful with menu choices. I seriously will be making this one of the spots that I recommend and bring friends to. Can't wait to come back and try more of their delicious meals and drinks. Bravo, Jolie Cantina!"], ["Cristina D.", "Wonderful. Went at 8:30 on a Saturday, place was packed but we got two seats at the bar. Tried two different margaritas which were very good. Started with the tostada trio appetizer. We had ordered the stuffed jalapeños, but the tostadas came out by mistake. The bartender who took our order was quick to notice and said he'd have the correct dish sent out right away. Since we had almost ordered the tostadas anyway we said not to worry about it. They took it off the bill without us even asking, which was nice. Then we had the seafood bouillabaisse and the short rib tostada, both were wonderful and satisfying! The only thing that wasn't great were the French fries, hence only 4 stars. Definitely going back for more, and will probably try and make a reservation."], ["Tom H.", "Excellent restaurant. Don't be afraid of their \"fusion\". It's based on years of experience and they nailed it. Came on recommendation of a local. Had the Mexican ravioli and a prickly pear mescal margarita. Both delicious and flavorful. Staff was friendly and engaging. Easy to get to by train. Don't settle for Manhattan tourist. Get here."], ["Kenny C.", "Did you know that French/Mexican fusion is a thing? Neither did I, but Jolie seems to.I came here for a low-key dinner with a friend. First thing we noticed is that it was dark and loud. The table next to us (full of older couples) had to pull out their cell phone lights to read the menu. But not us, we youngin's grew up with bad eyesight so we toughed it out.Was it just me, or was the menu more segreated than fused? There didn't really seem like many dishes that incorporated both Mexican and French cuisine. Sure, the decor and painted walls included French themes (a fleur de lis here and there, and the word \"Oui!\"), but aside from their cheese selection, I would've believed it if you told me it was just a fancy Mexican restaurant that will make you a Michelada with Kronenbourg.That said, the food was delicious.We shared the trio jalapeno fritas (3 stuffed japalenos). The one with the crabmeat was definitely the best. The peppers varied in spiciness, which was a fun game.We also shared the spicy ribeye taco, which I believe was 2 for $15 or $16. A bit pricey, but they were reasonably sized and the meat was cooked and sauced perfectly.For my entree, I had the spicy organic chicken enchilada. Probably the most low key of all the dishes I had, but it was filling. Big portions too.The Mexican rice is also delicious. It tasted like it had some sort of stock in it, but I believe it's vegetarian-friendly.I also have to mention that they have a good cocktail menu. I tried the El Puebla (bourbon-based Old Fashion-esque drink) and the Horse Tonic (a wonderfully named ginger and rum concoction). I liked the Horse Tonic a lot, though I also tried and enjoyed my friend's Rififi (gin, cucumber and some mint & mescal).There were a couple of service hiccups (we had several different servers, and one of them gave us the dessert menu before we even got our entrees).That, and the overly loud drunk guy at the next table, were the only exceptions to a wonderful dining experience.Hope to be back for brunch soon! I hear it's excellent!"], ["Leila L.", "We came here on a Saturday for Brunch.  This is nice because it's one of the later brunch spots in Cobble Hill.  They have brunch all the way til 4pm.  If you order guacamole, they'll make it right in front of you, very fresh, very delicious, but have a group to help finish it.  Other than that, we had the Lobster Benedict and Black Angus Steak and Eggs.  The Benedict came with chunks of lobster over soft muffins.  Very enjoyable hollaindaise and filling portion.  The steak and eggs was itself a meal that could've bene shared by 2 people.  The steak was small and thin, so it was easy to cook, but everything that came with it was very filling.  You had the small skirt steak, tamale, salad, potatoes, and a whole black bean omelette.  I was disappointed in the steak but everything else was very good."], ["Wanda N.", "I was a fan of the old Jolie and was sad when it closed. I finally got around to coming to this location and excited about the Mexican French Fusion.  Loved it.The mussels with chorizo was delicious.   The steak tartare fresh and yummy.  The guacamole...holy mole, get the guac, made at your table and delicious.  The service was great, we weren't rushed, the wine delicious."], ["Tina M.", "I really enjoyed my experience here. Our server Tobita ( I hope I spelt her name correctly) was very welcoming and helpful with menu choices. The vegetarian nachos were great and after I had the mexican mini raviolis which were wonderful. The white sangrias was delicious. Prices are reasonable and the place is fun. The only draw back was the one bathroom, may have to wait a while when it is busy. We paid cash so did not experience the credit card issue others have mentioned. I would definitely go here again. Great combination with the french and mexican style cuisine. Lots to choose from on the menu."], ["Noah R.", "Only credit card they take is American Express. Wasn't a problem but I find it unusual. They also filled us in on the bit of info after the meal when they gave us the check.The food was excellent. Nachos were awesome. Mini raviolis were amazing, so rich. The heat margarita tastes great. I coulda had 5 of em."], ["Michael C.", "Amazing guac and mole in the middle of Carroll Gardens. You could just order the guac and a few drinks and you'd be satisfied."], ["Mike G.", "Walked up smith st looking for an interesting bar and this one definitely looked out of the ordinary. They have some real interesting decor which basically brings you back to the Stone age of the 70's very cool and authentic. was pretty full when we walked in grabbed a seat at the bar their drink menu was pretty much down to a simple list of 10 different exotic French sounding drinks which sounded orgasmic We decided on the French kiss drink, I didn't get to French kiss but yet was worth it, my company was really funny and entertaining of course beyond beautifulTime passed us by so quickly forgot to check the time before realizing the bar was completely empty so I ask the guy what time is it! It was 11pm yup they close early. End of story FYI this place takes only American express or cash"], ["Uyen N.", "Great ambiance. Awesome service. The drinks: thumbs up. And the food: YAAAAAAAS. Just get all the tacos."]], "Don Nico's": [], "Ho'Brah a taco joint": [["Tori B.", "Got lucky and was able to get seated immediately  (party of 4) on a Thursday night close to 9pm.  There were more folks there than I expected.  Service was fast and friendly.  The food and drinks reasonably priced too!  We got two flights of frozen margaritas: mango, raspberry,  strawberry and blueberry.  They actually DO have pulp in them!  The chips are delish, nice thick crispy ones, not those thin flaky ones that break when you dip them in salsa.  We got nachos with barbacoa.  DELISH!  Then, a quesdilla to share also with barbacoa.   YUM!I think the blueberry margarita was the best.  Perfect balance of sweet and tart.  We'll be back next time we are here!"], ["Miri J.", "Unfortunately, most delicious foods, and I am talking about the real good staff is usually also not that healthy. And Tacos is the food I found that is closest to delicious and healthy at the same time. There aren't many places that can make food that will be both healthy and delicious, and Hobrah doing it well. Very well!When we arrived and noticed the long line at the entrance, we already knew that this place is good (And after going over countless reviews on Yelp). We started with cucumber Margaritas, which were good and positive start. They have large portions (As every Mexican places should have), and their chicken tacos worth a second visit. For me, when I can enjoy a meal without too much spicy extra on the side, it tells me that the place is good!Add to all of it good service, and you just found a place that worth a visit."], ["Jennifer P.", "Def my favorite brooklyn taco joint! I have been here several times now and it never disappoints (well food wise that is)! I do wish the restaurant was bigger. Coming closer to the end of the week this place can def get pretty packed. I myself have waited close to an hour to be seated or have left and have seen others leave due to the long wait. But other then that the food can be well worth the wait. You can't go wrong starting with an order of chips, salsa and guac. The loco frites and the baja street corn are also pretty good. My fav tacos are the sunset pork, long beach all star and the classic cali. Have yet to try their desserts as I never have enough room left for it."], ["Caitlin T.", "Service sucked only one good waitress someone stole my id and I went with my girls for dinner and drinks all my friends had ids and after I told my waitress what happened and showed her a picture of my id she wouldn't serve me :( I understand the situation just totally ruined my evening and then the waitress started talking about me to her co workers which I find is very rude . My quesadilla had bones in which is so unappetizing"], ["Melissa M.", "Good Guac, and drinks! It's usually pretty packed on the weekends and you can't make reservations. The Loco Frites are amazing. Def a must try. It's tostones with a combination of avocado creme, pico and jack and cheddar cheese. I ordered a steak taco and was very disappointed. It was just a tortilla with just steak- no lettuce no tomatoes and then it had a BBQ sauce. I had explained to the bartender exactly what kind of taco I wanted which was steak taco with some avocado lettuce and tomato- which she said they could make. Maybe it was my fault for not ordering exactly what was on the menu. The restaurant is pretty small and you may have to wait a long time for a table. I gave it a four star since I always manage to squeeze into the bar and the drinks are always good. Definitely try the bulldog margarita. You won't be disappointed."], ["Lili R.", "Great taco-joint! Its a small restaurant with limited seating. The decor is cool with surfer pics. Their drinks are probably better than their tacos. You MUST try their frozen flight - 4 small margaritas served on a wooden tray. Their margs are great! As for their food - the guac is delicious! I wish they also served it with a salsa. The tacos are hit and miss... i've tried the Long Beach All Star, Sunset Pork, Diablo Diego, & Bohemian.  the beef in the all star desperately needed seasoning - I put it down after 1 bite. The sunset has a sweet tangy taste. The diego could use a bit more spice. The bohemian has too much shredded chicken. I won't write this place off because it is good, just not always great. Maybe next time I will stray away from the tacos and try something new. As for the service, my server did get a little lost at times but overall did an okay job. I will return.. hopefully they redeem themselves."], ["Jeanine Z.", "I love ho brah. I go often with friends. I just wish they had happy hour! There's usually always a wait and they don't take reservations. But I never mind grabbing a drink at the bar. I really like the cucumber margarita. But they have a few different kinds, and I've heard they're all good. The guacamole is pretty good. I like their tacos, specially the one with cod and barbacoa. I've tried others as well and liked them all. Sometimes I also get the mission bay burrito In a bowl with chicken or barbacoa. It comes with beans, cheese, guacamole, salsa, rice and sour cream. It's delicious. Ho brah is great place to grab food and drinks with friends."], ["Adriane H.", "Everything was okay while I sat at the bar enjoying my ceviche and bulldog with my date until we saw a roach crawling across the bar. Yes. We saw a roach at the bar. Disgusting."], ["Bina S.", "I was craving tacos and decided to go to a local place to get some.  This place has a charming interior with brick walls and a small bar inside.  My husband and I ordered four different tacos (soft shell) and chips with guac and salsa.  We ordered two fish tacos and two tacos with meat (pork and beef). The taco with the atlantic cod was pretty dry but the other three were great!Keep in mind that their portions are pretty big. I usually order two tacos where ever I go, but I was pretty full with one taco and some chips at this place. Place is pretty small so if you are planning to go there with a group I would suggest to call first. Enjoy!!"], ["Amy N.", "Another place checked off my list of bookmarks. What a cute place with a cool California twist. Surfboards, wooden/brick walls, Hawaiian floral patterns, frozen margaritas....a place you would expect on a broad walk. My husband, and I strolled in for lunch on a sunny afternoon, but the ambience was too dim, they should lighten up a bit to go with the beachy feel. We started off with an order of Guac Chips & Salsa (chips wasn't free). The bowl of guac which seemed small at first, weren't enough chips to dip them in towards the end, but for 9 bucks, it's pretty pricey. D's glass of Freshly Squeezed Lemonade was very tart, soon enough, the ice watered it down, and it turned out just right. We also had 2 of their Baja Street Corn, too much cheese to begin with, and lacks salt. A few of their items on the menu are a bit cheaper if ordered in pairs.They have specials everyday of the week, and since it was a Friday, I went for the Friday: Bombora. Large sized fish sandwich served with a side of home made potato chips. You taste the freshness as soon as you take a bite of the panko crusted cod, the slaw complimented it very well by the sweetness of the red pepper. On the other hand, the tacos weren't what we expected, they were on the small side. The beef in the Long Beach All Star had chewy texture, not much flavor. The Diablo Diego stood out more out of the two tacos we shared, shrimps had a small kick of spice, I enjoyed the tangy pico de gallo.There were other items that caught my eye on their menu, like the naked burrito,  pork empanadas and their brunch. I would come back for those and give Ho 'Brah another shot."], ["Jenny C.", "I really like the atmosphere of this place, it's so aesthetically pleasing. It was pretty full so I waited 30 minutes and it was fine because I was also waiting for my friend and I know some restaurants have an hour wait. I'm a huge lover for spicy food and I was disappointed at the Diego taco since it wasn't as spicy as I thought it was going to be. I thought it was going to be at least \"Mexican-spicy\" but it was like white people spicy which isn't spicy AT ALL. And that was their spiciest. Even the sauces doesn't do it justice on the spicy level but the guacamole was bomb and I honestly wish they gave more for a $8 price. It was the same amount you get at chipotle except chipotle is $4 and has better chips. They only had one chicken taco, which is rare for a taco joint and it tasted kind of weird for a chicken taco but I'm not complaining. It had a unique taste to it but it isn't bad."], ["Kerry G.", "Ordered: Chips and guacamole, Shrimp empanadas, and Barbacoa tacoPros-- The guacamole was very fresh with chunks of avocado. The empanadas had slightly overpowering flavors, but it was accompanied by an avocado cream that lightened and balanced the dish. I'd recommend trying other items with the avocado cream-I ended up dipping some of the chips in it. The beef from the taco had a nice barbecued flavor.Cons-- The seats are packed close together, as the restaurant is fairly"], ["Tim R.", "Had brunch here and this place took me back to home, Cali. Shared the Huevos Rancheros, Long Beach All Star taco, and Classic Cali taco with  my young lady. All of the dishes were good and nice size. Also had the margarita and really enjoyed it.  They did hand us three different menus. I do love having a selection but this was a little confusing."], ["Lena D.", "Got here just before 8 on a Friday night, told it would be a 35-40 minute wait.Sat at the bar, our bartender was friendly and efficient. I enjoy the two kinds of Kona on tap, but was disappointed that their seasonal Kona was in fact Breckenridge Agave Wheat.Waiter recommended the burrito special, roasted pork with red mole sauce. The pork was shredded with hints of lime. It was good. $13.95Had a bulldog, (coronita and margarita) it was good. I hate that they clear your drinks before they're totally empty. Service was prompt.They're opening another location on Staten Island in March/April - sweeet!"], ["Nancy F.", "Came by this place after it was highly recommended by friends. I'm always open to new food and I love different flavors in my food. I tried the \"Chicken Mole burrito\" and after one bite I knew right away the taste was totally off. I think it's the jasmine but it's WAY too overwhelming.. it was literally the only thing I could taste. I myself am a waitress for about 10 years and I never want to be \"that person\"Told the server politely I didn't like it and the reason why. He was totally cool until that moment he got a little attitude and was like \"well have you ever tried a chicken mole before?\" I told him I had and I was okay with nothing since I lost my appetite after that bite.When the bill came he knowingly didn't take off the burrito in the hopes I would pay $10.95 for LITERALLY 1 BITE. When people don't enjoy a meal in a restaurant I immediately have my manager take it off the bill and talk to the table in case if they might want something else. Of course there are exceptions like if you eat more than half the meal you wouldn't complain you didn't enjoy it. We asked why the burrito was still on the bill which he said with attitude \"I really can't take but I will this time\" I really doubt that I couldn't be taken off the bill and I wish I did talk to a manager who obviously would have taken care of the problem the right way. Bottom line they need better trained servers(I also did go during the day so maybe for the night shift it's a completely different cook or servers who I cannot judge)Great atmosphere but the SERVICE SUCKS!(During the day)"], ["Henry C.", "I was here months ago and the food and service was horrible, but I figured I'd give them another chance (everybody can have a bad day). Boy was I wrong. I will never set foot in that place again. Was rudely told I had to wait 25 minutes even though the restaurant was 3/4 empty. Pretty amazing considering they don't take reservations. Don't waste your time at this place."], ["Michelle C.", "I already had high expectations for this place based on it being the sister restaurant for Kettle Black , I was told this place never disappoints from locals too.When we first came in on a Friday night it was packed, but it didn't get to the point of us being uncomfortable , the wait was much faster then we expected , less than a 20 min wait, if anything you can have a seat by the bar for some drinks to kill time, with very cute bartenders :) hahathis place has an awesome design, it feels like a place you would go to after the beach, almost like a shack, they have awesome surf boards and water murals , lots of bright colors too from the dishes to the furniture, its very invitingthe waiters are so friendly , they were able to accommodate me with my diet from the drinks which they can make a skinnier version of to the tacos themselves, you can take out anything you want to cut back on calories, so I took out the coleslaw which is usually found on the majority of the tacoseach taco ranged from 2.50-4 bucks , I like how they didn't offer just meat options but vegetables and shrimp too, and they aren't stingy on the amount of meat they give in each taco, the steak taco with glazed bbq sauce was a big hit, it was really filling filled with lots of flavor, they can also add slices of avocado or cheese for just a dollar extrathe shredded chicken tacos were a must, they had a tangy touch to them from the lime, and they added some greens to it as well, the flavors worked really well togetherthe tortilla chips and guac was great, they weren't too oily and were plentiful, the guac was chunky and fresh with a hint of lime which wasn't too overwhelmingthe food came out quick too, my friend got chicken fajitas which came out sizzling hot with onions and jasmine rice for the fajita wrap, the chicken was perfectthe menu also had other good options like tostones, burritos too with large portionsthe highlight of this place is the drinks, the ingredients are homemade as mentioned in other reviews, not artificial crap, when they muddle ingredients, its real ingredients!the jalapeno margarita on the rocks was so good, it wasn't too strong and it was a decent price, they offer majority of the drinks in frozen versions toothe bulldogs were great ,its perfect with coronathe next drink on my list to try is their cucumber margarita, it sounds perfect for the summerthis place also has really good music, lots of indie rock to alternative rock, modest mouse and silversun pickups ftw!this place also is pretty casual, which is just what I needed since I was too tired to dress upalso this place is really clean , the tables are always well kept and the bathroom was clean toothe only downside to this place is the lack of parking, but that's typical for a weekend out in bay ridge"], ["Lorie R.", "Being from a border town in Texas, I am very picky about Mexican/Tex-Mex food. Seems that Cali-Mex is a big thing here in Brooklyn, which is a good thing. I was pleasantly surprised at the quality of food here and very good portions for the price. I especially love the Wednesday shrimp special!! It gets pretty packed in there and it's a small place but the wait is never that long. My husband and I love going there and happy to see locals there!"], ["Julianne C.", "The food and margaritas are decent but this place is really just a Mexican joint that parades itself as Hawaiian. Talk about a confused identity.It's so bad it's laughable."], ["Vanessa M.", "THE MOST AMAZING MARGARITA!!!!! look no further.  This is my go to spot for margaritas.  The blueberry is the best! it has the right amount of tart and sweetness.  The guacamole is to die for and the sunset pork in anything is delish!  Put it in your nachos put it in your quesadilla put it in a taco! they have a margarita flight which is totally worth it and you can see what flavor you like the best!"]], "Taquitos Mexico": [], "Gueros": [["Keanna W.", "So delicious the chicken nachos, the queso, and the fried chicken taco are my absolute favorite the place is kind of small but food is so worth it"], ["Kelly O.", "I've been on the hunt for good gross queso like they have in the south since moving here a year ago, and now I've finally found it! Here's what I mean:- The kind of queso you find in a cheap Tex-Mex restaurant where everything is covered in cheese, the beans are refried, and there's no fancy add ons like radishes in your taco leaving you wondering if what you've always known to be Mexican exists in this city. - Creamy hot cheese dip with a little kick to it. - Does not taste like it came out of a Tostito's jar. This is it guys! Go to Gueros."], ["Jess G.", "Emphasis on Tex-Mex... I was really hoping for authentic chorizo, but it was so bland that I added hot sauce. It took 20+ minutes to get two tacos to go. I will still go back to try their nachos, queso, guac, and margaritas, all of which looked good."], ["Kiesha B.", "They make some pretty great tacos!!!Everything was fresh. I plan on going back real soon.."], ["Taryn K.", "Tacos are GREAT.  But pricy.Seating is a MESS.  You get a number on a stand when you order, and then it's like some sort of free-for-all, eyeing people who look like they're maybe finishing up, waiting for someone to stand so you can throw yourself at the table.  I don't really know what the answer is unless they wanted to move to a bigger place, as the problem is just popularity."], ["Stacey D.", "I love going to Gueros. Their tacos are delicious and the nachos are to die for. Their best taco, to me, is the Brisket. It is so flavorful and juicy. The Brisket taco is a must try. The fish and fried avocado/jalapeno are the next best. The nachos are big enough to share and the queso they top it with is so good. The margaritas are good, but I think they used to be a lot better when I first started coming to Gueros a few years ago. The place is really small so it can be difficult to get a seat."], ["Nathalie D.", "My oh my those margaritas!!!! I came here on a Tuesday night not expecting much. But as soon as I walked in the vibe was flowing! The place is small so you are very close to those eating around you. Luckily the vibe here is so open that everyone talks to everyone! Curious what they are eating? They'll be happy to let you know! One margarita in I realized these puppies were no joke. I couldn't even finish a second one! The tacos were to die for. And the salads even better. You can customize things to your liking with no or little charge. One of the best mexican places I have been to in a very long while. I hope to be a regular at this 'cheers' type restaurant."], ["Dee V.", "This review is wayy past due! Our accountant who works in the hood recommened Gueros to us a couple years ago and weve been loyal since. The Tacos are AMAZING!! The margaritas just as amazing, a whole boozy pint for $9 I cant say which Taco is \"The Best\" it would be like picking your favourite kid! All I have to say is do yourself a favour and get yourself there STAT!"], ["Dannielle G.", "This Texas girl totally approves!!! It's not affiliated with the one in Austin but apparently the owners are from Texas and nailed the queso. NAILED.Fresh margaritas and bomb chips.Come one, COME ALL!"], ["Michael R.", "20 of 20 Taco Crawlers agree, this is the best taco joint within walking distance of my apartment. Love that fried avocado. Can't go wrong here"], ["A S.", "I was one of the first customers of Gueros, I have ordered from them for years now. I have introduced this restaurant to about 50 people in the beginning and those people went on to introduce this restaurant to a lot more people. I have walked to this restaurant from my apt in Crown Height  numerous times in the heat and the snow. And have ordered delivery from this restaurant as many times as I have walked in to patronized it in person.I have brought people here from out of town and out of the country. I have raved about Gueros so much so that when people visit they know that it is always on the list of \"must haves\". I have enjoyed the avocado tacos, queso an chips and everything else on the menu for years. As of late when I call the people that answer the phone tell me that I am no longer in the delivery zone. I am one block out of the zone, which is where I have always lived in Crown Heights. As a long time customer I would expect the same respect from a company I supported to support me. But now that our neighborhood is starting to feel like WILLIAMSBURG our neighborhood restaurant has decided to accommodate a certain demographic an exclude the people who have been there since the beginning. I remember when there was no line, no outside an barely a margarita. And the people taking your orders were cool and not pretentious.I know other people from the neighborhood who also decided to stop patronizing this restaurant, to which I replied \"NO NO NO it's wonderful\", they also have been around since the beginning an will no longer patronize due to not feeling appreciated. Although I like the food, there are NEW MEXICAN RESTAURANTS in the neighborhood that appreciate those of us who are in it for the long haul and not just passing threw for a few months.GOODBYE GUEROS THANKS FOR STAYING REAL!!!!!!!!!"], ["Courtney P.", "Guero's IS the spot. I traverse 40 minute subway rides on the reg just to come here.Tacos are good but the NACHOS are where it's AT. Steak are the best, but chicken's great too. The chips, so thin, so perfect, so crisp. The QUESO OH MY GOD I have missed Texas queso so badly, and it is amazing. The pico is so fresh, they use the reddest tomatos ever. Margaritas, super strong, and awesome. Ask for em half frozen, half not, they're dope. You'll be drunk off of just one. They're great. The place is small but cozy, and they usually bump awesome jams like the Backstreet Boys etc. Guero's, you have my heart."], ["Carla L.", "I've been here twice.  Honestly I was dismayed by how small the tacos were...but when I bit into them!!  Wow!!  They pack a punch.  The flavors melt into each other..it's spicy..complex..and yummy.  I'm surprised how satisfied I was with just three tacos.   Now let's talk about those margaritas.  Do the half on the rocks and half frozen.  One will have you buzzin.  The seating situation sucks..but the yummy food makes it worthwhile."], ["Marlon S.", "Come here during happy hour 4pm to 7pm.. Crowd starts to swell around 530pm. Happy hour is $1 off Tacos, which is a big deal when you can get any 3 tacos and a 20oz margarita for around 20 bucks."], ["Nick T.", "It's hard not to go here every time we want to go out for food.  Tacos are great - I've tried them all at this point, and I get an Al Pastor taco every time because it's so delicious.  They bring you the food real quick and everyone that works there is super nice.You're going to want to try the chips and queso and a margarita.It can get a little rowdy in there sometimes late night but it's a good and fun atmosphere.  It can be good for dinner or for late night post bar munchies.GO NOW!!"], ["Andrew W.", "Food is a 4 or 5 stars almost everyday. Their delivery windows are terrible. I ordered delivery tonight and respected the estimated time window of 45-60 min. At 75 min I called and they told me it would be another 20 min. They offered to refund it with no food but that's insufficient. Instead I need the food and a discount. I completely understand the process of food delivery. But this isn't the first time this has happened to me with Gueros. Food alone is exemplary. Delivery is extremely subpar. Order with discretion."], ["Sally A.", "I was in the other day with my Boyfriend. When we arrived at the start of their dinner rush and there weren't any seats available for any new customers. The place is mostly counter service, so people shouldn't even be seated until they've ordered. there were people either saving seats for people or lingering with food trash building up around them. What was most annoying was one guy taking up a table for two. He had multiple devices charging, and his computer out like he was at a Starbucks. When our food arrived we had to squeeze in at the bar between two groups people. one person who was waiting for a friend, and a couple who just got drinks and no food. I didn't really get to enjoy my food. I got the fried chicken and the el pastor, both were pretty good. Though they were eaten in a rush.My boyfriend and I would've bought more food and felt more comfortable if the staff had somewhat managed their seating around them. It seems the restaurant cannot count on the consideration of others to turn over their tables. Or just eliminate your tables in general if you don't want to do table service at all. It'd be easier to turn over space in the restaurant. We left soon after eating to go somewhere else. When we walked past an HOUR LATER, the computer guy was STILL there taking up this table for two.The food is good, so I'll be back. I am just appalled by the experience of eating in here."], ["National H.", "Really busy but consistently friendly is how I would sum up the atmosphere at Gueros. The food is delicious in my opinon, and all tacos are $1 between 4-7! That means my roasted vegetable taco was a measly $2.50 which is an outrageous value.I also had the Al Pastor and Catfish most recently and all were really tasty. They are usually super crowded with loud folks but the girl behind the counter was unflappable; her smile and warm demeanor never faltered.Get yourself some Gueros but be prepared to eat outside on a stoop or something because it can be at full capacity before you know it!PS - huge self serve water jug has lemons in it. It's the little things that elevate a place!"], ["Brooke M.", "One of my favs in BK :)The queso is the BOMB!!!! Tacos & margs are great too.Its super small and gets packed but so worth it."], ["Carlina P.", "Love love margaritas  steak nachos is to die for"]], "Lucha Lucha": []}