{"China Village": [], "Best Wok Chinese": [], "No. 1 Chinese": [], "Lucky Bamboo China Bistro": [["Sri R.", "Awesome authentic Chinese, Szechuan, & Cantonese dishes. The Szechuan dishes have some nice heat and omphf."], ["Amanda K.", "I have ordered delivery from the place about 5 times. Most of their food is tasty, but the wonton and egg drop soups are bizarrely flavorless. Adding soy sauce and scallions from my kitchen could not even fix it -  so I threw the soups out. Too bad really. All 5 times I ordered from here, there were no soy sauce packets or flatware or napkins or chopsticks in the bag. This was ok for me because I was eating at home where I have all of these things, but if I was eating elsewhere, I would have been upset."], ["Beth G.", "We have been coming here for years off and on moves back and forth and still love this place. It actually got better. We did Chinese New Year for Dim Sum once and with friends other times. Have not tried their sister resturant in green hills bc this place is the best. The hot pots are very hot and authentic. They sometimes don't understand everything you say but are good about asking questions. Quite honestly I love this place each time. We order out 2 times a month here and stay now with our favorites. Not sure why others did not like so I guess we are going soon just to make sure."], ["Charnelle Y.", "The servers here are so friendly, and always go out of their way to make you happy with your food and your entire experience...I want to thank the owner for being so gracious and hospitable with allowing my husband and I to try a few dishes that were spectacular...If you see my photos it was as if we had entire family of 12 eating with us, but it was my hubby and I only... I simply love food and everything about food. This is a great Chinese restaurant, and one your family would enjoy!!!Bring your empty stomach because they serve huge portions for low prices!!! Great deals and great experience!"], ["W B.", "Went here when visiting Nashville. It's the only dim sum place in a city that has notoriously bad Chinese food. I have to say that it was not bad.  Considering it is the only place in town for dim sum, I'd go there again if I was back in town.  The main complaint I have is that some of the portions are small.  For example, the fried shrimp balls came two to an order as did the stuffed eggplant and stuffed tofu. They do have steam carts and everything was pretty hot.  The selection was a little small, but it was adequate."], ["Jim M.", "While it may not look like much, this is the place for authentic Chinese food. Food comes predominantly from the Hong Kong region. Service was great even though they were slammed because it was \"dim sum\" Sunday. Thank goodness I had my son with me because he speaks Chinese. Ordering and how dim sum works is a little confusing. $88 for six people with dim sum a plenty, both kinds of rice, and three entrees. We will return!"], ["Shafi K.", "I feel like there's only so good American-Chinese food can get; especially, if it happens to be in Nashville, TN. I wonder how much of that is the inner Californian in me speaking. Anyways, we took my parents here last night because they love eating out but hate spending too much money. I figured that this place with $$ and the handy Yelp deal is quite a good offer.The decor is fine but not really something to extensively comment about. There was ample seating and at 5:00 p.m. it did not seem like there were too many people rushing in to eat. I realized we went in for an early dinner and by the time we were leaving, there were quite a few other patrons. There are some booths and a couple of round tables. 'The service was mediocre. Our server looked a little nervous and my dad's soup was dripping on the sides. They were a little slow; for example, we would ask about the soups or to get the check and they would take a while (more than 5 minutes) to get back at us with the answers. Honestly, we did not mind waiting but just felt that it could have been faster given that there were not that many people. We ordered the egg-flower soup which was kind of bland. We also got the hot-and-sour soup which was a little more zesty and yum! I enjoyed their vegetable rolls but felt like it was a little expensive to pay $1 for each of them. Additionally, we got the Kung Pao shrimp and beef and vegetables. I liked the beef and vegetables better because the beef was soft and there was a wide variety of veggies. My family liked the Kung-Pao shrimp more because it had more flavors but I felt like it was filled with lots of celery- something that you either love or hate and I just don't like it. Overall, this is fine for a quick takeout or even sit-in place but I would say Nashville, as a city, still needs to do lots of work on it's Chinese food!"], ["Alex P.", "Definitely a fan!They now serve DIM SUM as of two days ago!!! So happy!  Everything is made from scratch and very authentic.  I was a bit suspicious of \"authentic chinese\" in the heart of Middle Tennessee, but it definitely is.  The chef comes from my home city Philadelphia and was the chef at Han Dynasty in University City!  It doesn't get more legit than that!Aside from offering dim sum and bubble tea, I have to say that their steamed sea bass in ginger and scallions is AMAZING!!! Its a must!  I really like this place a lot!  And Jack, the owner is so nice!  He also owns Chinatown in Green Hills.  He definitely knows what he's doing and yet is very receptive to input and ideas.  Great guy!Pros:- Dim sum (the full menu 11-3 on weekends + limited menu on weekdays)- Dim sum during the weekends is served in the carts like in Chinatowns- Offers Bubble tea- Nice environment to eat and socialize- Plenty of parkingFavorites:- Steamed sea bass with ginger and scallions - PERFECT!- Dim sum- Cheung fun- rice noodle rolls with meat - yummmm!!!- Dim sum- spare ribs in black bean sauce- AMAZING!!Ideas for improvement:- Offer thai tea or other flavors for the bubble tea- the juice buns could be juicier- the sui mai is best with pork and beef- Steamed BBQ pork buns were good (could use more meat and sugar or something)- Instead of just oolong, also offer chrysanthemum tea.I am soooo happy that Nashville finally has an authentic chinese restaurant and its also the only restaurant in Middle Tennessee that offers dim sum.  Love it!!- List of things I want to get here- meat wrapped with bean curd or just bean curd rolls (dim sum), sautéed Snow pea leaves with garlic, milk bubble tea, pan friend dumplings, fried spring rolls, korean short ribs, baked bbq pork buns, sticky rice in wrap, stuffed egg plant... so much too eat!!"], ["Queen B.", "Hot soup are for cold days......Yesterday, a group of us went to Lucky Bamboo for lunch.  Snow was threatening and soup just sounded good.There were two tables occupied. Ours and the couple behind us.  Waitress was attentive, since there was no one else in the place..Water glasses were kept full.Had to ask for dishes to be removed.I had the duck soup for $6.95.  It had some duck, but most of it was all bones.. Had a couple of chunks of duck that were solid meat.Mine was good and spicy - opened up the sinuses..Plentiful noodles.One egg roll came with my bowl of soup.For a big bowl of soup and egg roll, price was pretty good.Soup broth was good - but then again, duck is a very flavorful animal.I would go back for soup.Still haven't tried any dim sum."], ["Nell H.", "We ate here today for the 1st time. Per other reviewers, yes, the kitchen was slow, even with us being the only customers there mid-afternoon. We did both appreciate the freshness & presentation of the food. Beware that if a menu item says \"crabmeat,\" they are referring to artificial crab \"something.\" My husband was very disappointed to find this in his dish. My experience was perfect for me, as I am one of the rare tofu lovers out there & the tofu dish with veggies was some of the best I've had outside of home. The service was perfect. I really appreciate the creative vegetarian options & I will return. btw, this business has no sign visible on Charlotte Ave. \"Turn when you see the green 'storage' sign & follow the road to us\" is what I was told when I called."], ["Erica D.", "I'm baffled by the high remarks of this restaurant. Maybe my experience was different from others because I did not dine in. I ordered the mongolian beef,  general tso chicken, and an egg roll. The mongolian beef lacked flavor, and the general tso chicken was soggy.  My egg roll was SUPER tiny, and should have been complimentary instead of $1. To top it off, the white rice was overcooked and resulted in a pile of mush. While this may be one of the better Chinese restaurants in Nashville , it was far from good. I will not order from here again....or any other Chinese restaurant in this city."], ["Lee M.", "An hour after I ordered online and I FINALLU get my to go order. The hostess is entirely overwhelmed, as she is trying to seat people, take phone orders, and carry food from the back. She even said she would check on it and never updated me on that. My guess is that they lost the order and her notifying them is the only thing that got me my food. The food is good - but not hour long wait good."], ["Maggie H.", "I went to order delivery one night, all was fine until they tell me they're too busy for my business. I had my money ready to pay them and they turn me away? Poor business strategy, this long time customer will no longer be returning."], ["Bethany G.", "Dined in during lunch on a weekday. I ordered cashew chicken and my friend ordered lo mein. Both of us thought the food was just slightly better than terrible. Like we didn't barf, but we kind of wanted to. The meals didn't have much flavor but did taste extra oily, if you're into that. Basically we could've gotten better food at any Chinese take out place or possibly even a Chinese buffet which isn't really the level of quality we expected from a restaurant with several good reviews. However, our waitress and the hostess were very friendly and good at their jobs."], ["Aaron S.", "This is not a review of Lucky Bamboo's food, I didn't get that far... This evening my wife and I wanted to go out and try \"The only Dim Sum in Nashville,\" so we ventured down Charlotte to Lucky Bamboo.When we arrived we were taken to a booth against the far wall across from the Koi pond and seated. While we were waiting for our server we noticed a smell... Ammonia, of an organic origin....if you catch my drift. We spent a few minutes trying to determine if what we were smelling was indeed what we were smelling and ultimately made the decision to leave without ordering.Ultimately we didn't give LB a chance, but I've learned that the only thing separating you from a salmonella evening on the bathroom tile are your five senses. We used ours and made another choice."], ["Corey W.", "Finally Nashville has a real dim sum place. It is under new management as of about 6 months ago. I had been there once under the old management and there is a huge improvement over what it used to be.The wait staff was very attentive, and the owner was super friendly. He was moving around to the various tables asking everyone how they enjoyed everything and was genuinely interested in hearing each tables experience.As for the food, I am only rating the dim sum and comparing it to my experience in China town Boston. Yes there was only 2 carts moving around but that was appropriate for the number of tables that were seated at the time. Also, there were a few servers walking around with trays of offerings not on the cart to give you additional options. The food quality was great. I thought it was exactly what dim sum should be. The place has great potential and the busier they get the better it will be."], ["D D.", "The food here is delicious!!! we went on a Sunday and we tried the different dim sum which we didn't regret!! We also had general tso chicken and my fiance had Mongolian beef, and we loved every bite!!my only compliant was the God awfullll SLOWWWW service!! there was only 1 waitress for the entire restaurant. if the food wasn't so good,the service would have killed this rating but I'm trying to be understanding and assume it can't be like that everyday. we were visiting from out of town so all in all it was a good experience."], ["Katie C.", "Jack is the most personable, thoughtful owner I have encountered in Nashville. He made me a bubble tea while I waited and the food came out so fast. Such great customer service and the food has been great since the first time. Im so excited to know they delivery to my house now!  My favorite dish i have had is the country tofu! But I look forward to bring my friends family and co workers back to all try the hot pot!"], ["Allison G.", "They held our American Cancer Society Hope Lodge dinner tonight & it was amazing. Great Chinese food & they deliver :)"], ["Stephanie C.", "I really enjoyed my food i ordered. I got the sesame chicken, spring rolls and chicken on a stick! Even though the delivery took a little bit longer the food was still pretty good when it got here. I would advise they do have a $10 delivery fee, but other than that i might have given it 5 stars overall. I will order from here again, and would be down for definitely checking the dining room out as well. Wontons with chili oil were good as well, just wish they had more meat !"], ["Senwhaa L.", "I got really excited when I saw that Nashville finally got dim sum and dragged my non-Asian friends because I frequent dim sum places all the time in Memphis. Upon reading the reviews, I had really high hopes for my first dim sum experience here only to be let down as I saw the cart. We started off with a pot of tea. Usually at dim sum places, they put fresh tea leaves in a pot of water for you. Here, they pre-made the tea. It was not fresh. The shrimp dumplings were nothing like the pictures. They were old and dry and seemed like they have sat in the carts for awhile. The noodles with barbecue pork were also old and dry. The only thing that was decent here were the steamed pork buns because we ordered them to be made.When our check came, the total was $30 for 6 plates. That was WAY OVERPRICED. Needless to say, I was embarrassed that this was my Non-Asian friends' first dim sum \"experience.\" Hopefully, another dim sum opens soon."], ["Stephanie O.", "I seriously hate to write bad reviews. The service was good. I felt bad though because,literally, there were 3 women working for 10 tables ( most were 2-4 tops and a couple were 6-10 top... This number of employees is including the hostess. The servers were rushing food around, with entrees coming before apps and apps at the very end of the meal. The servers were so nice. The food was not good. It was my first time to lucky bamboo and sadly my last. My dish was the weirdest Chinese food I had ever had in a bad way. This place needs a rescue. Thank you to the servers... No thanks to the cooks. I will stick to the local Chinese take out in my area."], ["Coach K.", "First and foremost I wanted to point out that you can't have too high of expectations for dim sum in Nashville. And thus I wasn't that disappointed(hence the 2 stars). It was impossible to find their restaurant and their ghetto sign sits atop of a pick up truck (see pick below). Some of their food was decent but some weren't even close. Either they were too salty, oily, or not tender.  Lastly I bought yelps $8 for $15 deal and the owner doesn't even know how it worked....sigh.This place isn't the same as nyc boston or sf dim sum so dont let the positive reviews fool you."], ["Christy Y.", "So glad we have finally found a family dim sum restaurant.  We ordered a whole duck for dinner tonight!  Had fresh veggies along with my dim sum. One star missing because I could not find the porridge.  New owner Jack is a friendly person and does a great service checking on his patrons!!!Can't wait to come back for schezchuan meal!!!!"], ["Tracy F.", "We've been back to Lucky Bamboo a few times in recent months, and I have to say that we've been more and more impressed with the food each visit.  This is the best, most authentic Chinese food we've found in Nashville so far, whether you order off the menu or try the dim sum weekend brunch.  I particularly like the shrimp with mixed vegetables, which is served in a flavorful white sauce made with garlic and sesame oil.  The shrimp is cooked well and the plate is generously portioned.  My husband is partial to the seafood pan fried noodles, which is essentially the dish I described above with assorted seafood and served over a huge pile of lightly fried noodles.  We also very much enjoy their egg drop soup - very tasty without being overly salty, and always served piping hot.We experienced the dim sum for the first time this morning, and were pleasantly surprised.  After reading many a negative review here on Yelp, we went in expecting the worst.  Instead, we received a nice assortment of hot, fresh dumplings and beef short ribs.  We also could have had some of the noodle dishes, fried appetizers, and desserts that were floating around, though we chose not to.  Our favorite dumpling was the shrimp and pork shumai, served with a sweet and spicy dipping sauce.  I'm not one to eat pork very often, but did very much enjoy this dish and would order it again (my husband actually ordered himself 2 plates of the shumai and didn't regret it for a minute)!I will say that while the food has improved dramatically, the service is still lacking and in need of some serious work.  We had to wait 15 minutes for our water glasses to be refilled, the carts did not come around regularly, and the dish we ordered off the menu was cold by the time it reached our table (and served without rice, though the rice was supposed to come with).  I believe this is due to the large space of the restaurant and its many tables, and also the expansive menu and many ordering options.  The servers are very nice and knowledgable, and Jack, the manager, is always extremely kind whenever we're there - but the entire staff needs to be trained to work a bit more efficiently.Overall, come try the food at Lucky Bamboo.  It IS good food and a place Nashville needs to satisfy us picky former New Yorkers who like our Chinese food."], ["Amanda G.", "I recently attended a small business conference in Denver, and we talked about the importance of being \"exceptional.\" These guys must've been there too because everything they're doing is exceptional. Service, food, the SAUCES and those free fried wontons... all exceptional."], ["Bridget S.", "35 minutes after ordering....still no appetizer or food. About 10 minutes after our arrival the emergency lights started flashing, no one seemed to notice. Hmmm...no fire, no electrical smell and the staff continue to take orders. After the 35 minute wait and no appetizer, I questioned the waitress. Her reply was that there was an accident in the kitchen and they are unsure if it were SAFE to cook. Hmm, she could have alerted us sooner. Order cancelled and off we went to another establishment."], ["Kiki C.", "I called Lucky Bamboo to place an order over the phone and mentioned that I had a severe allergy to shellfish. I told them I could not have anything with shellfish. I ordered what they told me was safe and without shellfish.I got my food home, and lo and behold they messed up my order and gave me dim sum with shellfish in it. Since the rest of the order was what was expected we ate that. Then in less than an hour my stomach got upset. I was so sick to my stomach, I am still feeling the repercussions of eating there. Such a shame - Nashville needs a place with a great selection of dim sum that does not lead to anaphylactic shock or humbling bathroom visits."], ["Kina L.", "I think the only reason I gave this place 3 stars is because my expectations for Dim Sum are ridiculously high given that I came from Atlanta. Yesterday, due to the RIDICULOUS lines at the Hot chicken festival, my friend and I thought the next closest thing to fire battered chicken was clearly chicken feet dim sum (which actually was one of the better dishes).So in regards to their dim sum. The have a very limited variety--sticking to your basics such as your char siu bao (steam bun with chargrilled pork), shrimp dumplings, siu mai (a pork dumpling pretty much), pork crepes, chicken feet, sticky rice and egg rolls (I would not order this). The chicken feet were clearly cooker pressured and heavily sauced..which made them relatively fall off the bone delicious-- the best of the dim sum choices. I was disappointed that the selection was also not very fresh. It seemed to sit in a cart for the duration of the lunch rush. Understandable given the low volume. In addition to dim sum, we ordered the singapore curry noodles. They were very generous with the shrimp and chicken in this order. I thought it had great flavor. Definitely would not call it a low fat dish as you can see the glisten on the noodles. This was my favorite dish of the meal. I will have to come back to try the hot pot that I saw many order. Good points to know: Thursday night for 20 dollars.. you can experience a multi course Szechuan meal- great intro for those not familiar with that style of cooking. Also, Lucky Bamboo is BYOB. WHAT. yeah. I know a lot of people say this is the most authentic chinese in Nashville... they are actually probably right. But that doesn't really say much other then that simple statement.  I will have to come back again to sample more redeeming dishes.. and hopefully the secret ones off the menu...But as I like to end on a positive note... service was very attentive and great. Which also kind of makes me question the authenticity of a true chinese restaurant. I don't go to Asian restaurants for the scenery or service... and if you do.. clearly you aren't looking for some home cooking."], ["Marc J.", "OK. I am Chinese and this was literally the worst \"Chinese\" restaurant I have tried in this country. Where should I start? We stopped by on a Sunday morning to have dim sum. We sensed something wrong the moment we walked in-instead seeing towns of people (which is typical for a Chinese restaurant serving dim sum on Weekend morning), the restaurant was almost empty. Their Sunday hours was from 10am but when we walked in at 10:15 was told that dim sum was not ready yet because they \"had to cook\" it. Their dim sum selection was extremely limited and food quality was very poor. They also charged us $11 for a regular-sized tea pot, which was insane. We walked away ending up with each person paying $20, and we were still hungry.  Lucky bamboo-what a nightmare!"], ["Hien L.", "Always room for improvement.  First time at LB. Overall,  the food wasn't so bad. Seems like they could or should have two people with carts going around instead of one.  Just as other dim sum places, the food was about the same. we loved the steam barbecue pork bun. The shu Mai with shrimp and scallop was spectacular. If I could had stayed longer, I would have tried more. I was hoping for more veggies on the cart..however, we got what we could get. This place has potential! It will be a place to return to when I return to nashville."], ["Brett M.", "Lucky Bamboo is solid Chinese food. If you like your Chinese food skewed slightly American, you'll be satisfied. I am happy that in Nashville  I am able to eat dim sum on a weekend afternoon.  They have about 7 plates, all but the slightly dry Bao are good. Very pleased to find Chicken Feet, a dish hoped for but not expected. A bit more creativity out of the kitchen, especially if it was in the direction of traditional dishes would be welcome."], ["Anna J.", "This review is for dim sum only:I don't understand why people give the dim sum at this place such high reviews.  They are just terrible.  I would give one star, but because this is Nashville and not New York or San Francisco, I will be generous and give two. The dim sum did not taste fresh first of all. Items were lukewarm, probably sitting out for a while. But it wasn't like we went at 3pm. We went right at noon! The soupy dumplings were the biggest disappointment...the shell was dried out and hard. Roasted pork was almost cold and had no flavor. The pork buns were okay, but they were just the generic frozen ones you can get at any Asian market. The spare ribs were extremely fatty and chewy. Some were inedible because they were too chewy. I will give them kudos for trying to be authentic, and offering chicken feet.  They were okay, but overall waaaay too sweet.Price was not as bad as I thought it would be, but generally higher compared with other cities, which is understandable, I guess.I would never go back for the dim sum, but may try one more time for their regular menu."], ["Courtney C.", "Service was fine, even was nice. Prices are on the high side, especially considering the area. They have a small kids' menu, which is a plus. First, I ordered the egg flower soup.  It smelled and tasted of wet dog. As an entree I ordered the beef chow fun... It was merely ok. Co-diner got chow fun pepper steak. It was slimy, and much of it felt pre-chewed. Thankfully the server left it off our bill!  If we do ever return, it will only be to try the hot pot.  This was our second lackluster experience there, but each time we saw others with hot pots.  They look to be worth trying. I hate to post this review since the people are so nice, but 2 bad dining experiences merit a post."], ["Ashley G.", "I tried this place a little over a year ago shortly after it reopened and was terribly disappointed in the dim sum offerings, quality of food and the service. I'm soooo glad I tried it again! I placed a take out order fairly close to closing time and the owner was glad to take my order even though it was so late. We ordered the sliced tendon cold app, sliced beef and tripe cold app, soupy beef and braised port belly with pickled mustard greens. The owner even threw in a pig ear app for free! The food was awesome! Best transitional Chinese food I've had since living in Atlanta. I cannot wait to go back for dim sum and hot pot! If the dim sum is as good as the menu items my rating will go up to a five star! Highly recommend this restaurant for fans of real Chinese food. I'm sure their Western style items are delicious as well from the looks of the food the diners at tables were eating."], ["Jason B.", "I've been looking for dim sum in Nashville.  I thought it didn't exist, until I saw their sign placed on Charlotte pike.  I read some reviews, and decided to give it a shot for lunch.I was a bit disappointed that the dim sum isn't available for lunch, and surprised that no one mentioned that in the reviews that I read.  There were a few items from the weekend cart they were able to prepare for lunch, so I was able to try the steamed pork buns, shumai, and a shrimp dumpling.   Of those 3, the shrimp dumpling was my favorite.  I was excited to try the pork bun, but found it to be a little bland.  It wasn't bad, it just needed some salt or spice or something.There were 3 specials on the board that sounded good, so we tried two of them.  We had the crispy pork belly special, which was delicious.  It was by far our favorite dish at the table.  We also had the spicy pig's feet.  As advertised, they were spicy and had a great flavor.  If you've never eaten pigs feet, you may be put off by the texture.The people were friendly and the service was fair.  I'd like to go back on a weekend and try the cart."], ["Lauren W.", "One of the things I miss most about living in New York is the Chinese food. The little town I grew up in had some of the best Chinese food (BBQ spare ribs for the win!) and I was only a short train ride away from NYC's Chinatown. All the dim sum and bean cakes I could stomach were at my disposal. Upon moving to Nashville, all of my dumpling dreams where shattered (well, at least until I found my favorite local Chinese place China Cottage). Lucky Bamboo (recently reopened with the folks from Green Hills' Chinatown) brings a little bit of New York Chinese style down to Nashville. They serve dim sum on the weekends, but on this cold night we went for their specialty: THE HOT POT.The inside of this place is crazy. It almost reminds me of a Disney themed restaurant in the Chinese portion of EPCOT, or something you might find in Vegas. There is a giant rock fountain in the center of the dining room filled to the brim with really pretty koi. Opposite the bamboo covered bar is a full wall mural of pandas. Pandas just hanging out, having fun and watching you eat. I could have sworn that their eyes followed me around the room. The place is big, with only half of it being used for diners. Behind a partition is another large dining space with what appears to be a stage and karaoke setup just begging to be used. I wonder if this part of the space will ever be used to serve diners, or perhaps it's just for private parties.To start we had small BBQ pork dumplings. They took a while to arrive at our table (an appetizer that arrived with the main dishes) but they were solid dumplings. The dough was thick and substantial without being so fluffy that it overpowered the fillings. The special of the day was Szechuan pigs feet. Luckily for me I went with a group of friends that are adventurous eaters like myself and it was a no-brainer to order this. The pigs feet were cooked slow and low and then stir fried with the hottest of peppers, peanuts and celery. Pigs feet, if you've never had it, have a very odd texture- a mixture of skin, fat and cartilage. I loved them especially because they soaked up all the flavor and were super tender. This dish was HOT. If you accidentally ate one of the red peppers your mouth was ON FIRE.The main course was the Ying Yang hot pot (this was half of the mild house soup and half of the scorching hot Szechuan soup). Hot pot, if you're not familiar with it, is similar to fondue or shabu-shabu. You're served a boiling hot pot of broth that is kept at temperature with a portable burner, and you select various vegetables, meats, and noodles which you boil in the broth. This is a fabulous meal for a cold night and an even better meal when you go with a group of friends. Hot pot is communal and it's best when you get to order a lot of things and share!The basics for the hot pot are cabbage, spinach, corn, tomatoes, pumpkin, mushrooms and some crab sticks. In addition to this you're given a menu for what you can put in your hot pot and you pay by the ingredient. We ordered so many things that they didn't fit on the table- but here's a list of all the goodies that went into our hot pot:beeflambjumbo prawnfried tofutarobok choienoki mushroombamboo shootwoodear mushroomudon noodlesWe tended to put the stuff that takes longer to cook into the pot first, like the pumpkin and taro. The meat cooked in under a minute and the cabbage seemed to soak up all of the spice. When things are done you just kind of dig in with a ladle or your chopsticks and pull out what you want. I had fun fishing for things and yelling out \"I found a taro, who wants taro?\" I honestly loved the hot soup better, mostly because I like the punishment of the hot peppers.Overall I really enjoyed the hot pot and I would go back for it any time. Even with ordering all of that food our checks were still fairly cheap (split between 5 about $15 per person). Jennifer, our waitress was helpful, polite, and happy to explain everything to us hot pot novices. When next winter rolls around I'm sure I'll want a hot pot just as frequently as pho. Now, I have to go back to Lucky Bamboo for their dim sum and see how that compares to New York."], ["Karen D.", "Lucky Bamboo is my go-to place for Chinese food. They have great lunch specials and generous portions. I usually opt for the Mongolian beef or general tso chicken with white rice. Their egg rolls and dumplings are also very tasty."], ["Mary V.", "Finally some dim sum in Nashville.  I don't know what the hell took so long.We missed the dim sum carts (which are Saturday and Sundays from 11am to 3pm) but we were able to order dim sum from the menu, which takes a while FYI.  The items we were able to order were limited versus what would have been available when they had the carts.  We ended up with Braised Pork with Tofu, as well as dim sum items: Sui Mai, Shrimp Dumplings, Scallion Pancakes, and BBQ Pork Crepes.  Everything we ordered was delicious.The place is huge.  I saw a poster they had that said they could hold up to 300 people for events.  In the back area there was a large projection screen I'm guessing for those purposes.  There is also a very nice koi pond water feature in the middle of the restaurant.  The koi in it were huge!  Very cool.The real reason for my 4 star rating was our server.  We had an OG Chinese man from Hong Kong who used to work with 5-star chefs at various hotels.  He told us all this.  He was funny without trying to be - I laughed everytime he said something.  He didn't give a crap.  Reminded me of some aunts and uncles.  Some of this quotes:I tried to use the coupon I purchased from the Yelp app: \"Yea yea - I ask my boss. Hong Kong no coupon.  Amelica always coupon.  Amelica no money.\"\"You eat like this.  Put pork in here like sandwich.  Velly good.  I work with chefs so I smart - I know what good.\"\"You want chopstick?\"  Yes, please.  \"Ah yes - chopstick good.  No fork ok.  Chopstick numba one.\"\"You want dessert?  Ah yes - I make special for you.  Taro.  You know Taro?  I make for you velly good.\"  He made us a special dessert that wasn't on the menu and it was fantastic.We will probably return for the dim sum carts on the weekend.  The single entree we did order was authentically tasty so I'm excited to try more.  Depending on our future dim sum experience, I may be updating my review, but for now - it was all \"velly good.\""], ["Jack T.", "this is a fantastic restaurant! excellent service and very delicious Chinese food!my wife and I came from Canton and this is one of the best Chinese restaurant I visited in US. Highly recommend"]], "China Moon": [], "Chopstick House": [["Jemil A.", "Oh man I see what the hype is about, okay I'm going to be honest. This is the best takeout Chinese I ever had. The general was amazing. It was crispy and was packed with flavor. Not like the other places where it tastes like it had been in the freezer to long. It's near my house also! Found my new Chinese takeout."], ["Rick B.", "Disclaimer here: I grew up in New York City, and my friend's grandma owned a nice Chinese restaurant in my neighborhood. And the best Chinese restaurants on the East Coast in the 1970s were a subway ride away in Chinatown. When I moved to Michigan, my sister in law was good friends with a family that owned one of the best Chinese restaurants in the Detroit area, and they catered our rehearsal dinner for my wedding. So I've been spoiled.Getting good Chinese in Middle Tennessee is an uphill battle. The ones I've tried all seem to be buying mediocre ingredients from the same suppliers. And Yelp isn't much help because, no offense, but folks around here who haven't traveled have no idea how good Chinese can be when produced with techniques learned in the mother country with the best ingredients. My final complaint (then I'll stop, I promise) is that the favored business model for a Chinese restaurant in Middle Tennessee is buffet or take-out or both. And that's just not conducive to serving the best food.All that said, I walked into Chopstick House on a day when I was recovering from a headcold and just needed something hot and spicy to clear my head and make me feel better. As our family friends in Michigan used to say, in the Chinese culture they believe certain spices are \"good for the breathing\" and I don't care what science says, they have always been proven right in my case. Chopstick House is a counter-service/takeout place, with about a dozen tables and chairs, and they will bring your food to your table if you are dining in.The General Tso's Chicken and a cup of Hot and Sour Soup did the trick. The chicken was cooked right, with a hot, fast heat so it was cooked without drying, and the sauce was complex and flavorful, as it should be. The soup was brothy, not gummy (A gummy soup is a sign they are using thickeners to stretch the dish and cut costs). It was a lunch combo, so it came with pork fried rice which was nice, not greasy, though not as loaded with veggies and pork as I would like.All this for about the same price as a burger combo meal at a fast-food chain, so definitely an upgrade from that.Chopstick House is doing it right so far. I'll be back to try them some more."], ["Jazz W.", "So delightful!! Best Chinese I have had since I moved to Nashville. Friendly service! They love their customers.. And it shows!!!"], ["Ray P.", "Best chinese food in Antioch.  I love their steamed dumplings.  They don't deliver but you can order online and pick it up."], ["Electa B.", "This is the best Chinese restaurant I have found since I moved to Nashville. We have ordered carry out four times and the experience has been consistent. The fried rice is amazing; the egg fried rice is our favorite. The sweet and sour chicken is exactly as I expected it to be: chicken fried in a flavor-neutral and crispy fritter batter with red sauce on the side and no icky bits of onion and pepper as filler. The General Tso's chicken is tasty and the chicken lo mein is perfect. The fried pot stickers were very good. The Mongolian beef was a disappointment. I look forward to trying the egg foo yung; I hope to report back within a month."], ["Sid N.", "If Chinese take-out is your thing then you will love Chopstick House is the place to go in Antioch. It has all the kitschy red Chinese ornaments that all suburban hearts desire. The service is fast and efficient. They have an online ordering system which works great! I ordered my favorite items: chicken lo me in and General Tso's chicken. Both tasted great! The General Tso's was crispy without being greasy, and was smothered in a mildly spicy sauce. The lo mein was fresh and flavorful.Prices are very reasonable!"], ["Toni M.", "This is our favorite Chinese take-out for the area.  My bf always subs out snow peas in his dish, and they always get it right.  This place is in our regular rotation."], ["Travis T.", "Brand new Chinese place by the Publix in Mt. View Marketplace. I am writing this review on the night of their grand opening (Nov 3, 2014).There are several tables here for eating in, or you can carry out. They also offer delivery within 3 miles of their location, with a $10 minimum order.I ordered chicken lo-mein with an egg roll, and my wife ordered vegetable lo-mein. What can I say? It's a nice, locally owned Chinese place. Food was good for the price, and for what I expected. Better than several other similar places in the area."], ["Ivan G.", "As you could see from the photos, this place is somewhat a hole in the wall compared to the size of the plaza. But, for the second time in the day, I was surprised by how good Asian food is in Nashville. We got the House Special Fried Rice, House Special Lo Mein, General Tso's Chicken and BBQ Ribs. This is the tastiest General Tso's I've had so far; the sauce is just perfect. Typically when I eat General Tso's Chicken, the sauce is either too sweet or too strong such that it's really good the first couple of bites, and the next ones become really hard to swallow. Not the case with this restaurant. Fried noodles and rice were also fantastic. It's great for take away but not good for dine in. The place fits probably only about 20 people. Call ahead before coming to save time. Also good service from the lady at the cashier. I wish them well in their business!"], ["Cris W.", "I love, love, love this place. They have the best chicken broccoli ever. I eat here all the time. The prices are super affordable and the staff are really nice. Its never a long wait and its always good."], ["Katelin B.", "This is my go to Chinese takeout place. You can order online and it's ready to go when I get there. Staff is friendly, food is what you would expect. Tons of food for the price. I do wish that they would do delivery, but overall it's worth the drive."], ["Howard L.", "Hands down the best chinese in the area and possibly my favorite right now in the city.  I get take out when I'm in the area and I am always pleased with what I order. They use fresh ingredients and leave out the parts that are meant to be left out - I can't tell you how many times I've been served parts of the celery, onion and carrot that should have been thrown away at other local chinese places - Chopstick House has no such issues. Their pricing is also very competitive, especially if you order shrimp dishes. Shrimp main courses feature decently sized shrimp - they use small shrimp for fried rice, lo mein and mei fun. I also think they fry their food well - egg rolls aren't soggy with grease, fried chicken dishes are made to order and not pre-fried.I have one gripe: I am not a fan of their spice scale. They do tend towards the bland side of spicy, which means you should request more spice if you're into it. I don't blame them, I blame Nashville for that one. Totally recommended for take-out Chinese. Also, they have Chinese style sweet tea, which is syrupy sweet and delicious. Try it."], ["Steve S.", "If you're looking for a great local area place to get some Chinese food, this place is great. I tend to move a lot and when I find that local Chinese food that's good, I will go back and this place is the one place I will def. make my Chinese food crave place to eat.There are so many places that look the same and even have the same looking building and menu setup. But its all in the taste. Each cook is different and some can be bland, but this place has full flavor in their food. I love the fried dumplings and they have really tasty egg rolls and spring rolls. Other places I've tried you can tell it was frozen or they just had the food sitting out.This place cooks to order on the spot. It only takes less than 10min if you walk in to order. But you always call ahead of time. Very big menu and their lunch specials is cheap and great portion size.For fast food you can pick Panda Express or a mom and pops family based place. I prefer the family based home cooking kind of food!"], ["Olivier D.", "This certainly the better Chinese take out in town. Good food, good pricing and very friendly service. Lunch specials are cheap 5.25-5.75$. I can easily become a regular."], ["Scott N.", "I am not a hug Chinese food fan, but I have found the ONLY place I will go again. The service was fantastic, the woman at the counter was so upbeat, so happy, she smiled the whole time, said please and thank you and was such a nice lady. The food was very good, and hot and fresh. I drove here for takeout, then drove back to my home in Lavergne...the food was still piping hot.If you want Chinese takeout...this is the spot"], ["Rubi C.", "I always get the House Special Lo mein and it's delicious my husband however loves to get something different every time and he is never disappointed."], ["Joey S.", "This place is delish! Very clean and the staff is very friendly. The combos come with plenty of food for an inexpensive price. I will be a regular!"], ["Jonathan M.", "Ordered take out for the first time tonight.  Everything was wonderful. The house special lo mein was very tasty I had no complaints at all. On the phone they were very friendly and said it would be ready in 15 minutes.....wow that's fast in my book.The location is very clean and they seem to have a well working system of operation. Will be ordering again soon. I'm unsure if they have delivery or not."], ["Phillip F.", "Fast, friendly, delicious!!! Welcome to the neighborhood!!!Standard American Chinese dishes. Made quickly, served hot, and yummy! Been here twice since they opened a couple weeks ago. Dining in is available, I think they have 8-10 booths, similar to a burger joint. No tables and chairs. It would make a great lunch stop, it's a relatively small place. Egg rolls are great, you can tell they are made with fresh ingredients. Not greasy, or mushy. The chicken batter is crispy, not soggy. Prices are relatively low compared to other Chinese restaurants in the area, but does not limit the quality."], ["Erik W.", "So, we ventured out yet again to try to find some quality Chinese tonight. ..and we scored. I had the sweet and sour chicken  combo with fried rice and vegetables. Clearly  the best ive ever had. The batter on the chicken was excellent and the seasoning as well as the cook was spot on. The rice was the absolute best of any Chinese restaurant I've ever had. Specifically the seasoning was perfect as well as the texture. I was extremely impressed. Hope this was not a fluke. In addition i got to try the chicken lowmanin and it was spot on. I don't typically write reviews, but this one deserves a thumbs up. In summary whoever cooked tonight knows whats up.....Thanks!!!!, nice to not be be disappointed after a ordering takeout.Keep  up the good work! !!!!  I'll be back for sure."]], "LJ Asian Cuisine": [["Wcurt P.", "Super friendly staff. I go for the sushi. It's very good and they have a wide variety. They make it fresh. The sesame Chicken is awesome and they bring u enough for 2 or 3 people."], ["Jason B.", "Not good for me.The tuna was mushy and had an off putting flavor and odor.  I\"m not even sure it was tuna.  Unfortunately, 2 of my 3 rolls had tuna, so my lunch was somewhat ruined.The crunchy shrimp roll was ok.The miso soup was good, a bit saltier than most places.Service was good, but there were only 2 other tables seated."], ["Bridget S.", "Lunch time disappointment. The goyza were soft and rubbery. Shrimp tempura....hmm where was the shrimp? Small lttle pieces of shrimp. The pro: Spicy tuna roll was good not great. The overall lunch was pricey. I will stick with my go to sushi place."], ["Isaac W.", "Some of the BEST sushi in Nashville. Quality staff and rarely too busy to get in and out in a flash. Pickup orders are ALWAYS correct. Beer and wine here too. Try the JJ Roll!!!"], ["Matt H.", "I hear there sushi is great, so I probably should have gotten that.  They have traditional dining available too (sit on the floor in a private room through sliding paper shade door, no shoes, etc.) and I didn't do that either.  Instead I got a Thai style dish where the rice seemed a lot like minute rice and the dining room was DEAD. SILENT.   I would give it 3 stars based on my actual experience, but 4 for the potential promised by the sushi and traditional dining experience."], ["Anna G.", "This wonderful restaurant is tucked away in a corner by Big Lots. I never would have thought it could be so good, but believe me, IT IS! I love the Dragon roll, spicy Tuna and Pad Thai. Can't wait to try more items!"], ["Alexandra F.", "This place was far from great, First of all I was looking forward to the miso soup, which was so scalding hot that it fried my tongue when I sipped it. I at least would have appreciated a warning. Second of all, this is the worst sushi I have ever tasted. The tuna tasted fowl. The shrimp was rubbery. The crab salad had almost no taste. What a waste of money. I went in knowing that I wasn't going to have the best sushi of my life for $9.82, but I didn't expect to leave angry, hungry and not tip. I don't think I've ever done that before. The presentation was the sloppiest I've ever seen. Isn't sushi supposed to be asian art on a plate? There was spicy mayo everywhere and normally, I'm ok with that, but this spicy mayo was not good. It was not at all creamy or spicy. It looked like it came out of a jar for $1. The place looked decent inside, but I was surprised when I walked in and there was not a customer in sight. That should have been a red flag. While I was dining I heard the server take a call for a to-go order. They ordered the \"three rolls lunch\" as well. That poor soul..."], ["Tim A.", "Given their location, it would be very convenient for me if LJ's just served awesome food. Certainly, the service is a notch above what you would get at Fujiyama's, but unfortunately the food hasn't progressed all that much.I ordered a spicy noodle dish with a side of Crab Rangoons. The rangoons were unfortunately not what I was looking for; the pastry tasted like frozen pre-made and there was nothing remotey crab-y about the filling. Even the cheese tasted a bit off. I'd have to give 2 stars for the appetizer.Fortunately, the main attraction was considerably better. I particularly enjoyed the array of vegetables which livened the plate up. The noodles, while far from awe-inspiring, weren't terrible either. My big problem with this plate was the proteins. Everything tasted rubbery and dried-out, to the point that I ended up picking around them by the end of the meal.I will give three stars to acknowledge the remarkably friendly environment this place has going for it, but I think there is room for improvement on the food front."], ["Emily B.", "LJ Asian Cuisine has been my favorite Asian restaurant from day one. Everything there is amazing. I usually get orange chicken or sweet and sour chicken from the lunch menu. Last night, I ordered the LJ special sushi roll. (Fresh cooked shrimp, cream cheese, crab, baked crab on top with tempura and caviar) It was by far the best sushi I have ever had. I even had extra to take home.  Best Asian food for quality, service, presentation, and friendliness of staff."], ["Gibson P.", "Perhaps we chose to here because it is close to Costco. Perhaps we came because it was highly rated on Yelp. Perhaps we came because we were hungry. For whatever reason we came, we will definitely be back. The 3-roll sushi plate for $8.99 with miso soup was a huge hit, as was the chicken red curry entree. Friendly staff and new owners. Please come try LJ Asian - you won't be disappointed."], ["Rita R.", "Great experience here. Super friendly staff. Very welcoming (and quick service). They had a $3 house wine special on Chardonnay last night. However, we tried the nigori sake instead. This is my go-to for sake since it's  served chilled (and it didn't disappoint). We ordered the panang curry and the general tso's chicken. Both were delicious and came out fast and super hot/steamy after we ordered (they were not very busy last night). Reasonable prices as well. Our dishes were around $10 each for a very generous portion."], ["Katie D.", "Enjoyed this little restaurant. My friend and I came in when it wasn't incredibly busy and received excellent service. We both ordered sushi and my friend order crab rangoons. The special rolls weren't cheap but included lots of food! Definitely didn't need more than one or two. My friend enjoyed her appetizer as well."], ["John-Michael M.", "I eat here at least once a week. Usually one crunchy crab roll and one crunchy shrimp. Always great with a friendly staff!"], ["Kiely S.", "I really like coming in here for lunch. You can't beat three sushi rolls and miso soup for $8.99. Plus the service is always great and the staff is friendly. I gave four stars because I don't think AMAZING sushi exists in Nashville, but this place does a good job. :)"], ["Jared K.", "Some of the best sushi in Nashville! I have yet to be disappointed here."], ["Belinda H.", "Wow! We just found this place by using yelp and I have to say, it was some of the BEST Food I have eaten in a while. Great friendly service, clean, and delishious food."], ["Misty M.", "Had the salmon teriyaki and he had the spicy noodle with scallops. Both were fantastic! Eggs rolls and hot and sour soup were also amazing.I was super impressed and will be coming back!"], ["Billy H.", "I like this place. Service is always friendly. I have absolutely no problems with the food. I mainly come here during lunch since I work on this side of town and will either dine in or take away. Their lunch items are good value for money."], ["Teresa B.", "I was running errands and was craving sushi so I dropped in to LJ Asian Cuisine for lunch.  I don't know why but I didn't have high expectations.  Maybe because it's located in a run down strip mall.  Anyway.....I ordered the gyoza and the Alaska Roll.  The gyoza was probably the best I've had - totally didn't expect that!  The Alaska Roll was good sized and fresh.  I decided that I needed to go ahead and order the Spicy Tuna Roll since everything else was so good and I wasn't disappointed.  LJ Asian Cuisine would have received 5 stars if the interior were a bit more cheerful.  Oh, they advertise 1/2 price sushi on Tuesdays!"], ["Ava R.", "I've searched all over Nashville for decent Chinese food. This place is fantastic. I have not gone anywhere else. And I would recommend everyone try the crab rangoon."], ["Christine J.", "What a great American Chinese place! The portions are generous and very good! Great to dine in or take out. Definitely going to come back!"], ["Ken M.", "Absolutely one of the best sushi places in Nashville.  Well kept secret among the locals. Also fabulous Thai and Chinese food menu.  Orange chicken was excellent and red curry to die for.."], ["Darlene V.", "I'm a regular here and it is by far my favorite Japanese restaurant in town. The staff is very nice. The prices are reasonable. I always order sushi and haven't tried some of their Thai or Chinese dishes. But I can say that their sushi is outstanding."], ["Mike W.", "Excellent egg rolls and food. Go there all of the time and never had a bad meal or service. Nice atmosphere also."], ["Stephen L.", "I have really enjoyed this restaurant since their opening. I eat here probably two times a week. The sushi is awesome and they also have Chinese dishes as well. I have never had a bad item. The service is great and when you order to go food they always get it right. They have half off sushi on Tuesdays which is a great deal! Dine in only."], ["Quincie S.", "I loved this place as soon as I walked in. It is beautiful! The staff is very nice. There was a vast food selection and my food was delicious. I will be back!"], ["Judy G.", "We decided to give this restaurant a new try after a bad experience with the previous owners.  There was no improvement. The ambiance was awful from the harsh, diner-style lightning to the classic rock music playing in the background. I went in search  of decent Chinese food in our area, only to find a very limited Chinese menu and not the dish I had hoped for. I ended up ordering sushi, a crunchy crab roll. It was not good, and I couldn't eat it. It tasted like bad, fake crab salad made with miracle whip. It was too sweet, with a crumbling of crispies on top.  My husband had a Schezhuan  Beef which was o.k. at best. Whole spicy peppers were left on his plate, and seemed to be the only seasoning in the dish. He had to add soy sauce to improve it. We do not plan to return."], ["David D.", "Okay, I have high standards for Chinese fare, having lived in Boston and San Francisco, both cities with booming Chinatowns and absolutely amazing Chinese restaurants.  I've never had a great Chinese meal in Nashville, but tonight at LJ, it was pretty darn good; had the Hunan Chicken and I have to say it was the best Chinese dish I've had here in my 20 years in town.  Ordered it mildly spicy, which was good for me.  The dish itself could have been hotter.  Service was excellent.  The room is very attractive.  Prices reasonable, especially for the very large portion I got (had to takeout what I couldn't eat and that will be lunch tomorrow).  I will definitely be back."], ["Richard C.", "This place is a new Asian restaurant at the site of the old Fujiyama's. I am glad to see they have many different types of Asian food: Thai, Japanese, and Chinese. I have tried the green curry Thai chicken bowl, it was good, but the real star here is the sushi. They take their time and it was prepared expertly. Presentation was top notch. Freshness excellent. I will continue to explore their menu further as there are so many things to try. Check out the Thai iced tea, if you've never had it before, it's something else!"], ["S G.", "I'm very selective with my five-star ratings. This one really deserves it. Found it on Yelp and was not disappointed.  Great menu, delicious food, friendly service, and nice atmosphere.  The only thing really missing was some music in the background.  I had the miso soup, squid salad, and Mongolian triple. All were great.  My wife had the sweet and spicy noodles with scallops. It was also great. Even the iced tea was exceptionally good.  It is in a very unassuming strip shopping center but well worth trying.  Appears to be family owned and operated.   Very reasonably priced, too."], ["Cam C.", "I like this place and it's under new mgmt than Fujiyama. The prices are better and the food tastes better than the old Fujiyama... But they are missing a business opportunity that makes me worry about the future of this place. Fujiyama offered a groupon that LJ has posted they WILL NOT honor. While the new owners are under no obligation to honor the Groupon, it is a bad business decision not to. They are turning away business and alienating potential repeat customers. They are not taking advantage of advertising they didn't even pay for! I'm afraid for their cost of one buy one get one free meal, they are throwing away thousands of dollars in repeat business from customers yet to try this gem of a restaurant."], ["Ebony Da'na C.", "People weren't joking when they said its hard to find a good Chinese restaurant here in Nashville. After about five or six failed attempts I finally saw this place on my way out of Big Lots and I was supper happy I did! First off I have to say that everyone in this restaurant is super friendly. When I walked in there was no one at the register so the sushi guy asked me if I needed help and stopped rolling sushi to take my order. I ended up getting some steamed dumplings and fried rice, nothing too special but let me tell you it was delish! Most places here just dabble a drop of soy sauce on a bed rice and call it a day but this fried rice was actually flavorful. The dumplings were fresh, tender, and juicy, just perfect. On my second visit I ended up trying the sushi. I'm not a big fan of sushi but our rolls were made to order. The rolls were super fresh and light something that is essential for me when I eat sushi. The presentation was beautiful as well. The waitresses, sushi guys, and the manager are always nice. I would recomend this place over Chinatown anyday!"]], "Pei Wei": [["Queen B.", "Not bad, for a franchise restaurant!Slipped away from an art exhibit and decided to have a quick dinner here.Like everyone else - 1) fast  2) cheap  3) fresh  4) convenient.It's not as salty as PF Chang's.It's not expensive like PF Chang's.It's not overly crowded with long wait lines, like PF Chang's..good.What it is, is fast, cheap, freshly made food.I had the Spicy Korean plate with fried rice.Plentiful, not real salty, good for the hunger pangs, easy on the wallet, decent on the pallet.I want to return and try a couple other dishes that sounded good.I appreciate how the manager runs the restaurant.  He understands Repeat Customer Satisfaction.There are many restaurants in this town that don't!I will return and try more dishes."], ["Tiffany M.", "I've been just really wanting decent Chinese food. I hoped that this would end up being someplace I could go for simple take out. Honestly, we couldn't even finish our food. We went in and ordered carry out. I got sweet and sour chicken and my guy got pad Thai. After a few bites all I could taste was ginger. At first I was really confused and thought maybe it was in the soy sauce. I tasted some on its own and that wasn't it. The more I ate, the more I realized I was chewing actual pieces of ginger. At that point I was trying to decide if it was in the rice or the chicken. I'm still not totally sure. It could have been in both! It was seriously all I could taste. It was the most bizarre thing. My boyfriend said his food was really greasy and tasted like burnt oil. Once he admit he didn't like his, I let out a sigh of relief and let him know I really couldn't even finish mine. We took our half eaten food downstairs and threw it out. Then we are slices of cake. That was way better. I guess we're still on the search for any decent Chinese food in Nashville. :/I'm honestly not even sure why I gave this place 2 stars since the food was practically inedible. I guess because the staff was friendly and the service was quick."], ["Alisha W.", "It's a chain so right off the bat not my favorite but I used to LOVE pei wei.  They have changed how the menu is and it seems like the ingredients have gone way down hill.  Since when is veggies just cabbage and thin slices carrots?? Where are the veggies at?!?! I was a bit disappointed in the new menu and prob won't be back."], ["Matt C.", "If I lived just a bit closer, I'd come here much more often. This trip I ordered the beef prepared \"Thai Dynamite\" style, with veggies, and a side of stir fried rice. I washed it down with a glass of merlot and man, was it tasty! I highly recommend that combo. The service was friendly and fast. Its a great place to get a yummy quick bite just before the movies in at the Green Hills theater."], ["Charlie P.", "You know what you're getting when you order. I've ordered takeaway from this location numerous times...the consistency is very good. Curiously though, the food was great again, but there were NO lids for drinks. Bizarre!"], ["Afkham N.", "Not thier best effort with the Thai Dynamite. Only half the chicken was sauced and overwhelmingly vinegary. Spicy Korean was better."], ["Lori C.", "Our food was delivered to our table within a few minutes of ordering. The food was piping hot and fresh. I had the Dan Dan bowl and enjoyed every bite. It's very reasonably priced as well."], ["Igor S.", "This was my first time here so I wasn't sure what to try. I asked the employee at the register. She didn't know. So I tried the orange peel chicken. It was fresh and hot. But more healthy than I was looking for."], ["Susan S.", "Absolutely love this fast food version of PF Chang's! It just seems expensive for the small portion sizes. Maybe it's just me, but I think you need to add double meat to get a decent portion. Their teriyaki and ginger dish is really good. They just need larger portions and more sauce. If you order extra sauce it's too salty, so I wish they'd give you more with the dish. But man, it's good!"], ["Mavis J.", "Food was not prepared as we ordered. Food bland and cold. This place is overrated. Not worth your time."], ["Mitch E.", "This store (Green Hills, Nashville, TN) makes the Pei Wei brand look terrible!I live and work nearby and love Pei Wei food, but the management of this store is absolutely abysmal.  On several occasions (most recently today), I've called in orders or submitted them online only to have an undertrained employee tell me they either had lost the order entirely or hadn't yet even put the order in.Tonight after waiting over an hour for an in-store takeout order, when my order finally arrived, the staffer told me, \"I'm not even sure what's in here.  If it's the wrong thing, it's because we ran out of what you ordered.\"As it turns out, all three meals in the order were indeed wrong.  An order of lo mein with chicken and extra veggies that was merely a box of lo mein being the most comical.If you're going to staff an entire crew of high schoolers, they really need to be trained and managed better."], ["David O.", "Pei Wei is your Fast Food solution to P.F. Changs, offering mostly the same kinds of dishes. I enjoy the food, but like others I feel the prices are perhaps a bit higher than they should be. The location is very nice with a reasonably decent amount of parking. You might run into problems in the evening, but for the most part you'll be able to find something. For my most recent visit, they kept trying to deliver the wrong food to our table, but we eventually got our food. I have no real complaints beyond price, and I'm sure I'll be back."], ["Nashville T.", "Not bad for fast food Asian.  The place is always freezing.  Just eat order and get out fast!"], ["Ashwin M.", "Oh god, the oil. The oil. \"Drill, baby, drill\"  was probably conceived right here in Pei Wei.The ambiance was nice and all that, but when the food came, it was floating in an ocean of sesame oil. For simple-minded vegetarians such as myself, there was a little green symbol next to the food items that signified what was meat-free. But the portions were large enough that I had to take home some of what I'd ordered. That or my stomach shrank after a few mouthfuls.For decades after eating here, my mouth felt dry and I was thirsty No amount of water could quench my thirst. A wise man also told me that oil and water don't mix and that I should not be surprised.  He also told me that if I crave authentic Asian food, I must never return here."], ["Jessica M.", "So much good quality food! Anytime my husband and I are in a town with a Pei Wei, we try to go. It's basically the same quality as P.F. Chang's, but for about 1/3 of the price. Birmingham NEEDS one of these!I ordered shrimp lo mein this time and ate the ENTIRE bowl (usually I take half to go). It was so good I couldn't stop eating it. I really like that their shrimp, chicken, beef, and tofu is the same price - it bothers me when people make beef and shrimp more expensive."], ["Joey Flash A.", "My first time at Pei Wei was on a Sunday night and being its the Xmas season and in the middle of the Green Hills area, the joint was busy...The food was decent, but not enough out of Panda Express' league to justify the extra $2-3 per entree. My friend had a tofu dish because they had run out of shrimp (the guy said the truck never showed up). Her dish showed up and for a second she thought they had screwed up and put chicken on instead of tofu. I had a taste and it was tofu after all, and it was delicious, I'm not a tofu guy so I was really impressed at how good the tofu was!My dish was the caramel chicken. It had the little icon indicating it was spicy, but the heat level was very tame. The dish worked though, and was quite tasty. Some of the white rice was too crispy, as if some sections were undercooked.The restaurant was kind of chaotic, I had to hunt around the joint for a napkin. The chili garlic sauce and mustard sauce jars were all close to empty, but hey, grab as many fortune cookies as you'd like! There were unbussed tables everywhere.The bathroom was kind of gross. Water everywhere and no paper towels. They did a great job of getting food out, but probably could use more on the bussing/cleaning/condiment stocking end of things."], ["Caitlin C.", "If Panda Express and PF Chang's had a baby it would be Pei Wei. Basically it's an upscale fast food American Chinese joint. Positives: cheap, fast, easy, convenient, options....Cons: bland, boring, predictable, fast food quality. I ended up getting some sort of salad with too much lettuce and dressing and not much else. It was only 7ish dollars, but quite frankly I would have preferred to make my own salad at whole foods. Oh well, it's fast and easy!"], ["Heather H.", "Don't judge, but I kind of like this place. As far as East Asian food goes I honestly prefer it Americanized (Spider J., you may kick me in the shins next time I'm in the SGV). It's not that I'm not adventurous, but it's easier to eat meat-free at a place like Pei Wei. Anything with a leaf next to it on the menu can be ordered with no meat or animal byproducts. The food is pretty alright in that context. I was able to get spring rolls, and veggies with tofu in sweet and sour sauce over brown rice.  The portion was very generous, and I wasn't able to finish it. It's not fine dining, or an authentic experience, but it's good. Pei Wei has kind of a pan-Asian thing going. The last time I was here I ordered Pad Thai, and I saw some Korean food on the menu too. You can also get all the standard fountain drinks as well as beer. And fortune cookies."], ["Johnny W.", "Pei Wei isn't so much a restaurant as a tool to scratch a particular kind of taste-itch (titch?). Commentary on its authenticity or sense of place is entirely beside the point. PW fills its role quite well as long as you take advantage of some basic knowledge:-Most of the sauces taste the same. Just get the Orange Peel; it's less salty than most. -You can get your chicken steamed instead of fried. For some reason they call this \"velvet.\" -The brown rice is much better than the white. Get it.-The tofu option is good. It's nice and seared on the outside. -Two people can easily split a dish, so it's possible to eat well here for about $6.50 a head. They offer extra plates at the tables, which makes sharing easier."], ["Ashley P.", "One of my favorite chains. Perfect for Fridays in Lent because you can get any dish with Shrimp in it. We come here every once in a while from work when craving Chinese. Their spring rolls are my favorite. They are typically not over fried like some tend to be. My favorites are the honey seared chicken and their lo main. On Friday I got the lo main with shrimp and was really impressed by how many shrimp they gave me. In the end I had more shrimp than noodles left, which never happens! I just got water but next time I would definitely try the fancy soda machine, someone I was with got a Strawberry Sprite which was pretty tasty. Overall this is a solid location of the solid chain. Sometimes I like knowing exactly what to expect."]], "Golden Coast Chinese Restaurant": [], "China Spring": [["A A.", "As has been said, China Spring serves it's purpose.  Sometimes it's a little off, but for the most part, you get exactly what you pay for.  I'm glad it's there and thankful.  The staff is nice.  Short of the occasional cops in there eating, (cops generally make me nervous, even when not guilty,) and the a-hole customers who think they are special and park in the fire lane, it is a good place!"], ["Ashley T.", "Meh, it's not great. It's not bad. It's cheap, unhealthy, Americanized Chinese food. I called in general tso's tofu for lunch and when I opened the door it was crazy inside. They apparently have a hopping lunch buffet. This is really close to where I work so I'm sure I'll go back but I hate feeling like napping when I have to get back to work so who even knows anymore."], ["Megan T.", "I hope this was just an off night... I've been in the past and although it wasn't memorable, it wasn't a bad experience. Tonight was just bad. I called twice to place a takeout order.  Both times they hung up on me. I was hoping it was just miscommunication. I show up a few minutes later, the man who took my order is still being rude and the cook is snickering in the background. Food was ready very quickly; that would be great if the food had been good. Egg drop soup was curdled? That's the best way to explain it. Thick and gross.  Chicken with broccoli, fried rice and spring roll were ok. The kicker is when I went back in to ask for fried noodles to go with the egg drop soup(that ended up in the trash). The rude guy threw the fried noodles at me!  Even if the food was outstanding I would not be going back."], ["Daniel W.", "This is your run of the mill cheap, strip mall chinese. Its large portions, quick, and terrible for you. But it is yummy when you want something slummy. Lo Mein is really good. Their Moo Goo Gai Pan had green peppers in it, which I've never seen before."], ["Corey G.", "This place is great!  A hidden gem in the Melrose area of Berry Hill.  I ordered take out and the meals were enough for two people and had a great price on them.  The inside of the place was somewhat plain but it was very clean and well maintained.  The customer service was very friendly and helpful.  This place has become my new go to Take Out Chinese place in Nashville!"], ["Brian K.", "I just tried China Spring for the first time and I would agree with the other reviews.  China Spring gives you a lot of food at a decent price, but the food is just okay.  We got the Orange Chicken and Broccoli Chicken and both were good, but kind of bland.  The portion sizes were big and could easy be 2 meals which was awesome.  We called in for pick up and it was ready in 10 minutes so that was also a plus.  I would eat here again if I was looking for cheap and easy Chinese food."], ["Jesse Q.", "Great food and great service it's not expensive and it's cooked fresh while you wait. It is quite as well for meetings and more"], ["Susan D.", "I went for their lunch buffet. $5.75 without a soda. There are several soup options as well as fried rice, normal rice and egg rolls with crab rangoons. The hot and sour soup was good and hearty and the egg rolls and rangoons were pretty tasty as well. The rest of their menu was decent. Their other options were General Tso's Chicken, chicken and broccoli, hot chicken and mushrooms, hunan beef and onions with pepper chicken. Lo mein noodles were also there. All of those were decent but nothing special. The General Tso's was the best option but even that wasn't impressive. Lo mein was bland. There was also sweet and sour chicken which was fine. The chinese dough nuts were good but how can you screw those up? Overall, decent chinese food for what you're paying. I'm still looking for a better chinese option in Nashville"], ["H S.", "I have three words to say about China Spring and I need you to follow along with me: 1. General (A rather vague word, keep going.)2. Tso's (This is a tough one to pronounce, but not unfamiliar.)3. Tofu (Speechless?)That's right, the ol' standby China Spring has added General Tso's Tofu to their menu of specials. Now in some cities this would not be at all remarkable, in New York and Chicago this is no big deal, but in a town where meatless Chinese food is limited to veggie eggrolls and the occasionally well-prepared Homestyle Bean Curd (China Spring does both of these pretty well) this is remarkable.This is a new menu item for the 'Spring and the first time I ordered it, it was so-so--the tofu was kind-of hard, the sauce too sweet and not at all spicy. I almost didn't order it again, but I am so very glad I did!Since my last visit they have perfected this dish. I asked for it extra spicy and it came out just right. If you've never had really good Chinese meatless dishes you will be blown away by this one. On my second taste, the fried tofu was so perfectly cooked I can only describe the texture as fluffy. If you've been wishing for a great vegetarian Chinese gluten restaurant, do yourself a favor and go there for the next best thing. It is off the charts good!"], ["David G.", "I have lived in Nashville for 7 years and I think that by far China Spring has the best lunch buffet in town. $5.75 for a buffet and water... What a deal. I really feel this is one of Nashville's best kept secrets."], ["China Spring B.", "i think china spring is the perfect place to buy a family order. u only have to spend $7  on the combination platter, u cn get rice, eggroll and watever the stuff u want in the comb,!! it's cheap and they give u enough food.:)    they also hve lunch buffet, is only $5.25 for a person, u cn eat as much u want, and the food is  really fresh,  + delicious:)   if u dont have time to eat there, u cn also do the buffet togo or order something else from the menu."], ["Erin D.", "When I lived in this part of town China Spring was a weekly outing. Their food isn't the best, but it's cheap and you get a lot of it. It's perfect for the college student budget. If I remember correctly the combos are close to $6 bucks and they give you enough food for two or three meals. I liked their Lo Mein and Fried Rice, and my roommate would get the Sweet & Sour chicken. We once took a picture of her plate when we ate in because they gave her more chicken than any 12 ppl need. They are super quick too, so I would order when I was leaving class at Belmont and it would be ready by the time I got there (about 5 mins.). I've never seen a crowd here, but they stay in business so I bet the majority of the business is take out. I definitely recommend it."], ["Patrick S.", "China Spring is your standard strip mall Americanized Chinese joint.  They handle many of your favorite chinese food staples, with some additions like the General Tso's Tofu.  There aren't many Chinese places all that close to the area so it's nice to see one in the 12 south community.  What i do like the most is the lunch buffet they have. It's kinda small probably 6-8 dishes, but all are very tasty. And being the cost conscience guy that i am, i noticed they don't technically have servers there so you get a decent sit down meal without having to pay any tip.  Hey, in these tough economic times every dollar saved is a dollar earned.  Check this spot out!"]], "Bao Down": [], "Panda House": [], "New China Restaurant": [["Kristina G.", "I got crab rangoons, honey chicken and a side of chicken lo mein.  The crab rangoons were eh, there was nothing special about them and the wanton rappers seemed like they were a little stale.  The honey chicken was horrible, it was all a congealed mess in the bowl and I'm pretty sure they used pancake syrup to make it, it made its way to the trash can instead of into my stomach.  I would only consider going back to this place if it was to get the chicken lo mein,  it was not the best I've ever had but it was decent.  I gave it two stars because of the low mein and the fast and friendly service."], ["Danny B.", "This is probably the best Chinese restaurant in Donelson It's not great but it's good worth trying."], ["Shane M.", "Pretty good Chinese and decent prices. They deliver too."], ["Sean W.", "Good food, better than Super Wok in Hermitage. They have traditional pork fried rice plus the food is pretty tasty. Be on the look out for coupons in the clipper magazine. Cute plastic containers are nice as well."]], "China One": [["Na Hyun K.", "My boyfriend and I ordered broccoli with garlic sauce, lunch special general Tso chicken, and a small shrimp lo mein while in town.The guy on the phone was very easy to talk to, no heavy accents, was not rude, and he repeated the order.The broccoli tasted fresh and wasn't heavily soaked in garlic sauce like some Chinese take outs are. It came with a small box of white rice.The General Tso chicken is actually the reason for the 4 stars. The breading tasted old and not crispy how it should be if it was fresh. The chicken inside tasted a little old as well but it might have just been because we came during late lunch. The lunch special came with a spring roll and fried rice which was good.The shrimp lo mein was delicious! It was probably the best lo mein I've tasted at a Chinese take out. Overall, I recommend this Chinese take out, not only for its better than average service and tasty food, but also how quick they took preparing it!"], ["El K.", "CLOSE! Reliable...hair in my food...I loved this local hole in the wall when I realized there was constantly hair in my take-out. Yes I have pets! I first thought this was the reason...alas there were hairs that I don't even want to detail...this is appalling. I'm pretty sure there is either animal hair or pubic hair! I'm going in there tomorrow to speak with the manager and owner. I shouldn't have to worry about my child eating something unsafe in this community! This not acceptable. Pay attention to what you're eating, I bet you'll find hair in your take-out too! TRULY UPSETTING!"], ["Timothy M.", "I eat here once a week. I love their teriyaki chicken-on-a-stick. I order it every time i go. The food is great, always hot and you get a lot for your money. And I think the girl behind the counter is cute, lol. Never had a problem with hair in MY food. Best chinese food in Donelson."], ["Alicia M.", "This is usually my go-to spot for Chinese food. Only giving three stars though. The food is indeed good, fresh, and hardly any wait time.  Very convenient from my home. The owners have their daughters running the front counter sometimes and answering phones. They need a lesson or two in mannerisms and customer service. RUDE! RUDE! RUDE! If the mother answers or is at the counter she is usually pleasant. I ordered from here Saturday night (April 19th), young girl answers the phone was kinda snappy. Arrived at the restaurant 15 minutes later and my food was ready. However I was not greeted, the girl didn't smile, had a nasty scowl on her face, and had a TOTALLY effed up attitude.  I ordered the Shrimp Egg Foo Young and I had a HUGE helping. Didn't have enough rice but thats ok. This location does not have a lunch buffet so the comment made way earlier is totally wrong. Ill return though."], ["Rachel H.", "ChinaOne never fails my family. Our favorites are delicious and pretty much everything else is too. Fast, friendly service and delivery."], ["Kimberly B.", "Blame part of this on me not checking my order before I walked out the door.*Sweet & Sour chicken - sauce was on the side, and I absolutely did not specify that. Makes for a completely different experience.*Ordered take-out for 2 and asked for \"an order of egg rolls\" - got 1. Horrible counting skills.*A kid had to take time out of his video game to come ring us up, couldn't have been older than 12 and was clearly not what he wanted to do.Won't order from here again. Horrible service, lukewarm build-your-own food, just ridiculous all around. Panda express at least mixes their chicken with their sweet & sour sauce."], ["Melinda A.", "The worst Chinese I've ever had in my life. Now I'm pretty depressed that I wasted my money. We couldn't eat any of it. Part of our order was even missing but I don't want anything else from this place or I'd get sick. We didn't even get forks, napkins, or even a receipt. Idk how this place is even open."], ["Sean G.", "I must say - food was so-so. The service from the rude chick at the register was worse. Too busy standing behind the countrr on her cell yelling at someone to help customers - wont frequent this place."], ["Amanda W.", "Got the fried rice.  Can't go wrong with fried rice, right?  WRONG!!  It was bright yellow and so disgusting I couldn't finish it.  I felt sick after eating what I did and regretting getting out of bed and driving from my hotel for this nastiness.  I thought with the good reviews on Yelp!  it would be good, but they must have gone on a different day because this was just foul."], ["Deborah G.", "Really delicious. Rice was fluffy, crab rangoons might be the best I've ever had, and the sesame tofu was sweetly savory with plenty of broccoli."], ["Trey J.", "Good food great service always knows what I ordered as soon as I walk in the door to pick up my order!"], ["Avonel R.", "I've yet to find a decent Chinese place in East Nashville..(hint for those of you that may know of one-please tell me!) so I have to make the drive over to this place when I get a craving.The workers here speak English well and are so incredibly pleasant. They even gave me a TON of extra fortune cookies because my wait was a little longer than normal. :) I havent tried many different things on the menu, but I've never had anything to complain about here. The food is average, but for takeout it meets my standards."], ["Mark B.", "This is my fave for Chinese takeout. They also have a M-F lunch buffet, but haven't tried it yet, as I'm more of a night-owl, so I'm usually not awake during their lunch hours. All the dishes I tasted here have been wonderful, especially the eggrolls, chicken stick, and the pork lo mein. The cashiers are always friendly, as are the owners (I assume the owners are the ones I occasionally see in the kitchen), One of the best things for me is that they're open until 10:00 pm, and they are only 2 minutes away from my home. I hope they keep doing well, hope they grow and get bigger and better."], ["Randall P.", "Food was surprisingly good!  Got 3 dishes for my family of 5.  First was Szechuan chicken.  Nice spicy kick to it, very good ingredients.  Next was house special lo mein.  Very good, if maybe a little short on the meat & shrimp.  Last was beef & broccoli.  Very good quality beef, good tang to the broccoli.  Overall, I'd give it a hearty thumbs up.  As Arnold said, \"I'll be back...\""]], "China King": [], "P.F. Chang's": [], "No 1 Chinese": [], "China Panda": [["Vanessa G.", "Let me start by saying, I don't do take-out and i'm not a fan of Chinese and I LOVE this place. The food is available for pick-up in about 10 mins and is freshly prepared with NO MSG. You can also eat in the restaurant. I love the steamed mixed veggies with chicken breast and brown rice.  The garlic sauce comes on the side and you can use as much or little as you like. The prices are reasonable and I can easily enjoy 3-4 meals from one dinner entree. My husband loves the curry chicken with brown rice."], ["Jonathan S.", "Good solid Chinese. We come here often."], ["BethAnn S.", "Yup...it's strip mall Chinese restaurant, BUT it is head and shoulders above Nashville's other offerings.  The atmosphere is meant for take out with a couple of booths and unbelievably bad lighting.  Decorations (warnings?) include a horrifyingly green tank with some next generation goldfish who can apparently thrive in algae (think Simpson's three eyed goldfish from the nuclear power plant).  My six year old and I wondered at the same time 'is that fish alive?'.  That being said, if atmosphere wasn't an issue, I'd give the food 4 stars.  My family isn't wildly adventurous in dining, but the teriaki beef, dumplings, boneless ribs and fried rice were all solid and enjoyable offerings.  I wouldn't hesitate to go back.  Service is fast and friendly.  It requires a bit of gesturing and pointing to get your choices across, but they are good humored about it and it is a lot of food for the money.  Just leave the kids in the car and don't stare too long at the fish tank."], ["Deepak B.", "Yep I like. My wife and I come here for our Christmas dinner."], ["shannon b.", "The lady that owns the place is extremely nice and friendly.  My daughter says their chicken lo mein is the best and I'll say I have to agree.  Dumplings are really good as well as the chicken and veggies from the diet menu."]], "Chinatown Restaurant": [["Lihua S.", "Would be unfair to compare them to Chinatown restaurants in New York or Boston, but I'm just happy they're here in Nashville. They're beef noodle soup does satisfy that occasional hankering for Taiwanese comfort food. (The xiao long bao however doesn't really do it)"], ["Johnny T.", "3.5It is what it is. Unfortunately, Nashville is not SF. We don't have the depths of certain cuisines found in other cities. In time, we'll get there. In fact, I'm sure there's some small mom & pop joint in the city serving up delectable, addictive fare. It just hasn't been yelped yet. It'll get there. Until then and that said, Chinatown offers up a lot to enjoy -- you just have to know how to order. The restaurant tries to straddle the line between authentic and Americanized and the trouble comes in trying to serve two masters. I understand the latter perspective -- it's located in Green Hills and has been around for a while. Know your audience. It makes sense. The last few years, though, have been transformative to/for Nashville. The Chinese restaurant that capitalizes off the influx of and demand from foodies (hate that word) will win big.And, again, what you get out of Chinatown is directly proportional to what you put in. Back in my Chicago days -- and before I placed a fatwa on him -- I was a huge fan of Tony Hu. Any restaurant/endeavor he opened, I was at. I'd never experienced the focus on Chinese regionality when it came to food and he served it up well. Soup dumplings, spice profiles, meat heavy, fish heavy, etc., there was a method to it all. It makes sense. China's ginormous. 'Chinese food', therefore, is a massive undertaking. So, if you do your research, find out the region(s) Chinatown best represents and the dishes that best represent that region, you're assured to have a slam dunk experience. If you're truly seasoned in Chinese fare, ask for the Chinese menu and go to town.I know all this. But, when I came in on a cold Monday night, I just wanted some Americanized Chinese food to eat with the porter that was chilling in my fridge. I ordered the garlic chicken with white rice and engaged in some chit-chat with the front of the house. She was very nice and the restaurant was packed (good sign). After long enough to make me know that my food was made to order but not so long that I got restless, I paid $10 and was on my way. Was it tasty? Yep. Did it make me weak in the knees? No, but that's my fault (see para. 2). Will I come back? (With a group after doing some research and diving in to the full offerings?) Yes."], ["Necey T.", "I despise leaving a business one star, but my experience here was one of the most disappointing dining experiences I have ever had.Food: Worst Chinese food ever :(I ordered General Tso's chicken with white meat, and they gave us a full plate of greasy dough pieces with a heap of sauce all over it. The fried dough was edible but we wanted chicken not dough.I ordered fried rice with egg and received a bowl of steamed brown rice...I didnt expect to have great fried rice here, but I at least expected a piece of carrot or a few pieces of egg. There was nothing in the rice whatsoever, and the waitress confirmed that was the order of fried rice :/I saw another review on here with their General Tso's chicken and it looked great! perhaps they changed chefs or ran out of chicken this time.Service: The waitress was nice, however, she didn't pay attention to our questions and food orders. ie. brought us shrimp egg rolls despite us mentioning (twice) how my mom \"absolutely could not eat shrimp\" (shrimp allergy). Sometimes a shrimp will end up somewhere when a restaurant serves seafood, but these eggs rolls were primarily made up of shrimp...thank goodness I took a bite before my mom did. She also got another part of our order wrong, but it was hard to get her attention (perhaps she was a little frazzled?)Ambiance: Nothing worth noting.Cleanliness:The table and floors were sticky. The floors had food and sauce all over.I am unlikely to ever return. If this is one of the best chinese food restaurants in Nashville, I won't be eating Chinese food for a longggg time.PS: As we were dining in, another customer left while shouting he was never coming back, not sure what happened to upset him, but I can relate!"], ["glenn s.", "First customer of the day so service was pretty quick.  They bring wantons out to the table with a sweet sour type dip, kinda like Mexican restaurants do with chips and salsa. Place is very clean and comfortable atmosphere.  I had the lunch special pepper steak.  came with fried rice, eggroll and soup.  Price was very reasonable.  Food came out very quicklly but I was the only table when I ordered.  about 5 more tables were sat while I was there.  Egg drop soup was very good as well as the pepper steak.  Lunch portion is on the small side.  I would consider it a lite lunch.  If your really hungry order a regular portion."], ["Matt B.", "These guys are soooo unbelievably rude. You have to fight them for a few pairs of to-go utensils. So ridiculous."], ["Eliza L.", "It was literally disgusting. I couldn't even force myself to eat it. I ordered the vegetable delight and it was terrible. It came out all one color: pale green in a clear sauce. It was gooey and looked like spit with some broccoli and cabbage stuck in it. I also ordered a bubble tea and it was okay but you could taste the dust of the mix in it."], ["Justin L.", "We met some friends here for lunch on our drive back from New York City.  Like some other reviewers have said, this is NOT New York City caliber Chinese Food, however, this was some good Chinese food!  I ordered the General Tso's chicken (this is my go to dish) and I was a bit disappointed.  The chicken pieces that were used were very fatty and not of good quality.  The impressing that I received upon entering this Chinese Restaurant was all the ingredients used in their dishes would be of high quality.  While I did order the lunch special of the General Tso's chicken, that should not dictate what type of chicken is used to make up a dish.  I will give this place another try the next time I am in Nashville as their Fried Rice was pretty freakin' good."], ["Marie L.", "I was having a tough time deciding how to review this one.  The food just wasn't quite right but I couldn't put my finger on it.  Then a few days later I got the rare opportunity to eat at my favorite Chinese place back home and that made my review crystal clear.I ordered to go and got Sweet and Sour Chicken, Vegetable lo mien, chicken fried rice and a couple of spring rolls.  I don't know if the time of night had to do with it, but the sweet and sour chicken and chicken fried rice were slightly dried out.  The sweet and sour chicken was tiny, hard pellets of chicken.  The lo mien wasn't edible, leaving me unable to find edible lo mien in the city so far.  Nashville lo mien as a whole is best described as inedible goup in my experience.  The spring rolls were delicious though and while slightly dry, the rest of the food was at least edible.I can't tell you how disappointed I was, especially since I was told this was one of the best Chinese places in Nashville.  Looking at other reviews leads me to believe that some of their dishes are better than others, so I will go back and try their \"best\" dishes.The service was excellent and the food was the most edible Chinese food I have found thus far, so I gave it that third star.   I agree with other reviewers that the food is average at best."], ["Joshua L.", "One of the hostess was not friendly towards us when we wanted to order lunch socials. She tried to up-sale us the regular order when we clearly told her we don't want to order lobster. The food was not as good as used to be. We will not be back"], ["Christa P.", "First, let me start by saying this isnt nearly as good as the chinese food you find in New York City's Chinatown - but, for Nashville, its the best we have found in town by far. I really like this place. We order pretty much the same thing every time we go. Start with the green onion pancakes and crab ragoons. Both are always hot and delicous. They aren't greesy and are served with appropriate (and different) sauces. For mains, we always order off menu general tso's beef, beef belly in hot pot and either sizzling beef or mongolian beef. The beef belly in hot pot is amazing - it comes out already boiling in this beautfiul stew sauce, large beef chucks braised down and tender and served with baby bok choy thats been still holding its form with a bit of crunch but soft and tender - so delish! For chinese food in Nashville, this is the place to go!"], ["Annabelle A.", "Overall, a solid place for Chinese in Green Hills & very convenient if you work nearby.Atmosphere: Clean, pretty quiet, & nicely decorated.Service: Polite, friendly, attentive.Food: Mixed. I've found a few great dishes that are my go-to (Mongolian beef is my favorite!) Some others have been very average (the lo mein is not that great). You get a lot for the price with the lunch specials & their egg flower soup and eggrolls are good.Note: The last time I ordered online, it didn't work. The order went through successfully online, but when I arrived to pick up my food, the worker informed me that their online ordering wasn't working. I had to waste 10 min. of my lunch break while they made my food. **Always order by phone just to be safe!"], ["Cheery M.", "The owner is very nice to us, we have a good experience to eat there, we will back when we get chance to go to TN again:))"], ["Coco D.", "Egg rolls a joy as always, but....they've gotten smaller so if you're looking for nice size egg rolls this isn't the place. I love that they are made fresh, just too small."], ["Jason T.", "Best Chinese restaurant in Nashville period!My favorite is the spicy braised tofu and scallion pancakes for an appetizer. I have yet to have any meal here that was not amazingly good!The portions are generally large enough that there is enough to take home for another meal later.The staff is extremely helpful and attentive and the food usually arrives very quickly.Highly recommended!"], ["Cher Y.", "It's Nashville, Nashville, Nashville....welcome!Point is - context is key.  I think a lot of the reviewers on here are used to Americanized chinese food (it's what is mainly available here) and therefore graded accordingly.Authentic  chinese food is not drowned in cheap stir-fry sweet/sour/salty sauce - the key lies in its balance of flavors without overwhelming the taste buds.  If one is used to eating salty food, the cuisine here will come across as bland.  So if Panda Express is your staple, I would not recommend this place to you.Chinatown is a mix of both - authentic and americanized.  For the geographic area, they are about as authentic as it gets without scaring the majority of diners away who may or may not have tried authentic chinese food before. Now onto the food - good mix of meat vs. vegetarian dishes, generous portion sizes.So for the Nashville area, it is pretty good.  But graded on my collective experience of Chinese dining - it is A-OK.    Every time the craving hits, this is my go to place. For now."], ["April B.", "Yes I know they are very busy on the holidays any other day you will get the sweetest waitresses and the yummiest food."], ["Bob L.", "This is a run of the mill Chinese food restaurant. I will say the restaurant itself is very well kept and clean and the staff are extremely friendly but the food itself is average. I ordered the Orange Chicken with fried rice and my girlfriend ordered the General Tso's Chicken with Lo Mein. The Lo Mein was very good I must say but the fried rice was on the bland side. Both main meals were good but the funny thing was both the Orange Chicken as well as the General Tso's tasted and looked identical. Overall the food was ok but I wouldn't recommend going here if you're looking for GREAT Chinese food."], ["Shannon M.", "Great! Ordered Crab Ragoon, Orange Chicken, General Chicken, white rice, & lo mein! Loved it! I highly recommend this place for Chinese!!! I give it a 5 star!"], ["Nancy P.", "Oh my goodness. Dismal, depressing. The workers were morose, unfriendly, unprofessional. The food was just not worth that. I had a sushi lunch, which was expensive, made worse by the quality. $19 for the sushi lunch. Our favorite spot, Sakura in Franklin, is $8.95 for the same lunch, and 10 times better. My son got a fried rice, his usual. He was not impressed. No one ever spoke to us, everything was done with grumpy face and hand gestures. Then it seemed as if they were unsure who would serve us, so that took a while. Our waitress never came back, ever. Despite this I left a 15% tip, and she found out right away because after I filled it out, she picked it up and looked at it. *&#%! Really? Cardinal waitressing sin. That has happened to me one other time, ever. Ironically both times when the waitresses were mediocre at best. I would never ever go back. I would not recommend at all. I like to try to find little independently owned places like that, but that was bad. I will try to find another place for our Green Hills days."], ["Joe C.", "There are not enough words to describe how delicious this place is. I've never tasted a bad dish. And since the remodel, I feel like I'm getting fancy food in a fancy place at extremely reasonable prices. And the servers are the best!Try the steam buns. Oh my! Never have I tasted something so delicious."], ["Kara C.", "The food was pretty good. Bubble tea is great! Service left us looking at each other every time she walked away. When we asked what was in the steamed dumplings she said idk..... Chicken? If you study the menu before you go and know what to order right away. Like as soon as you open your menu you'll be good. Will be back for bubble tea."], ["Martha H.", "Mediocre food and terrible service. Really terrible. Do not waste your time or money."], ["Matt D.", "It has been at least 2 years since I have eaten here.  7 years ago when my wife and I were dating I would take her here to eat for her lunch/dinner break from work.  It was her choice.  She has always liked this place even in college 20 + years ago.  It has been here a while.They have made some changes since we were last in.The decor is much more up scale.  There are now 2 huge fish tanks in the back.  One with live lobsters and the other with tilapia.  These are there for freshness as you are looking at your dinner if that is what you order.  Very cool!The menu has some of the traditional American/Chinese dishes but I was very pleased to see real traditional Chinese dishes.The service was excellent!  The waiter checked on us just the right amount of times without ever being a bug.About 1/2 way through our meal I looked at my wife and told her, \"this may be the best Chinese food in Nashville\".  I am not totally sure about that as there may be some whole in the wall place where some little Chinese lady is making XO Shrimp in the back of a small kitchen or some 5th generation chef is making braised chickens feet in a spicy brown sauce from some street cart that I would dream to be eating.  Until then, I will continue to try new places.  Until some other place really knocks off my socks,  Chinatown is my favorite.Very pleased and will go back.  I am looking forward to our next trip there."], ["R R.", "This isn't the tyical Americanized Chinese takeout food you usually find around here. Chinatown Restaurant is for people who are looking for- and appreciate- traditionally cooked Chinese food. Don't go here looking for Americanized dishes like general tso and orange chicken or else you'll miss out on a wonderful opportunity to try excellent Chinese dishes.We went on a busy Saturday night, but I was impressed how helpful and polite the staff was! You didn't get that feeling that they were completely overwhelmed. The restaurant was run very smoothly. The food was absolutely delicious. I tried a little bit of everything my group got, and it was hard to pick a favorite because everything was so tasty! The roasted duck was delicous, and it seemed like everyone was really impressed with an eggplant dish we had. The tofu dishes were excellent. Even if you think you don't like tofu, try it here! Same with the duck! This is a place for trying new things and experiencing different food.Take a look at the menu and do some research before you come so you don't get so overwhelmed that you just order the same old Lo Mein, orange chicken, etc. Don't be afraid to try something authentic!Also...BUBBLE TEA! I was so happy to have bubble tea again! If you have never tried it, definitely give it a try!"], ["Mark S.", "I've been here lots of times but always ended up eating the food before remembering to take pictures!  Probably because I know how good it is. Went again today and it was the normal experience. Great food. Great service. Was in the mood for a potato dish that I used to eat in China so I asked the server and she spoke to the chef and he made it for me off menu. It's that type of place. If they can do it they will. Also got the chicken and tofu in peppers (can't remember the name in the menu). The sweet pea leafs which is my fav veggie. The scallion pancake and then the mapo tofu. They make my mapo with Sichuan peppercorns which is the only way to eat it as it really spices it up. Ate everything and will be in a food coma for the next day or so but it is really worth it. It might not be Chengdu but this is as close to authentic Sichuan cuisine that you will find in Nashville. Yummy yummy."], ["Tracy F.", "In a town where great Chinese food simply does not exist, Chinatown is pretty darn delicious and the closest we've got.We ate here for lunch today after 18 months of living in Nashville.  How it took us so long, we'll never know!  We came after an intense workout and were HUNGRY, so we were able to sample quite a few items on the menu and enjoyed nearly everything we ate.I chose the Mongolian Chicken lunch special, which came with brown rice, egg drop soup and a chicken spring roll.  It was a great deal for less than $7, and while the portion was small, everything that came with my lunch was freshly prepared and piping hot.  The soup was nicely flavored and not too salty, but the Mongolian Chicken was greasier than I like, especially because I asked for the dish to be prepared with as little oil as possible.The fiance ordered Black Bean Chicken - a favorite of his from his lifetime of living in NYC - as well as the steamed dumplings.  He very much enjoyed his chicken, though remarked that something was missing that made it different from what he's used to.  However, he did like the nice pop of spice that Chinatown added to their recipe and said he'd order the dish again.  The fiance was also excited for the steamed dumplings, which he thought might be similar to the soup dumplings he misses so much from NYC.  They were indeed similar, though smaller and less soup-filled than the ones he loves.  Again, though, he'd order them upon returning to Chinatown.Though we both enjoyed our food, we were a little put off by the service we received.  We found our waitress to be flippant and unfriendly, and we never received the soup noodles, oranges, or fortune cookies we saw other tables receiving when ordering similar items.  Considering we ordered from both the lunch and dinner menus and paid a nice (though reasonable) price for our lunch, we were disappointed that we didn't receive the same treatment as the other customers in the restaurant.Regardless, for Chinese food that actually tastes like Chinese food, we'll be coming back soon for more."], ["Dani B.", "It was alright. I ordered steamed dumplings, chicken fried rice, and egg rolls with a boba tea. I have nothing to really complain about, per se, but nothing to really rave about either. It was just... average.Even though I didn't really order anything too adventurous, I was still surprised by how bland the fried rice and the dumplings were. I pretty much had to drown everything in sweet & sour and soy sauce. The bubble tea was delicious, but you can't really mess something like that up.Overall, I probably won't go out of my way to go here again like I did this time around."], ["Charlie S.", "We stopped here after shopping at the mall and Parnassus Books.  The atmosphere was very pleasant and comfortable.  The employees were all welcoming, warm, and helpful.  The food was amazing!  I had the pan fried dumplings and they were the best I had ever had.  I also had the General Tso's Chicken which was also great.  The portions were large and everything tasted fresh.  Finally the prices were slightly higher than normal Chinese restaurants but this was a much better experience in a nicer part of town so it was definitely worth it."], ["Austin H.", "A year ago I ordered from here and was blown away by the quality and service. Since then I've gone back three times, each time hoping for that same experience. I usually order either General Tso's or Sesame Chicken (basic americanized dishes, I know). A couple little things before I address the food- I always order to-go and haven't been given utensils or napkins since my first visit. It's not a big deal of course, but the little things go a long way.The last three times I've ordered, the meat has either been such low quality that it's tough to eat or so deeply fried and such small pieces of chicken that there's almost no real food. I've gone out of my way to give this place more chances time and time again and I would love to have a reliable Chinese restaurant in Nashville, but I'm left feeling like this is not it. Unfortunately, I don't know of any great alternative. Their friendly staff and my first experience are the only thing salvaging a two star rating."], ["Alyssa L.", "I recently got take out from here - pan fried dumplings and Mongolian chicken. As I've only tried it once, I'm hesitant to give too stellar a review, but the food was great. I'm not a connoisseur of Chinese by any means, but I found it all more than satisfactory. The service also really pleasant. I agree with earlier reviews that it's maybe a little overpriced, but it's a lot of food, easily enough to make two meals of my one order. I'll definitely eat here again."], ["Mark T.", "Had a horrible experience last time and said never again, but recently, it was late, we were tired, so on a whim we did takeout. Glad we did because the meal was MUCH improved. The egg drop (egg flower) soup was back to normal; temperature was just right, and tasty. The combination fried rice was solid, and the noodle dish my wife had was good. Overall a nice meal, and we'll definitely try it again."], ["Kaleena 'Kala' H.", "Sometimes it is hard to find a decent Chinese restaurant to go to. But after visiting Chinatown for my first time yesterday, I am hooked!My fiance and I were both craving Chinese food recently after I finished my shift at work, so we decided to visit Chinatown and have an early lunch. The staff was very friendly and welcoming, and I loved the environment of the restaurant. Our waitress took our order (I ordered Chicken Fried Rice and an order of dumplings, and he ordered Sweet and Sour Chicken and an order of crab rangoons) and even brought us wonton soup and an egg roll on the house! Wonton soup is one of my favorite soups and it was delicious, and so was the egg roll.Our food was brought to us very quickly. I had never tried crab rangoons before, so I was definitely excited to try them. Both the rangoons and the dumplings were delicious! The chicken fried rice was amazing...I almost couldn't finish my plate because the portions were so big. My fiance's sweet and sour chicken looked quite appetizing, and it was nice to see that they put the sauce on the side instead of slathering it all over the chicken like I see in typical Chinese restaurants.All in all, I had a great experience and hope to visit again soon!"], ["Sam L.", "#1 or #2 for most authentic Chinese food in Nashville. Complementary soup was large portion when we did family style for 6 people. Sautéed sweet tea leaves and bok choi was tasty and delicious. Pork belly was a great cut of meat and the fat was buttery smooth. The chitlins with tofu could have used a little more spiciness but overall was well done. Bubble tea is also available and good.The roast duck should be avoided; overcooked and dry. Also more bone than meat/fat combination.Overall, the food is excellent for the reasonable prices. I hope they keep it up."], ["Tennessee P.", "Called in a take out order for sesame chicken, fried rice and an egg roll. Food was ready in less than 10 minutes, and the lady at the front & phone was very courteous and friendly. The fried rice was garbage. The pieces of chicken were really small and hard. Little to no sauce. Finally, the egg roll was like the size of a stick of gum! Now, I could easily deal with all of this for a cheapo price like $4.99 plus tax or something, but this meal was $10 and change! Ridiculous. I will not be back."], ["Madeline M.", "I have been to China, so I know how authentic Chinese food tastes like. So far this is the only place in Nashville that I know serves real Chinese food."], ["John S.", "For a Chinese restaurant in Nashville, this is as good and authentic as it gets and would deserve 5 stars. However, since I am Chinese, and having been to real chinatowns in bigger cities (heck, even Memphis has quite a few authentic places), I can only give it 4 stars.Now for the food review, the food is actually really good and authentic. A while back I even got a special Chinese menu, but last time I went I asked for the special menu and didn't get it (although they seem to have combined menus)... I haven't tried any \"Americanized\" Chinese dishes here, but all the dishes I've ordered have been spot on and delicious. Even my parents were impressed when they came to visit.Some good chinese dishes:Dou MiaoMei Cai Kou RouHui Guo Rouany kind of \"Bao\""], ["Alyssa B.", "This restaurant was recommended by so many friends as the BEST Chinese around town, so I decided to give it a try after 3 years of living in Green Hills. I was pretty disappointed. I ordered Chicken Fried Rice and it was not great what so ever... We also had Mongolian Beef and that was much, much better! I would give it another try and would NOT order chicken fried rice!"], ["Kerry L.", "Just so so Chines food. Went there several times and decided not to be there any more.They charge rice and hot tea at very high price, unbelievable !"], ["S F.", "Felt like we were herded in and out like cattle. No thanks."], ["Queena W.", "Is very good place   。Best chinese restauran in Nashville  。Comback soon 。lobster is very good."]]}