{"Fattoush Cafe": [], "Kouzina Cafe Gyros and Subs": [["Julie S.", "I know you pass this wonderful place every day going to and from work, and still... you haven't stopped. Do not miss out out!! KOUZINA is a must. It's so good I crave it.You'll always get..1. Smiles and friendly service.2. Your order is prepared quickly. It's fresh!3. The food is delicious and not greasy.3. It's yummy and inexpensive."], ["Tara S.", "Aww man this place is really good. Ordered a classic gyro sandwich with fries. It was made fresh and was out in a jiffy. I even ordered extra tzatziki sauce and it was quite tasty. The people working that day were extremely friendly. Inside was very clean. Dirty tables while people are standing around is a huge pet peeve of mine but that was definitely not the case here. I would definitely recommend this place for fantastic Greek food."], ["Amanda C.", "Wonderful food. The staff are the best and super friendly. The prices are great and food portions are large"], ["Alex P.", "mmm... the beef/chicken Gyro was delicious!!! And it was like 5 bucks!  Can it get any better?  Oh yeah, the owners are really nice, plenty of parking and long business hours."], ["Tran T.", "They probably serve the best gyros in Nashville area!I passed by this place on the way home from the gym. I was starving at the time and having a gyros salad seemed like an excellent decision. It was around 5pm and the place was completely empty. I guess most people do take-outs. I ordered a gyros salad and some falafels (never had these before). The owner was kind enough and gave the falafels to me free of charge. I liked the Gyros salad a lot! The meat was flavorful and the ranch dressing was   delicious! The falafels, however, didn't meet my expectation. I felt like I was eating a chunk of MSG haha. I'll just stick with Gyros next time :)2013/#90"], ["Cee J.", "This place has delicious food! And the guys are quick to make the food too. Theres lots of room inside and its clean!"], ["Natalie J.", "Not sure if I went in on an off day of what, but the staff did not have it together. They messed up our orders multiple times, have an odd system of just shouting for people when they want them to complete their orders, and lack general communication skills among employees and customers. With there being so many greek/gyros places close by, I will not go here again. Hope they get it together, seems like having 8 customers at one time overwhelmed and frazzled everyone.Also, the food was alright, nothing better than what I could have gotten from another Greek restaurant, portions were good and I had some to take home."], ["Adam F.", "I occasionally come here for a quick and delicious bite to eat. Always friendly and they always have fantastic food."], ["erin s.", "Clean, fresh, delicious, friendly, well priced, hearty portion sized amazingness!!!  For $17 we got dinner for two that was absolutely fantastic.  Go.  Go now!!"], ["Bryan B.", "For a classic mall style gyro place, this is where its at. I tried this place out and both the gyros and chicken breast wraps are great!!."], ["Terry W.", "The owner actually sent a personal message  apologizing for the service and offered a free meal.  That is a man who cares about his business and building his customer base.  Doesn't happen often these days!  Thank you, sir!"], ["Kevin P.", "I crave Kuzina lamb gyro wraps weekly. Never disappointed. Always great food and even better service."], ["Rich W.", "We come here about three times a month. The staff is super friendly and the food is fresh and delicious. The mix platter is a huge portion and a great value. So glad we found this place."], ["Jessica S.", "Great service, great food!  The food is very good, well prepared & fast. Very nice people who work there. Highly recommend this place."], ["Eric S.", "This place is great! Tried it for the first time and was very impressed. First of all, the staff are extremely friendly and accommodating, which is almost always a good sign. I had the shawerma (a marinated chicken dish), which was very tender and flavorful. Also tried the hummus, which came with fried pita bread that was unlike anything I'd ever had. Because it was Sunday, we also received free baklava with the purchase of two meals, and it too was outstanding. Overall, a very good experience, and will be coming back very soon!"], ["Patrick S.", "Great food, great service. Everything taste awesome here. The place is clean and prices are very reasonable.  I love there philly cheese style gyro and there falafel is tasty too."], ["Brandon B.", "A hidden gem that I hope more of Nashville discovers soon! I randomly tried this place while visiting a friend in the area, and have literally been back 1-2x per week since then. Friends that I've introduced to Kouzina have ALL become regular customers. Incredibly fresh, delicious food; great prices; amazing service. The best quality food for the money that I've found in Nashville, by far. I gladly drive a few extra minutes for the gyros here. The staff is beyond friendly and gracious - they are as much a reason to visit as the food. My personal recommendation: mix sandwich plate with tabouleh salad. For vegetarians, try the falafel. Literally the only \"con\" for this place is the decor, of which there is none. But seriously, who cares? Grab a seat in one of their booths and enjoy."], ["Katie S.", "Over all, I was very impressed. Good food, great service, and as is normal at Greek restaurants, huge portions!!  Like I mentioned, the tzatsiki sauce is better than most I've had in nashville ...but man, do I miss tzatsiki sauce like I had when we lived in Chicago!!"], ["Tara D.", "I went here for a late lunch on a Monday and was a little worried because there was no one else there.  However I was pleasantely surprised by the service and the food alike.  The staff is VERY friendly and accomodating and visibly eager to please their customer.  I ordered the falafel plate and hummus to go.  The food is super FRESH and everything I had was very good.  The restaurant is also super clean and spacious.  I would definitely recommend it and spread the word to help local businesses!  Maybe if their business picks up, they can expand the menu a bit.  Go check it out!"], ["Frederick W.", "Amazing service.  Great quality food.  Best of the \"fast food\" Greek restaurants in Nashville."], ["Kathryn G.", "Update: This is our weekly to-go spot.   Please stop in,  it looks like there's not a lot of customers at first glance due to the darker windows, but don't let that deceive you as whenever we are there they have a revolving door of patrons and have many orders are to go orders --we often have ours to-go after work as we know it isn't a long wait, but much better food than any drive-throughs!  And, there is plenty of seating to accommodate those who want to eat in!   There isn't a large menu, but large enough to give the whole family something to choose from and the food is fresh and priced right,  the owners and employees are absolutely delightful and make you want to support them by coming again and again!  Bring the family - there is something here for everyone!  They have done a great job creating better ambiance and an inviting, family appeal!  These are owners that truly care what their community and customers think! Stop in, the food is fresh, quick and as delightful as the owners!"], ["Jason H.", "Staff was nice and the food was good! My wife had the chicken pita and I had the gyro and we will be back!"], ["Timothy L.", "The gyro plate was huge, the wife and I should've split it, but it was very good.  Stay away from the grape leaves tho, pungent smell and didn't taste good.  The consistency was that of canned grape leaves that were opened and put out.  But the gyro's are very good and the staff was polite."]], "Chicago Style Gyros": [["Patrick R.", "I am a Greek food junkie, and this little place is pretty satisfactory as far as a good local place to get hummus and falafel goes.  I'm relatively certain Chicago Style used to be a Captain D's or a Long John Silver's (hence the pirate-style sabers on the doors), but the authenticity remains.Chicago Style Gyros certainly isn't the classiest of joints, but the dining area is comfy and the staff is friendly and hilarious.  It's cheap, and the combos are delicious.  Frequent customers seem to get preferential treatment, so if you go enough you're likely to get exceptionally hearty portions and other freebies.  The carryout containers seem to hold larger portions, and you're certainly not missing any ambiance by hitting the drive through, so I recommend doing so.Somewhat ironically, the gyros are actually one of their poorest items.  I don't typically mind them messy, but they tend to be pretty weakly constructed.  The boys don't skimp on the sauce, however, and the falafel and combo plate are up to par.  They're open relatively late (10:00 PM I believe, but I'll check on that), so I'd recommend Chicago Style Gyros as a good joint to swing by and pick up a late dinner.  And be on the lookout for the Red Greek--that guy is awesome."], ["Laurie S.", "I LOVE Greek food (almost as much as I love Indian food) and Chicago Style makes me love it even more!  We have never eaten inside, I usually just grab food through the drive-thru and they have never failed to serve me some amazing gyros!  At first I would get the gyro combo but now I mainly go for the plate because I get rice and a small salad and it's 2 meals worth in one box.  The guys that work there are so nice and even my 3 year old asks for the chicken rice and pitas.  Now, if only I could remember how to pronounce 'gyro'."], ["Megan M.", "Things I like about this place:  Drive thru Greek food-how can you complain about that?  Convenient location.  Good variety, prices, and portions.  I seriously ate the rice from my last combo here for three days, there was so much of it.  Their gyros are good and filling.  Other stuff I've had here hits the spot but tastes just average in my opinion.  I LOVE hummus and theirs just doesn't do it for me and their tahini sauce has an odd almost mayo-ish flavor.  I think I need to try more of their menu based on the many great reviews this place has had."], ["Brant C.", "Oh hello there, Nashville. You are my new friend and my new home. We must get to know one another better. On my first evening in Music City, my new roommates suggested we hit up their favorite greek joint, a tradition of sorts whenever they have Nashville newbies in town. I've enjoyed the food of the Greeks in many cities across this great country. I've got Mediterranean fare in my blood. Suffice to say, I was intrigued. I'm happy to say, I was not disappointed.This isn't a place you're going to 'wow' a first date (so, don't), but it could become a favorite place to grab a bite or carry out after the tenth. Honestly, if she still likes you by then, you're probably past the point where choosing a bad restaurant could cause catastrophic failure anyways. It does indeed look like it used to be a fast food joint, both inside and out. That's ok, most of my favorite restaurants rely on their food, not the glitz and glamour of the building. (After all, it's what's on the inside that counts, right?)I opted for the Gyro Salad. Im not a \"salad guy\" per se, however I had just been on the road for the past couple weeks stuffing my gut with every processed meat, cheese, and saturated fat various southeastern drive-through towns could offer up, so I wanted something a little lighter. The servings were substantial with several strips of seasoned lamb laid out across a leafy salad bed alongside their significant other, the requiste gyro flat bread. Tzatziki sauce worked its way into every bite, tying together the tasty, inexpensive experience. Good food and new friends in a new place always make for a memorable occasion. The people working the joint recognized my roommate, even making an effort to say hello and goodbye. Familiar faces get familiar smiles and that's a bonus worthy of my fourth star. I'll be back to give the falafel a go. It's close proximity to my 'hood all but ensures I'll add my face to the list of familiar regulars."], ["Dana F.", "Easily the best chicken plate I've ever had at a gyro place, and believe me I've done my research. Fresh, flavorful and every part of the dish was great, not just the chicken. Even the salad was tasty. Definitely a place to seek out amongst all the myriad of choices on Gallatin Road."], ["Greg S.", "I love this place.  There are 4 locations that I know of.  But this one is the best out of the 3 I've eaten at.  I love it because they load the pocket up!!!  instead of a taco style.  Its a giant pocket gyro!!  Excellent staff at this spot.  Gyros are great, falafel is excellent!!  love everything ive ever eaten here!! I will be back for more!!  Plus if your on the go.  They do have a drive thru! Prices are great!"], ["Anna A.", "This is my go to place for Greek. I can't say that it is the best I have had but for convenience and consistency, it rocks my world basically. For one thing, they have a drive through (must be an hold over from Long john silvers) which makes my lazy ass happy. In addition, the portions are plentiful, the prices great and it the food actually taste pretty darn good. I always mean to get a gyro but I end up with one of the combo plates. They like the one with the gyro meat which comes with a salad, yellow rice, and fresh pita."], ["Josh F.", "Always consistently good food, sometimes too much food :) out of the three I've been to, this one is by far the best. There is another on Dickerson rd, , and I will not go back to that one."], ["Dante' T.", "I LOVE this place! This is my go-to whenever I am in a hurry and do not have time to cook. I pull up to the drive-thru window and they confirm my usual order (2 Gyros plates with sauce on the side) without my prompt. I guess that I am busy and in a hurry more often than I realized... :-) If you are in a mood for inexpensive, yummy Greek food, you should give them a try."], ["Nash B.", "one of the main dudes who works at this particular location is just not nice.  the food is fine.  but he needs to improve his attitude.  (kurdish & not nice...usually that doesn't go together.  kurds are unusually friendly)"], ["B C.", "This place was...decent!  Good!  We were pleasantly surprised when our friends turned us onto this place as it looks kind of divey from the outside but the food inside was really good!  Everything we ordered - lamb gyro plate, tabbouleh, falafel sandwich and gyro sandwich - was good.  We would definitely go back again, which is not to be said of most of the restaurants in Nashville.  Sorrrrry!"], ["Peter M.", "You probably won't confuse this place with an actual Chicago gyro place, but it is still pretty tastey.  Gyro plates are a good deal and come with salad; generous, flavorful strips of lamb; bread; and yellow rice.  You can ask for extra cucumber sauce and they will not charge you or call you a fatty.  Also good are their stuffed grape leaves and hummus.  Don't be afraid of the Gallatin location; its a favorite dining spot for cops, so no one will mess with you here.  Staff are friendly and actually Greek (I think)."]], "Taziki's Mediterranean Cafe": [["Justin J.", "Food was great! Very quick service! Great place for a quick and tasty lunch! I had the lamb gyro which was very good and we had the hummus platter also very good. Small outdoor seating area was a bonus."], ["jesse b.", "The only reason I'm giving this place a single star is because of the service. Food was great. My wife ordered a veggie gyro with no sauce or sides and I ordered a chicken gyro. We also ordered the hummus appetizer. The nonsense started when my wife saw there was pesto on her gyro and she requested no sides. The young lady that brought it out to us was new and very nice about the order and tried to explain that sides came with it. Fine. No problem. Then another young lady walks up with a very nasty attitude and appeared to be frustrated that we asked for no sauce or sides for my wife's order. After we acquiesced and said no big deal, the one with the attitude snatched the number from our table and walked off muttering something. I was obviously pissed but decided that it wasn't worth it. I took my wife's order back up and the manager redid the order with no problem. Then she brought it back out to us and really made it worth staying to finish our meal. I didn't mention the experience with the employee with the attitude. I'll let Yelp do the talking for me. The food here is actually great. My wife and I try eating healthy so this place fits the bill. But after this experience I won't be going back. We visit Nashville a couple of times a year but I refuse to patronize an establishment that has rude workers. I think some of the grace and kindness that the manager showed to us should be passed down to the employees. If you can't handle dealing with customers then don't apply for a job where you deal with customers!I added a tip as I paid prior to getting our meal. It's on their checkout screen. Maybe that should have been an indication of what was in store."], ["Heather R.", "If McDonald's did it like this, I might be a chain restaurant fan. I was a little reluctant the first time I encountered a Taziki's. Chain Mediterranean food? My only prior experience was with the horrible chain Greek place in the Chicago airport where I immediate food poisoning.Anyway, back to the relevant facts. Taziki's is DELICIOUS. Fresh, relatively healthy, well-priced, and with plenty of gluten-free options. Back in my younger, care-free gluten-eating days, I was a giant fan of the chicken gyro; now that I am older and digestively weaker, I tend to lean towards their grilled chicken, which is always well-seasoned and tender. I am also a huge fan of their rice, which is slightly, but not overly, lemon-seasoned. It's not traditional, incredible Greek food, but it is a fast and cheap way to get fresh and nutritionally sound food. There is a patio, there is fast service, and there is baklava; what more could a person want?"], ["Carly B.", "Healthy, fresh and filling Mediterranean food at a great price. So very rare for a fast food joint! My favorite is the pesto chicken gyro with a scoop of hummus (they'll add this for free if you ask!) and a side of fruit. All gyros come with ruffle-like potato chips and a side. They have an awesome patio to soak up the sunshine or you can get your food to go and hang out at Centennial Park across the street. It's the perfect summer spot."], ["Carli M.", "Food is good, healthy. I'm not a fan of their aggressive tip technique. When you pay they spin their screen around to give you the \"opportunity\" to auto-tip them 15%  20% or 25%. This is before you've experienced their food or their service. (Which is limited to running food). I'd give the food 4 stars but that pushiness made me lose my appetite for Taziki's."], ["Brandon H.", "I have been wanting to try a Tazikis for a while. It was amazing and I have been missing out! Delicious food is an understatement. I ordered the grilled veggie gyro and pasta salad. I highly suggest you give one or both of those a try!"], ["Cheryl W.", "I was really excited to see a Mediterranean restaurant. However I just can't give it above three stars due to a few things. I did a take-out order and called my order in. The girl on the phone told me how wonderful the chocolate cake was so I thought \"why not.\" I also ordered the chicken, rice and salad dish with a side of roasted potatoes and hummus as an appetizer. The rice was a little overcooked slightly dry, The potatoes were perfect. The salad was delicious. Unfortunately the chicken was inedible! I must've just got a bad piece but it was full of fat and gristle. Out of six slices of chicken I probably had two I could actually eat. I was very disappointed. Oh and the chocolate cake that I was told is so good - it wasn't in the bag, and I was charged for it. I would go here again but I would check my order before I leave and possibly not order any meat."], ["Emily C.", "Order the grilled lamb gyro, and their roasted potatoes/rice as the side. You can't go wrong. With the chicken, a lot of it tends to be overcooked although I don't mind their chicken salad. Their side of soup is great - zesty and lemony.I enjoy their food - can always get a nice meal for $12-13 and it's very healthy."], ["Carl P.", "Very good food and plenty of it. The bathroom is clean and hot water is sink which means to me it is sanitary. Value is very high, lamb is the best I have had in years!"], ["Kathy P.", "Awesome food. Great for quick lunch"], ["April E.", "Great food and attentive service!We were a tad bit tentative given some reviews but it just goes to show, some times you have to try it out for yourself. We had vegetarian gyro wrap and pork tenderloin sandwich. Sat in the patio. The servers were so attentive and our sodas were refilled several times. Food was very good and we will be coming back."], ["Jane R.", "The Caesar salad is terrific and the lemon-flavored rice is the best I've ever had. Apopular place with great food."], ["Sheena T.", "Maybe I'm used to my hole in the wall Greek food, but I thought Taziki's was nothing special after my trip this weekend.I stopped in with my BF and it was pretty empty on a Saturday afternoon, but has a very nice atmosphere. The restaurant is clean and open with lots of space. I also noticed right away that they offer wine and beer and they have a nice outdoor seating area. We ordered the grilled lamb gyro and chicken salad with 2 waters, and it was around $18.00. Maybe I was thrown off by expecting the food and prices of my run of the mill Greek places, but I thought it was a bit steep for what we received. The chicken was bland and the lamb was not shaved in strips like most Greek places. The lamb was just OK and I liked the dill sauce but overall it was lacking. I had the tomato cucumber salad on the side that was my favorite part of the meal because it was seasoned well. I also had potato chips on the side, which I found odd. I would have ordered something else if I had known. Overall, I've had better and will go somewhere less glamorous for my Greek food because I feel that you pay for the interior rather than a good meal."], ["Janet Y.", "I think the food here is excellent! I usually get the Steak Tenderloins Feast Plate. I could eat it everyday if I could.  It's not super fancy, but it's perfect for the low-key, after yoga workout, healthy food option! I find that the serving sizes are a little small. I'm a really big eater, so sometimes I don't feel full-- satisfied but not stuffed, which isn't necessarily a bad thing. I literally lick my plate clean every time. It's just that good!My only other complaint is that parking at this location is a total pain. There's a lot right behind the restaurant that I believe is shared with Which Wich. In all the times I've been here, I have been able to park in that lot maybe twice."], ["Rachel M.", "I know some of you will think this rating is ridiculous, especially once you read that I have only eaten two items on the menu and I think the service is spotty at best. I read the talk threads. I don't care. This is one of my favorite places to eat in Nashville. I loooooooooooove the Grilled Lamb Gyro. Yes, that's 12 of the letter 'o.' I love it. I crave it on a regular basis. I am so, so sad that I now live 30 miles from Nashville in a dark place where Taziki's doesn't exist. Don't think I won't drive 30 miles for it, though. The grilled lamb gyro with a side of the tomato-cucumber salad and a sweet tea is the perfect meal for almost every occasion."], ["Jordon M.", "I had the turkey chiabatta sandwich with a side of fruit .thus was hands down one of the best sandwiches I've ever had. The service was great I highly recommend it!"], ["Nina P.", "I went for lunch today and ordered the Greek salad with chicken to go.  I was sort of disaappointed when I got back to work and saw the portion size.  For $ 10.91, I felt that the salad should have been larger.  It was a good salad, nothing to write home about.  If I go again I will probably eat in and order a different item.  I did feel that it was healthy."], ["Marci R.", "I had a really delicious Mediterranean salad with grilled salmon. Very fresh and tasty. My order was not ready when I arrived and I ended up leaving and coming back. They compensated me with a free dinner. That kind of service is so appreciated and doesn't happen often enough. I will be going back soon!"], ["Janice A.", "Half-price wine on Wednesdays. Fish taco special on Thursday. Liked the Taziki Greek salad, too."], ["Andy H.", "The best fast food lamb I have ever eaten. I am constantly amazed by Franklin. While Cool Springs is often over run by \"QSRs\" there are several local chains that have excellent fast food. Today on a vendor lunch I have found another one. Tzaziki's offers fast greek food, which is not so out of the ordinary anymore, what makes this place stand apart is the quality of their lamb. As many of my family members will tell you there is nothing more satisfying than good greek lamb.I look forward to trying the other dishes on their menu, and the additional table side service at lunch is a nice touch."], ["Mk Z.", "I love the fresh food and flavor of this place.  Nice, interesting concept.  Lots of vegetarian and gluten free options!  Parking is a challenge, but the food and service are worth the walk!"], ["Virginia S.", "I have to disagree with any of the negative posts listed. I loved this place and was wanting go back as soon as I left. I had the Grilled Chicken Pesto wrap and it was perfect, I ordered a side of hummus for an extra $2 maybe and it too was excellent. The chips felt homemade and were extra crispy, perfect for scooping sauces or dips. I thought the restaurant itself was very clean and especially nice for a quick sit down type of place. The staff was attentive and very helpful and our food came out much quicker than I expected. I will certainly go back and have recommended it to several friends since my first visit."]], "Nashville's Best Chicken & Gyros": [], "Santorini Greek Restaurant": [["Adam N.", "One of my favorite places to eat in Nashville!  I stopped by this restaurant when looking for a good meal downtown.  I ordered an appetizer sampler and a gyro platter.  Everything was fresh, flavorful and delicious.  You can really tell the owners take pride in the restaurant.  After I finished my meal, I decided to try the baklava.  The owner gave it to me for free which was so nice!  The prices are very reasonable too.  Give it a try, you will be glad you did!"], ["Scott T.", "Gyro combo meal. $5.99. Comes with fries and a drink. That's tough to beat...This is the place that was on 4th for many years. They moved due to construction on a new hotel. Same food. Same people. Very similar decor on the inside. It's still the best lunch value downtown."], ["Chris P.", "Fantastic gyro. Combo meal with fries and drink is super cheap. Great option in downtown"], ["Amy S.", "Generous portions on the gyro.  Great taste and very fast service.  We were there on the 4th of July right after the firework/free concert let out.  They were one of the only places open (beyond closing time), crowded and still had fast service."], ["Sandra C.", "Great food had the gyro fajita salad and hummus with olives and pita Yummy!!!!!! The restaurant not fancy order and sit kinda place but food was so good"]], "Mediterranean Cuisine": [["Jason N.", "Great food and at lightening fast speed!  I had the falafel platter and my wife had the veggie platter, we had a small side of baba ganough.  We had barely sat down and the baba ganough was delivered!  Very delicious and creamy!  Both of our meals we delicious!  And we had food left over. Great little restaurant in a sweet little setting."], ["Jonny W.", "Best Mediterranean food in Nashville! Fresh produce, kind staff, clean, nice view. Their salads are great and the gyro is on fleek!"], ["Gary M.", "Basically, this restaurant is another miss for my quest to get good, affordable gyros and felafel. Mediterranean Cuisine sits in a small strip mall in northwest Brentwood. It has counter service and the atmosphere is pretty quiet, clean and ordered. The menu is more on the Greek end of the Mediterranean-Middle East spectrum. Service was fast and here is the bottom line.Gyro: Reasonable pita bread, meat with some fresh vegetables. They include some grilled peppers and onions along with olives. Nothing special.Hummus: Good consistency but not very flavorful. Very heavily salted and lemoned.Felafel: Main disappointment. These were obviously cooked well ahead of time and reheated. As a result, they were dry and tough.I cannot recommend this restaurant, even for a quick lunch bite, given the limited items we tried."], ["Cindy R.", "Best food ever! My husband and I love this place. The owners are always there. Not a long wait. Good price for a lot of food."], ["Jeff C.", "I met two colleagues here for lunch on a Wednesday at noon.  It wasn't busy at first, but before long there was a long line, and I know why.The first thing I noticed was the young guy delivering food and busing tables.  He had a genuine smile on his face every time I saw him.  When he delivered our food, he saw that we had prayed together and said, \"God Bless you\".  After lunch, I wanted a coffee and didn't want to stand in line behind 10 people, so I slipped him a few bucks and he happily brought a cup around.  Imagine that at most pre-order style places.Enough about the service.  The food was awesome.  I consider myself a connoisseur on food in general and Mediterranean in particular.  The humus was fantastic-and I am someone who has seen it made from scratch and eaten it fresh.  The pita bread was great.  The shawarma I had was fabulous, and my two companions consumed their chicken gyro platters so quickly I can only assume they were equally as pleased.  The portion sizes are adequate for most gluttons, and the tables are set with flatware, napkins and menus, so you can grab a seat and figure out your order before getting in line.  Three of us ordered platters, drinks and had a large plate of hummus for $37, so it's a good value.  If I had known beforehand my colleague was paying, I might have eaten even more.  Give this place a try."], ["Salman S.", "It is very rare to find a place that has maintained its standard in the quality department. Have been here a number of times and it just always tastes the same, like it did the first time.You cannot go wrong with any of their platters or just go for it all and get a mixed platter. The gyro is great and mouth watering. Prices are reasonable and the food hits the spot.The staff is courteous and will go the extra mile to make sure the food is to ur liking."], ["Laura H.", "Mediterranean Cuisine always serves delicious, fresh Mediterranean food. Recognized by dieticians and nutrition experts as the most healthy and balanced diet, it is nice to have a place offering a variety of wonderful, healthy options in Maryland Farms. I love their platters that come with lamb (or your choice of meat), the BEST rice and fresh Greek salad. On this particular visit, I had the Greek entree-sized salad along with baba ganough and pita. The Greek salad consists of lettuce, diced cucumbers, tomatoes, feta cheese, olives and sliced banana peppers with a Greek vinaigrette dressing. While I liked the baba ganough (first time trying it here), I will likely stick to their hummus in the future. Mediterranean Cuisine is wonderful for catering business lunches in the Brentwood area. Last fall, I had a team meeting and used them. I have a couple people on my team from the Mediterranean region, and they thought the food was authentic and delicious. They are also very reasonably priced, with lunches ranging from $5-$9 a person and offer plenty of vegetarian options. So forget that bland, boxed sandwich lunch for your meeting and go for variety! They are typically very busy during lunch, but don't leave if you see a long line waiting to order. The line moves very quickly, and there is usually plenty of seating inside and outside with tables turning over frequently.Also, for my order this week, I used the Eat24 Yelp app for the first time. I dug it! Very easy to place my order and pay for it, knowing I had a tight timeline between meetings and needed to be able to just run over and pick up my order without spending time in line. I'll be using this app more in the future!"], ["Leah L.", "That food was so damn good that it's not even right. I got the Mad Special Platter. It was beyond delicious. Maybe I was just hungry, not sure..but I thoroughly enjoyed my food. And I had enough to split in half and save the rest for lunch tomorrow."], ["R Z.", "These guys are the best.  I usually come in during off-hours (after lunch, before dinner) and my order is handled quickly and professionally every time.  We love coming to this place because this is the best Mediterranean Food in the Southeast.  We have tried a ton of places and everything else pales in comparison.  Keep up the good work!  It's delicious!"], ["Shaun B.", "Visited this place for lunch today, I've worked in the area for two years and have somehow never noticed it. Its a little joint in a strip mall of various restaurants and such. You walk in and order at the counter, we were able to walk right up and place our order. I ordered the Gyro platter, it came out promptly, including Lamb, rice, Tabbouleh, Hummus and pita bread. The Tabbouleh was very good, definitely the highlight of the meal. The hummus was pretty good as well, I've definitely had better but as a compliment to a meal I can't complain. The gyro meat itself was pretty uninspiring, it was good, but it kind of had the feel that it had been sitting in a warmer for a little while. The rice was your typical Gyro restaurant rice, nothing more nothing less. The Tzatziki was good, they kind of spice it up a little here, and I always like my gyro's drowning in it.Overall, I was pleased with the meal, the service was great, the employees were smiling, and the restaurant was clean. The food wasn't anything mind blowing, but definitely good enough for a return trip next time I'm in the mood for some Mediterranean fare. Although I'd hope to find a better option in the area, I've tried several places in Brentwood, but they're all about the same as far as quality and price.I would suggest giving it a shot if you're looking for a place like this in the area."], ["Kris T.", "Food was good. Fast service great hummus. Didn't get a five star because sauce for gyro platter and environment were not to the best level."], ["Dan A.", "Yum!Some of the best Mediterranean food we have had in a good while.  The gyro platter & lamb kabobs were killer and the falafel & grape leaves as appetizers were spot on. The place was clean and the food was fast & fresh.As we were looking at the menu,  another customer commented that it's all good and you can't go wrong with anything...from what we have tried this tine, it looks like he was right."], ["Danny N.", "I was looking for a Mediterranean place for lunch in the Brentwood area and looked for a good online recommendation.  We got there at 11:15 right before the lunch crowd.  It did get crowded which helps to ensure good food for a place with an average outside appearance.  I got the combo plate.  The chicken was better than most competitors. The portion was perfect as it was big but not too big."], ["Adam V.", "Good spot for Mediterranean food!  The food is excellent and there is plenty of it.My wife and I tried this spot because of a recommendation I received from a client.  He is from Jordan and said that it's his favorite restaurant.  I told him about Blue Fig as well (my favorite Mediterranean spot).  We really enjoyed everything.  They have a small beer selection and plenty of items on the menu.  We had the Mediterranean platter.  It had lamb and chicken as well as hummus, baba ganoush, rice, and falafel.  After eating most of it, we were completely stuffed.  It's a dinner for two that is in the $15 range.The service was great and everyone was very friendly.  I'm not sure that I would have found the place if I had not been looking for it.  However, I'm glad that we made the trip from Franklin.Mediterranean Cuisine is a great spot in the Brentwood area if you want to have a gyro or some of the other delicious foods from that region.  They would also make an excellent lunch spot because they are super quick."], ["Lyrad V.", "My husband's client who is from Jordan recommended this place, so we decided to check it out. First off, I'd never known about it otherwise because it's tucked away on a back road in the Maryland Farms area. Since I don't work in this area I hadn't heard about it.My husband and I met up with another friend here on a Saturday before 6 p.m. and the place wasn't busy at all. Most everything in this business park area is calmer on the weekends.The food was excellent. I was excited to see baba ghanoush on the menu, since a lot of Greek restaurants in this area do not serve it. They also serve chicken shawarma which you don't see regularly on Greek menus aw well. My husband and I decided to split the mediterranean platter for $14.99, which was served on two plates and pretty much a sample of everything on the menu! And it all was delicious. The meats were succulent and tender and came out nice and hot. It was plenty of food for two people!The staff was friendly as well. We will definitely be coming back."], ["Sam H.", "Not very busy on a Thursday night at 7 but very good.  I had the gyro platter and a falafel appetizer.  Humus is excellent as is the lamb. Very large portions, too."], ["Rachael Anne E.", "My favorite Greek place! Lots of delicious food at a low cost. The Greek Platter for lunch is $8.99 (after tax) and it's plenty of lamb, rice, hummus, pita and salad. I get tabbouleh instead of the Greek Salad. They take AMEX."], ["Joann J.", "Excellent. Everything we are was excellent. Pastichio and lamb kabob platter. The baklava was amazing...order 2, they're small!"], ["Anna J.", "I love this place, best Mediterranean food in town! Portions are huge and flavorful.  I always ask for peppers and onions added to my entrees. The mixed platter is delicious, you get a little bit of everything.  Salads here are great also.  The service is quick. The place is clean and inviting.  You can go sit on their patio and watch or feed the geese (give them your leftover pita bread, they give you plenty!)."], ["Dan Z.", "Trusted my fellow Yelpers on this one!  The best baba ganough I've ever had!  I always try to order lamb, and again very good!  The size of everything was huge, too much to eat in one sitting and I'm a big boy!!!"], ["Will M.", "Located in the affluent suburb of Nashville, this well kept secret is the best greekfood in town.If it is your first time, try the gyro platter.  Sliced lamb was browned before service, placed on top of rice, alongside salad, pita bread and hummus.  It is healthy, and delicious.  The atmosphere is decent."], ["Marcus P.", "Don't let the downplayed appearance of this place fool you into not going; the food here speaks for itself. I work close by and have been coming here regularly.The food is always fresh, the prices are more than reasonable, and the portions are outstanding.Even during the busy periods, the staff here is always on the ball and efficient. The outdoor patio next to the pond is icing on the cake. When I am having a stressful day at the office, this is my happy place."], ["Justin R.", "Some of the best restaurants, are in places you would least likely expect them to be. Thats exactly how I would describe this Mediterranean style cafeteria. You walk in, order at the counter and when your food is ready, they bring it out to you. We arrived about 30 minutes before they were closing, and they were very welcoming, even with our late arrival. My girlfriend and I ordered a falafel platter and a gyro. The gyro was my preferred option, since the falafel was a little dry. I think the falafel would have been delicious if we had been served a fresh batch, and not the bottom of the barrel. Overall I was impressed with this find tucked away in a Brentwood business park."], ["Jasper T.", "Today I was looking for a great place to have lunch and came across some great reviews for Mediterranean Cuisine.  So, I thought lets give it a try.  It is in a very unusual spot and I thought how could this be a good place.  So, skeptical I went and and gave it a try.  I am sooooo glad that I did.  This was one of the best lunches I've had in a really long time.  I had the #5 lunch special which was a Gyro with hummus and a drink.  It was less than $10 for this goodness.  The lamb meat was perfectly cooked and the hummus was amazing!  And I'm kind of a Hummus snob.  I can't wait to go back here to have some more amazing Mediterranean food.  Oh, and the service was great.  The place was packed with people however, they still made me feel right at home and took very good care of me!  Love seeing great restaurants likes this!"], ["Allan P.", "This was my first time here, and this will become a regular spot for lunch from now on. The lamb was great and the other ingredients were fresh. The service was great too. I highly recommend this place."], ["Star T.", "So good, and the portions are not so dainty, you will be full when you leave. The owner is a great guy, and he cares about his food and making sure you're experience was a great one. Not to mention it's nice in the summer time sitting on the patio having lunch, then afterwards partaking in the Shisha! Good food and Shisha...Whaaaaaaaaaaat!"], ["Jemina B.", "OMG this place is fantastic. If you haven't tried it, Go. Now. I'll explain: the food is affordable, the portions are huge, and bottom line - it's all delicious. Met the lovely Kim Y. here for lunch the other day and had the falafel for an appetizer, which came with yummy pita and was served with hummus. I had the gyro platter, which I thought would be an average serving of a few strips of lamb with pita, rice, etc. Oh, no. it was a PLATTER. grilled onions, lamb, tomatoes, rice, tabouli salad, the whole 9 yards. I was in heaven.If you're lunching in the Brentwood area, skip all those lame-ass chain restaurants and get over to Mediterranean Cuisine toute de suite."], ["Benjamin D.", "Good, authentic restaurant that may not be instantly obvious. The hummus is great. Great gyros, large servings. You can really taste the freshness in everything."], ["John M.", "This is my go to spot for Greek food in Brentwood.  I typically get the same thing which is the gyro platter.  For the price, they give you a mammoth platter of food loaded with flavorful meat, rice, choice of salad (greek or tabouli), hummus and pita.  You can ask to get your hummus spicy, and they will also top your meat with a delicious sauce and griled onions and tomatoes.  Whether you decide to dine in (their patio is great during the spring time) or get it to go, Mediterranean Cuisine is a quality restaurant option in the Brentwood area."], ["Brad C.", "Take a few extra minutes and find this place. It is worth any detour from wherever else you may be headed! Step up to the counter and you will be greeted by a very friendly smiling face who will do what he can to assist you. Questions? Ask! Substitutions? Ask! Very accommodating. We ordered and found a place to sit, moments later the food arrived. We both got the mixed platter -- choice of any three meats plus Greek salad plus homemade hummus plus rice. Lots of good food, authentic Mediterranean (not just Greek) and reasonably priced. A diamond in the rough."], ["Jason B.", "some of the best mediterrean ive had. i got the gyro plate and it was top notch. you get so much. i think the prices are absolutely fair. grilled veggies over some type of rice. the gyro meat was perfect and you could tell it was also cooked properly and cooked correctly. (ive had tons of gyros in my life). salad and hummus on top of it. baklava was stellar. pita was stellar and didn't taste mass produced like most places. did try the pita chips but they looked home madethe service is just as good as the product. i went late on a weekday and they were VERY friendly and very accommodating.JEANS: OK by farORDER: counter"], ["Sanky S.", "The husband & I moved to TN about a year and a half ago from Dearborn, Michigan, which is practically the mecca for Middle Eastern folks. Hence it has great Arabic restaurants. We were spoiled and we have become pretty snobby about Arabic food. We had searched high and low for a good middle eastern/Mediterranean restaurant and were highly disappointed with the restaurants we had visited, which claimed to have Mediterranean/Middle Eastern food but really it's mostly Greek. We stumbled upon this place and rejoiced in finally finding our long-lost favorites. They offer a very large variety of the most well-known dishes of middle eastern cuisine. They are extremely delicious and very well priced!!! We had the chicken schwarma and the lamb pita wrap, as well as hummus & baba gnoush  , which were all delicious."], ["Angie A.", "Friendly Staff, nice patio.Food was lacking. I ordered a beef/rice and pita platter that was served with hummus and a small Greek salad. The beef was over cooked and dry. Ashamed because it did have good Mediterranean flavor.We also noticed the menu prices on the board are different than that in the menu. We pointed it out and staff member said it was a printing error."], ["Bret D.", "Exceeded my expectations.  It does not look like much from the outside.  I was expecting your typical Gyro/Kebab fast food atmosphere but this was much nicer.  The gyro was served on a rolled pita not a stuffed pocket ans was made only of lamb.  It was tasty but a little on the small side.  I think I prefer the gyro at Istanbul.  Not a bad deal for a combo at $9.00."], ["Priya A.", "Came back after 2 years and still loved their Falafel sandwiches.. The same friendly staff who will customize for you.. will add hot sauces and give you tahini on side if required :) Lentil soup is great for a chilly winter day.. not too spicy, warm, with thin noodles and served with crispy fried pita chip .."], ["Joy S.", "I'm giving this 3 stars because the hummus was good and my husband was fairly satisfied with his meal. Personally, I'm not a fan. The restaurant itself was not very clean, and the staff only acknowledged my husband. Very strange. If you're in the mood for a gyro, check out NY Deli in Brentwood. It's so much better!"], ["Matt D.", "Excellent lunch choice. If you have never been here or tried Mediterranean food, do yourself a favor and get a combo plate. My recommendation is the Mediterranean Combo...a little taste of everything and you won't be dissappointed."], ["Jeannie G.", "The thing I miss most about working in Maryland Farms is coming to Mediterranean Cuisine for lunch! I first started going there when they were in a strip mall on Franklin Rd. Since moving to the Ward Circle location, the atmosphere has greatly improved. I LOVE the gated patio that overlooks the pond. It's the most relaxing place to eat lunch. The food is amazing, too. I love the gyro platter and the greek salad is great, too."], ["John W.", "Great lunch spot go early to beat the rush."], ["Marti P.", "We walked in 10 minutes before closing, and got treated like royalty!  Welcoming, casual environment. Counter orders, but they delivered everything to our table.  Ice cold mugs of beer, fresh warm pita, great hummus and falafel. Can't wait to go back!"], ["Lisette F.", "Been here twice. Food is really good. Nice ambience and service."], ["Sharon K.", "This unassuming restaurant has really top notch Mediterranean food.  The name is pretty generic, but the food is full of flavor and variety. The restaurant is located in the business park on Maryland Way in Brentwood so it does a good deal of business over the lunch hour. They have a full menu and a long list of lunch specials.  The lunch specials include tasty dishes such as the veggie platter, which comes with very fresh tabouli salad, smooth creamy hummus, lightly fried falafel, and a large portion of lentil rice.  All of this is only six bucks.  It's refreshing to have such a flavorful vegetarian meal for so cheap.  They also serve lamb, chicken, and beef gyros or platters with tabouli and hummus. The restaurant has a nice outdoor patio that is right next to a huge pond with geese and ducks walking along the shore. So you can get a little nature show while you have a bite to eat.  Oh yeah, and they have a nice beer selection."], ["Becca G.", "I come here once a week for lunch since I work on Maryland Farms. I believe that this is the brother store of the Med Cuisine on 21st, but that's about where the comparison ends. The one on 21st...boring. This location, awesome!The owners are Egyptian (I think) and are super friendly. I always get the lamb gyro plate and sub tabouleh for the salad. I'm sure their salad is fine but damn that is some awesome tabouleh. The platter has hummus, warm pita, amazing rice pilaf, tons of gyro meat and roasted onions and tomatoes if you ask for them. The portions are hefty so I split with my bf...but I've polished off many a plate solo as well. I've tried their falafel which is ok (not as good as Kalamata's) and they have some really delicious looking salads for the veg heads. The chicken gyro is good too, but the lamb is where it's at.I like to sit outside and toss pita scraps to the geese that hang out by the pond next door (no worries you are separated by a fence). They also have beer and a tv inside, though every time I've been there it is some Egyptian Idol show or a soccer match. Great food, awesome portions, light on your wallet, and very friendly employees. If you work nearby you owe it to yourself to stop in for a bite!"], ["Shannon W.", "I have been on a search for good Greek food since I moved here a year ago.  I tried this place on a whim not realizing how close it was to me.  OMG - so fabulous.  The service was incredibly fast and friendly.  I ordered the lamb kabob and an order of spinach pie.  Not just a small wedge of pie but a square the size of my hand.  Hot and delicious.  The lamb was perfectly seasoned and cooked.  Served on a bed of yellow rice along with salad and hummus.  I must say, I am not a fan of hummus, but I ate all of it.  So wonderful.  This place might be a little off the beaten path but is completely worth it."], ["Phillip P.", "This is one of my favorite Mediterranean restaurants in Nashville. The prices are very reasonable and the food good.  I highly recommend this place."], ["Matt Y.", "Soooooo happy we found this place!! The first time my wife and I went here, we couldn't believe how good it was. Super friendly service and awesome food.  It is now on our regular rotation."], ["Keith M.", "Some of the best Mediterranean food I've had in a long time! About as authentic as well. I look forward to a return trip to Brentwood just so I can go back , it is that good! I have spent some time working in the eastern Med (Cyprus & Jordan), and really love the local cuisine. I've since been to a lot of Greek and Mediterranean restaurants in the States; many are good, but this place really is one that stands out. I can't wait to go back!"], ["Charles A.", "The hunt for the best falafels may have just ended with the falafel platter at Mediterranean Cuisine.  As a vegetarian, one of my favorite meals is a falafel platter, which usually includes rice, salad, hummus, and pita.  This platter was no different, but what this one did better than any dish that I have had was the grilled onions and tomatoes on top of the falafels and rice.  The falafels were good, not great, the best falafels in my mind goes to Sam's Kabob Gyros, which is just down the street.  But the entire combination of rice, grilled veggies, falafels, hummus, pita, and salad was top notch.The meal was excellent and it was $7.99, which to me is a great bargain.Aside from falafels, I normally judge a middle eastern style restaurant by their hummus and pita bread.  Their bread tasted more like greek pita bread, which is used for gyros.  It is not the right combination with a good hummus and does not compare to other restaurants, which are more like traditional pita bread.  (The best pita is from Tarboush in Murfreesboro.  It is homemade and still piping hot and filled with air from being fresh out of the oven.)"], ["R C.", "The best...great food...good prices...the nicest guys on the planet.  BTW, they are Egymptian Christians...support them...their home is going thru hell.  I eat there at least once a week."], ["Van H.", "We have been eating at Mediterranean Cuisine for about 9 years - we usually visit about 2 times per month.  We have found that it really is the best middle eastern food in the Nashville area.  The food is very reasonably priced - most items are under 10.00 and the most expensive item, a platter of food for two people is about 13.00.  The portions are very good sized for the cost.   And all the food is made in house, the stuffed grape leaves are awesome and the falafels are great as well.  The location is somewhat off the beaten path, they are located in Maryland Farms off of Ward Circle.  They have a nice outdoor seating area - weather permitting, and ample indoor seating.  The are open 7 days per week and the owner is very nice and will make sure everything is to your liking."], ["matt c.", "Great \"quick dining\" mediterranean food, of the Egyptian origin but attempts a pan-Med cuisine. Beautiful location hidden in Maryland farms, by a large pond. In the spring or fall it is recommended to sit on the patio. Indoors, many small tables await local regulars and businessmen. A television indoors regularly shows international soccer matches, or else, off season, news or entertaining Egyptian programming.The rice is flavorful and moist, with vermicelli (and lentils, on vegetarian platters). If you ask for everything on the veggie plate, they will put grilled onions and other good things on top. Fettoush is great and preferable to the other salad. Falafel are usually served with a little sauce on them. The lamb gyro is good. Cucumber sauce (tzatziki) is good. Pita on platters comes toasty (with a slight floury touch) and cut in quarters in a basket. You can get more if you ask. They are also very quick to fix any mistake in your order.Desserts include baklava and an intriguing tapioca."], ["Nathan J.", "Found this place through Yelp and it is a gem. I had the shawarma beef platter and my wife had the falafel. Both tasted fantastic and service was quick. I wish there was something like near where I live."], ["Paige B.", "I've been here a couple times so far, and plan on going back until I've tried basically everything on the menu. The staff is always so friendly, and I receive my to-go order pretty quickly even when it's at peak lunch hour and very busy. I've had the veggie platter as well as the grape leaves, both of which were tasty, but the veggie platter was my favorite. They have a great little patio by a pond and it's always packed - I would love to eat out there one afternoon when I have more time. Overall a great, clean, friendly place with delicious food , reasonable prices, and a nice ambience - I look forward to trying other items on the menu."], ["Tuan T.", "This place simply has great food. I come here often after church because it is close. The price is right and the service is friendly. The combos are pretty good..."], ["H W.", "This is our go to place for Friday night takeout.  Their tabouli is the best in town, easily.  Always tastes fresh, even when I order late on a Friday.  Their lamb gyro platter is fantastic and their Greek salad is very tasty.    We eat there at least 4 times a month and we love it."]], "King Solomon's Gyros": [["Con S.", "Gyros are gyros, but the service is top notch.  They are quick and attentive, and all sorts of friendly. The salads are great too."], ["Brad M.", "I really enjoy this place. It is a drive through only, so no seating. The mix gyro (chicken and lamb) is excellent as is the spicy chicken sandwich, which is actually chicken, wing sauce, jalapenos and ranch dressing on a pita. It's spicy, hot and delicious.  Fries and shakes are also good. It can be a little slow, because they don't prepare your food until you order it. But, it's definitely worth the wait."], ["Sean A.", "Really good Gyro.  I'm not sure what makes a Gyro good, but I would know a bad one if I had it and this wasn't bad at all.  It could have used more sauce, but that could probably be said about every Gyro ever. The fries were pretty good too.  I got their \"hot wings\" too.  The wings were super crispy... I would say cooked to perfection, but not hot (as in spicy) at all.  That said, I haven't found any other good wing places around so I've gotten in the habit of getting wings plain or without sauce, and adding my own sauce when I get home.  To that end, the well cooked wings here are great.The staff was super friendly.  One guy took my order and another brought the food out, and both of them said \"I appreciate your business.\"  While I was waiting, an old guy with gray hair and a mustache (King Solomon?) went out the back and got something from his car, and he stopped and waved to me.I'm not sure why it took me so long to eat there, but I'd needed to get beyond my usual staple of take-out joints: 5 Points Pizza, Calypso, Far East, etc.  I'm pretty sure I'll be back here soon.And for what it's worth, their health/code score is 96."], ["Luke K.", "I'm a loyal King Solomon's customer but had not previously had their gyro fries.  Mindblowing.  That's all I can really say.  If they weren't already five stars, the gyro fries get them there.  Brilliant, filling, delicious.  Good with the spicy fries or the regular although I recommend the spicy fries."], ["Nichole J.", "My favorite \"fast food\"in Nashville. For a little over $5 you can get a huge falafel sandwich, drink, and side of rice or seasoned fries. That's (well, usually) enough for 2 meals for me.Did I mention the service? After just 2 or 3 visits, the employees all recognize me, and sometimes they even throw in a few extra falafels. Delicious food for the same price you would pay at the Burger King next door, and you're also supporting a local business."], ["E W.", "Great little takeout place. Love the gyro fries!  People were very friendly. I admit, it's not a place I would've stopped at on my own. I read the reviews on Yelp and decided to give it a try. I'm glad I did!  Tasty food, large portions and a great value!  Try it, you'll be glad you did!"], ["Ann W.", "Great takeout. Your basic gyros with a very friendly and helpful guy at the window. He asked if I had been there before and if I'd been satisfied with my food. Made sure we had everything we needed. Spicy fries were good, too."], ["Geoff T.", "I heard about King Solomon when Nashville Scene awarded them the Best Gyro in Nashville. Naturally, I had to give them a shot.You would not randomly stumble across King Solomon. It's in a drive-thru/walk-up only building on Gallatin Road. Honestly, my personal restaurant bias would have normally kept me driving right on past a joint like this.However, the food was surprisingly good. It was also surprisingly inexpensive. For $5.99, I bought the combination platter that came with both gyro meat and chicken on a bed of yellow right with a tasty little salad mixed in. I chose the cucumber sauce, which they poured over the top of the meat in the perfect portion size. I even felt like what I ate was reasonably healthy as well, for fast food at least.I ate lunch at noon. It's not almost 6pm, and I am still full. Value, people.Normally when I buy this type of lunch, the lettuce is the stale out-of -a-bag variety, the meat is a little dry, and I feel like I have to douse everything in the tzaziki sauce to make it palatable. I was pleasantly surprised to find the meat fresh (and very tasty), while the salad was actual romaine lettuce glazed with a good vinaigrette-type dressing and fresh chopped parsley. There were slices of fresh onion, black olives and banana peppers thrown in as well. If they had only thrown in some feta, it would have been perfection.Don't be tempted to feel dubious about the neighborhood or the exterior of the building. The family staff was friendly, the food was good and the price was very aggressive. Not a bad lunch for a cheap guy like me..."], ["Sean H.", "I'm a little mad at myself for not trying this place sooner. I've liven in East Nashville for a year and a half and have driven passed her countless times and never stopped, ever with a recommendation from a friend. Well it's AMAZING! The best Gyro I've had in Nashville, super friendly staff, great food, this place is a must!"], ["Suq M.", "I love this place!  I go here with my partner so often the family (King, Queen, Princes and Princesses) know us!  I even got to say hi to one of the King's grandchildren a few weeks ago--an adorable little Greek baby.  The family the runs this place is super sweet, and so gracious. But about the food...I've heard its the best Greek in Nashville.  I can't say I'd disagree. For a drive-thru restaurant it's ALWAYS fresh, flavorful, and delicious. I personally like their salads. $6 gets you a huge, fresh salad covered in meat and cucumber sauce, with a warm, delicious pita on the side. Their spicy fries are crispy crunchy, their gyros are also delish. However, hands down, their baklava is to die for.  Definitely the best I've ever had. The best part is, it's cheap!  Scary cheap. Like, you can eat here for less than the neighboring Burger King, and not feel terrible about yourself afterward.  I usually call ahead since it's about a five minute drive from my house, and the food is ready when I get there.  King Soloman's is an awesome place for fast, delicious, cheap food, and you're supporting a lovely family!"], ["Chris S.", "Went there today and got a falafel sandwich combo, probably the best i've had in town.  Their falafel are lighter in color than any I've seen and seasoned well, very tasty.  I think mine had like 6 pieces in it, frickin huge, and they gave me tons of fries-the spicy kind similar to the ones at Fat Moe's.  The guy working was super nice too, so I'll definitely be back.  Recommended for sure."], ["Rachel S.", "I almost do not want to review this place for fear of Nashville's best kept drive up secret being let out, however as a foodie it is my duty to tell you about the amazing gyros this nice Iranian family serves. First off you pull up to a window or wait for a server to come to your car to order. AWESOME. Secondly the food is amazingly cheap. $3.99 for a good sized gyro or falafel. Thirdly these people could not be nicer. I had an incredibly interesting conversation with the owner's wife, an Iranian family, who is as interesting as the food is amazing.I've been to Israel and Jordan, let me tell you this is straight out of the Middle East. The gyro is the closest I have come to a one I had in Israel. Full of flavor and they do not skim on the meat or fillings. Fries are crispy and delicious. Falafel is not dry and spiced to perfection. I love this place and you should love it too. Stop by for a fast meal, when you are starving, or have the late night munchies."], ["Snug M.", "Great food and even better service! Workers always have a great attitude. Gyro fries and Gyro plate are amaze balls!"], ["Mike K.", "I \"moved on up\" to the east side months ago and was hesitant to check this place out based on the exterior. Bad choice! I don't know Solomon from Adam but he is definitely the local gyro king."], ["Jason K.", "I was passing through Nashville and decided to grab some greek. I went to King Solomon's for a Gyro and it was absolutely delicious! Great food, great service and I would totally go back there again! The only problem is there is only a small bit of outside seating for eating so if it is cold it might be better to get it to go."], ["Angie L.", "If you haven't tried this place, do it ... now.  It's amazing.  Family owned.  From scratch food and just the best ever.  And, the people are so, so nice.  Love."], ["Randa T.", "I found this place through Yelp and read good reviews. i got a yummy gyro combo and will definitely go back again.  The guys working there are brothers and seem dedicated to offer wonderful food & customer service.  This cute little drive through is a awesome... Also great prices!  The menu offers homemade baklava for even more temptation to stop by ;)"], ["Paul C.", "Best Gyros in Nashville.  Perfectly seasoned chicken and tastiest ingredients."], ["Hillary Y.", "After reading positive reviews on Yelp and Urbanspoon, we decided to give this little drive in delight a try. I ordered the chicken plate served with cucumber dressing and rice alongside a healthy portion of rice. The chicken was well seasoned and cooked, tender and flavorful. The salad was fresh and crisp, though I'd have preferred whole kalamata olives over the canned black olive slices. The pita bread was hot and fresh.  I'll request a bit more dressing on the salad next time, and I could barely manage to eat all of my rice, but overall a fair price for a hot Greek meal that satisfied my craving. Service was friendly and quick, too, another plus! I'll be back."], ["Janet S.", "For the love of god we stuffed our faces with food and drink today.  Yummy meat and super fresh salad and  a portion of fries, pablo can be downright hog like!.  Delish apart from the white saucy stuff on the meat, lets say hold the white and add the hot sauce.  Yum and by the way the server was hot hot and cool (marcia can I say that). Nice cheap eats in the hood, snaps again elle!  Greek ? methinks not."]], "Greek Cafe": [], "Sam's Kabab Gyro": [["Dave L.", "These guys are awesome! The food is great and they're super friendly all the time. Sometimes I go in there and get food even when I'm not hungry because the guys who work there are hilarious. They always greet you with a smile and a joke. The food is fresh, delicious and filling. Really fair prices too - you get a jam packed gyro with delicious lamb and fresh ingredients for $5. When a Big Mac is $4 and is a piece of shit how can you go wrong with Sam's gyros? I HIGHLY recommend this place if you're in town and you want some quick, fresh, delicious, protein packed food with a little bit of humor to brighten your day. Two thumbs for sure."], ["Ashby F.", "Very good and inexpensive. Priced similarly to the fast food joints around here, but the food is much fresher. The Grilled Chicken Salad is a large portion and very tasty...Gyro is good as well."], ["Joanne B.", "This place seriously has the best rice!!!!!! Such great service, the staff is always so nice! I always get the chicken platter, I don't care for lamb meat but if it's any close to the chicken it must be great!!"], ["Emily R.", "Had an awesome (and cheap) falafel here. They packed the pita tight and used hummus to seal everything together, so it was easy to eat - not too messy. It really hit the spot after walking around Cheekwood. Employees are very friendly and like to make you laugh."], ["Cameron C.", "This place is a hidden gem in Bellevue! If you love authentic Greek food, do yourself a favor and come here. I always get the gyro platter and I'm never disappointed. It's a ton of food (way too much for me to finish on my own) and it tastes wonderful. Everyone is super friendly and there's a really good chance that you'll be told that your food is on special that day for $100 (just go with it, it's a running joke). I always leave there laughing and glad I decided to go in. Love, love, love this place!"], ["Alexander M.", "Yum! Yum! Yummmm! This place was fanatic! I'm visiting my cousin in the Nashville/Bellevue area and I was craving a Gyro sand which! Low and behold after hopping on yelp I was able to spot this location that's less than 2 miles away! The reviews were good and the pictures seemed to look quite tasty as well! For literally just about $7 you can get a very fulfilling Gyro sandwich meal!"], ["Laura C.", "I'm a huge fan of this place! My go to is the gyro platter which has always been delicious. Great prices, great quality and everyone that works there is super friendly!"], ["Bree B.", "Best hummus around hands down!!!  Love the friendly staff.  They always make me smile!"], ["Kerri J.", "I can't express just how much I enjoy the variety of delicious flavor that is contained in a gyro platter with tabbouleh. I have to stop myself from eating here everyday. I wish I could talk about other things but I feel like I have found perfection in this dish. The sauce they put on the top.... I could drink it. It seems like ranch but it can't be that simple. The dining area is simple. The staff is very friendly."], ["Tabitha W.", "Funny, friendly, tasty, and the price is great!"], ["Andy B.", "Well, I went in here to get a gyro, but I have this thing about cheesesteaks, and if I see a cheesesteak on a menu I'm going to order it.  I always watch people make cheesesteaks if I can because it's a passion of mine, and where did they go first?  The freezer.  To pull out a frozen block of meet.  That's a big strike one, and it kinda went downhill from there.  I was hoping to find a new, cheaper option to Jersey Mikes double meat Big Kahuna ($14), but this one just wasn't very good, and for all the reasons that I noticed while they cooked it.  They get a pass because you come here for gyros."], ["Paul B.", "The best. Sam is hilarious, and runs a tight ship - every time I have been there, it has been consistently high quality.   I love the gyros,and the falafel is great, too. Try the cucumber sauce instead of the ranch dressing for a really authentic experience!"], ["Katie M.", "My husband and I love gyro salads and have been trying a bunch of different places in Nashville to find our \"go-to\" place.  Luckily for us we stumbled upon Sam's and have never looked back.  I think we end up getting take out from here at least 4-5 times a month.  The gyro meat is some of the more flavorful meat in town.  Also - the white sauce is perfectly tangy.  However, one of the best things about this place is the people behind the counter.  They are so happy and can be quite the pranksters.  They also recognize my husband and I as regular customers and have started to learn our order.  The service is wonderful and the food is perfect.  Can't recommend this place enough, especially if you are in the Bellevue area."], ["Nikki B.", "Soooo good and they aren't stingy with their ingredients. They will pack that gyro FULL. Both the chicken and the lamb are great and their vegetable options are very fresh."], ["Tyler U.", "Great gyros at a great price.  Pita and hummus are very good too. Have been here several times since moving to the area recently. Has become my go to place."], ["Amber B.", "Flavorful food. Friendly service. You can't go wrong ordering here! The chicken plate was delicious. Gyro meat was tasty. Excellent little place! Salad was crispy with a wonderful sauce that accentuated instead of drowned the flavors. They were out of one item and went out of their way to make a substitute that was delish! Come eat here. You won't be sorry. Wish I lived closer."], ["Chad R.", "Great place. We had to place multiple orders for a work event and they were super accommodating and helpful on everything. Orders were correct, nothing was out of order. Great job guys!"], ["Sue W.", "Still love this place. Consistently great. Always fresh and delicious. Friendly and affordable."], ["Paige L.", "Delicious! Very hospitable staff. Stopped in for lunch while in town for work, and I felt like a regular - the owner is super friendly. Ordered the chicken salad with everything, and it was wonderful. Not a lot of options, but very well seasoned meats and fresh veggies paired with great prices and the best pita bread I've ever had made for a great experience. I'll be back if I get the chance!"], ["Deepak B.", "Love this place. When I fly into Nashville airport every week I am starving. This place in my way and I just order random things on the menu. The service is nice, food is plenty and flavorful, and prices are reasonable. There is a sit down place across the street (will not name) I wouldn't recommend. SAMs is one my favorite go to places in Nashville."], ["Ashley E.", "Great service, always with a smile! I know people who live across town and drive here for the food. I always get the regular gyro \"sandwich\" (pita), and the husband gets the platter (rice and side salad). They never disappoint. Only thing I'm not a fan of is the hummus, but that's personal opinion."], ["Dagan B.", "the rice was moist the meat was tender and everything tasted fresh. for the price it was really good. i would definately go back.  the tabouleh salad was also good and fresh"], ["Angie W.", "I love eating at Sam's Kebab Gyro! There gyro plate is always delicious. I love the fresh ingredients and speedy service. the restaurant is clean and the service is very quick. The location is convenient and easy to find. I recently visited with my boyfriend on crutches and the manager ran to the front door to open the door for him. Not necessary, but very much appreciated all the same. I have visited other \"gyro\" restaurants in the past and been disappointed in the lack of flavor of the meat. That is not the case at Sam's. I often drive an extra ten miles just to visit Sam's."], ["Brandon M.", "Awesome gyro... This is my new place when on Bellevue Tennessee"], ["Shane A.", "I've driven by Sam's a million times but never stopped in. Mediterranean food in Nashville is atrociously vanilla at best (in \"pop-in\" store fronts that is). I was starved so I set my phaser on mediocrity and popped inside. Boy was I was in for a surprise. The 6 or 7 people in queue went fast. Friendly older guy took my order of combo plate (rice, gyro meat, chicken, pita, Greek salad). Salad ingredients looked (and were) very fresh. I cringed at first that the meat was coming from a covered tin instead of being cooked fresh. (it was 1:30ish, who knows how long had it been there? Would it be dry?) Turns out the meat was very fresh. Gyro meat was especially tasty, just enough flavorful spice to eat on its own with frequent pauses to enjoy the taste. Chicken was safely tasteful, if not uneventful. Definitely fresh, tender, and a kind of BBQ moist (if that makes sense...all of that a plus) but the \"spices\" seemed to only color the meat, no burst of  yummy like its plate date, the gyro meat. Rice was perfectly cooked. Firm, moist, a hair more flavor than the chicken (although rice and chicken together made up for their individual blandiness). Pita was a warm, balance of fluffy and dense. Substance without being a brick, also fresh, which seems to be the running theme of the meal. Portions were big, and I only spent $8 for the combo and drink. I'll definitely be back (construction worker guy in the next booth had an awesome looking Philly sandwich I'd like to try!) My Nashville gyro dry spell seems to finally be over. Hooray freshness!"], ["Gregory B.", "I have already reviewed Athens, across the street from Sam's, and felt it was only fair to review Sam's, one of my favorite take out restaurants in Nashville. I like both of the restaurants, for different reasons.If I had to pick the best take out Greek in Nashville, it would be Chicago Style Gyros on Harding, but it is on the other side of town. Sam's is a close seconjd and much closer to the house. IN Bellevue, Sam's is the best take out, Athens (across the street) the best sit down.Most times I go into Sam's the owner is there, serving food. He greets everyone with a smile and makes you feel at home. The portions at Sam's are ample, perhaps even too much so. If you order the gyro platter, you get a large portion of rice, nearly completely hidden with gyro. It also comes with a side salad and you get to choose the toppings. I would personally skip the ranch dressing (homemade, nice) and go for the tzadziki (cucumber yoghurt -- yum).My favorite is to get a sampler. For a bit more, you can add gyro and you still get more than enough gyro to fill your stomach. The hummus is very nice and creamy. The dolmades are very nice. The falafel is decent enough, although I have had better (I still order from time to time). I am grab some of the spanikopita (spinach cheese and filo) from time to time.The best part of Sam's is the price value ratio. Even the sampler, with meat added anda  drink will run around $10, which is very reasonable for the amount of food."], ["Mark M.", "Gyro was a packed pita. As others have mentioned sauce seemed like ranch."], ["M R.", "I love Sam's! The gyros here remind me of the ones I had in Greece, made to order and stuffed full. The portions are huge, the gyro meat and chicken are always juicy and fresh. Falafel is good, I've had better, but only because it was fried a little hard for my taste, but I'm also not the biggest falafel fan in general. The hummus is silky smooth with a nice touch of olive oil on top. Stuffed grape leaves are magnificent and perfectly spiced. I always get the gyro platter or gyro salad, both 6.87+ tax. Both options provide enough food for 2 meals! Just as important to me as food quality is service and Sam's never disappoints. I've been a frequent customer (at least a couple times a month) for a few years now and it never fails that the owner already remembers my order when I step up to the counter. I even took my parents in once when they were visiting town (they're requested to go back several times now) they were new to Mediterranean food and  were unsure of what to order. After the meal, the owner inquired if they enjoyed the food and they raved. Since then, he often asks me how my folks are and sends his regards to them during the holidays. The combination of great food and amazing personalized service make Sam's a true Bellevue treasure."], ["Jeff B.", "Wasn't the 4.5 stars I expected. Decent but I've had better."], ["John B.", "Yup, like everyone else has said- this place rocks.The owner is in here frequently. He's super nice and always greets people warmly. The food here is just GOOD. Really, everything is bangin'. The platters are huge, chicken and gyro are both excellent, the falafel is really tasty, too. And don't forget the hummus!!! When I was living back at home, we'd get food from this place multiple times a week. And when I visit my parents, it's always one of the first places we go to. The prices are great, also."], ["matt c.", "This is one of a few places I will eat at on my occasional way through Bellevue. The other main one is Penn Station kitty corner from Sam's. This place is also known as \"The Sauce\" because of the way the owner, taking his place behind the employee, will patiently instruct him in the fine art of adding sauce (i.e., tzatziki) into the pita gradually and mix the ingredients about two or three times during the preparation of the sandwich: \"Sauce.\" (Nods. A couple more ingredients.) \"Sauce.\" (A couple more ingredients are mixed in. An approving nod.) \"Sauce.\" etc. The service, to say the least, is friendly and attentive. However, it is advisable not to let one's guard down, or one will be persuaded to accept the \"homemade ranch\" instead of the tzatziki. It is not as good. If you don't want to bust your belly, it is possible to get a light snack here, too. In such cases, I like to get a couple warm, sliced pitas and the smallest-sized cup (about 4 or 6 oz.) of hummus with a little olive oil drizzled on top, and wash it down with an unsweet tea. When you have your food, you can choose a comfortable, well-worn booth (purchased second-hand?), preferably as far from the blaring flat-screen as possible (it usually airs world news or FOX, I think), or take the picnic bench outside, weather permitting."], ["Jamie D.", "Sam's Kabab is one of the only places in Bellevue that can give you way more than what you pay for!  Go there for lunch(between 11am-1pm) and you can get a gyro sandwich, fries or rice, and a drink for $5. The sandwiches are HUGE and they mix everything together inside the pita so you get a taste of it all with every bite :) The owner is always happy and remembers what you like.  Downsides: Parking is a nightmare in the shopping center.  Not nearly enough spots, in which case you may have to park at the McDonalds or Hardee's and walk over.  There is one employee there who is seriously more interested in what's on TV than fixing your meal. I'm not kidding, he once stopped mid-way through making my gyro to watch part of a soccer game. Finally, the tables and bench seating rarely get wiped down. The wood on the booths always feel sticky and the tables always have crumbs from the previous customer. I've been here many, many times with a packed restaurant or just us and it's the same every time. That is probably my biggest complaint."], ["Matt B.", "I know that there are several of these around town, however, I think this is the best one. I've had their chicken pita wraps for a while now and they are BIG and tasty. Last night I went again and tried their Combo platter. It was gigantic (not that I need to eat that much) with shaved beef, chicken, yellow saffron rice, and toubouli salad with tomato.I've eaten my weight in hummous in my life and this has to be the very best ever. They get the texture and the blend of spice just right and it is too perfection. The pricing is cheap--yet the taste is an eleven. Can't say enough."], ["Cynthia T.", "Soft (microwaved) pita stuffed with all the dressings and tasty gyro meat...Is what Sam's Kabab Gyro is all about!  And much more! It has quick and friendly service, a good variety of combos to choose from, and their gyro meat has a well balanced flavor (sometimes gyro meat gets too salty).  The eatery has a medium to small seating area with tables and booths as options.I'll be back again if I want some fast and tasty Mediterranean food!"], ["Chris B.", "Various generous portions and very fresh. Excellent value."], ["Jack V.", "Stuck back in an out of the way location in a Bellevue strip mall it's easy to drive right by, but don't! Seven dollars gets you a huge gyro platter overflowing with a fantastic greek salad, rice, gyro meat, and pita. Vegetarian platters looked great as well."], ["Missy M.", "This is the best Medditeranean place around.  I always get the chicken gyro sandwich with everything and it is to die for.  It is so huge you can save half for the next day if you want.  They also have fresh cut french fries which is awesome.  Everything always tastes fresh and has good flavor.The staff is very friendly and if you take your sandwich to go they will put the cucumber sauce on the side so it doesn't make your sandwich soggy."], ["Paul A.", "Looked promising; a big meaty mass spinning in front of my eyes, cheap combos ($7 for a combo platter (chicken/gyro meat, rice, salad), cool air conditioning... all that was left was a person to serve me.  Drove all the way out here to try there greek food but I waited 5 minutes for some sort of service but I saw no one.  Were they in the toilet, were they playing dice in the back who know's... I'm not coming back to find out."], ["Sasser M.", "I really need to sneak a look at the brand of pita these guys use... oh and get a flat grill so I can make it taste just right.  I'm not  a know-it-all about Mediterranean food but I do know that the tzatziki sauce on rice and gyro meat is the bomb.  I don't even like cucumbers but that sauce is yum!"], ["Justin Y.", "This restaurant is batting 1000 in our book!   My wife and I frequent this place almost 2-3 times per month and have yet to receive a bad meal.  The owner and staff  are a very friendly and amicable and always remembers us whenever we come in.I usually order the gyro platter, which comes with grilled lamb on top of a king-size bed of rice pilaf, feta salad, tzatziki, and warm pita.  The grilled lamb is some of the best I have ever had.  It's always cooked fresh.  If I'm feeling extra gluttonous, I will also have an order of grape leaves.  These are great to have on an especially hot day.  The seasoned rice stuffed inside is very tasty, and the leaves are never soggy.  The serving sizes are also quite generous.  They never charge you if you ask for a little bit extra.  The food is definitely under-priced.The only disappointing aspect of this restaurant is that they don't offer punch cards like the other Sam's locations, but that won't stop me from returning."]], "Blu Fig": [["John M.", "Great place. Terrific salmon wrap. It's a meal not a snack. Fresh and tasty food. Price is right and service is friendly."], ["Miena B.", "I drive by this place a lot and decided today I would try it. Pros- I ordered the Mezza w/ falafel, which is supposed to be a sampler platter. The hummus was very good, and so was the tabouli. Both tasted very fresh, as well as the feta cheese and black olives. The staff was friendly.Cons- I got my order to go, and didn't check the container before I left. The platter was supposed to come with pita bread to eat the hummus with, I didn't get any. And instead of kalamata olives, I was given black olives. Also, the music was a little too loud. Made it hard to hear the staff as he was making recommendations, and so probably not a place I would sit down to eat with someone and hang out.I still think this place has potential. I'll go back to try some of the other menu items. Hopefully I'll get whats described on the menu next time."], ["Sarah Jane M.", "Just tried Blu Fig for the first time. Very impressive - the falafel is made in house as are many of the specialties & the hummus is to die for! The owners are also very nice & Blu Fig is locally owned which is always a plus in my book. I'll be back and recommend it as one of the few healthy AND tasty places to eat in Nashville. A+"], ["Jenny A.", "I LOVE Blu Fig!!! It is the CROWN JEWEL of my neighborhood! This is my go-to place when I want to have something healthy, fresh & tasty and guilt free! My favorite is their sampler platter that includes stuffed grape leaves, hummus & pita. Love their tabouleh and yummy salads! They make everything fresh on the premises except for the baklava, I believe. The baklava is TO DIE FOR...very fresh, tender and NEVER chewy! They cut each piece in fourths so you can eat a fourth and take the rest to go. I've been a total fan since the first time I went. The owners and staff are super-friendly and service oriented. Their take out is just as great as eating in, too!"], ["Pilar A.", "I love the smoothies and the hummus!!! I go there every Tuesday and Thursday for the delicious smoothies. Owner is super nice and staff is great too!"], ["Collin K.", "Wasn't referring to sandwiches ... Was referring to gyro play with  beef rice lettuce and pita bread ...."], ["Susan D.", "Staff is super nice and genuinely care about their customers. I've had their Plato's delight (amazing), Lentil bisque (very good but I like my soups with more of a chunky fill then blended but still tasty), delicious and light falafels with yummy Laban sauce and their marinated chicken is so tender and flavorful! I've had several smoothies and they're all good as well as their bubble teas. I highly recommend trying this place if you're anywhere near it. Always fresh and reasonably priced"], ["K T.", "The menu is limited. But the food is fresh and taste great."], ["Bradley S.", "**EDIT** 7/12I've since been and for sure have changed my opinion. Again, as I said below, I think I caught them on a bad day. 3rd time was a charm for me. IF I get a hankering for some good greek / med food... I'll check it out.Oh and to the reply from the vendor, no my first review wasn't a joke. My opinions still stand from my initial visit, HOWEVER since I went back i even tried Bubble Tea, for that alone... I'm a HUUUUUUUUUUUUUGE fan.Short and not sweet ... avoid this place. Maybe I just got them on a bad day... but suffice to say nothing was good. Sauce sucked, lettuce brown, long wait , expensive, and just dry and tasteless. Gyros should be savory and moist! sorry I won't be visiting again."], ["Daniel M.", "The food was excellent and the staff where very friendly and welcoming. My only complaint is the lack of seating, it was very crowded the day I was there, but it is a small place and I gather they do a lot of takeout."], ["Kevin S.", "Nothing special pricey."], ["Paige P.", "Great food and service. Everything is fresh, and the falafel is amazing! We will definitely be regulars here."], ["Kate S.", "Really enjoyed my dinner last night here. Great service, and the food came out quickly. I ordered the duo plate which I was informed was a lot of food - and it was! No disappointment in freshness or quality at all. I think it was 8.99 for this item, which was just fine with me. The fruit tea is apparently really good according to my friend, so if that is your thing try it. I tried one of the smoothies with peanut butter in it and it was excellent. (Can't remember the name - sorry!) Not sure why one reviewer said it was not made from real fruit; I watched them make it. Maybe they changed that since? Regardless, I was very pleased and will be returning soon. The place was super clean and the bathroom is decorated very nicely and has honey and fig scented soap which I found amusing.Afterthought worth mentioning: The seasoning on the fresh potato chips was ahhhhmazing too."], ["Andre P.", "This place is a hidden gem. Food is delicious and their homemade fruit teas are second to none. Atmosphere is kind of lame but highly recommend grabbing some for take out."], ["M. J. D.", "Blu Fig - Short name, short menu.When I think of Mediterranean food, I think of Falafel, Moosaka, and Baba Gahannouj.  Foods that are as much fun to say as they are to eat.Blu Fig however, misses on all of those.They started in the right direction, with an appetizer menu that contains Dolma, Tabouli, and Hummus, but once you get past the appetizers, you get 4 options - gyro, grilled chicken, salmon, or shrimp.  The first 3 can be served in a pita, all 4 are available as a salad or on a bed of rice.So I was disappointed.  I didn't get to order something funny, like shawarma or matbucha.  The Blu Fig didn't even have Figs on the menu.  If I opened MJ's house of pasta, you can bet I would serve pasta.Then the food came.It started with a smoothie.  It was very good.  Fresh fruit, yogurt, and locally produced honey.  If this place was next to a gym, I could burn off 400 calories and put them right back on all within an hour.Then my gyro came.  It was good.  The meat wasn't greasy, but fat equals flavor, so the meat was a little sad.  Healthy, but bland.  The laban & tahini sauce made up for it though, so they hit their mark.  Where they excelled was with their basmati rice.  Very tasty, despite the fact that they jazzed it up with a bag of mixed frozen vegetables.  Almost floral tasting.I really want to support local eateries, especially ethnic ones.  But the Blu Fig dumbed down their menu too much.  They don't even have \"Gyro\" on the menu, they call it a Yee-Ro.  As if to say; \"Hey you redneck hick, this is how it's pronounced.\"  Well you Mediterranean Bluneck, Salmon isn't native to the Mediterranean, and that's a quarter of your menu.Tip:  Be ready for takeout.  Despite the size of the establishment, there are only 4 tables here.  Three of them are 4-tops, and one only seats 2.  Also be aware, that it runs kind of pricey, a lunch for 2 (one plate, one pita wrap, a side of tabouli(so I could order something funny), a diet coke, and a smoothie) ran us $28 not counting tip.  2 1/2 stars, rounded up to 3 because of the rice."], ["J C.", "We tried this place tonight. If you like Mediterranean food, it's okay but not spectacular. I had a gyro plate, which included some tasty pita bread. My husband had a grilled chicken plate, and he said it was so-so. The rice was flavorful, the meat wasn't greasy, and the salad was filled with a variety of flavors.While I waited, I was offered a sample of their fruit tea. Good stuff. They also carry baklava and cheesecake if you're interested in dessert. I'd like to try one of their smoothies since they offer a variety of flavors. Customer service was friendly and attentive, which is a major plus.Overall, it deserves 3.5 stars, but since Yelp doesn't offer that, I have to settle for 3."], ["Becky S.", "Awesome food. Everything was so fresh and flavorful! We can't wait to go back!"], ["Chris F.", "Had an amazing salmon salad and mezza platter! The service was excellent and the food was delicious."], ["doug d.", "This place gets an extra star for being able to get Med. food in this location.The Lentil soup is wonderful, Falafal is great too. I also enjoyed my smoothie very much.The salmon is really good, over their rice. The appetizer plate was ok, and gyro just ok for me.Salad and tabouli were good.I think if you live in, or pass by this area, it is definitely worth a stop."], ["Jim S.", "the best gyro I have ever had... my wife had the chicken pocket , the staff are very helpful and never seem to stop smiling ."]], "Athens Family Restaurant": [["Kristin B.", "The double lamb burger was outstanding and the service was awesome...Reuben sandwhich is a must have. Smoked corn beef awesome.."], ["Heather B.", "I love Athens. The Greek food is very authentic. My favorite is the chicken souvlaki  sandwich or salad. They up the notch on French fries by adding feta cheese to them! Portion sizes are good. Kids meals are large and reasonably priced. The only reason I didn't give them 5 stars is because they close too early during the week. Their humus and pita bread are off the chain. It's BYOB so grab your favorite bottle of wine, a good friend and enjoy!"], ["Ed H.", "Very good food and service. Seating is minimal, especially for a larger group. However, overall a very positive experience."], ["Cassie S.", "Sorry, this place just did not do it for me.The food:First problem was that the appetizer and the entrees came out at the exact same time.  We ordered the appetizer because we were particularly hungry -  if we'd known we weren't going to get it before the entrees, we wouldn't have ordered it.  (it was good - the eggplant dip).  We both ordered the gyros platter.  It comes with a tiny little thing of tzaziki in a little plastic container, and the same sized thing of salad dressing.  Stingy much?  Anyway, gyros were just OK - really salty (and I love salt) and not enough sauce.The environs:Unpleasant to say the least.  We were next to a window, the blinds were down and on the blinds was a bunch of splattered food.  Not super appetizing.  Also, very dusty.  And the flies.  Black flies everywhere.  Since it's kind of an open kitchen, I can only imagine what the fly situation was like in the kitchen, given how it was in the dining area.  Also not very appetizing.  Service was very good.  If it wasn't for the dirtiness, I'd come back to try breakfast.  But there are other places to try first."], ["Ashby F.", "New breakfast special omelettes are delicious, fresh, and an amazing value. Thanks Athens for listening to us Bellevuers who don't want to spend $15 on breakfast :-)"], ["Nancy T.", "My favorite breakfast in Nashville! ! Benedicts,skillets omelets are amazing!  They hand cut fresh fruit each time a fruit bowl is served!  Sometimes it IS the little things:) and they have a warm,friendly welcoming staff!!"], ["Kaleena 'Kala' H.", "My fiance and I came here for dinner one night with his grandmother for our first time. We had seen this restaurant on Food Network and decided to give it a shot.If you do eat here, be prepared and bring a jacket. It was so cold in the room that I was freezing and it irritated my allergies. I ordered a gyro with no tomatoes and french fries, and my fiance ordered a gyro as well (but with tomatoes). They mixed our order up and we had to swap food around. I liked the gyro, but all I could taste was the bread and the sauce, thanks to my allergies knocking my tastebuds out. Not sure yet as to if I will come back."], ["Megan L.", "I had only been to Athens for breakfast, but decided to go for lunch the other day and I'm really glad I did! I ordered the Greek salad with Gyro added and it was the best lamb I have had! Plus our server was very nice and we got our food quick. I can't wait to go back!"], ["BethAnn S.", "Full disclosure - I've only had breakfast here AND breakfast joints in Bellevue are pretty sadly limited, so I will do all I can to encourage this little 'can-do' joint to keep slinging out their omelets and scrambled eggs even if you can do better at a chain restaurant.  The staff is friendly even if the outside looks like a take over of a Long John Silvers (is it a take over of a Long John Silvers??).  We've always gotten in within 15 minutes even with a party of 6 or 7 on a Sunday morning.  Priced reasonably - about $7 for eggs, bacon, hashbrowns and carbo mania, the place is clean, fast and very diner feeling."], ["Nate G.", "This place is pretty good. We went there for breakfast and it was satisfying. I got the Greek omelette and it was very good for an omelette. So all in all the food is good. They have a wide selection for the menu with all day breakfast. Maybe a little pricey for breakfast food."], ["Elizabeth R.", "My favorite restaurant in Bellevue! It's not a chain, you can get an amazing breakfast all day and the Greek food is amazing! Highly recommend it!"], ["Jesse M.", "This is one of our favorite places to go! Great vegetarian options. The staff are always friendly. For vegetarian options my favorite is the baked eggplant. Delicious!!"], ["Geoffrey J.", "I came here with my girlfriend for dinner. From the outside it didn't look like much; the building was obviously a fast food place at some point. The service was great though, and the food was fantastic. I had the lamb special, a shank with tender, fall-off-the-bone meat resting on a bed of rice with a tasty red sauce and potato dumplings of some kind. She had the lamb bifteki, which was two groud lamb patties, perfectly seasoned. Even the pita bread was perfect. One of the best meals I've had in months. I only come to Nashville a few times a year, but if I happen to be that way again I will definitely go back for more."], ["María D.", "This was my first visit to Athens in Bellevue. Upon arriving I was seated fairly quickly. I was struck by how noisy and how bright the place was. The atmosphere felt more akin to a fast food restaurant, and I would not recommend it if you wanted an intimate or relaxing dining experience. After I was seated, my server disappeared and I was left waiting almost 15 minutes at my table (even though the restaurant was not busy). The server who eventually visited my table was very friendly, which partially made up for the wait. I ordered the vegetarian Greek platter and an olives/hummus appetizer. The olives and hummus appetizer was tasty - the pita was warm and plump, the hummus was not special but good nonetheless, and for the price I thought it was a good deal.The vegetarian platter, however, left a lot to be desired. The moussaka was meh, ok, kind of tasted like some frozen gourmet meal. There was a small dish of vegetables in tomato sauce that I actually thought was quite tasty. The rice was a huge no - it tasted like the kind that comes pre-cooked in a bag. There was a cheesy potato side dish that was tasty - but then again, it was almost pure cheese, so hard to mess up. The portion was big - I had enough to take to work for lunch the next day.As a Bellevue resident, I'm glad to see this place here. The more variety of restaurants the better I say. If you go here, you will probably get something that tastes decent. You will probably not get something amazing though. The service is just ok, and the atmosphere is diner/fast food joint. I probably will not visit this place again. I'd rather visit someplace outside of Bellevue where for the same price the food is tastier, the service better, and the ambience cozier."], ["Annie S.", "I'm sitting here now and I feel so bad for our poor waitress. completely understaffed. she said it's always one person on the floor so it's not just a day where there was a no show. she's running the place by herself which is making for  poor service. Which is completely not her fault. The food was not very good. Soup was cold, thick and flavorless. It's supposed to be broth based lemon chicken soup. I couldn't taste the lemon at all. Pita bread was wonderful though. My gyro was fine I suppose, it had little meat and the taziki was just plain yogurt it seemed like. Nothing special though. the French fries were straight out of a freezer bag and into.the fryer. Prices are way too high for the low quality you are getting. my boyfriend and I like Sam's gyros across the street way way better. This place is sad and I do not recommend it. I hope the waitress at least got some money from her two hours in the weeds because she was sweet as pie"], ["Jenn S.", "Fantastic breakfast. Fast, friendly service. The portions are large, the menu is unique and the food is great. We've had several different things off the menu, the skillet with hashbrowns, cheese, peppers and topped with fried eggs is my favorite. The boyfriend liked the pancakes and steak/eggs. Highly recommend."], ["David W.", "Athens Family Restaurant is awesome! Tonight the sea bass and lamb dish were specials among others....the lamb shank was spectacular! Always fast and friendly service...LuAnne made us feel welcome...and we will come back very soon!!"], ["D A.", "Great Bellevue secret. Great food, breakfast or burgers! Greek food is fantastic and if they are serving it, the clam chowder is ridiculously good. Let's keep this gem in Bellevue. Wait staff, while small, is the friendliest ever."], ["Lakeisha H.", "Me being from Chicago and having a Greek Town in the city makes the review somewhat unfair BUT...... I've been to several other places around town and much better than this.  I'm never going back.  The people were friendly and nice but the food needs some serious work.  If you want good Gyros go to Pyramid's in Opry Mills or Rivergate mall"], ["Jason S.", "Sometimes you have a dining experience where one tangent can throw the whole meal one direction or the other. Could be a great meal with a crummy server, a stinky smell in a fine restaurant, or fantastic ambiance that saves a rotten meal.The other night, we went out with our kids to meet some friends at Athens.  I have eaten here several times before, and I have no idea why I don't come here more frequently since we literally live five minutes down the road.  It is probably because we don't eat out with the family that much and if we do, we usually try to get out of Bellevue.  Nevertheless, it was solid food, but what changed the night was the guy running the place, Doran.  In his joint role that evening as cashier/server, he showed us great patience, warmth and kindness.  He was really sweet to our kids, and super attentive to everyone at the table. Fantastic graciousness and hospitality; he really made it feel like we were in his home.  You go, Doran!At the end of the meal, when we ordered baklava for desserts, he brought us the gift of the caramel cheesecake.  Now wait a second.  Cheesecake?  I haven't ordered cheesecake for dessert since 1989.  But my friends, this is not your standard cheesecake.  It was light and fluffy, dare I say custard-like, almost like a flan.  And a delicate caramel sauce on top.  I will absolutely order it next time, and good for himAnd also, why in the heck have we not eaten brunch here?  The menu is AMAZING and available all day!  If I could smuggle in a Thermos of Bloody Mary's, that place would be PERFECT!My advice, clone this Doran fellow, and put him in both restaurants for all shifts, all the time.  Quick, before I hire him away from you."]], "House of Gyros": [["Bashkalov B.", "Greets from Keiv Ukraine, Bashkalov Babadook love House of Gynos!Is favriote in Nashville. Home os USA country star! Go keith urban and robert mitcum!check was excalent, is faovrite for bashkalov will be comings back next time in nashville dafinetly. ok thanks.B. Babadook from Keiv Ukraine"], ["Joyce A.", "My boyfriend always raves about the gyros in Nashville, so naturally, we had to find some on our visit to his family. We chose this one mainly out of convenience, being about a fine-minute drive from his family's home. But it was definitely a good choice.The restaurant's pretty simple--both in the menu and the decor. There isn't much to this place except for the great food and friendly service. We both got combos and were so full and satisfied with our meals. The gyros were so delicious, and the fries were seasoned perfectly.It has a fairly large space, and there weren't a whole lot of people when we came for lunch. We were able to enjoy a quiet meal together, enjoying the food and each other's company. I really enjoyed my meal. And my boyfriend definitely did!"], ["Bob B.", "I've had better,  it was good, just had better. Even here in Nashville at the farmer's market, that place is better by far. With a lot of great reviews I was surprised of the lack luster gyro.  Seemed the meat was not as seasoned. The tzatziki was not as flavorful. The whole gyro , you know when you can taste it a hour or two after you eat it, that was missing.  The fries were good though.  Well,  there you go,  that's all i gots for you.  Now go run along, kids. Lol"], ["Zeb M.", "Hidden gem of gyros in Donelson! Grabbed  quick bite to eat here with my friend one day after randomly stumbling upon the place, and I'm glad we did! Staff was friendly and our meals were promptly served. Surprisingly fresh and fantastic food for such an unassuming place. Recommended!"], ["Jackie S.", "I've lived in this area for 3 years and just recently tried this place.  I wish I would've done it sooner!  The prices are excellent.  We both ordered the gyro combo and weren't disappointed!  The gyros were so delicious and made fresh in front of you to your specifications and the fries were freshly fried and seasoned wonderfully.  The staff here was very friendly and the kitchen and dining room were both very clean.  We will definitely be back very soon!"], ["J R.", "Great services and delicious food! I ordered a gyro with chicken and lamb and fries. Everything was fresh and seasoned well. The saddest part about my meal was seeing that my food disappeared. Lol I'd definitely come here again."], ["Tracy B.", "Flew into the Nashville airport and was hungry. Found good reviews on Yelp so decided to try it out. Didn't feel like a burger. My husband got the gyro plate and I got the combo with salad instead of fries to be healthier. They did not give me any grief about the substitution. All the food was fresh and delicious. The cooks/servers were friendly and attentive and were concerned that we were happy with our order. Prices are very reasonable."], ["Michael A.", "Simple menu, fresh food, and good hospitality. Open kitchen with a open view to food prep. Well maintained clean eating area with a TV. You really can't go wrong with anything on the menu."], ["Dela P.", "Stopped by for a quick lunch, had a great meal!  Gyro was very tasty, and you get to pick your own toppings Chipotle style.  Fries were fantastic, not sure what kind of seasoning that was they put on it but it have a heckuva lot of flavor.  Highly recommend for low key meal."], ["Virginia S.", "Great gyro meat, salad and hummus! Friendly service and large portions. Best gyro I've had!"], ["Leona W.", "Best Gyros ever!!! Fries are also amazing. Love their good always hot and fresh made to order. Friendly service and very clean."], ["Tony M.", "Super friendly service, super fast fresh hot food... I had the gyro plate and it was fantastic. Not too far from the airport. I was full halfway through but I had to at least eat all of the gyro meat... nice thin slices with crispy edges.... awesome tzatziki. I'm coming back for sure!"], ["Kelly M.", "The only reason they don't get a 5 is because I'm from southeast Michigan, where food like this is the best thing you've ever eaten, and nothing compares. But for Nashville, this is my favorite spot for chicken plate. Super nice guys, always fast service, fresh good food, you can go healthier with no rice or fries or live it up a little. A little something for every eater."], ["Rob H.", "Went there for the 1st time today.  I had a Gyro and my wife had a chicken Gyro.  Both were made to order,  so it was nice and fresh and hot.  Great fresh ingredients as far as salad goes and topping on the gyro.   The gentleman taking the order and the cooks were working very well together. The food came out quickly and it was really good.  I would definitely recommend this place.  Lunch combo for my wife and I was around $14. Great value for good food!"], ["Steve S.", "Best gyros we have found yet. Great cucumber tzatziki sauce!  Friendly and VERY clean. Hidden gem in Donelson."], ["Jessica T.", "This is my new favorite place! The food is delicious and the environment is very clean. Staff is super friendly as well. I got the chicken plate and when they asked if i wanted salad i told them to put everything on it, because im  not a picky eater. i was not disappointed! Can't wait to try the baklava next time!"], ["Elizabeth S.", "When my husband told me I had to try this Greek place, I declined many times because of my past experiences with other Greek restaurants in Nashville. I finally gave in and have been going back ever since! This is the best Greek food I have had in Nashville and I've had some sandwiches and some plates. Everything I've had has been excellent and fresh! The staff is very friendly and the restaurant is very clean! Don't let the exterior strip mall deter you. Once you get inside, it is great! Highly recommend!"], ["Ashley R.", "I was surprised to see that a gyro place with such high ratings was located so close to me!  I checked this place out after trying to find Greek food nearby.  I ordered the gyro sandwich and my husband got the platter.  We both were extremely pleased with our meals.  The meat was so tender and delicious and something about the taste of my pita bread just enhanced the whole experience.  The baklava wasn't the best I've had, but still delicious.  A very modest establishment with great service and delicious Greek food that's nearby.... What more can you ask for!?"], ["Abby H.", "Very clean interior. Friendly staff. Prices are the same as other gyro places. The gyros are excellent and the rice and fry sides are delicious as well! This is one of the best gyro places I have ever been to. I don't have anything bad to say about this place."], ["Tom S.", "Great place! I love swinging by for a hearty Gyro. Nothing better after a hard workout! The prices are very fair and the gentlemen who work there are very kind.I recommend this place for the gyros!"], ["Allison B.", "Being a fan of the strip mall ethnic restaurant I was excited to discover a hidden gem near my apartment. House of Gyros is unpretentious, as are most strip mall places, but it's clean and the staff is friendly and helpful. I usually go for the house club with grilled onions. The house club comes with the lamb/beef mix typically found on gyros and marinated chicken. Super tasty and awesome. After the cook has griddled you meat choices, you are then able to choose from a variety of toppings to add to your wrap or salad. They have a middle easter salad mix with cucumbers, tomatoes and onions, romaine lettuce, feta, cheddar, etc. They you can pick a sauce to top it with. I alternate between taziki and ranch. Both are homemade and awesome. The fries are your usually frozen ones topped with seasoned salt. They make them fresh for each order which is nice that they are hot and crispy. I haven't had any of the other sides.There is also a bakery in this location. They make custom cakes and always have a nice assortment of treats. My favorite thing I've had from the bakery are theses yummy date or fig pastries that weren't too sweet. Of course I've tried the cupcakes too. Peanut butter cup is so yummy. Overall I'm very happy with the quality of the food and the service."], ["Michael H.", "House of Gyros is as good as it gets for a Gyro place.  The food is excellent.  It is very consistent ever time I eat there.  The staff is friendly and fast.  The place is always clean and has plenty of seating.  I noticed on 10/25/13 that they had a 100 on the health food score that is always nice to see.  The chicken is excellent."], ["Laura W.", "Great service, delicious gyros! I got the plate and it came with meat on rice with a salad and a side of bread. Since they were about to close, they gave me what was left of both salads and I don't think I've ever tasted a better compliment to a gyro. Both salads were delicious! The meat is cooked to perfection right in front of you when it's sliced off the roasting stick. Can't say enough good things about this place. Yum!"], ["Kristina G.", "The gyro is pretty good, my only complaint is that the cucumber sauce needs a little something it was very very thin and really didn't add flavor to the gyro.  Fries were ehhh nothing great about them they just filled space."], ["Shane M.", "Yup, great place! Had the BBQ plate and Marinated chicken breast. Both were amazing! The beef is excellent!"], ["Damon D.", "Yup!  Gyro sandwich, seasoned fries, beverage - $7.  Proper!  If you're on that side of town, it's the best."], ["Piyush S.", "This place is really something. The menu is the standard gyro joint stuff but the real difference is the freshness here. I have eaten here many many times and food is always hot and fresh. The lady who runs this place is also a baker so you could try some really good deserts here as well. This seems to be the takeaway lunch joint in this area and why shouldn't it be."], ["Danny B.", "This is my favorite Gyro place in Nashville, this is as close to a Chicago style Gyro you gonna get... I love it:-)"], ["Rhett H.", "Great service and staff. Gyros were excellent, well seasoned. They give you options for feta or cheddar and for cucumber sauce or ranch. Cucumber sauce was really good-not too thin. More than I could eat for lunch. Falafel was also very good. Was busy at the lunch hour, but we dined in and business settled out by 12:30. Kids portions were also good and larger than expected. Fries can be savory seasoned if wanted."], ["Beau E.", "I'm a big fan of this place. I've gotten take-out there probably 10 times and I've eaten there a few times over the past six years living in this area. As mentioned, the owner is a cool guy and he you can tell he works hard to provide and grow this small business. I like to support places like that. This place is a diamond in a very rough strip mall. The gyros are great, but his grilled chicken is my favorite. The grilled chicken salad is the best in town. The buffalo chicken wrap is surprisingly great also. He also has one of those drink fountains...you know the ones with the PERFECT mix. Mmmm. It is not Kalamatas but it's an awesome local restaurant!"], ["Mallory M.", "I really enjoyed it! Awesome to be able to get a good gyro right by the house. Score."], ["shaun p.", "This place was ok for what it was a small gyro shop.The guy could have had more toppings out after we got our small gyros another person asked for things that were not out so we went back and asked for japs and black olives.I have had way better.Will not be back"], ["Tommy G.", "Had the gyro lunch combo with salad.  All was fine and the total bill 7.50"], ["Theresa V.", "If you've had REAL gyros, you will like this place. I grew up on gyros in Chicago, so most of the gyros in Nashville are disappointing. Here, they use actual pita bread, not pita pockets. The cucumber sauce is right on. The owner is really nice, always remembers me, very helpful."]], "Kalamata's": [["Marci R.", "I love the chicken gyro and hummus here. Consistently good food and service!"], ["Liz F.", "I don't get why this place is so popular. I have been here three times and will never go back. The food is nowhere near as good as some other options in town (Athens, Blue Fig or even Fattoush Cafe) and the service I've received has always been sub-par.When I first went to Kalamata's I was surprised at how it worked. You go in, order at a counter and then get your own plastic silverware and napkins and pick a seat. The food is served on styrofoam plates and your drinks are served in styrofoam. This seems like laziness on the restaurant's part. There are no real waiters to speak of so if something is wrong, you have to take it back to the counter--where I've had to wait in line just to get a wrong order fixed.The food itself is okay. I'm not blown away by anything I've had on their menu. A couple of times I've ordered the hummus with pita bread, which is a big mistake. The hummus tastes about as fresh as the Athenos stuff in the supermarket and the pita bread is served cold. Why? It takes so little time to heat up pita bread. Yet another problem that just seems like laziness on the restaurant's part.Ultimately,  my biggest problem with Kalamata's is the fact that I can get the same meal on plates with real silverware and receive actual service at a couple other restaurants in Nashville for the same price. I think that for my dollar here I should have gotten a lot more than I did."], ["Caroline J.", "Salmon Thursdays are the very best...!"], ["Gresham H.", "An absolutely wonderful place. The rice and kabobs are my favorite but its all very good.  The prices are good and if you save room, their desserts are amazing. My wife loves the hummus and I'm a fan of their salad with feta cheese. The only negative is that this shopping center has terrible parking. But I won't hold that against them. I will just think poorly of whichever idiot put 7 restaurants in a row right here."], ["Brian D.", "Great Mediterranean Restaurant for lunch or dinner. The Gyros and greek salads are quite good, but the daily specials are highly recommended. Your tastebuds will thank you. I also recommend the cheesecake covered in chocolate."], ["Keith P.", "We had the humus, tabbouleh, lamb/beef gyro with rice and the salmon special with salad and white pita. They had musicians playing in the main room which was nice. We did not know that everything would come on plastic foam plates and plastic cutlery.The food service was quick. Very good selection of drinks. The humus was very good. The gyro was very... cafeteria quality meat but the rice was good. The tabbouleh was not quite the style I like but I realize there are many different recipes for it. The salmon was good but not great and the prices was way too much. If you are looking for the Fazoli's  of Mediterranean food this is it. Otherwise go elsewhere in my opinion."], ["Ben G.", "There are a few places I've been, where you can sense the owners presence. sometimes this can be a little creepy, sometimes it is Awesome! This is the latter type of place. Who knows if it was actually the owner, it doesn't matter, but their personality carries the place. Kalamatas had a line out the door when I visited for lunch. It didn't take long to see why. Great atmosphere, and fresh food being prepared behind a beautiful counter right before your eyes. And running the whole show a guy calling out orders for customers and staff...\"no, no, pay me when you're done, Hey You what do you want??\" the line moved quickly, the drink cases had unique beverages from around the world...and the food was Fantastic! I had grilled shrimp skewers on a fresh salad bed and a garlic knot. Definitely the freshest and best Mediterranean food I've had in town. More of a lunch joint than a nice sit down dinner spot but maybe they change that up and have table service after the rush."], ["Shawny S.", "Great food and great staff. The food is always consistent when I come into this restaurant of Middle Eastern goodness. I mean my goodness people, are we in Beirut or something!?! You won't find any mediterranean food like this in all of Nashville. Their food is delicious and always consistent, their service is always spot on,  and they are always friendly. Look for the bald guy with glasses, he will make make you laugh. I will always come back for my gyro fix."], ["T. R.", "Love the lamb gyros plate. It's a distance for me to drive, so sometimes I get an extra order to take back home.  The tiramisu is very good too. The dolmas are good but more vinegary than I prefer.  The Greek salad that comes with the entree' is good also."], ["Will M.", "My food made me feel good, because they gave me plenty.  A plate of hummus, gyro, salad, was too much for me for $12.  I paid after I ate.  But the food lacked seasoning, and the awkward setup was odd.  Plus they too much dressing on the salad.Overall, I'd come again, but not expecting five stars."], ["Steve J.", "My favorite at this restaurant is the Lamb/Beef Gyro Plate.  If you are used to a Gyro plate at the typical Greek restaurant, this is going to be different.  It is a step above the typical Greek, both in ingredients and taste.  This place is alive on the weekends, unlike most other similar restaurants.  The live music is usually very good and a nice touch for an affordable restaurant.  The Gyro plate comes with a side salad which is small, but excellent.  Everything is very fresh including the mixed greens, veggies, sheep's cheese and peppers.  The Gyro beef/lamb mixture is not shaved, but is very tasty.  It goes well with the rice and the Tzatziki sauce.  Their Tzatziki is made from Cow's milk, to which I am allergic.  However, they have a non-dairy Tzatziki which is very, very good.  If they did not tell me that it was non-dairy, I would have never known. This is a great place for a quick meal or an impromptu dinner date with your spouse.  If you find yourself hungry in Green Hills, give this place a try.  I recommend it!"], ["Ruiqiu K.", "I had to try their lamb gyro plate. After having strips of lamb served at another Mediterranean place, the julienned lamb was too perfectly cut to me. I personally don't care if my meat is shaved or not.  But it was delicious. I especially loved the rice. Rice is usually very bland, but their version was a stand out.The salad came on a very thin paper plate. Thankfully, it wasn't heavily laden with too many olives and peppers. The salad was lightly dressed, which I appreciated.The meat to rice ratio was more than I expected. I was using the pita bread as a sandwich maker when I ran out of rice.I was hoping to try the cheesecake, but because they asked me to pay after my meal, I kind of forgot about getting a slice.Not entirely sure if what I heard the workers speaking was Greek or some other Mediterranean language, but it sure lent some authenticity."], ["Aaron D.", "I'm going to go ahead and give this a Coveted Fifth Star!Why?1. Speedy. 2. Healthy. Especially the appetizers like hummus and baba ghanoush, but even meaty sandwiches like the chicken gyro are filled with fresh lettuce, tomatoes and cucumbers3. Delicious! Creamy baba ghanoush with one perfect olive on top. Chicken in the gyro was moist and appealingly seasoned.4. Affordable. Overflowing chicken gyro sandwich and baba ghanoush was plenty of food for two people (or one really hungry person). With just water to drink, I think the total was in the $9-10 range, including tax.5. Nice clean atmosphere with good ambience. Not over the top, but distinctive.Impressive. This could just be one of the best casual restaurants in Nashville."], ["Lauren Y.", "NEVER have I been treated so rude by a person at a register let alone the OWNER operating the register. After waiting five minutes to cash out I decided I'd call my mom for a quick chat, when he came back I moved the phone from my ear and told him what I had ordered, gave him my card, he walked over picked up my bag and dropped it on another counter away from me. When I said \"is that my order?\" He ignored me and I asked again and e said \"oh you're talking to me I didn't know\" then I said \"is there a receipt I need to sign?\" He said \"no, go on\". The other staff is great, food is great, but if that's the OWNER profiting from my purchases I will never return again."], ["Samantha joelle A.", "My most favorite place for a Greek salad is Kalamata's. Surprisingly, this is the only thing I have ever eaten here. Minus the occasional tomato basil soup if they have it. BUT, the salad is good enough to keep me coming back time and time again. I think it is the combination of the dressing and the garlic knot that comes with it. It's simply just fantastic. Yum. My boyfriend usually orders the combo kabob Greek salad, and he swears that the meat is some of the best cooked beef he's ever had in Nashville. I don't like meat on my salad, but I have gotten the chicken in the past, and it was really good. OH, and you can not leave without trying a baklava. Kalamata's is right in the heart of Green Hills right across the street from the mall. It's convenient and quick, unless you go at lunch and have to wait in a long line out the door. My one complaint is that the prices are a little high, but I gladly will pay a little more for food that is amazing every time."], ["David O.", "A bit awkward having never been there before knowing just want to do. bit the entirely laid back nature makes you feel at home right away. I was surprised to walk up to the counter, order.. get the food.. eat.. and then pay. We weren't even provided with a ticket to say what we had ordered, we simply recited it from memory. The remarkable effect of this is, it makes you feel like family. Sure, you could probably go in there and order something, and then not pay for it, but what would be the point? Why reward courtesy with crime? The friendly nature of the restaurant is second to none. The food, as it is, was good. While I can't speak to the legitimacy or authenticity of this Greek food, but I quite enjoyed it. The beverages are mostly bottled with some \"fountain\" teas. If you are looking for free refills on your coke, you'll be disappointed. Overall I enjoyed my visit and I certainly plan on returning."], ["Kristie P.", "I had grilled barramundi with a white bean salsa/relish over Greek salad for lunch today. What the hell did you have? Let me explain. Known throughout many parts of the world as Asian Sea bass, barramundi is a fish species found throughout the Indo-West Pacific region from the Persian Gulf to China; as far north as India and as far south as Australia. It has a white, flaky flesh and buttery finish, and tasted absolutely delicious atop Kalamata's delectable Greek salad. Gyros and falafels are not my thing you see. So when I purposely drive across town to Kalamata's for lunch, I feast on one of their (almost) daily fish specials and always order their delicious hummus. Everything is made to order with fresh ingredients. The staff is always friendly, no matter how busy they may be and the food never disappoints. Kalamata's serves up some of the most flavorful, nutritious, Mediterranean-inspired food in all of Nashville, in my humble opinion."], ["MyRanda W.", "Great food, could have better customer service and make me feel as if they appreciate the money you are paying."], ["Gabe F.", "I've eaten here several times now. Overall, their menu is ok. But I highly recommend the turkey club gyro with pasta salad or roasted potatoes. It's the best meal I've had yet."], ["Lauren S.", "This is my favorite place to lunch solo. The people who work here are so friendly, and the falafel is always wonderful & freshly made. Plus it's such a deal for how much food you get. Did I mention I love this place?"]], "Greek Deli": [["Justin S.", "Don't be fooled from the outside. Great Greek buffet at a good price. Been in business for 22 years so this place must be doing something right."], ["Kenneth B.", "Chicken shwamba was good. The chef, ( must be the owner) very entertaining. He is very freindly and likes to engage with customers. It was funny he started talking to me behind the wall and I wasn't sure who he was talking to but he always knew when someone was standing there lol. I Give food 4 5 stars. Store is one of those hole in wall kind of shops not that there's anything wrong with that. Try it out sometime."], ["Charlotte L.", "This place has taken the place of Pyramid's Cafe as my favorite gyro spot.  I went there for lunch for the first time today and everything about the experience was just awesome.  The owner is so friendly and helpful, the food was just delicious and more than enough.  I got the gyro platter - big chunks of meat not the thin strips you get everywhere else.  The only bad point was he didn't ask me what if I wanted olives on my salad but I'm cool with picking those off.  I will definitely be back."], ["Matt C.", "Awesome food, great owner, great place for lunch.  Get the steak plate, more than enough food.  Best Greek food I've had in a long time."], ["Ryan M.", "Great little place, an excellent find that was walkable from the client we are at.  The lunch is buffet style and it all tastes very fresh.  Owner has a great attitude as well, its a great find for anyone on the fence."], ["Cole S.", "Really great place.  The wife and I grabbed lunch there after reading reviews.  It is really straightforward.  We both got the buffet, which has Greek chicken, gyro meat, yellow rice, and a homemade sauce that is between tzatziki sauce and ranch.  (There are potatoes and a few other things on the bar, too, but all I got was the above).  The owner is more than friendly.  He is downright giddy and he greets everyone coming and going in a pretty over-the-top fashion, yet it seems genuine.  I am a fan, for sure!"], ["Kristina G.", "The gyro meat here has really good flavor, the chicken was pretty good, the cucumber and tomato salad was fine but not a lot of flavor, the rice was just rice and I would stay away from the tabbouleh salad it is more like a parsley salad.  The atmosphere is great just because the owner is so friendly and keeps you entertained with his comments.  Based on my overall enjoyment at lunch I give it a 5 but as far as food I would give it a 3, good but nothing special."], ["Nicole M.", "This was soooooo good came around closing time. Was treated to a heaping plate of Greek goodness will make sure I go again!!!!!!"], ["Jennifer M.", "I tried Greek Deli for the first time today.  It took a little arm-twisting, but I got my husband to join me (he was turned off by the rundown strip mall location). If you're looking for ambiance, don't go to this restaurant, but if you're looking for good food and friendly staff, definitely give it a shot.  We both had the buffet--definitely a good choice. I don't know what they do to that chicken, but it is awesome!  If you need a quick, low-price lunch, check it out!"], ["Pritish Z.", "Well, i visited Greek Deli today for lunch and it was pretty good. I would agree with all the comments about the owner Sam, he is too funny and keeps you smiling till you finish off your lunch/dinner. I would recommend to give it a try atleast to support Sam - the jolly man!!"], ["eric p.", "gyro buffet?  YES, PLEASE!  nice owner."], ["Peter P.", "Just a small little place with a small buffet of greek food. The guy that runs it is a character and just doesn't stop addressing random people that enter and exit his place. He's definitely part of the experience. It's a good lunch spot, but not amazing."], ["Ryan O.", "Don't be put off by the out of the way location or appearance of this spot. It offers really good gyros and very friendly atmosphere. The owner Sam is hilarious... expect some friendly hecking from the moment you walk in the door. He has a slew of one-liners for almost everyone and expect to keep smiling the entire time you are there as he keeps up the banter.When I worked in this area It was almost impossible not to eat here at least two times a week for lunch. Everyone that went absolutely loved it and always wanted to return.I can't express how big a fan I am of the the gyros here. My favorite aspect is how he uses larger chunks of lamb rather than slicing it off a spit. I hate when other places take thin slices off a spit and then burn them on the grill. You won't have that problem here."], ["Chad R.", "I worked in Donelson from 1997-2002 and used to go here for lunch all the time.  Sam, the owner, was very funny and friendly and kept things lively and his food was really good.  I worked at another job in Smyrna from 2003-2011 and had not been to this restaurant the whole time.  Now I am back working in Donelson and visited this place for the first time since then.  As soon as I stepped in the door, Sam said,\"Welcome back.  Glad to see you again!\"  I was surprised that he remembered me after all that time.  He had refurbished the place so it looks better than it used to and has more \"atmosphere\".  I think his food is even better now than it was then.  This is a great place to go for lunch because the food is very good and cheap.  Also, talking to Sam is always a big plus because he is a very like-able guy."], ["Jason E.", "Solid Greek buffet at a great value with a friendly owner. Relative to the area, the price, and how much fun Sam is, I feel justified giving this place 5 stars."], ["Skip H.", "Great food!!!  We've had the buffet and eaten off the menu. You always get so much more than the price you pay. And Sam is a great guy.  We eat here every time we come to Nashville if we get there before he closes."], ["Brad B.", "I must be special, the owner Sam always gives me a special rate for the buffet.  Everyone else, $7.99.  Me, $8.00.  Wait, what?Sam is a good guy so please support your local businesses.  Sam runs a good greek buffet.  The chicken is good.  The buffet has a number of veggie-centric items:chilled three bean saladgarden saladgreen beansyellow riceoil marinated cucumber/tomato/onion saladhummuspotato/onion casserole type dish (not sure of the name of this)tabboulehThe quantity is solid, and it's good but not great.  I don't eat lamb/beef so can't really comment on that.  I'm had the falafel here and it's again good, not great.  I personally don't like the hummus -- I always think wall spackle -- and the tabbouleh is average in my opinion (too soggy).  But if you're looking to try some new greek type dishes or simply meet a really entertaining restaurateur, here's your place in Donelson."], ["Greg S.", "This place is great.  I've been here multiple times.  Sam reminds me of a guy off of \"Seinfeld\".  When you enter for lunch you are greeted with a deep Helloooooo!  \"Would you like to try our wonderful lunch Booooofet?\"  He's a very friendly guy.  The buffet is loaded with all types of things.  Make as many Gyros as you want.!!  Have fresh salad,  yellow rice, hummus, tabbouleh.  It's all great and you feel very welcomed!  I think they close @ 6 PM.   Well the atmosphere is pretty plain. Who cares the food is great and service is awesome.  I love listening to all the things he says to all the customers!!  Great local business!!!!"], ["Eric B.", "are you serious??? no one has reviewed this absolute GEM of an eatery???sam, on behalf of the entire combined nashville-davidson-murfreesboro-columbia combined statistical area, i apologize for not singing the praises of your spot here on yelp. seriously, people... if you work in donelson, you NEED to get over here for lunch. as soon as you open the door and hear sam welcoming you with a \"HELLOOOOOOOOO!\" that you know he means fully, you know you're at a good place. the food here is so, so good. the lamb is truly second to none in nashville. everything i've had here is amazing. in addition to that, the prices are ridiculously reasonable (how do you do it, sam?). and to top it all off, sam is a great host.seriously, people. get to this place, and enjoy the wonderful food!eric b"], ["jerry a.", "serenaded by the proprietor while being served?  yes!  Sam is quite the character and hilarious and it is definitely worth the experience to stop by this place.  Unfortunately I was picking up a carryout and couldn't stick around but I will definitely come back by for the lunch buffet.  I had the gyro platter with rice and salad, the salad was fresh and had a good amount of other vegetables, and the rice was typical flavored rice served at Greek restaurants.  My lunch gyro platter cost around $7 with drink.  I am a sucker for a good side of tabbouleh and when I asked Sam about it, he said \"for you, $2, everyone else $1.99\"..... good ole comical Sam.  I also like family run joints. He had 2 of his daughters there helping out with the lunch crowd and one of them was complaining about leaving... AMAZING.  I also love he tries to greet every customer as soon as they come through the door and a quick \"thankyouverymuch\" rolls off his tongue during departure."], ["Amith N.", "mediocre food"]], "Istanbul Restaurant": [["Amy K.", "I've been going to Istanbul for years, and every time I leave completely happy with my experience. The food is delicious, plentiful, and flavorful (and a great bargain!). Between the toasted pita and creamy hummus, all the delicious soups (though I'm partial to the spicy yogurt), and chicken, gyro, and doner, the owner Mehmet always knocks it out of the park. And surprisingly, he has what is probably the best burger in Nashville. And his baklava? Flaky, sweet, and delicious.Along with the great food comes great, attentive service. My cup of hot tea is always filled, and I always get a nice chat with Mehmet or his sweet wife. Located conveniently off of 440, Istanbul is a true gem that you don't want to miss."], ["Casey S.", "Came here on a whim.Got the sampler appetizer which had olives, tabbouleh, falafel (If I remember correctly), hummus, and some cucumber/yogurt dip. All very tasty! I got the Kofta plate, which was very tasty. You get a HUGE mound of rice to go with it. The food was really good, so I definitely recommend it. Atmosphere was lacking; it's a little dive-y if you ask me. Parking lot was TINY--only a few spots. Not sure if they have parking in back or not.The only complaint I have is that we ordered 2 Turkish coffees along with the rest of our order, and they weren't ready until after we were already finished our whole meal. We mentioned it to the waitress after we got our appetizers and then when we still didn't have them, we assumed she just forgot and gave up on it. Not sure why they took so long to make. Especially since there were only two other people there, and they'd been there for a while before us. They were tasty though! I didn't know that Turkish coffee left a lot of sludge in the bottom of the cup, so I had a rude surprise at the end, but my boyfriend said that's normal."], ["T J.", "Finally tried this place due to all the positive reviews, and unfortunately our experience was poor and we are unlikely to want to return. This place needs to up its game to earn all the glowing reviews here - which are a bit astonishing after trying it myself.Ordered the following plates: one falafel, one combo hummus/baba ganoush, one gyro meal, one combo with gyro and chicken. Hummus was average at best, we can easily make better at home. Baba ganoush was inedible, a strange smooth consistency and odd color. After first taste we left it untouched, and didn't finish the hummus. Falafel was average and not particularly flavorful. The main courses were dried out, not fresh at all, and as we were hungry we forced ourselves to eat through it with a hefty covering of hot sauce (which was tasty). Tabouleh was a let down, and cucumber salad made for the tastiest bites of the meal (it was cut fresh!)I've had Turkish food in Turkey, and London, and elsewhere, and getting it right just isn't that difficult. Grill the meat fresh!! Same goes for all other dishes as well."], ["Clara Sue B.", "I've been meaning to stop by Istanbul restaurant for quite sometime and finally had the pleasure today! I had Turkish hot tea, spicy yogurt soup, and the Mediterranean  salad with gyro meat and cucumber sauce(1/2 order was definitely large enough). It was great! There was barely a soul in there, but I went around 1:30. The main guy behind the counter was so sweet and friendly. Best thing was it was all under 10$! I recommend!"], ["Praveen P.", "BEST BURGER in Nashville !  Not expected, but it is what it is..Great service as wellBurgers at Pharmacy, Burger up, Melrose are not even close"], ["Samantha B.", "Love this place. Whenever I'm craving Greek food in Nashville I come here. They have great hummus and gyros."], ["Ray D.", "Average food and average service. I would eat there again, but I wouldn't go out of my way to do so. House of Kabob is a couple of miles away and much better food."], ["Leigh M.", "Absolutely delicious!I tried this place because my first choice restaurant for lunch was closed. Pulled out my Yelp app and saw a place called Istanbul was close and figured it seems worth trying.I'm so very glad I did!I'm honestly shocked that they weren't busier. Besides me and a couple coworkers who came to lunch with me, there were maybe 3 other occupied tables in the middle of what should have been the lunch rush. Don't let this fool you into thinking this place isn't great though.I ordered the greek salad with doner meat on it, and it was fantastic. The salad itself was picture perfect; everything was arranged so nicely I almost hated to disturb it. Piles of veggies, piles of feta cheese, and a pile of freshly grilled doner meat in the center. The greens were fresh and crisp, the meat was tender and delicious, and the olives & feta were quite olivey and fetaey, respectively. At first I thought it was a tad pricey for a salad, but it was well worth it. They absolutely did not skimp on the ingredients, and the portion is as large as it is delicious. Unless you're practically starving, you can plan on bringing some home with you.I also had their white bean soup, served with some sliced pita bread. The soup was absolutely fantastic with the perfect level of spicyness. I definitely intend on visiting this place regularly.Oh, be sure to park around the back; the few spaces in front are a pain to pull out of, and the funeral home next to the restaurant has quite a few \"We'll tow you if you park here\" signs."], ["Thomas Z.", "This place is great !  Delicious, freshly prepared food with with friendly service.  I've been to this place four times in the past six months, and have always thoroughly enjoyed my meals.  They usually have a freshly made juice from several green vegetables. Extremely healthy !"], ["Caroline H.", "Loved this place. I came with a group of 6 last weekend for a friend's birthday lunch. We arrived at 1pm on a Saturday and the place was completely empty. (There's parking around back, FYI!) But by the time we left at 3pm, the place was packed! Odd timing of meals, I guess? We started with some hummus and baba ganoush which were both tasty (and we got refills of pita!) Then a round of soup for everyone. I got to try all 3 soups. The white bean was tomato based and tasty, but the least popular at our table (Mildly spicy). The lentil wasn't spicy at all and creamy and delicious. The yogurt soup was super spicy in a totally delicious way and was a hit at our table. Next, most of us ordered a combo platter of some sort (some with shish, some with gyro, some falafel, etc). Everything on my plate was awesome. I was a little disappointed that they didn't have doner available (wanted to try it due to the super reviews on here!) but it was still marinating. Bummer! (Next time)Our waitress was really sweet and attentive and brought us wine glasses for the champagne we brought to toast the b-day boy. Then she brought us some baklava with candles and started up the birthday song! It was really fun and we all felt really well cared for. I'm not sure if she hooked us up with a deal or what, but I paid for myself and the birthday boy and with tax and tip it came out to around 35 bucks (for 4 courses!) AWESOME. I felt like family here and it was a delicious, filling, and fun (and not expensive!) experience."], ["Jill L.", "The owner was extremely kind to my 2 year old son. That means a lot because I know 2 year olds can be annoying and messy!It's not the most, erm, swanky of atmospheres but whatever. It's cheap, the portions are plentiful and the service is great!!! I love it!"], ["Michelle B.", "One star for the owner being a nice lady. The other star is for the food being fresh. That's about all. The flavors are bland for Turkish food. Too much tahini in the eggplant and hummus made them taste bitter.  The pita is rubbery. The meat-- very dry. Clean space. Bare decor.Cleaning the floor while eating is not only unsanitary but bad for my allergy."], ["Boston B.", "Good dinner/lunch type food. Dinner for 2 big plate of rice (lots of rice) and meat coast $22.99 I think is good price."], ["Jen R.", "Good food. Ordered the house sampler, sampler appetizer, lentil soup, & white bean soup.  There was nothing i disliked.  Felt like eating at someone's home which was a very welcoming atmosphere. I thought it was a reliable family owned restaurant"], ["John S.", "I don't get why this place is not far more busy - they have great food, a friendly staff, and it's cheap. I've been here a couple times, and it is always tasty and cheap. This time I just came for a to-go order, 2 gyros. They were actually very custom, so to speak, since I wanted only certain things on each one and not othersm and some extras. I had one with just the meat, the lettuce, and cucumbers. And the other, mine, had the standard, minus tomatoes, plus feta, parsley, and a few other things. And sauce on the side for both.I had no problems at all, it was done quickly, and each gyro is only 5 bucks, normal price. It's also kind of huge for a gyro sandwich - it was very filling and if I'd gotten a side it would have been far too much food. The meat itself was flavorful and not dry at all, while the vegetables tasted fresh, the lettuce and onions crunchy as I like them.Overall, delicious and it makes me want to come back here more often. Small FYI, they don't take Amex."], ["Joe S.", "I have eaten here a few times and I have NEVER been disappointed. The chicken kabobs are my fave."], ["Hanna H.", "My husband and I love Istanbul! We get there about every three months or so and it's always been a great experience. We normally go on Saturdays at odd times so it's never been crowded. The hubs is a standard gyro guy and he says they are great! I sometimes get falafel sandwiches or Greek salads. Both of which are satisfying. I will say the Greek salad is one of the best I've ever had (close second to Euro Grille, which I'm not sure still exists).During our most recent visit, the waitress brought us samples of two soups to try and they were delicious! The hummus is fantastic and we always get an appetizer to share. Our son loves it! We may or may not always get baklava either to go or to eat in. I mean, why wouldn't you?! It's honey heaven!The atmosphere is very welcoming and friendly and it feels like you are just hanging out in a friend's living room. All this talk about it makes me want to go again now!"], ["Katya W.", "Absolutely yummy!! The owners treat you like family! The food is amazing! My husband and I had the gyro sandwiches, they were huge and yummy. We also had the lentil soup it was so creamy and earthy! They make their yogurt from scratch, yummy!! Also, their deserts are amazing!!"], ["Kevin M.", "For my first visit, a solid and delicious meal.  Starting with the white bean soup and Turkish tea, both of which were very good, the stage was properly set.  The Doner plate was excellent. Finding authentic Doner is a rarity and this offering is one of the best I've ever had.  Succulently tender and juicy, while being subtly spiced in a way that defies the detail of ingredients, but culminates in a unique symphony of flavor.   Looking forward to many return visits."], ["Rod O.", "Fantastic Doner! !! !!!!  The Owner told us this is the only Doner in Tennessee!  Real Doner is a rarity, this one is Excellent, Superb Flavor!  By the only Doner he may mean not only is he shaving the Meat loaf from a Vertical cooking rotisserie, after slicing thin stripes he takes the meat to the grill and sautes it with Olive Oil!  The Owner told us that is the real Turkish way to prepare this Incredible Meat!!!   All the Meats were enjoyable:  The Doner, Beef, and Gyro were my favorites!  The Chicken, Shrimp and Kofta were good, seasoned nicely... My next visit I will get the Doner Platter!!!!My Girlfriends Father who probably did not want to eat here was impressed with the Burger (said it was the best one he had eaten in quite a while) I tasted the Burger, it was good and wait until you see the photo, we guessed it was Half a Pound of Meat (I took a Photo)!I Love Turkish Tea, this one was Cinnamon and was Very Nice!Turkish Coffee, this one was GREAT!!!  Cardamom makes the difference! We got all three soups:  Lentil, White Bean and Yogurt.  The Yogurt was the spiciest dish of the meal.  All three had good flavor! The Desserts were good!  Better than the \"Greek\" versions!  I'm used to a Baklava with Pistachios, less syrup and maybe some Clove, still this was a good one!The Tabbouleh was good and the Baba Ganoush was Very Good!Our Server was great!  She and the Owner made us feel at home!"]], "Kebab Gyro": [["Hallie J.", "My mom and I both LOVE Mediterranean food.  This place is quite the hidden gem to us!!  We have been to various places such as; Fattoush, Tazikis, Kalamatas, and others but this is by far our new favorite place!!We were out shopping and got pretty hungry.  We were going to go to one of our favorite local places The Wild Hare (which I highly recommend) however, it was unfortunately closed.  We ventured further down white bridge road and saw this place and decided to give it a whirl.   We walked in and were instantly greeted with a warm welcome from the owner!  We looked at the menu for a minute before both of us deciding on the Greek Chicken salad.  We also ordered Grape leaves and falafel!All three were incredibly delicious!  The chicken was so tender & fresh!!  The falafel was freshly made warm and paired greatly with the yogurt sauce. The grapes leaves were also great (this being my first time to have both falafel and grape leaves, I was pleased as punch!)My mom and I have already deemed this our new go-to restaurant when we are in the mood for some Mediterranean food, and in the area of course.  I definitely recommend it!! (Also*** A father with his two young children came in while we were dining there and the owners changed the channel to Spongebob Square Pants for the children to watch, they were elated!)"], ["Fifi L.", "If the TV wasn't so loud and the cook wasn't on the phone as I was trying to order, I would've been charged correctly. I hate leaving reviews like this when I haven't even tried the food yet but...already bummed."], ["Megan S.", "Just moved to the neighborhood and was so excited to try the falafel (I'm a little picky when it comes to the flavor). Upon entering the restaurant I noticed that the TV was very loud, so loud that I could barely here the questions being asked about my food. The entire process was negative- the man barely put any toppings on my sandwich. Fried my fries until they were shriveled up and then even added fries to my sandwich- without my asking. I think the man literally made the sandwich how he wanted, and I felt too nervous (and deaf) to refute it. Just beware that you may not be able to hear to tell your order, and you might be made to feel like a nuisance. Guess I'm still looking for my neighborhood spot!"], ["Jason B.", "Kebab Gyro is a divey little place tucked into a back corner of a busy shopping center.  I really like this place, but its not mind blowing or exceptional when compared to similar gyro restaurants in the area.  The gyro platter is my favorite thing on the menu.  They are generous with the portion of meat, and the side salad light and refreshing.The owners pour their heart and soul into this place, and you can see with their return business and satisfied customers. This would be a great addition to your lunch rotation."], ["Brettan B.", "Love this place. Very well priced and authentically delicious food. I love the chicken (which is all white meat, unlike a lot of places), the tabbouleh, salads & gyros. I highly recommend this over the Mediterranean chains in the area! Plus, it's nice to support hardworking people who own small businesses like this."], ["R R.", "This is my favorite gyro place in town! Their fries are AMAZING as well. I would make an excuse to go to that part of town just to be able to stop by for lunch. The owners/workers are really nice."], ["Tracie R.", "There is no question, the best in Nashville! Don't judge a book by its cover. This place may not look fancy but your taste buds will disagree."], ["Katie I.", "one of the better \"fast food\" gyro places. guy is super nice and has been there forever. great hummus and gyros. rice could be a bit more authentic, but overall, pretty good and great for take out."], ["Michael L.", "I've been here a few times. The food had been good so far and the owners are really nice folks. I had the Gyros platter with tabbouleh and rice. The tabbouleh is really good here, but the star of the show is the spanakopita!  I can graze on that stuff all day long."], ["Michael M.", "My wife and I both got the gyro mediterranean salad.  It was great.  Enjoyed the service and even got to catch some soccer on the TV.  Will definitely be back."], ["Xian H.", "I'm a bit surprised at some of the less-than-satisfactory reviews that this place has received. My experiences here since my husband and I first discovered it back in 2009 have been, well, surprisingly good. For a nondescript Middle Eastern joint that shares strip mall space with a Radio Shack and J. Alexander's, I'd say that this place has done a good job standing out with it's fresh, well-executed Middle Eastern fare.PROS: The falafels are hands-down some of the best I've ever had. They are made to order, i.e., you can watch each of your falafels hand-patted and deep-fried with TLC. The gyros are also quite good. And I thought the guys behind the counter were pretty friendly. (Of course, they're not the world's best conversationalists, but heck, they've got falafels to make.)CONS: This is not a place you go for ambiance, so don't go expecting that."], ["Jason S.", "Wow! This place is pretty great. The staff (I imagine they are the owners too) is super friendly. The food is fresh and can be healthy too. I whole heartily recommend the quail its very delicious. The gyros are great too, and well priced. Be sure to get some grape leaves (dolmas), and the falafel is amazing. I Highly recommend this place!!!!!!!!!!"], ["Sissy D.", "After a few more trips to this place I had to change my review. Umm..the food is ok and seems fresh, but the staff is very rude. The main guy is kinda ok, but his flunkies are total A**'holes. They treat women like 2nd class citizens. They cannot understand what you want even if you point at the menu, and cannot make change or run the register, but they laugh and make fun of you if you mispronounce something. They messed up my whole order (ordered chicken, I got lamb which I will not eat), and when the main guy got back we told him my order was wrong he said, \"ohh, well yes sorry\" and went on. No refund, no new order, nothing. Don't support these rude people, go somewhere else where they know how to treat customers."], ["James E.", "Cheap, Authentic and homely.There certainly isn't much of an atmosphere and you notice it in the price.  However, I feel at home with Al-Jazeera blaring over Mediterranean men arguing over how to cook my chicken and wrap my grape leaves.Check out their home-made Tzatziki sauce.....Tis the Bomb."], ["Robert K.", "Kebab is a Chipotle style Mediterranean place.  I have only had the Gyro here, which was decent, but nothing too outstanding.  The lamb was nothing special, but the veggies tasted fresh.  It had a bit of a manufactured taste to it, kind of how a McDonalds burger tastes nothing like a burger!  The pita it came on was pretty good, though.  Also, my friend ordered a Falafel platter that was really good.  This is probably a good lunch place, but I  don't know if I would come here for dinner.  It is cheap, too!"]], "Kebab Gyros and Pita Bar": [["Calonda G.", "The food was really delicious and fast sufficient service. I was here on a business trip but plan on coming back with my family."], ["Bridget D.", "I've eaten at this place twice now.  First time I got the Falafel, which was pretty good. (I've had way better, but what do you expect in Nashville?) This time I got a salad. List price for the most basic house salad:$6.95.  Kinda pricey for lettuce and tomatoes, but I chose to add a protein to it and that raised it $2.95 higher. (It said it came with Kalamata olives.  They piled it high with black olives instead. blah. The taste of the food, otherwise, was good.  That is the only reason I came back.The gentleman who worked the assembly line to make my salad was Mr. GrumpyPants.  He never once looked me in the eye, nor did he raise his voice above mumble-level.  When I didn't hear one of his under-the-breath questions he got snippy with me.  \"Tabbouleh, YES.OR.NO...\" still never above a mumble. The gentlewoman behind the register,  Mrs. I-Have-No-Craps-To-Give, also had the inability to look customers in the face and spoke in a disinterested monotone usually only reserved to DMV employees. Sad.When I go to a restaurant, I like to be made to feel like I am a valued customer. Thank you for choosing our restaurant, ma'am, we hope you'll come back.  This one has made me feel like I was preventing the staff from having their Union Nap.  I probably won't be back. P.S. Turn on the AC!"], ["Lisa G.", "The food is NOT good enough for the price they charged me 9.97 for chicken and hummus with a side of cheese...when did the Greek spot start charging extra for feta???"], ["Tyler B.", "I came here for a Spanish Language and Culture Meetup group. Pros:1. It was quiet and there was a large table so we could all speak together and hear each other well. 2. It was clean. 3. Prices are good.Cons:1. It was FREEZING. I was literally shivering it was so cold. 2. My salad was kinda blah. It didn't have much flavor. 2. The only dressings they have are balsamic vinaigrette, ranch and Taziki sauce. I got the balsamic and Taziki, and they were very bland. The Taziki sauce was nothing like Taziki sauce. It tasted more like watered down ranch. I'd come here again if the group meets here again, but I wouldn't drive out of my way to come here on my own."], ["Linda B.", "The food is excellent and the staff have always been friendly.  Even when the line is long, they keep it moving quickly.  Brought my 18-month old here recently and she even enjoyed the gyro and hummus!"], ["Robert B.", "Anyone rating this place with less than 5 stars is eating the wrong thing, or needs to get their taste-buds checked out by a licensed Orthodontist!  This place hands down has the best Gyro's I've ever had...EVER.  I get a chicken gyro, with rice, tomato, onion, and lettuce, with some of that white ranch sauce.... CAN YOU SAY HEAVEN ON EARTH??? I've had Gyro sandwiches in many many states, and none can compare! I've been eating at this place well over 20 years... This place is a Nashville landmark. The fact that this place is able to stay in business for so many years in a DEAD location, next to an ABANDONED MALL shows that they have EXCELLENT FOOD that keeps people coming back!"], ["Debbie R.", "The food was good, the place seemed clean and the people were nice enough.I didn't like having to stand in line to pay with everyone else when I had called the order in. I also think I was overcharged. The menu board said $6.95, but she rang up $7.90. They were busy and I was in a hurry so I didn't hassle it. It's a nice change from the fast food around here, so I will go there again."], ["Courtney B.", "Hands down the best Greek food in Nashville. Lots of healthly options, not just your typical rice, meat, bread, ranch dressing kinda place. I usually get the greek salad with chicken or the chicken platter. The food is very fresh."], ["Suzie R.", "This is one of my go-to places in Nashville. I used to work around the corner and came here multiple times a week. Falafel is awesome, the tabbouleh is tastier than everywhere and that white sauce is ridiculous! I almost want to tell people not to come here because I don't want it overrun by tourists!"], ["Bruno S.", "There are a few Kebab Gyro's on here so hopefully this is the right location.  I'm not overall familiar with Nashville but we found this hole in the wall while driving in the downtown area. There is limited seating on not much of an atmosphere, and it looks like the locals were mostly sitting down for a quick lunch.Parking was hard to find so I ended up just pulling in and getting our food to-go. They had a good variety on their menu but yes it was mostly cafeteria style service. Definitely not a restaurant/dining in environment.  But I didn't mind it, actually was looking for somewhere quick.The FOOD: I ordered the gyro and it was delicious. Not your typical gyro. They cut the top of the pita bread and \"stuff\" the bread with meat and fillings of your choice. This was the best Gyro I've had in the South and beats a lot of them up North.This place is busy during lunch time and would not recommend eat-in. It is family owned and they were very friendly.I will definitely eat here again and do recommend it to anyone looking for a good Gyro."], ["Karen T.", "Looks can be deceiving, I didn't think this place would be that great based on the location and the looks from the outside, but the marinated chicken platter I had over rice pilaf and house salad was good, and a good deal for the amount of food.Good sign that there was a pretty good line of people from surrounding businesses; you know if the locals like a place, it is usually a good sign. The people were friendly and patient and make sure your order is correct."], ["Nickie G.", "So now that I work at MetroCenter it has come to my attention that there are a paucity of decent restaurants to try in the area.  In order to avoid fast food we went to Kebab Gyros.  It is located in a strip of places that includes Neely's BBQ - which smelled so freakin delicious I almost never made it into Kebab.So this place has no atmosphere whatsoever, so don't expect much in that respect.  Just a bunch of tables where people with limited time to eat can sit and grub down really quickly.  Also, the trashcans needed to be emptied and there were a ton of gnats flying around them.  Ew.  So don't expect it to be very clean either.  That being said...on to the food!So there will be a line at lunch time but it moves quickly so don't let that run you away (if the gnats haven't already ran you away, that is).  The menu includes gyro or chicken pitas, platters that include gyros, chicken, or combinations + rice and tabbouleh, or platters where you choose two specialty items (like hummus, greek orzo, tabbouleh, chickpea salad, etc).  They also have salad offerings.  I got the gyros platter.  The meat was plentiful and was pretty decent.  Liked the yogurt sauce to dip it in and the pita they served on the side was soft and fresh (might have been store bought, not sure, but was still good).  Price was $8ish for the platter plus a drink.  And drinks are serve yourself which is good because you can refill right before you leave to get some afternoon caffeine.  AND it is a Coke establishment so you don't have to drink crappy Pepsi instead.  Service is fast and efficient - no time for friendliness or banter here.Try Kebab Gyros if you are in the neighborhood and are looking for something different than the usual fast food!"], ["Janet S.", "Sit down place by the lake in Metro Center, outdoor patio, plenty of seating indoors, cafeteria style food.  Platters, sandwiches, wraps,  No better No worse than any of its type in Nashville, just simply getting away with it (sigh), beef/lamb mixed together, could not taste the difference, horrible tasteless rice, and the classic watered down ranch, chick pea salad was soggy.  Had no expectation and none were met.  $12 for lunch.  The possee I was with thought it was great."], ["C R.", "Good spot for a quick lunch in an area without many sit down restaurants. Good, not great, Mediterranean fare. Fresh ingredients and friendly people. You can get out for less than $10."]]}