{"Indian Queen Lounge & Bar": [], "Bawarchi Biryani Point": [["Hemanth L.", "Terrible service and average food. Bad attitude by the owner to add to the mediocrity.I ordered an Onion Chilli Uthappam for carry out and only realized that it was not fully cooked when I got home. At the restaurant,  I specifically asked for sambar and chutney with the Uthappam and he assured me that it had been packed. It was an error on my part as well not to check but again only realized when I got home. When I called the restaurant back,  the owner had the audacity to tell me that I should have checked. It's just a mom n pop store where people with no experience on how to run a restaurant are the ones running it. Stay away from here if you don't care about service."], ["Jami W.", "Really good food.  Since the menu is extensive and a line was forming behind us, we asked the owner for suggestions.  We ended up with the boneless chicken biryani, goat palak, and either chicken 65 or chicken 555, I'm not sure. The chicken in the biryani was tender and delicious, a little spicy.  It came with a yogurt sauce that really amped it up.  The goat in the palak was tender like a slow roasted pork shoulder.  It was the spiciest (heat) of the three.  Then there was the chicken 65 or 555.  Wow.  We couldn't stop eating even though we were stuffed.  A little naan made our big lunch complete."], ["Michele S.", "5 stars for tasty food. Minus 2 for very bad service. I got my food in an appropriate time frame. But it took asking twice for husbands dish and after a total of 20minutes they went again to the back, and brought back some appetizers to appease him. Order came in another 5.The table behind us had several errors on their order.That said, food WAS good. If they get their act together on service , we'll be back.Fast food environment."], ["Vikram P.", "Opt this restaurant only ******* if you want to eat Biryani. the Chicken, Goat and Veg Biryani is  **** not good **** it's dry and not like it used to be. probably I assume that the cook has been changed because the taste is not consistent. the Fish and Shrimp Biryani is good as they come with the extra masala that keeps it not dry and is more tasty. believe me though it is a little spicy there is no harm in eating it. that's how an authentic Biryani is supposed to be (Fish and Shrimp Biryani). Also do not eat Idly, vada dosa etc. this place is only for Biryani and not authentic for breakfast items. eat only Biryani and other non veg dishes.I was not happy with my last visit. the goat and chicken were not at all good. upon complaining they gave my money back on the table very unprofessional. Small change, the chicken Biryani comes in different varieties. The boneless chicken Biryani is good. And the daily special are good.note to the restaurant - please improve on goat, veg and chicken Biryani. they are just not up to the mark.I am a Biryani lover and I know what is authentic."], ["Jackson H.", "I come here when work is over and I just want to slow down, drink a beer, and eat some good food. I could see that this may not be the place for someone In a hurry, but that doesn't bother me. This is my favorite Indian place around, and there are some good curry shops around. It is true, the wait is not short (but it's not THAT long either), and it can be a little pricy. But the service is great, the people are wonderfully kind, and the food is beyond delicious."], ["Ashok P.", "This place is absolutely new and inexperienced Thay don't have naanI mean who doesn't have naan Very disappointing"], ["Crabby O.", "Let's start with the obvious here. Whoever is running this restaurant must be a rookie. The place is complete chaos both behind the counter and in the dining room. They have far too many tables crammed into this place. For example you have a slow-moving fast-casual line, a cashier to the left and then guess where the drink fountain is - of course to the right of the customer line. They have a variable menu, not a problem. The have a printed menu that is apparently meaningless, problem. The variable menu scrawled in small print on a neon markerboard (looks like something you would see behind the bar at a frat house announcing the next intramural soccer game time), problem. Said markerboard is in a place where it hard to see from where you order, problem. Said markerboard has obnoxious feature to flash rapidly in different colors - yep you guessed it they had that \"feature\" enabled. big problem.The biryani indeed had some interesting flavors but was grossly over-salted and had very few vegetables in it. For a place that is touted as authentic I was shocked to taste MSG in all the dishes. Pakora was burnt to a crisp - should not have been served at all. Meat dishes again had some nice flavors but were all gravy and contained about 2oz of meat."], ["BILLY W.", "Disappointing. The naan bread was reconstituted frozen. Tikka masala and paneer were substandard. Slow service. Unauthentic in every way except for the personnel. I will not return."], ["Mary F.", "The arrival in Franklin of the first Indian food chains that I know of. Bawarchi Group's website states that there are 15 restaurants in the Midwest. See their website at bawarchirestaurants.com/…This is Indian fast food. Counter service with numbers that you display at your table and the food is delivered as it's ready. Dhum Biriyani from Hyderabad is their specialty.  We didn't try it on this visit--nuts are bad for my boys. Bawarchi uses nuts and eggs that our boys can't eat. So sad for us. It restricts a lot of our choices. For this visit, they sweetly made a giant Dosa with cheese for my little one. An Indian grilled cheese. Delicious, crispy and hot. My older son had spicy Tawa fish fry--not their greatest dish--the fish seemed a bit soggy. It wasn't really deep fried like you might think; instead it was pan fried with a crust of spice that wasn't very crispy.  The Uttapam (a rice/lentil pancake bread) was crispy, savory and delicious, with minced red onion. I had a mutton pepper fry that was very spicy-great for me. I love it hot. Authentic with lots of bones--I think this can turn off the local crowd b/c we are used to getting lots of meat-not bones. My husband had a goat curry. It was served with a side of chapatis. Very tasty. All in all, lots of savory spiciness. Great selection of Dosas and we'll be back to try those. The generous use of nuts here will ensure that with our family nut allergies, we will be eating with a side of frisson, but we will stay on the Dosa straight and narrow. They've only been here 6 weeks!  Wow. The kitchen is doing a great job turning out tasty food. The order taking and food delivery is still getting organized, so you'll have to be patient. The flat note was the whole fried jalapeños. They were covered with a thick hard batter.  Never had this before so not sure whether this was supposed to be that hard texture or not. A tip:  Try the Dosas. They turn these out quickly. We've only tried one so far but the texture was excellent. High notes:  Kingfisher and Taj Indian beers. Three stars for now b/c they're still getting organized and I need to visit a few more times and try other offerings on the menu. I look forward to them getting their machine well oiled but would recommend them for their Dosas and at least their Mutton pepper fry--especially for you chili heads out there."], ["Brijen P.", "Food was amazing! The owner is really helpful in suggesting what to order. He's very friendly and keeps a great atmosphere there. Will definitely be going back!"], ["Ryan S.", "Food was quite tasteful. Comfortable environment and the staff & owners were very friendly and welcoming.  I look forward in returning again very soon."], ["David S.", "I come to a restaurant for its food. Service is a necessity, but has to be really bad to turn me away. This restaurant is part of a chain. It's a small storefront, so you know what you're walking into. Service isn't going to be on par with a larger restaurant. Still, service was excellent on my visit. The staff were cheerful, helpful,  and knowledgeable. All wins.The food? The tikka was delightful. Warmly spiced and just enough to make my nose run. I'll visit again."], ["Sally R.", "Had a lunch date with my husband here. LOVE IT! Ordered the Goat Khorma mild with a mango lassi to chase it down. Delish!!! Service was excellent. :)"], ["Graham M.", "The food is delicious, and authentic southern Indian.The service is slow because they are not used to running a restaurant.Give this place time and the service will get better.Go here and order the Chicken Dum Biryani, and get chai to drink.Fresh spices, and deep flavors. Trust me"], ["Craig W.", "I really enjoy going to Bawarchi for a quick lunch! My favorite is the chicken biryani because the chicken is always tender, the spices that are used are traditional indian spices, and the aroma from everything blending together is delightful! The staff is always friendly and punctual. I really enjoy dining on the patio too! I highly recommend Bawarchi for a traditional indian meal."], ["Sklyer G.", "While on vacation I was craving some Indian food and decided to go to Bawarchi Biryani Point. All I can say is amazing. The food was very delicious and their Mango Lassi was to die for, it was so smooth and creamy. Customer service was nice and very helpful. I definitely recommend this restaurant."], ["Dougie C.", "Went for lunch....ok the service was slow ish.... But the food was FIRST CLASS!I'm a curry holic, I make no apologies for that, and try any Indian restaurant I see and this ones food is good. Spicy, tasty and plenty of it! And great value. Definitely will come back!"], ["Doug L.", "The menu board was hard to read and unless you know Indian food good luck knowing what your ordering. The lady at the counter was very friendly and helpful and made the ordering process easier. I had the chili chicken and loved the heat and flavor. My wife got the chicken tikka masala which she very much enjoyed. The wife also like the mango lassi. Im sure we'll be back to try some more dishes."], ["Kara R.", "My husband & I love the biryani here!  I work in Franklin & love being able to place an order online to grab on my way home - very convenient.  Service:  When I arrived to pick up my food, it was ready  & waiting to be bagged.  The man working the counter had noticed that I specified names on my order, one shrimp biryani & one boneless chicken biryani, & was waiting to ask if I wanted them placed in a separate bag in case I indicated names because of an allergy.  I was pleasantly surprised that he had picked up on such a small detail because this is in fact the case.  Very impressed with customer service!Food:  My husband served in the Middle East, living close to locals, and became accustomed to this type of food, so he loves to find a good biryani.  After recently moving from Chicago, he's been searching & has declared this his favorite!  The food was excellent!  The biryani has large portions with the perfect amount of heat and spice.  The shrimp order had an amazing amount of shrimp too!  Overall, we were very pleased with our to-go order and will be returning."], ["Chris H.", "5 star quality food. 1 star speed of service. Don't go here if you are pressed for time. I am waiting over an hour for two orders of chicken tiki masala. Just plain unacceptable. Unfortunately this place probably won't be open long, as good as their food is. I could have gone home and cooked the food they made in half the time from scratch."]], "India Grill Halal Restaurant": [["Martin D.", "This location was an puerto rican establishment before and its not a very great location. small establishment like these, I will support it and help give them some exposure.  A typical indian restaurant, would not call it an restaurant, but they do have the set up for at least 20 people or more.  Food is great so far, but they do not have an machine to make naan, which is the bloodline of everything they do.  They have instead, a bread called \"Dal puree which has yellow powder lentil inside of the bread, pretty tasty and they give you a small plate of onions, cucumbers and hot peppers and it can be eaten anytime, a great light lunch on the go.  I have tried their chicken tikka masala and they do an decent job with the taste.  Lamb curry is something i am finally trying, will update this as soon as I can.  If you are near this place, i would recommend to give them a chance.   The service is not urgent with them but hopefully things can be hasted once they see more customers come to this eatery."]], "Shagor Indian Cuisine": [["Diane H.", "We have been a few times to Shagor. We've only gone on Sundays for the buffet, that way we can try numerous dishes. FOOD IS AMAZING!! Very authentic, fresh, homemade food. The bread that they serve with the buffet is crazy good!! The owner  Sam is super nice. If your going for the decor, pick a new place to go!! The atmosphere is very low key. The food gets all the attention!! As it should!We just found out yesterday...THEY DELIVER!! Knowing that could get dangerous!!"], ["Eric N.", "Every Saturday there is a all you can eat Indian buffet for only $9.99. As you open the door the waft of mouth watering spices hits you in the face. The food is made fresh, well spiced and big portion. I make it a routine to come here every Saturday for a wonderful meal."], ["Manish B.", "Ordered Chicken Biryani and found a roach in the Biryani, Roaches were found all around the place, table, chair, walls... it was terrible experience, the person at the cash counter was throwing roaches on the floor and was serving food with the same hands."], ["Russell M.", "The absolute best food ever. I eat there at least once a week. If you haven't tried Shagor you are missing out."], ["Eric Y.", "I come here every Saturday and has become a tradition. I love the flavor and is always a great experience. I have brought my family and friends and would recommend to everyone."], ["Linnie T.", "Great authentic Indian cuisine! The flip side is it took more than an hour for my food to come out which took a star out for me. They need to hire more helpers and provide a tad bit speedier service and this place will get busier for sure."], ["Anthony P.", "Ate here a couple of weeks ago and we really really enjoyed it. The waitress was immensely helpful in answering all of our many questions. Everything had richly wonderful flavor and was very fresh. I'm not normally a lamb guy. And I've had lamb off and on throughout the years prepared in places where they knew their lamb. I do very much like lamb/beef burgers and gyro meat. But roasted lamb? Not so much... anyway... based on recommendation, I cautiously ordered a menu item that among other things included a lamb dish and I ended up loving it. My significant other had never before tried Indian cuisine and she greatly enjoyed the experience. We'll be back."], ["Heather R.", "Some of the best Indian food I've ever eaten. I usually don't eat naan but I do here; it's delicious! I haven't tried the buffet yet, but items from the menu are great. It took a while to get our meal, but it was cooked fresh and the wait was totally worth it. We can't wait to go back."], ["Bryan L.", "Best Indian food in Mt. Juliet!!!I really enjoy the vegetarian options. I'vetried several items off of the menu and have loved everything i've tried so far. Get some Naan!!!!"], ["Leah J.", "My boyfriend and I came here on a Sunday. When we arrived there were about 4 other tables and a buffet set up that looked like the food had been there a while. We didn't see a server so we stood for a couple minutes until one came from the back. It took us about 30 minutes to get our stuffed naan and about 15 more for our food which did arrive hot and was tasty. However, with the lack of music or ambiance the wait was just awkward and very poor service  I won't be back."], ["Rakhee V.", "Although this place is not crowded, we love it because they personalise each dish to your requirement and made fresh.... Best dishes that we have had are veg biryani, paneer makhani, dal makhani and tomato soup... naans are also good... rice that comes with sides is good too.... the biryani was almost like the one that you would cook at home :)"], ["Nicole A.", "My husband and I opted for a nice quite restaurant on a Saturday night.  I have ate Indian food for lunch quite a few times with coworkers, however, my husband has never had it.  I was definitely looking forward to some Naan, however they were out of it which I thought was a little strange.  My husband ordered the meat combo meal and I ordered the fish combo meal and they were out of lamb.  I enjoyed my meal but my husband did not.  I was disappointed that certain items were not available on the menu."], ["Khena K.", "I'm confused about the other reviews here. Most say they liked the food but only gave it 2 stars. Doesn't make sense.My wife and I love Indian food and have tried every Indian restaurant in Nashville. Shalimar has always been our favorite, but it's far and a bit expensive. In comparison, Sitar is gross!I've lived in Europe, Chicago, NY, LA, and have eaten traditional Indian food a lot in my life, so I know good from bad Indian food.When we moved to Mt. Juliet, we were happy to see this place open, but a bit skeptical, as the building looks like an old pizza place (which it was). When you walk in, it's as if you stepped in the Twilight Zone. The place is charming, well decorated, linens on every table, and romantic atmosphere. The food is absolutely amazing! We've been there a dozen times since, and it's been consistently the same. How often can you say that of any restaurant. Big portions, great taste, and lots of options. They give you the option of mild (not spicy at all), medium, and hot which is great depending on what you like (I like mild, my wife like spicy).I couldn't recommend a better place for genuine Indian food in Nashville.Thought we needed to post a review because we would be devastated if this place closed because of lack of business, as it is our favorite place to eat."], ["L C.", "Had a chance to try Shagor's food. It was pretty good! Compared to other Indian restaurants that I've enjoyed, theirs is not as spicy or flavorful. You do get a lot for a small price though! Service was quick and friendly. I had the veggie samosas and curry. The samosas are large and filling. They could just use a little more spice as normally expected with this type of cuisine. The saffron rice was light and fluffy and went well with the curry! It was a little hard to find and the sign is a bit dim, but now that I know where it is, I will go back again."], ["Melissa C.", "The food here is yummy! =) I definitely recommend it! Definitely try the onion Bhaji!"], ["T M.", "I'm going to have to disagree with most of the other reviewers. Perhaps their reviews have led to positive changes at Shagor-tonight was our first visit. We found the food quite good. Not world class perhaps, but as good as or better than several places I've been to in Nashville--and I love Indian food and am a complete food snob.The portions are not massive, which I personally appreciate. I tire of restaurants that serve huge portions in dishes that could be used to feed farm animals. And yes, the prices are a little higher than other Indian restaurants I've been to, but I didn't feel overcharged for the quality or quantity of the food.My husband ordered his food spicy and it was. Not \"crank up the defibrillator, Alice\" hot, but hot enough for him to comment on how spicy it was, and he really likes spicy foods.The naan was awesome, as was the papadum. The mint chutney was so good if there was more of it I would have eaten it with a spoon. I had salmon cooked tandoor style and it was quite good and my husband had some saucy chicken thing that he was very pleased with. They brought us complementary vegetables that were perfectly cooked and in a delectable brown sauce.Shagor is nicely decorated and the man who served us was very pleasant; though English is clearly his second language which may account for some of the misunderstandings mentioned in other reviews. Our bill accurately reflected what we ordered.We will definitely be back."], ["Tracey W.", "I had the Zalfrazi, my wife the Rogan Josh.  The food was excellent and the portions generous.  Masala Kulcha bread is divine.I've eaten take-away from here before and will visit again to dine-in as we did tonight."], ["T L.", "I quite enjoyed it. We generally avoid chain restaurants and are glad to have this little gem in our back yard. We'll definitely be headed back. Overall the food was good. My lamb was quite good. Very tender and flavorful. The chicken tikka masalla was also quite good. My only complaint was the naan. It was good but not the usual crispy chewy goodness I was craving on the way there."], ["Tiffany S.", "Shagor, although located out in the middle of nowhere (aka Mount Juliet), it's not a bad little Indian shop. I've only ever eaten Indian cuisine in Nashville, and since this place moved in not but half a mile from my home, I had to give it a try. The lunch buffet is very good and they serve just about everything on the buffet as they do at dinner so you're not gonna miss a thing. For takeout, I always get the combo of Chicken Tikka Massala with the Sagg Paneer and some samosas and onion bhaji for appetizers. Can't go wrong!The only set back for this little place is they go through wait staff like no one's business, and at times the wait staff has been a bit inexperienced serving Indian food. Oh, and it's out in the middle of nowhere. However, if you really want to try a new Indian place and maybe watch a little Bollywood on the tube, this is a good place to come to (if you're up for a drive.)"], ["Ceile G.", "It's the closest Indian restaurant to my house. Wonderful food. Love the white linen napkins and tablecloths. I only wish that there was a name tag at the buffet with ingredients. Manangement is nice. Also nice is that you may bring your own wine with no uncorking fee."]], "Taj Indian Restaurant": [["Cammie B.", "Had a great dinner, Tadaka Dahl, Mali Kofta, and Tiki Masala. All dishes were fresh and hot. Our service was good as well, great guidance!"], ["Carey James B.", "Still a five star Indian experience!The people that work here are very kind and friendly.They have lamb and goat dishes that are great!The chicken was not dry. Great stuff!"], ["Julie M.", "Absolutely love this place. Their Lamb nargisi is so savory and sweet and just plain awesome. My boyfriend and I love to order take out from Here and eat in. The food is always perfect and the service is friendly.  If you go as a male-female couple... expect the man to pay.  They always hand the check to the man and look at you funny if the woman pays. We think it's a cultural custom for Indians and Pakistanis."], ["Mia R.", "So far, the best Indian food we've had in Nashville.  Food arrived freshly prepared and piping hot.  Naan was light and delicious.  Service was excellent.  Will definitely dine there again soon."], ["Anna M.", "Taj is my new favorite Indian restaurant in Nashville!! Previously, Sitar was my jam until a night of food poisoning ended that love affair. We have visited Woodlands and Bombay Palace without returning to either.  My husband and I visited Taj last night for the first time and were very impressed. Not only is it conveniently 2 miles from our house but it is the best and cheapest Indian restaurant we have gone to. The condiment/chutney trio they bring out as an appetizer is delicious. I used the chutneys with the rest of my meal. We both ordered a mango lassi and we split the Mixed Appetizer for Two which consisted of veggie samosas and a variety of pakoras. Before we were finished with our appetizers, our entrees arrived - very quick and diligent service! My husband had the Paneer Masala and I had the Kashmiri Dum Aloo: potatoes stuffed with cheese simmered in a creamy tomato sauce. Ahh so divine! Of course we had some garlic naan along with our meal. We had plenty of leftovers (for breakfast the next day!) and I can't wait to return! Oh wait, this whole meal was $40.09?!"], ["Shruti S.", "Love the food here!!! Authentic and fresh!The kebabs need to improve though.. Need more marination! Good over all"], ["Cassie S.", "Do not be fooled by the location or outside appearances.  This place is incredible.  Easily the best Indian food we've had in Nashville.The buffet was great.  Variety of dishes - vegetarian, chicken, lamb, and goat.  Also dishes from different regions, which is nice.  The breads were of course wonderful.Price (at least for the buffet) is definitely reasonable for the amount and quality of the food.  It's a bit out of the way for me, but I'm sure I'll be back!"], ["Ocean S.", "This place is a diamond!! Not only is the food amazing , but the service is great too. If you get the buffet or order off the menu, you will not be sorry. Try the coconut soup. It's my favorite :)"], ["Sharon M.", "This is our 2nd trip to Nashville and we tried two different Indian restaurants during our first trip which was really nothing great and unfortunately could not remember the name of the restaurant. However, this time we tried Taj and the food was really good. I absolutely loved the chicken kurma and goat curry. Lenthils and sambar was awesome too. Will definitely go back if we come to Nashville again."], ["Tommy M.", "Great Indian food! New favorite beating out Sitar. Naan was superb. Service great an friendly. Has lunch buffet, but ordered off menu. Large portions. Lamb very tender and tasty."], ["Jenn Z.", "A girl friend and I met for lunch here during the work week, we were the first anxious customers in the door at 11am for the lunch buffet. The service is very attentive and we were not disappointed to discover a spread of freshly prepared dishes, most were made with either chicken or were vegetarian and all of them were flavorful. On my second visit there were more lamb dishes, which was disappointing for me since I don't eat lamb, but every thing else was still delicious. The service is good and it appears to be a popular spot for lunch as it continued to fill up through lunch hour. If I were well versed in Indian cuisine I might be able to share the names of the various items available, however I'm not, so I can only say they appeared very traditional and were complex in flavor. If you aren't one who is familiar with the wide array of Indian dishes, you may be intimated by the selections which aren't always clearly labeled. However if you're adventurous and love good food, go for it! My only wish is that they offered a bit more dishes to choose from, but this is a small place and given the array of flavors it's certainly worth the $10 per person and a nice break from the usual choices in this area."], ["Steven S.", "Maybe I just don't get it. Or maybe there's a lot of bandwagon reviews here. Or maybe it's just really not that great. If this is the best Indian restaurant in Nashville, then all the other Indian food that I like must not really be Indian. The service was cheerful and friendly, but the buffet left much to be desired. Lack of variety, lack of the most popular Indian dishes, and a complete lack of flavor in what was there. I seriously might as well have just had some wet basmati rice."], ["Ronette T.", "This is easily a 5 star restaurant the food & service overly exceeded my expectations. The atmosphere was laid back & comfortable. I cant wait to come back for the buffett"], ["Shay G.", "Checked out this place today and were not disappointed!  Delicious food, nice atmosphere and good service.  Garlic naan was awesome.We shared the Tandoor Mix and Chicken Tikki Masala and both were awesome.  Highly recommend!!!!"], ["Carolyn F.", "This place never disappoints. We usually call in now and pick up. Fast courteous service and great food."], ["Trish H.", "Definitely the best indian food in Nashville. Can't recall the names of the dishes but everything I've had here has been great, especially the lamb and the garlic naan. Great service and friendly waiters. Been telling all of my friends about this place!"], ["Abbey H.", "I can't say enough good things about this place. Try everything. Go back and try it all again. I have never disliked something from their menu, and I love all of the employees."], ["George L.", "We just had the buffet on a Saturday, but it was great.  The sauces were not overspiced, and the naan was plentiful.  As others have said, more poofy than normal but still light.  We have a child with a dairy allergy and the staff was very helpful in pointing out which dishes in the buffet line were safe for him.  I'd love to go back and try dishes off the menu next time.  I'm fairly confident that they are all good."], ["William R.", "This place is great! I would highly recommend it! The food was great! Service was extremely friendly and the value was wonderful!"], ["Anthony G.", "We were in Nashville for a day and craved Indian food.  Well, not only there is an Indian restaurant in Nashville, it is a fantastic one.  The menu is huge, and among other things they do feature an Achari curry - one of my favorites and a rare find.  It was delicious, as well as rogan josh.  Portion size was very generous.  Garlic naan was one of the best I've tried, even though they should really cut it in pieces.The interior design looks very elegant and upscale, and the place is very clean and nice."]], "Bombay Palace": [], "Bombay Bistro": [], "Swagruha Fine Indian Cuisine": [["Lihua S.", "There are few things more comforting than a crispy dosa and fluffy idli dunked in coconut chutney and sambar. It's not delicate or refined, but I wouldn't want it any other way."], ["Beth G.", "I don't understand why not rated more? It is always busy and always good and for walk up Indian with two entrees and rice with soap for 9 dollars a great deal. It is spicier than others but it is a walk up so you can't decide spices. I like the pakora but Indian friend said it was store bought. Whatever someone cooked it for me. People are nice and line moves fast. One of my favorite places at nfm."], ["James S.", "I never really understood Indian food until an Indian friend took me here, which is in the food court at the Nashville Farmer's Market. Everything is covered in a lot of sauce that you soak up with rice and bread. Ordering is like at a walk-up Chinese place --  pick a rice and two entrees and they'll plop some crisp flatbread on top. The two mild entrees were Tiki Masala (the one Indian dish that I know) and a nearly identical dish of chicken in a creamy tomato sauce. I would've preferred more variety, so next time I'll get a vegetable instead of a second entree. I really liked the food, and it had great flavor even though it was the mild version. And whenever I come here, I get inspired to go to the Indian grocery store in the food court."], ["James M.", "Best naan I've had from any Indian place in Nashville and I love Indian food! Their curries and veggie options are always pretty interesting to try. It's served cafeteria style and they generally always keep the same options on the menu. While I've had better curries and certainly had better rice, this place in the farmer's market is a fantastic option for lunch and a good value. Try the veggie options! Those have always been the most flavorful to me."], ["Emmanuel K.", "I've been coming here for years and the food is always on point, spicy as you like it, and very delicious. I get more than full coming here."], ["Samantha S.", "I'm glad I did not read these reviews before I tried Swagruha.  I'm so guilty of reading bad reviews and then never going to a restaurant.  This tiny little food spot is located in the Nashville Farmers Market.  Is it the best restaurant located there?  Not quite.  But where else can you go get chicken tikka masala x2 (you can pick 2 different entrees but I always double up), rice, naan bread and a drink for $7 total?Swagruha is a great option for a super fast and cheap Indian chow down."], ["Paul K.", "I gave it a second chance. I'm going to say I now have no reason to contemplate returning again. I'll stress the food is not terrible, but it's neither plentiful nor a great bargain to make up for it.While in line, a large foreign object (Dr pepper can?) fell into one of their heating buckets, splashing what I think was chicken-based juices across every container... they pulled it out, and resumed... ok, I'll buy an unwashed Dr Pepper can isn't going to kill me regardless of what the internet freaks say, and even as a vegetarian a little chicken juice in everything by accident isn't going to drive me to insanity, but cross-container contamination does ride my goats.They ran out of veggie rice before I got my order in... I asked the woman if she had any more veggie rice and she said yes, I said I would have some veggie rice and... and she turned and walked away while I was speaking so I just kept talking \"I guess the rest of my order will get heard when you get back\" ok random sassy woman, not cool.Rest of my order got plopped onto the plate, I paid and left and realized the plate was actually pretty light... ok, whatever... the food was not-quite flavorless, again... oh, it had one spice, and that was burn. The veggie korma was ok but meh...sad, felt like it was undercooked and overcooked at the same time.I got done eating a $7 plate of food there and thought \"what the hell, I'm still hungry\" - I'll point out I was not horribly hungry when I went there.A bit later (friends had been waiting on food trucks and finally gave up to get food inside) I'm sitting with friends, one of which went there also, specifically stated she could not handle hot, was assured whatever she was getting was mildly spiced... rrr no. Plate of hot by US standards food abandoned.I started thinking, most of the Indian places I go are buffets, they've got their things, you get a plate of food, maybe you can eat two plates, it's $8-10. You walk away, it's food coma time. I know this isn't a buffet, but the food tasted like it was from the Shoney's of Indian cuisine, there wasn't a whole lot of it, there was splatter and bleh...I'm just not impressed. I've been to enough Indian joints to figure out an average, and this isn't quite to average levels based on the other places available."], ["joyce g.", "One word. Dosa.Best in the city. Get the masala dosa. Seriously, it'll rock your world."], ["Tim A.", "The best features about Swagruha are the value and the friendliness. Both employees smiled the whole way down the line, and the guy gave me a full two bucks back after I paid with a ten dollar bill for a total of $8.18. While I would still put the rice into the \"cheap\" category, I thought it was pretty good by food court rice standards. Seeing no vindaloo available, I opted for the two \"wuss\" curries: tikka masala and butter chicken.  They were both okay, but a little bland for my taste. Usually, when I go for Indian food, I'm there because I'm looking for in-your-face flavor. That doesn't mean it has to be spicy; I really enjoy a good tikka masala. This was just okay."], ["Kim Y.", "Swagruha - its like an American buffet (but not American or a buffet). I say that because you get a TON of food for less than $7 and quickly. So, price wise it is most definitely a value, unfortunately the food was not that great.The bread had good buttery flavor but was too chewy. The chicken literally still had gristle and two HUGE pieces of bone in it (keep in mind this was a typical chopped chicken in a sauce dish, not tandoori or anything).Here is the kicker. I am a girl who slathers a lot of my food in Sriracha, puts a a few dots of Daves Insanity in her Chili, etc. I love hot food. But all you could taste here was 'OMG - HOT' pretty much deflating any other subtle flavors or nuances Indian food usually has. It was like the Princes of Indian cuisine. SAD FACE! I kept biting into big chunks of hot pepper in my rice. Yuck.The chana masala was alright, but the sauce was very thin and watery not really letting the 'yum' coat the beans. Let down. Eat at any other place in the farmers market! You could also run around the international market and make your own ;)"], ["Janet S.", "Third choice as Bella was a 25 min wait and noolys had sold out of shrimp and grits.Veggie Korma and matter paneer with rice for $7.00.  Not like any Korma I know but OK.  Matter paneer quite tasty.  Rice blah, donut dessert, sticky gooey and tasty.This is my 4th time here and it never gets any better, come on guys make an effort."], ["Westnashy Y.", "I like the hot dishes, like the goat curry. native heat, will take wallpaper off the wall"], ["RShan S.", "I am a travel ling IT consultant and have been traveling on a regular basis for more than 5 years. Swagruha Fine Indian Cuisine  is one of the best Indian restaurants that I have eaten in.This restaurant is part of the food court and is ONLY open for lunch. The combo plate only cost $7 and comes with Vegetable rice  / Biriyani plus two curry (veg / non-veg) and naan with raita. Not to forget the Goat Curry and Veg Dhaal is Awesome and outstanding!The waitress also identifies high spice versions of Goat and Chicken so that foreigne origin people are cautious when picking the items for the comboThe restaurant food taste very much like home cooked Indian food and is very tasty. In addition, you do NOT have any heavy food symptoms like bloated stomach and discomfort which usually happens after having spicy food.If you are visiting or travelling to Nashville on business, you should checkout this place for lunch!Cheers!Rama (Atlanta GA)"], ["Piyush S.", "Ok Guys. I went to this place as it had rave reviews on yelp. I was so so dissapointed. I ordered butter chicken and they give you 2 sides along with Rice and Roti. The butter chicken was the worst I have tasted in my life. I would say it was not even butter chicken. It was chicken butchered by mike tyson and cooked by Hulk Hogan. The sides dishes - Paneer Mutter was equally bad. The only saving grace was the dal which I must say was really good.I am definitely not going to this place again. After the meal I went to the next door bbq and ate some decent ribs. Skip it and got to the bbq, creole, jamaican restaurants in farmers market instead of swagruha. But if you are one of those who has not tasted good indian food, you may like it. god bless you guys."], ["Harish M.", "Delicious South Indian food (Dosa, Idli, Chutney, Sambar are awesome)!"], ["Jamie A.", "Was it the best Indian food I have had?  No.  Was it well seasoned, tasty and an insanely good deal?  Absolutely!Mattar Paneer was tasty, but the peas were a little firm.  Butter chicken was decent.  My favorite was the chili chicken.  Nice and spicy.  The flavor came through the heat.  My boyfriend made fun of me as my face was sweating...So yeah...2 curries, 1 meat, rice, naan, raita and a can of soda for a little over $7.  Winner!"], ["Justin E.", "So, I ordered, at the urging of my sidekick, the Masala Dosa. As other reviewers have said, it is about a 10-15 minute wait. This was my first taste of Dosa. The taste and texture were perfect. The slight crunch on the dosa with the delicious filling satisfied and comafied.The paneer matar was passable. However, do not look past the Masala Dosa. You cannot miss the Masala Dosa.Finally, a nod to the nicely done Gulab Jamun for dessert.A nice plus is getting to wander the Nasvhille Farmer's Market before and after enjoying your Dosa."], ["Wayne H.", "Okay...so it isn't the best tasting Indian food in the world. That said however it is amazingly cheap, about $7 for rice, two meat or veggie dishes, naan bread and a drink.  The plate of vegetable rice is nothing special, but a nice exotic change of pace for someone raised on white rice.  The chicken dishes, Tikka Masala and butter chicken are a bit on the watery side, but the Mattar paneer and the lentils dishes are nice, thick with veggies and spicy. As people have complained, the naan is generally quite buttery, but works well as a soak for the chicken dishes. Some homemade Lassi usually rounds out a meal here for me.  Evidently I like to torture my taste buds, but I love the spiciness here, which ranges somewhere between restaurant \"extra hot\" and \"native Thai\". The family that runs this restaurant are friendly and helpful and open to exceptions and concerns.  In sum this is a nice place to go when I'm in need of a quick Indian food fix or  low on money (or both).  This is strong, spicy comfort food for me, and I appreciate its presence at the Farmer's Market."], ["Joy S.", "Possibly the best Indian this westerner has sampled.  There was a time when the owner(s) mentioned that they may be opening a sit down location, but that never seemed to have moved forward.  I'd go every day.  Now, when I visit any other Indian establishment in Nashville besides here, the results, while pleasant, cannot compare Swagruha.  Fiery, aromatic, rich, curry sauces, and to die for naan bread, charred to perfection.  Highly recommended. And like other reviewers have said, this place is a bargain."], ["Uma S.", "I always order the special Masala Dosa plate. It is about a 15 minute wait but completely worth it! The dosa plate gets you one large masala dosa, 2 idlis, green chutney, ginger chutney, sambar and desert.I recently tried the chicken biryani, it was well seasoned and completely hit the spot.I would happily go back for the biryani everyday."], ["Art Q.", "I am close to giving this place three stars, but there are just too many other Indian restaurants in Nashville that are better. The food actually tastes pretty good, and the  chicken and goat curries are things other Indian places don't seem to have. But it's all pretty spicy, and that's not my thing. Also, it's a pretty limited selection. If you're in the farmers market and in the mood for Indian fare, go for it."], ["Howard L.", "Rice is not that great but the curries are decent and it's cheap. I'm giving this place 4 stars for their vegetable samosa. I can't eat enough of them and they're only a buck each."], ["P N.", "I always think about buffets when it comes to Indian Food for lunch.  This place is surprisingly convenient and delicious.  This family cooks in the spicy Andhra fashion and be prepared for a kick.  My favorite dishes are the goat curry and the peas and cheese.  At about $7 for a stacked plate, its one of the best deals in Nashville.  The friendliest people work there BTW."], ["Tart L.", "Good southern Indian food in Farmers Market humble surroundings. Sometimes the Farmers Market site is known as \"900 8th Ave,\" but let's honor Mrs. Park's civil rights chuzhpah and use the new street name. Swagruha is a yummy downtown area spot where you simply walk up to the counter and make your food choices which are dished up to take with you. Eat it at home or office, or sit down in the food court there. I like the Gulab Jamum Indian pastry, the Vada fried lentils, and the requisite chicken creations. The Mango Lassi smoothie is double yummy."], ["Virju P.", "Today I had the opportunity to eat at Swagruha in Nashville.  I must say, being indian and traveling extensively across the US, this is a place where you can easily appreciate a authentic indian dish.  As you will find the selections are small, this is because these are the dishes best cooked and served.  Everything was mouth-watering delicious and I will recommend this restaurant to anyone in the Nashville area.  I will add, the owners are very kind, and she took away from her time to check on our food and we mentioned it was very tasty and spicy.  She brought us yogurt on the side, complimentary.  This is what I call good service.  This is a place to eat, cafeteria style.  Not a normal restaurant.  You order, and there is a general sitting area for all the near by restaurants.  Food was nothing short of superb."], ["Richard Y.", "One of the best Indian restaurants in Nashville.  I'm only saying \"one of\" because I haven't tried them all.  It is definitely my favorite.  You absolutely must get the butter chicken!"], ["Carol W.", "We had lunch at Swagruha today.  This wonderful Indian restaurant is located in the Nashville Farmer's Market located on Rosa Parks Ave.  The food is excellent, well-spiced and absolutely delicious!   I love the butter chicken and chicken tikka masala, as well as the channa masala.  My husband loves the goat and lamb curries, as well as the chili chicken and the chicken curry.   Today we had mango pudding for dessert, which was smooth and creamy, with bits of mango and just the right amount of sweetness - a delicious treat for the end of a spicy meal.   The owners and servers are very friendly and go out of their way to make sure you are satisfied with your dining experience!  The restaurant also now has some of their spicy snack mixes for sale in the International market at the Farmer's Market as well.   This is one of our absolutely favorite restaurants in Nashville, and as a bonus we get lots of grocery shopping done at the Farmer's Market too!"]], "Sitar Indian Restaurant": [["Randall F.", "Fantastic. Freaking fantastic.  Tandoori Chicken was wonderful as was the Chicken Tikka Masalla. Great lunch buffet. Just really great!"], ["Maria K.", "I have been coming to Sitar since I was like 6 years old....so I might be biased? Either way, this is hands down the best Indian place in the city. My dad is from southeast asia, so I have high standards when it comes to Indian food and Sitar fulfills all of them.One thing I love about this place is that it has a homey and family vibe to it. If you are a \"regular\" then they know you and appreciate your business. My family and I have a special table there. As soon as we walk in, they seat us there and bring us out our favorite appetizers. Now obviously this is special treatment since we are loyal customers, but I've seen them do similar things for other people. The servers have the mindset that they want to serve you.You know how they say that hole in the wall places are the best types of restaurants to go to?? That is how Sitar is. It's the oddest building, I think it used to be a house or something. But don't let the shabby appearance stope you from indulging in a wide variety of Indian delicacies. I'm hungry just writing about it now.If you decide to treat yourself and go to sitar, you have two options. (1) Go to their lunch buffet (2) Eat there for dinnerIf you have never had Indian food before, and when you hear the world \"naan\" you think you misheard me saying \"Hey maannn\" then go to the lunch buffet. You will be able to try a wide variety of different types of dishes and ultimately see what your taste palette and stomach agree with. If you are a lover of all things Indian Cuisine and know what you like then I suggest going for dinner. The food during the evening tastes better. My family (4 of us) usually order....two orders of chicken tikka masala, one order of the mixed grille (it comes out with kabobs, chicken, fish...sooo yummy), a couple orders of samosas and pakoras, some type of dal and four naan. Three entrees here will easily serve 4-5 people. Ok, that was a long review. If you actually got to this point then good for you! Go eat Naan now!!"], ["Marie B.", "Several of my colleagues from South Asia highly recommended Sitar as the best Indian restaurant in Nashville and since this was my first taste of India I was not disappointed. Sitar is a casual restaurant that offers a great selection of authentic Indian cuisine with reasonable prices, dine-in/carry-out options, an attentive staff, and an extensive menu selection. The food was generously seasoned with Indian herbs & spices. My colleague & I ordered the lunch buffet, so that gave me an opportunity to sample a few of the many dishes the restaurant has to offer. I started with the fresh house salad; then cased the buffet bar for familiar foods that looked good by sight. I tried the Curry Chicken, Chicken Tikka Masala, Vegetable Korma, Chili Chicken, Bhindi Okra Masala, Rice Pullao, and the Naan bread that was delicious alone no butter needed. I enjoyed it all and to my surprise I was full after one plate. My beverage was water, water, & more water. I must had at least six refills! I was stuffed and went back for seconds not because I was hungry but the food was that good and besides, I never only have one plate at any buffet....so why break tradition now? ;-) I enjoyed my first time, it was a great experience with no complaints, & I do plan to return in the near future."], ["Jason B.", "Indian food is great and one of my go to restaurants is Sitar. They have a great buffet for a reasonable price. I can definitely recommend the chicken tikka masala. That is without a doubt my favorite thing on the buffet. The one downside here is the parking which can be right during primetime lunch traffic so shoot for an early or late lunch if you're in a rush. If you can handle that then make sure you swing by to fill up!"], ["Kristie A.", "I love this place! I come here often during my lunch break. Since I'm not that familiar with all the Indian dishes, buffet works best for me. I get to try it all.Their lunch buffet is just a little over $10. They have dishes from chicken masala to plain old grilled chicken. It's really just what you need. The waiters always kept up with your water too so you never had to ask for refill.they get so busy but since it's a buffet, people come in and go really fast.a coworker of mine comes here every single Friday to eat! I kid you not so that should tell ya something!"], ["Walt H.", "This restaurant is tucked away into an area that's not particularly easy to spot, although their sign out front is bright neon. The environment inside is pretty cozy, and the food I top notch Indian cuisine. The lamb korma is great, although the chicken tikka my girlfriend got was a little more flavorful. Service was great, with my glass rarely remaining half empty before someone returned with more ice water, and the waiter profusely apologizing when he was slow at remembering one condiment we requested. The naan is incredible, and should be ordered with every meal! The piswari naan, which is a sweet variety, is some of the best I've had in a long time!"], ["Marcus B.", "I really enjoy this place, especially the buffet. I love Indian food and this is one of the better (and more affordable) places that I've been to over the years. The flavors are very present in the food and the food hasn't been left out for hours in the times that I've gone. I recommend it for any one looking for something different but doesn't want to put limits on what that different might be. There isn't a lot of space for parking (it's behind the building) but ironically I've never had an issue with it here. Just something I noticed. It's in the pedestrian friendly Vanderbilt area so walking afterwards is highly encouraged after engorging yourself with that curry goodness."], ["Cait C.", "As we are used to frequenting the Indian restaurants in New York and New Jersey (some of the best), we are happy to report that we really liked this place. They have a very wide variety of dishes available. We loved that they offer the combination meals, so you can actually try more than one item for dinner, a vegetable, a meat, and some side items. Everything we had was delicious but we particularly liked the vegetable ginger dish. Their interpretation of medium is a true 'Indian' medium not the 'American' medium, so it is on the spicier side, which we liked."], ["Jared K.", "I came to Sitar for a working lunch meeting. I'd been here many times during my undergraduate years at Vandy, but it's definitely been a while.Sitar has a fantastic Indian buffet, which is really the best way to do Indian if you're as unfamiliar with the names of certain dishes as I am. I scooped an array of things onto my plate, some of which I've had before and some I just felt like investigating.The naan is always delicious, so definitely load up on that. They had a dish called \"Chicken 65\" (I think that was the name at least) which I'd never heard of. I'm not sure what it was, but it was amazing! It actually tasted better than the Chicken Tikka I normally eat. I also liked the pakora (vegetable fritters), which were fried and lightly spiced. They were very tasty, even for veggies. One of the last things I tried was Baingan Bhurtha, which is some kind of eggplant-based side dish with peas, tomatoes, onions, and other stuff. I'm more of a carnivore than a vegetarian, but I liked it more than I thought I would.I easily could have stayed here for another hour gorging myself, but I thought I'd save that for after my work colleagues and I are better acquainted."], ["Jeb H.", "Still my fav for Indian restaurants in Nashville. Best Chicken Tandoor I've ever had!"], ["Jay G.", "I really enjoyed their lunch today. Very nice and lots of variety.  I am definitely coming here again."], ["Anthony T.", "Terrible service. Was told 10 min for my Togo order. Been waiting for 40 min and he still says 2 more minutes. No apologies either. $32 not cheap for two dishes."], ["Whitney L.", "I absolutely love this place! The buffet is amazing! The staff is so fast.I have been getting the to-go buffet because I work across the street. You get so much you can always have seconds for dinner. My favorite dish on the buffet is the rice and the potato dish.They are open everyday how can this place get more better!"], ["Kyra S.", "This restaurant has a nice selection of food in the buffet to choose from as well as a menu for a more formal dining experience. Everything is made fresh, and the service was friendly. The atmosphere is lovely, with a gorgeous mural on one wall, and everything is clean. Definitely recommend for lunch or dinner."], ["Pam X.", "This was the first Indian restaurant I went to in Nashville, and I've been back multiple times. Their vegetable korma is perfectly creamy and spiced, in my humble non-Indian opinion. The dinner portions are nice and come with way too much rice--rice I don't know what to do with. Naan here is always warm and nicely buttered. I honestly am not a fan on the tandoori chicken, though. It's dry and hard to chew.Their buffet on the weekends pales in comparison to Woodlands', but I'll come to Sitar for non-vegetarian fare any other time."], ["Cynthia M.", "Wonderful buffet! Indian food has not been my favorite in the past, but this place has changed my mind. All the great reviews are accurate. It was SO good and I can't stop thinking about it. I will definitely be back!"], ["Dalal J.", "I have found this little gem some 14 years ago ever since they got a new chef and i have been in love ever since! I have tried most indian restaurants in town and authentic indian food made by friends but my love will always be for sitar. It has all the basic : buffet, menu and all the indian comfort food but what it excels at is the consistent level of quality and service! The food always tastes good,the servers always nice and if you want something specific, the chef will make it for you!!! My all time fave is chicken tikka mughlai which is only served in this place btw!!!! The korma is phenomenal as well!!!"], ["John C.", "I have been to Sitar probably 20 times or more in the last 4 years and it is without a doubt the best Indian Restaurant in Nashville. From the negative reviews I have read it seems like most of them are for the lunch buffet. Well I have only gone to the lunch buffet once and it was well a buffet. I guess it could be better but it's buffet how high a standard do you expect?I almost always go for dinner and order off the regular menu. My favorite item is the Chicken Vindaloo which I would only recommend if you are an experienced Indian food eater and can take the hot dishes. We usually get a Pakora appetizer and garlic naan with dinner which I highly recommend. A note about the service. Some of the servers / owners will tend to hurry you along. Just make it clear that you intend to take your time and there will be no problem. The servers recognize us now so it's never a problem.Reading some of the other negative reviews I wonder if they have tried any of the other Indian places in Nashville. We tried that place in green hills once and it was awful they couldn't even cook the bread correctly.The decor is nothing special but it's adequate. One night of the week they have someone playing the sitar live which is nice.Last thing they are kid friendly but if your small child is not used to the spices I would recommend you bring them a snack."], ["Salman S.", "Good buffet, great price.The daal is amazing as it is buttered, great mutton curry. You cannot go wrong."], ["Deb H.", "Fine example of Indian food. Just visiting Nashville so I have no idea how it ranks citywide, but perfect for near the hotel. Had the lamb biryani, which was yummy, with lots of lamb, and a huge portion, priced about right. The naan was melt in the mouth delicious, raita a bit powerful, but great to counter balance food. We were asked about level of spice we wanted and they nailed it.I would go back, I would recommend."], ["Joe F.", "Good food in the restaurant, but when I ordered delivery everything was wrong about my order. There was no spice and the garlic naan I ordered was just regular naan. Otherwise a good restaurant if you go to the restaurant."], ["J R.", "This place has top notch food! I ordered the Tika Marsala and rice. The roti and spicy garlic cilantro sauce which were tasty.  The service was quick and the staff is nice. The only things I didn't like were the small dinner portions and no one tells you that you have to pay up front. I waited about 20 mins until I realized that I needed to pay up front."], ["Tim A.", "I've noticed that Sitar has a really polarizing effect on people where I work. Some return again and again, while others refer to it with an alternative pronunciation of the first syllable that wouldn't be appropriate for the youngins. I, however, am left wondering why a restaurant so mediocre can result in such strong reactions in either direction.If lunch to you primarily means having a nice place to sit down for an hour and chat with some friends, then Sitar is definitely worth a visit. It's a pleasant spot to hang around in and the servers refill your water at a rate unparalleled by most Nashville restaurants. Furthermore, the buffet means you are in charge of how fast you get in and out of this place, making it ideal for a working day.As for the food...I've had nothing that I didn't find at least mindlessly pleasant, nor has anything been excessively enjoyable either. If Olive Garden branched into Indian food, I imagine it would taste much like this. So, if you're okay with that...with a great location and comfy seats, you could do worse I suppose."], ["Erin Y.", "I came here for the lunch buffet. They have a very good selection of food, more than I expected. The food is very tasty, but the staff needs to refill the food tray a little bit faster. Every time I go back for more food, there are always one or two trays empty. One good thing about the restaurant is you don't come out smelling like Indian food!!!The waiters can use some bleach to wash their white shirts...they look dirty and black. It kinda makes me question the cleanness of the food and the restaurant overall."], ["Melissha S.", "We really enjoy the lunch buffet here. Alot of great options for vegetarians. Great value for the money. The service is also wonderful."], ["Alexandra F.", "Not a fan of Sitar. You can find much better Indian in Nashville. If a girl wants an 8 out of 10 spicy, give her an 8. I know how to order Indian and I'm going to eat it regardless. That's one way to piss someone off while eating Indian food. When they expect it to be spicy and it's not at all. Won't be going back here again. Not worth it."], ["Matt C.", "I'd been here once before (about a year ago)  for the lunch buffet, which was my first attempt at Indian food. I'm not sure why it took me so long to have dinner here, bc I had a very good first experience. And I wasn't disappointed either for dinner. The food was delicious and the service was very good, despite having a hard time understanding the waiter at times. We first ordered the naan bread with lamb and spices baked inside as an appetizer ($3.95) which was delicious. Then we had two main courses, the Lamb Bhuna ($14.95) and the Chicken Tikka ($13.95). Both were very good. The chicken was surprisingly tender and cooked to perfection. Not only was the food good, but our doggie bag yielded at least one more serving. So, the portions were healthy. I will definitely return to try more of what's on this menu."], ["Bethany W.", "So. Much. Food.This is my boyfriend's favorite Indian place in town, so we recently visited. We split the mushroom matar with medium spice and the vegetarian thali. We would've had plenty of food with just the vegetarian thali, which includes chutney, papadum, rice, and naan bread on vegetable korma, sag panir, and chana masala. On Thursday nights, Sitar has a sitar player in the space, which added to the ambiance. The service was quick and attentive [my water glass was rarely not filled to the brim], and the prices are quite reasonable."], ["Bridget S.", "Hmmm.....I had to ask for the menu. We decided to try the buffet. Chicken Marsala was tender moist and had great flavor. Now the other chicken, tandoori, dry and without flavor. Interesting vegetable curry balls, tasty. My husband liked the curried goat. Naan bread tasted fresh.Atmosphere: clean, bright and not too noisy!"], ["Derrick W.", "Great Indian food!  Love their Curry and Chicken Tikka Masala!"], ["Allison R.", "Sitar is my go-to Indian in Nashville. I tried this place years ago and it remains my favorite Indian in Nashville. My husband and I normally get the same few dishes -- chicken tikka masala, the sampler appetizer, and garlic naan, it never disappoints. We've been to the buffet for lunch and it's a great price for what you get but it isn't comparable to ordering off the menu fresh for dinner."], ["Meredith W.", "Sitar is our favorite Indian place in Nashville!  Always great food and great service. I get the tandoori chicken sag which is soo delish!"], ["Jay R.", "Incredible! I had the lunch buffet along with a meat samosa and it was so good. You can taste the butter and cream in the food. Genuine kindness from the servers and the owners."], ["Sheena T.", "I want Sitar to be good again. I really really do. So I decided after over a year to give them a chance, but alas... it's just not what it used to be.I ordered one of my old favorites, chicken sultani with ginger and asked for it spicy. The consistency was good, but it was spicy without any flavor. No richness, no depth of flavors. It was spicy but bland. Sigh. Also, my wheat roti was burned. What happened to you Sitar? I'd still consider going to the buffet, because it's decent enough, but no more take out or dinner from this place, I'll go to some of the better Indian restaurants that are in the area."], ["Steve C.", "I'd say this restaurant is similar to Bombay Palace, another Indian restaurant in town. The food tastes pretty similar, but Bombay Palace is more clean and the service is better."], ["Tim G.", "This is my favorite Indian place in town! I absolutely love it. Get it spicy. And lots of buttered Naan. There's almost always a coupon online!"], ["Larry S.", "Went for dinner. Tasty and reasonably priced. Not fancy, but friendly and efficient."], ["Anthony T.", "Better than average for Indian restaurants. Unless Delhi is your standard, go -- you won't be disappointed."], ["Theresa S.", "Hailing from the Pacific Northwest, we were hoping to find Coconut Curry here at Sitar's, but we couldn't find it on the menu. The waiter was so nice - he suggested that we try the Nirgisi. Oh my, it was just like home. We had a dish of it with lamb and one with Chicken. I do wish there was more meat to the dish, but the flavor of the coconut curry was scrumptious. Oh - make sure to get the Garlic Naan, as it is the best ever!"], ["Brooke M.", "I was very pleasantly surprised by this place. My friends drug me here because they really wanted to try it. I can't remember the name of the dish I ordered but I believe it had lamb in it. IT WAS SO GOOD! The waiter was super friendly and great at making suggestions and describing the food. I will definitely be back."], ["L Z.", "Food was outstanding, but I can't give it 5 stars because the servers are so grumpy.  I had been looking forward to this place for over a month.  Used to come here a lot when I came to Nashville for work.  I guess I forgot how crabby they are.  Just puts a damper on the meal when servers, hosts, bus boys, etc aren't friendly."], ["Benjamin S.", "Went there for dinner with my wife- we started off with the appetizer plate and then split an order of Chicken Tikka Masala. The portions were more than enough for 2 hungry people, and the food was great. We went a Friday night and it wasn't crowded at all. We'll definitely be going back."], ["Melanie C.", "Some of the best Indian food in town! Still puzzled by how they do not have butter chicken, but the rest of the menu is still very tasty. We've only eaten at the buffet once; usually, we order this in and for delivery, it can get a bit pricey. But it is always a real treat. My usual is the vegetable curry; bf prefers the chicken saag. Both are absolutely delicious. We've also tried a variety of appetizers and fell in love with the Shrimp Pakora. I've had better samosas but that's not to say that these are bad at all.Overall, love this place!"], ["Bridgette C.", "Maybe I just picked a bad time to go here for my first visit.  I was not impressed.  Don't get me wrong, the food is good, but m first and only experience was at lunch, on a Friday, for their buffet.  I feel like I was set up for failure.  I would go again to be proven wrong.  It was just kind of crazy in here.  It was hard to get a server to even refill my water glass.  The food was good, a nice sampling of different Indian dishes, but truthfully my favorite thing was the naan, which I could have eaten as my meal happily.  The dishes did have some nice spice on them, perfect for flavoring without being overwhelming or too hot (I'm a wimp, no shame in that) but other than that they were a little bland.  I love Indian food, and maybe the problem is I know exactly what I want and don't need a Golden Corral-style spread of choices to try.  Heads up, its wildly busy in here around lunchtime, so take that into account when planning your visit.  I hear dinner is a better time to go so maybe I'll give that a shot sometime, but I'm admittedly not in a hurry."], ["Michelle H.", "Appetizer-Garlic NaanEntrees- Non vegetarian combination with Chicken Tikka Masala, and Chicken Korma and lentils. Malai Kofta and Lamb Tikka Masala. The combination plate came with the tiniest portions in comparison to the other dishes. It literally looked like they had taken a soup ladle and put one scoop of each dish on to the platter. Sure, it was just the two of us and we had ordered enough food for four people but for the price, they could have been a bit more generous. Same goes for the rice with the combo. The two main entrees were fine, proportion-wise.The Chicken Tikka Masala and Garlic Naan were the saviors of this meal. The Garlic Naan was puffy and chewy and super. The Chicken Tikka Masala was perfect and amazing. (Granted, this was my first time trying it. But if we hadn't ordered it, I'd probably not pick this restaurant again.)The lentils were my least favorite thing. Bland and goopy. The Chicken Korma, Lamb Tikka Masala and Malai Kofta were all bland and every bite was exactly the same. That first bite *was great*, but a little more seasoning/flavor would have made a world of difference.Cozy. Hole in the wall. Seat yourself. Clean-ish.Prompt. Attentive service.Not bad prices, but not great for only loving one entree and the appetizer."], ["Sarah W.", "I have been eating at Sitar since the mid-to-late 90's, I believe.  They have been quite consistent in quality  throughout these many years.  My husband and I largely order to go around the close of business.  The hours of operation can prove frustrating as it seems every time we have the time go, they are closed are about to close.  Other than that, it is my favorite Indian restaurant (I've been to a few in Nashville and a few in LA and Europe.)The chicken tikka masala is the best in town that I have tasted.  My only complaint is that occasionally, it is lacking in chicken.  Other times, it is quite generous.  I order the medium heat and quite like it.  In fact, I crave it.  (If you get it to go, save the sauce left over from your meal as it is wonderful over plain or Mahatma gold rice or the rice you ordered the next day reheated,)  The naan is great.  I get the plain and my husband gets the garlic.  He orders a curry usually.  He is usually quite happy with his order.  The raita and chutney are great and I loved the papadum.  Just the right amount of crisp.The buffet is generous as long as you get there on the front side of the hours.  The service is a little on the aloof side.  It has the feeling of a family run restaurant where no one *wants* to be there, they just are expected to be there.  Of course, it has been two or three years since I ate in the restaurant, but we do order take out about once every two weeks.  The price is almost a bargain.  I would say that if they lowered the prices just 15%, that we would go once a week."], ["Eric B.", "OK so let me start this by saying I am a rookie when it comes to Indian food. Luckily I had two guides to get me on the way. One was Indian and the other was an experienced traveler so I was in good shape. I am now a fan of Indian food. It was incredible. The staff was awesome and the food was better. I am now a customer of Sitar. I have leftovers that I am excited about eating. To the negative reviewers I would say that it is idiotic to compare the buffet to the full menu. Further there was a review that complained about bones in a goat dish. Well, as it turns out, the menu clearly states that the goat has bones so.........This place is awesome.......PERIOD!"], ["Bethany C.", "Nice little establishment. The lunch buffet is a pretty good value. Nice if you want to sample different types of Indian food and you aren't sure where to start."], ["Stephanie K.", "One of the better Indian places I've eaten at in Nashville (although from what I hear I still need to try Woodlands).  I went with a friend who had never had Indian before, so it was a fun experience for him.  We went on a Sunday evening, and it wasn't too crowded, although there were several other tables there.  I noticed other reviews had commented about poor service, but we didn't experience that at all.  Our server was very attentive and helpful.I ordered the Bengan Bhurtha (Eggplant roasted in the tandoor and cooked with green peas, fresh tomatoes, onions, ginger and garlic in traditional Punjabi style).  My friend asked the server for a recommendation, because he wanted to try one of their best, most \"Indian\" dishes.  The server recommended the Chicken Tikka Masala.  We also ordered garlic naan to go with the meal.The dishes came out really quickly, and both were delicious.  Mine was mildly spicy, and his was slightly spicy.  The combination with the garlic naan was great.  The only thing I might say was that my dish was a little oily.  If you're looking for Indian in Nashville, this is definitely a good choice."], ["Brittney D.", "We've been here twice now and this and are just not that impressed with it. I've not been to dinner there and I imagine it's better than their buffet but I've always preferred to have options when eating Indian food out since I can cook it at home. The buffet is pretty good and has a lot of vegetarian options. It seems to be the trend in Nashville for Indian food to be mostly vegetarian. We've had chickpeas masala, vegetable vindaloo, pakora, goat saag, chicken tikka masala and chilly chicken. We also tried a couple soups and their kheer. The biggest complaint we have is that both times we've had the goat saag, everyone at the table has found bone in it. Just today I found two small bone fragments and my boyfriend found a large chunk. Last time we were there, a friend our ours found about five pieces of bone in his portion. Finding objects in food is the main reason we won't be going back.For the most part, the food is good. It's not awesome but it's pretty good. There just seems to be very little difference between the different curries. I guess Sitar prefers to serve a few signature dishes with little difference between them. Somehow, the goat saag tastes pretty similar to the chicken tikka masala and the variety of vegetable dishes. I've eaten Indian food in a variety of states and tried multiple restaurants in a few areas I've lived and I've always thought each dish was unique. Sitar's food all kind of blends together. It's disappointing and we plan on heading somewhere else where hopefully we'll find some different dishes as well - lamb vindaloo, chicken korma, etc."], ["jacki R.", "If you like Indian food then sitar would be one the places to go eat. They have lunch buffet that's around ten dollars . That's really good compare to a burger joint just for a burger . The food is healthy and you can fill up even with my appetite ."], ["Nicole P.", "ALWAYS great!!  The Chicken Tikka Masala is the best in town.  It's hard for me to find anyone who loves Indian food, but I finally got my kids to join me.  They devoured the Curry Chicken and the Naan.One of our favorite restaurants."], ["Carissa O.", "Average Indian food but they had peshwari naan so despite all the other reviews stating that it's average I thought I would try. It's definitely average. I think I'll continue looking for an Indian restaurant in town."], ["Ruiqiu K.", "I once wrote in one of my earlier reviews that if a restaurant offers lamb, I will inevitably choose that dish. However, I have to make exceptions to restaurants that offer more uncommon proteins -- I have tried ostrich, buffalo, alligator, kangaroo, calf brains, snails, etc.Another uncommon (yet not as exotic) protein is goat. We finally found our way over here this past summer, and I knew I had to try the goat curry. The last time I had it was at a Himalayan/Nepalese restaurant back in Berkeley. I remembered there being a lot of bone, so I was expecting the same here.It was mouth-wateringly good and contained fewer bones. The last Indian restaurant I went to, I made the mistake of asking for medium instead of mild. The dish from that place was so fiery that I couldn't enjoy the flavor of the meat. Here, I made sure to ask for mild, and the dish was excellent.I also had my usual sides of naan, raita, and mango lassi. They were all also good. I had enough leftover to make 2 extra meals (and I don't eat massive quantities).Place was kind of dark inside, even though we were eating in the middle of the afternoon. We were seated by a window, which helped.Husband had a fish tikki masala of some sort. He almost always figuratively licks his plate clean; but he didn't do so here. I think it had to do with our apartment situation at the time (review forthcoming)."], ["Brandon F.", "Best in town! The buffet is so great it has all the things you could want. If your a first timer it's your best example for what great Indian food should taste like. If you only have water you can eat like a king for 9$ you can't beat that!"], ["Sara C.", "This place rules! I highly recommend going for the daily lunch buffet-eating there always makes me happy:)  The buffet is delicious and not at all expensive and you will be surrounded by happy people! We try and eat here at least once a week, if not for lunch then take-out for dinner after a long day."], ["Anna Y.", "My favorite Indian restaurant. I crave for their food all the time!! There is this fantastic grilled spicy home made goat cheeseI will never forget.. It makes me keep coming back, try something new.. And come back again!! Serving are normally large enough to make 2 meals out of it."], ["Riley S.", "Probably my favorite Indian restaurant in Nashville.They have the standard lunch buffet, but I usually get take-out.  The chicken tikka masala is my favorite!  Definitely recommend."], ["Tara F.", "Love the lunch buffet! This is the place I get my Indian food fix. Glad I have a friend that can met me there that shares the same love for Indian food."], ["Teresa B.", "I've been dining at Sitar ever since they had their Madison location before moving off West End.  The chicken tika masala is the best!  The lunch buffet is a good introduction for those who have not tried Indian food.  I would highly recommend."]], "Woodlands Indian Vegetarian Cuisine": [["Alvin P.", "This is probably one of the best Indian Restaurants I've been to, and by far the best in Nashville.   I'm pretty much a vegetarian (although the occasional hot dog seems to slip through my security zone every now and then) so this is right up my ally.   The staff seems friendly, and I've never really had to wait much whenever I've been there, albeit I haven't gotten the chance to go there for their lunch buffets.  The place seems clean as well.  The waiting area is a bit small, but since I haven't had to wait there much, doesn't seem to be much of a problem.  The food is amazingly good if you like Indian food, and the varying degrees of to which they can adjust spice comes in really handy if you have a sensitive tongue.  The Dosa here is excellent and so are the Aloo Paratha.  They have plenty of choices as well, and almost all of them seem good.  I've tried various dosas, appetizers (samosa, pakora, vada, etc), curries, parathas, naan,  poori, and bhatura's, and they all seem to be really good.  I don't think I've ever really been disappointed going here.   The only possible negative that I can think of is the parking.  It's basically on the side of an apartment building, right besides 440, so parking can get tough especially if it's the weekend.  There is parking in the back, but I believe some of it is reserved for the apartment building, so that can get tricky.  This is one of those places that people will keep returning because the prices aren't exorbitant (nor are they particularly cheap) but the food is amazing.   I recommend this place to pretty much anyone that likes vegetarian Indian food.  Pretty much when my gf or parents come to visit Nashville, they always make atleast one trip here. And last but not least, controversial advice from my parents:  Judge an ethnic restaurant by how many people of that ethnicity visit it and/or are seen when you visit.  I'd say this passes that benchmark, although it's skewed because I visit it often, :D"], ["Laura B.", "This place is the jam. I love so many menu items and the location is really convenient. The mango lassi isn't jaw dropping but I just think the place deserves 5 stars every day I've ever been for every meal I've ever had there was truly delicious."], ["Blake R.", "Been coming here for years... never had a bad dish! I regularly order malai kofta,  bhatura, masala dosa. I never leave hungry or disappointed.  The service is pretty darn good and the food comes out pretty fast. Even though it is a vegetarian restaurant,  I wouldn't hesitate to recommend this place to anyone"], ["Marci R.", "Food is really good. Service is good as well. Worth a visit!!"], ["Jammie M.", "A must visit!  Some of the best Indian food I've had in several years and I eat Indian food at least every 1-2 months."], ["Dennis L.", "Great Indian food. Caters to vegetarians and nonvegetarians like. Service was good. Food was delicious. Buffet style."], ["J A.", "After spending a few weeks in Malaysia, it's the only place in Nashville that comes close to the authentic southern-style Indian food of vegetarian curries with other eclectic dishes to boot. We eat at Woodlands about once a month and are always excited for the Manchurian Corn.We had Woodlands cater a graduation party for 35 people and they were more than helpful in suggesting dishes and helping stay within our budget. It all came steaming fresh and excellent--as Woodlands consistently is. I can't wait to plow through the leftovers!"], ["Om B.", "4 words: great food, packed house. Came here to stop by for lunch after a long day of travel. As a southern-Asian, I can say it's worth stepping by this tucked away eatery in the 'burbs. Mixed crowd of all ages, between toddlers and seniors (which gives you an idea of the ambience). Try the palak paneer and the apps, also the complementary mini-masala dosas. Service par to subpar due to volume. But they tried. Nevertheless, can't go wrong."], ["Ashley T.", "I have been wanting to try woodlands out for a while now, but am usually never out near west end. It is located in what looks like a hotel. Hard to find unless you know that and eyeball your gps like crazy. We had to turn around the first time. Anyway we went for dinner with a couple out of town friends last night. My husband and I ordered the vegetable pakora appetizer to start. It was really so good. I liked both the tamarind sauce and the mint chutney sauces that came with the appetizer too. Hubs ordered the vegetable jalfrezi and added paneer, and I ordered the mysore masala dosa. He said he loved his as much, maybe more than our favorite Indian place back home. I had never tried dosa before and I'll admit it was a toss up between that and the palak paneer. I almost always order spinach at Indian restaurants because I love it so much, but I decided to try something new. The dosa itself was fine. Nothing mind blowing, but okay. The actual filling was so good but there was SO little of it! My friend ordered a dosa as well and hers came wrapped up like 3 fat burritos with a ton of filling. Mine was laid flat on the plate with a tiny roll of filling underneath one corner. I left satisfied, but I was the only person at the table without leftovers. Next time I will definitely order something else. I do like that the menu denotes everything that is vegan and/or gluten free."], ["Sandy T.", "As far as vegetarian restaurants in Nashville, Woodlands gets 5 stars from me. I love Indian food. I do not know the names of most of the specialty dishes, but I can certainly point at the pictures on the menu and tell you which ones (all of them) are good.  There is just something about their simple, staple and humble ingredients that makes me find comfort and familiarity in each dish. It's rice, legumes, and vegetables...highly spiced to make the most out of them - that's it. Oh, before I forget, Woodlands is closed on Mondays! (Just didn't want you to drive all the way there and be disappointed).Their buffets are excellent. Lunch is served 11 am - 2 pm...$8.99. The buffets consist of a variety of several different kinds of soups, salads, curries, rice, desserts, and breads.  A great appetizer: Samosas are delicious especially with the variety of chutneys it's served with (tamarind and mint). My favorite dish is the Rava Masala Dosa. It's a crepe filled with spicy potatoes and vegetables. It's crispy on the edges yet soft and tasty on the inside! The Vegetable biriyani and Ghanna baturo (big fluffy bread served with chickpeas masala) are also delish! If you order a la carte,  I recommend to order several different dishes then share with the other guests on your table because the portions are quite generous....but if you want to be greedy and not share, then I hope you really like your entree and don't choke! Customer service is superb.  The staff is very friendly! Very attentive, respectful, helpful attendants.I say go spice up your buds!"], ["Don G.", "Pretty impressed. It was a busy Sunday night. The place was pretty full. Service was fast and professional, never felt that I was lacking for anything while also not feeling like someone was hovering over me. Food was excellent and very well prepared. Had some Mushroom Masala and Masala Dosa and it was all excellent. My dining companion wasn't into spicy things so everything was mild. She felt it to be just right, I could barely detect anything that I would call \"spicy.\" Just goes to show that everyone has a different opinion on that. I'll say I felt that the dinner prices were slightly high but they're really in line with other Indian restaurants that I've visited."], ["Cee D.", "Excellent Indian food, and really, ethnic food of a quality that is not found in many U.S. cities. I've always found the service impeccable, and have never had a bad item. I wish I lived closer and frequented Woodlands more when I was just down the street in college. Don't make the same mistake I made!"], ["Josh M.", "This is hands down one of the best vegetarian restaurants in town, not to mention the best Indian food. All of the wonderful smells, textures, spices and colors will make you not even miss the meat. Mango Lassi is incredible and is a must. The location and parking trouble is worth a visit to the lunch buffet. The service is also great."], ["Gabrielle D.", "I love southern indian food, it's a cuisine that is everything and more I could ever hope for as a vegetarian.  It give me comfort and satisfaction like no other!That being said, I've tried a number of southern indian restaurants and this is one of the best.  I've eaten here late at night before they closed and during dinner rushes, and other then waiting a few extra minutes, I've never had issues with service.Their food is flavorful and delicious and the staff can easily tell me what is safe to eat being gluten free.  We often order more then we need so we can take it home and eat the leftovers the next day.My favorite go to meals here are Uthappa, like an indian pizza! Sourdough flavor and gluten free.  Their Aloo Gobi is great along with their Vegetable Jalfrezi, Vegetable Koorma and Mushroom Masala.Even non vegetarians love this place, so give it a shot even though its a vegetarian restaurant.  They are able to bring a lot of flavor!  You won't even miss the meat!"], ["Huzefa M.", "Food is ok, but the servers are RUDE and terrible. We were from out of town and didnt know what time they closed the buffett. 10 minutes into the meal, they asked us to take 'all that we can' since they were closing the buffet. I mentioned that when we came in to be seated, they should have verbally mentioned to us that they were closing the buffet. The server started arguing that I should have 'read' the signs outside the restaurant before coming in. Really rude waiter, thought no end of himself and was raising his voice at us at the restaurant. I am not sure why management even hires such losers. It spoilt our entire experience at the restaurant. As for the buffet, the right thing to tell the customer is that although the buffet is closed, we can get portions of whatever you sampled and liked al a carte. That is called customer service. You dont tell a customer that no more food is available to you, specially when a customer has paid for a buffet.We are certainly not going back and we are going to recommend to our network not to go there."], ["Christa P.", "We went with our family and vegan couple. My husband and I are both meat-eaters, but did have a lot of different options on the menu to enjoy. My husband ordered the brijahani (rice) and was disappointed. I ordered the tikka masala, although I asked for extremely spicy and it came out mild. We also did the pakora and somosas as appetizers which were not prepared well. Overall we were disappointed with the flavor and preparation of the food- and we both ended up getting sick."], ["David C.", "Love the food here. Really impressed by the quality and the price. They are very busy sometimes, but sure is worth the wait. Only once when I went the server was quick to drop the bill and ask that we pay and leave because they are on a wait. I have served tables for the majority of my working life and I have never said this to a table (and I'm a New Yorker!) we literally just finished eating and we're finishing our drinks. This would make sense if we sat there for a while but this was not the case. Other than the rude server I love woodlands."], ["Eli C.", "Excellent buffet. Super consistent, nice staff and always busy. Also the apartment building it's housed in reminds me of Miami Vice so you feel pretty cool walking in and out."], ["Brian N.", "I've been eating here two or three times a month for years, but this, inexplicably, is my first review.  This place is fantastic.  They have a buffet at lunch, and a full menu at dinner.  I'm a vegetarian, and it's such a treat to be able to eat anything they offer without having to modify it.  The service is always exceptional and incredibly friendly without being overbearing.  I admit that the food on the buffet could be a little spicier, but that's the price you pay for eating buffet food: it has to appeal to the greatest number of people, so it's not as spiced as it could be.  It's still well worth going, and it's very cheap for the quality of food and service.  Is it the best Indian food I've had?  Not by a long shot.  But it's still a great place to go, and I've always been glad when I've gone."], ["Peter V.", "BEST BUFFET IN TOWN!!!This is the best place to go for your indian fix. I don't have too much to say about Woodlands other than It is consistently delicious, the service is prompt, it is affordable, you can bring your own alcohol, and I have never had to wait for a table even when it is full. Could you ask for anything better?This is my #1 weekend splurge plan. I love to eat myself silly at the buffet then go home and take a nap to help digest. Days off like that are rare but when they happen, they make life worth living."], ["Justin B.", "Everything is great about this place.Personal favorites:Malai Kofta - best Indian dish I've ever had.  Some sort of cashew sauce with fried lentil dough balls swimming in it.Chana batura for an appetizer.  Huge fried, puffy fried bread that shrinks to a manageable size when you stab it with a fork.  Comes with spicy chickpeas in a curry sauce.Palak paneer. - some Indian places make this a goopy mess, but this doesn't have that pureed look.  A go to.Mango lassi.  Sweet, mango yogurt drink."], ["Crystal B.", "A hidden gem. I've been coming here for many years and have never had a bad experience. The food is fresh, flavorful, and always exciting. Tonight we ordered the appetizer sampler, dosas, baingan bharta, dal mahkani, and a curry along with naan. Everything was was delicious and we left stuffed. Service was great and everyone was very attentive. A big plus is that you can BYOB."], ["Prasanna K.", "Excellent ambiance and great South Indian food..ravi onion dosa is the best so far that I ever had in USA ..I come from New Jersey and have been to several Indian restaurants in NJ and NY and woodlands in Nashville is one of the best"], ["Renu K.", "On the way back home from trip Looking at the name woodlands in yelp told my hubby for sure we gonna hv lunch here. Thn quickly fed the address in the map found.  1. It was little close to Exit. Was hard to find the exact spot bks thr was one huge building and this is in some continent hotel building and opposite to some gas station.2. Food was Awesome! 3. Service initially thought it was rude bks I think it's manager or some main In charger of the restaurant said it's 2.30 and closing time. We felt little annoyed for a sec thn he said u can pick the buffet in one shot. We said anyways we wanna the menu still he said again u hv to order in one shot. We agreed though we felt little rude but later on the same person and the other waiters amazed us by their service till the end of chk out they treated us so well felt homely. 4. South Indian thali was too good. Sambar, Rasam was awesome and in that fruit dessert tasted yum and you can choose tea or mango lassi. We had tea and it tasted goo d wth nice cardamom aroma. 5. Veg pulao wth raita and a papad had a average taste. 6. Then I ordered Bombay baaji and that tasted yum. I dint know they will give along wth white rice later on my hubby said mostly all the side dish they serve wth white rice. So keep in mind before ordering for side dish or double chk wth them bks I was too full after eating pulao and I need to get box to pack them. 7. Then we ordered their special dosa and idly for to go came home hungry and had that for dinner. Omg! It was a bliss the dosa tasted so yum wth potato masala, sambar and chutney( thought the chutney might hv got spoilt since we had it after 6 hrs but to my surprise it tasted awesome) But Idly was dry and dint taste that good. Bill was totally some around 80$ yeah newyork price :( :' but taste was too good. So I will strongly recommend."], ["Micheal P.", "Every time I eat here, I think, \"Why did it take me so long to return?\"Woodlands is killing it. I mean, most of it. Not animals. But in every other way, killing it."], ["Julie S.", "Good food, diverse menu with many vegan options! Unfortunately the unwelcoming, unfriendly service overshadowed our whole evening out. Good food though!"], ["Ben M.", "Great service, nice atmosphere, phenomenal food. Well deserving of their 4.5 star average."], ["Arshbir G.", "Good dosas!"], ["Liz H.", "Delicious Southern Indian food and the best vegetarian place in town in my opinion. The lunch buffet was bomb and the place has a very relaxed vibe (so rare for a West End restaurant). Even if you are not vege (which I am not) you aren't missing out on a thing. Go now before this gem is discovered by the throngs of new Nashvillians!"], ["Bridgette C.", "I've only ever had the lunch buffet here, but its very good.  I've already written about my favorite Indian place in town, but Woodlands is a great lunch spot.  A huge vegetarian buffet for under $10?  Yes, take me to my table and allow me to embarass myself at the buffet.It can get crowded in here at lunch but its not a long wait.  The food is very good, but again, keep in mind that this is VEGETARIAN people, so don't ask where the meat is.  The service isn't exemplary, but its a buffet, so you really don't need someone hovering over you all the time.  I'd be interested to see what it's like at dinnertime here.They have salad options, mild curries, some spicy ones as well, and some dessert offerings, and they bring you a veggie-stuffed crepe of some sort (sorry, don't know what its called, aforementioned server kind of dropped it off and ran) that's a great compliment to your meal.This is a good stop for a mostly healthy lunch with lots of options for everyone.  And the price is more than reasonable.  I'd recommend it even if you're slightly rushed."], ["Anna J.", "I'm giving this place average rating BC i cannot survive on veggies alone.  So this review is totally BIASED.  Read only if you are a meat eater!The buffet here was good, but after I finished eating, i still felt the need to eat some chicken, or beef, or... and within a few hours, i was hungry. So for you meat eaters out there, try Bombay palace down the street... just as good Indian buffet but with chicken chicken chicken!Ok vegetarians, don't judge me."], ["Ashley K.", "Best Indian Food in town! Great for take out, very friendly staff and quick service. I love their Bhindi Masala! Fav go - to dish."], ["Ritu S.", "Food is just Wow! Enjoyed every bite. My kid liked it too. Awesome food. Want to visit again and again."], ["Mohankrishna S.", "No salt in any item. Iddly is bland. Coconut chutney is bland. Sambar is tasteless. Baby corn manchuria is ok but again no salt. 2 ravva  dosas has the same ingredients and no salt. This is the second time and definitely my last time."], ["Tanmay S.", "I am not going to beat around the bush !People who rated this indian restaurant any more than 1 star really doesn't know what Indian food is and must have not been outside Nashville EVER !   Chilly Paneer - had more green peppers chilly than paneer. I ll upload the pic of it. Trust me!Noodles : stale stale. What a shame. I thought they served me leftover from their buffetSchezwan dosa - 1 star belong to this.Onion Utthapa - i am sorry but utthapa without butter is meaningless for even health freaks. This was bland with just onions sprinkled over but no flavor."], ["G. Mary A.", "Delicious! Great service. We were in a rush and they were really accommodating even though they were packed."], ["Hernan G.", "Great food, fast service.  The Palak Paneer is especially delicious."], ["Samantha O.", "Absolutely love this place. I ordered to-go and unfortunately was stuck in traffic so I ended up being about 20mins later than I expected but I called to let them know about the delay. They said it was no problem and my food was hot and ready when I arrived! Will definitely be eating here again."], ["Craig W.", "Great vegetarian Indian cuisine in the center of it all. Woodlands offers some of the best in Nashville, not to mention one of two that serves Dosa. I highly the Mysore Masala Dosa if you are wanting a great combination of spices and a little kick of hotness. The food is always great, the service is always good, and it makes for a fun night out with friends. My only negative remark is the parking. The parking lot is shared with the apartments community above the restaurant. Don't let this deter you from visiting Woodlands, because it is well worth the wait."], ["Leslie G.", "OK, so positive reviews of Woodlands from meat-eaters inevitably follow a simple format:1) State that you're \"not all that into\" vegetarian cuisine, or that you were \"never that into it,\" or that you're just generally way into meat and the day really isn't complete unless you've messily devoured an entire suckling pig or something. Bonus points if you broadcast the fact that your horrible vegetarian friends dragged you here.2) Describe in lavish detail the specific dishes that convinced you that Woodlands is, in fact, a wonderful place to dine, and rhapsodize about how your meal was in no way diminished by not having fragments of selected animal carcasses lurking within it.3) Complete your conversion narrative! Lord, lord almighty, you have seen the light!So yeah, I'm not a vegetarian either, so I guess I'll quit making fun of you now. The reason that Woodlands is so awesome is twofold: first, they have a huge and intimidating menu with everything you could possibly want on it. The descriptions are cryptic, many of them are strongly similar, and you'll find yourself wondering about what will actually come out of the kitchen. I ordered puri there once because I was in the mood for something lighter, and they served me an enormous puffy bread somewhat larger than a football that I cautiously prodded with my knife for fear that it might emit some sort of hazardous spume (spoiler alert: it did not). Second, everything is fantastically prepared, reasonably priced, and very very tasty. The curries with almonds and/or cashews are my favorite--nutty and spicy.OK, so I lied: the reasons are actually threefold--it's also BYOB. Thus, your dinner can be as fancy as you want it to be. Feel like a night on the town? Bust out that bottle of Dom. Want to slum it with your hipster friends? Bring a suitcase of PBR (unless, of course, PBR has been supplanted as the crappy beer du jour, in which case bring along your Genesee or Natty Ice or Night Train or whatever swill the youngsters are drinking these days).Finally, some superlatives: this is most definitely the best Indian food in Nashville. I hesitate to describe it as one of the best Indian restaurants in the South / the nation because I haven't dined at all of them yet, though I'm working on this."]], "Best of India": [["Alexis V.", "Went here for an early dinner on a Sunday afternoon. The place was not busy at all and service was very prompt. I ordered the vegetable korma--delicious. I did get the medium spice level but I wish I'd ordered spicy. At the end of the meal, we asked for some extra rice to go with our left overs. They gave us a huge container of extra rice!"], ["James M.", "I dropped by Best of India for a cheap lunch option today and was not disappointed! This is a little shop in an old strip mall off of Charlotte near the Vietnamese Restaurants. It feels like they try to be a bit more casual than the other Indian restaurants around town. One thing I liked is that they took the time to explain on the buffet labels exactly what each thing is. Sometimes, I get a little confused between all the dishes and I just like to know, you know?So, today my lunch was at 2:30 (30 minutes before the buffet closes) and I was one of two people in the restaurant. That didn't stop them from having fresh offerings and a full buffet still available. I loved the chicken dishes, especially the Chicken Makhani! The Saag was good but not quite the same level as Woodlands, my personal favorite in town. Pros:Service, freshness, and flavor of food were all high points!Cons:The atmosphere leaves a little something to be desired.Overall: I'll be back. Oh yes, I'll be back."], ["Tony S.", "Ordered chicken curry, paneer tikka masala and parathas and all of them are soaked in oil. Taste is not great. It felt like precooked food. Won't visit this place again"], ["Mike D.", "Wasn't sure want to expect before I got there... but what did I find when I arrived?  Well, on a side note, I suppose that's the whole point of writing reviews, right?  And then really, this entire paragraph is completely pointless.  Anyway, I digress...I found a fully stocked buffet.  Whenever any item reached the bottom, it was refilled or replaced immediately.  I was especially concerned about this with the naan because I a self-confessed naan junkie.  Everything, I repeat, EVERYTHING that I tried (and I tried everything) was delicious!  Service was prompt and extremely attentive.   My water was refilled quickly and often.  Ambiance is not really much.  It's very plain with boring low-scale decorations.  However, the interior is surprisingly spacious and you don't feel crowded or rushed. When you are done with your meal, just go to the front register to checkout.  I am a fan of this because you don't have to ask for or wait for your check.  Quick lunch that leaves you satisfied for only $7.99!I will definitely be back!"], ["Kamryn C.", "Just ate here for lunch. The staff was very polite and respectful, and the food was amazing. I have tried many Indian restaurants and for being a hole in the wall strip mall...this was better than most. I got the veggie korma with the sweet nann and literally have zero complaints. Highly recommended. Give this place your business."], ["Janette C.", "This is a little place, tucked into a strip mall. Easy to miss if you are not watching for it.   That being said, we headed over to this area to pick up some ethnic food.  They had a buffet, which is unusual for a Sunday. The price was only 7.99.  I had a delicious black chai tea with it.  The buffet had a few nice offerings on it. Not extensive but plenty variety and a great lunch.  The food had a bit of a kick to it but not too crazy that I couldn't handle it.  Everything I tried was delicious. No review for the service, since it was a buffet service but they did get our drinks to us quick ;)Bottom line.  I would go again if I was in the area."], ["Sheena T.", "After 3 visits I'm giving Best of India the coveted 5 star review. The best part of it... they deliver!!  The buffet never disappoints. The chicken curry is seriously the bomb, but get any of their veggie dishes (cabbage, okra, creamed spinach) and you'll be blown away too. I also love that they serve papadm (sp?) the crispy large chip like thing that I've never seen on a buffet before. So good. The take out is on point as well. While you have to order at least $20.00 worth of food, it's well worth it for the amazing Indian feast you get delivered to your door and can eat on for days. This place is my go-to Indian food restaurant! Sitar, take note.Also, Yelp needs to be updated, they are open on Sunday!"], ["Alexandra F.", "Mediocre Indian. I had high hopes for this place since it is maybe 5 minutes down the road from where I live. And honestly if the service was better I would probably be ordering takeout a couple times a week. My two experiences with weren't the worst ever, but I was disappointed.The first time I ordered Vindaloo curry and garlic naan. I had purchased their $6 for $10. When I got to the restaurant the man at the door said I could not use the coupon because what I ordered what not a dinner entree. I left after getting my food a little angry because I had read the fine print on the voucher and it said nothing about ordering a dinner entree. The food was decent. I was a big fan of the garlic naan. The vindaloo sauce, however, was just ok. It definitely seemed less authentic that other Indian places I have had in the Nashville area that are in the same price range. And less fresh somehow.The second time, I thought I had everything down. I ordered vegetable curry extra hot with garlic naan. Thinking this time that I would definitely be able to use that coupon I purchased. When I arrived to pick up my order the same gentleman was at the door. He almost didn't honor my coupon this time. I don't know what the issue was other than he didn't seem to want to give me this discount. Reluctantly he honored it saying he would \"this time\". Frustrated, I left and haven't been back since.If you're going to have a Yelp offer, be more detailed in your description or don't have one. That's frustrating for people who are trying to score a deal while trying a new restaurant."], ["Melissa D.", "This is hands down my favorite Indian restaurant in Nashville. The service is friendly, helpful with questions and suggestions and just overall enjoyable. The food is phenomenal. Everything I've had is spiced perfectly and just a taste experience that in my opinion can't be beat. I typically order the chicken tikka masala, side of garlic naan and saag paneer. Delicious."], ["Richard R.", "Just fantastic. Stopped in for the lunch buffet today and thoroughly enjoyed it. The price was right (7.99 weekday) and the food was delightful. The chicken is cooked perfectly and the naan was made fresh immediately when I arrived. Service was friendly and personable. I'll definitely be back and can't wait to bring friends."], ["Chiedozie U.", "I was contacted by the owner and asked if I could come back to retry their food. I I took it up and was BLOWN AWAY!!! The food the second time was fantastic. I had the salmon tikka masala and my gf had the okra curry, both dishes were very flavorful and delicious, just the way I like my Indian food to be. We got some garlic naan which was very buttery, warm and fresh. And we both ordered the mango lassi which was also something special. The staff were very apologetic about our prior experience and definitely more than made up for it with top class service + a delicious meal. Changing my rating to 5  very well deserved stars!"], ["Casey H.", "The restaurant is a hole in Aaron's wall.... lol Ok, it's really just next to Aaron's and they share a parking lot.... The food and service was 5 stars but the decor and lighting is lacking. I like to see what I'm eating and the lighting during lunch time was just not there.  I don't eat Indian food on a regular basis but this place was actually pretty wonderful. Lunch buffet was $7.99 and not crowded at all. On a Tuesday, they had about 6 people in there. Between this place and Sitar --- I'm definitely picking Best of India!"], ["Jessica A.", "The staff was nice and helpful. Also if you think \"mild\" spicy ness is not hot, you're wrong but sooooo good. All their food was delicious and great naan. Vegetable samosas is really great with the sause! Would always recommend"], ["Cj G.", "Not ground breaking or amazing per say but it's damn good Indian food and you can't beat the value of the lunch buffet. Just as good as sitar and much cheaper. I can't stop coming here."], ["Christina E.", "I have ordered from this restaurant multiple times.  The food is always great.  So why the 1 star?  The last time I called and asked if they delivered to my house (I live in Bellevue so I did not think they would deliver but wanted to check).  I provided my address to the person on the phone and to my surprise, he said that they did deliver to my house for a fee.  I agreed to the fee.  I also verified THREE times that he had my address correct, and spelled it out several times (e.g., \"A as in Apple\").  Afterward, the man on the phone confirmed my address and SPELLED it back to me.  An hour later, we had not received our order.  I missed a call on my phone and called the delivery man back who explained that the man who had taken my order took down the wrong address and that he needed an updated address.  I provided it and made sure he knew where he was going.  When he arrived at our home he HONKED until I came outside (really? - you honked?  You couldn't walk to the door?).  I went to his car to pick up the food, where the delivery man SCOLDED ME about my address, and said that they do not deliver to \"this\" address.  He then told me to verify my address with them next time and not to waste his time.  He then handed me my food, and drove away.  While the food was good, the experience definitely soured my opinion of this place.  :(  Boo hiss!"], ["Becky H.", "Amazing! The service was divine but it was the food that was superfluous! I loved it so much. Everything was perfect! I can't tell you how wonderful my experience was for dinner! The best Indian food I've ever had any place. As a matter of fact, it was the best meal in general that I have had in a very long time. Plus it's not expensive although the quality is!"], ["Mary G.", "Used a Groupon and ordered al a carte ....The flavors are there, everything we had (vegetable samosa, vegetable pakora, garlic/onion naan bread, mixed biryani and mango lassi) tasted fresh and was delicious.  They serve pappad and 3 to 4 sauces when we sat down. Next time we're going to try the buffet, which looked very good.The restaurant seemed clean and the service was good.  It's casual, not at all fancy, just great food!  Worth a try."], ["Tina J.", "I want to thank the Best of India for the handling of my issue. It was a misunderstanding by one of their employees on how the coupons worked. They absolutely have the best Indian food at a great price. I have been going there for years. I'm so happy we were able to work this out. Thank you Best of India."], ["Librarian M.", "Mediocre buffet at best. No garbanzo salad, no pickle, and naan not made fresh to order. Chicken and veggie dishes are decent but better is available in Nashville. The greatest insult - they pulled the kheer 10 minutes before buffet closed and the gulab was soggy and slimy."], ["J D.", "I went to Best of India with a friend because she had an Entertainment Book coupon.  The food was really good.  I ordered the Chicken Curry medium and my friend ordered Chicken Tikka Masala.  The flavor was excellent and the presentation was lovely.  We had wonderful, attentive service.  You can see their passion for good food and good service.  I can't wait to go back and tell my friends!"]], "Zyka Indian Cuisine": [["Batia K.", "Recently moved from New York and have enjoyed my fair share of Indian restaurants. Until now, we haven't felt like we found an Indian place that could compete. That changed today. The food was fantastic and the service outstanding."], ["Neal C.", "Had a delicious lunch with great service."], ["Krash T.", "Oh, I really wanted to love this restaurant. With Shalimar going downhill at the speed of light, I was thrilled when Zyka opened near my regular B&B. And they would deliver! My first meal was exquisite - shrimp biryani \"Indian hot\", raitha, papadum. My next, lamb korma, was just as good. Sadly, though, the restaurant appears to be pretty uneven. We have ordered from them - and eaten there - seven times now. Three times, the food was fabulous (although a few things were odd - but more on that later). Twice, it was all right. Twice, it was not good.What's most annoying, outside of the inconsistency, is the kitchen's apparent deafness to requests. Last time, we ordered salad \"with dressing on the side\", and instead received salad with dressing, plus an extra side of dressing. Zyka offers \"dal soup\" rather than the customary dal, but we requested that they provide something more like \"dal stew\" (in the words of the gentleman on the phone and at the desk) and were told it could be done. When I arrived to pick it up, I reminded him again and was told it was done. But we got the soup.  liquid, not much solid. Two friends of mine who'd lived in India for years went there for dinner, and I asked their opinion. \"The naan was strange\", they said. I agreed. When we ordered garlic naan, which normally comes as a whole piece of naan stuffed with garlic, with garlic on top, w were served a soggy naan cut into five or six strips, nothing stuffed inside, just garlic on the outside. When I said I'd never seen naan like this and would have preferred a whole piece of bread I could tear pieces from, I was told if I'd ordered the \"regular\" naan, it would have been like that. But without garlic.The dal is strange. I have never seen dal soup at an Indian restaurant in America, though as a disclaimer I've probably only visited a few dozen in my life. But every other Indian restaurant I've ever eaten at has offered a nice, thick dal, perfect for scooping up with a piece of naan.The lamb is fabulous - I've had the rogan josh, the korma, and one other. If you can convince them you really mean \"Indian hot\", the heat is exquisite - still tasty, not sacrificing any flavor for the spiciness.I would heartily recommend not getting the Tandoori Chicken. I've tried it twice, and both times the chicken (all white meat) tasted like it had been sitting under a heat lamp all day. Tough, stringy, essentially tasteless. And snd again strangely enough, it's not served with grilled onions, or lemon, as it is everywhere else I've eaten it.The Raitha is good, not terribly flavorful but nice to cool the tongue. Service is nice. They share the space with a pizza parlor (curtained off) but it never smells of pizza, only Indian food. I really hope they're able to make a few changes, like consistency. I'd love to visit more frequently, but after the last Tandoori Chicken, I'm going to try Taj on Nolensville for my next visit to Nashville instead."], ["Val P.", "I stayed away from Zyka for several months (although I live in the area) because of the reviews here, however last week was the first time I decided to go for it and try something from them. They offer free delivery with just $10 min order, so I thought \"what the heck, today's the day!\" I'll have to say that I was quite impressed! The food arrived on time, and was piping hot. The moment of truth came when I tried the Masala Naan ..... tasty, a little crisp on the edges, a little oily but not too oily, a little more spice would have been nice, but hey it was still really good! I haven't tried the other naans so can't comment on those, but the masala naan was really good. Next we tried their vegetable samosa. Note that each order is only 1 samosa, but it's substantial. Samosa was crisp, warm and delicious! Doggies enjoyed it too! (your dog may not be too crazy about it if he / she doesn't like spicy food). Then the chana masala ..... yum! Can't say it's the best chana masala I've had, but it certainly was good, and can't beat the price! The final dish we tried was the Malai Kopta. It was nice and thick, and very tasty, but a little too expensive compared to the rest of the food. So yes it was good, but I think it should have been a couple dollars cheaper. Everything else was priced right. All in all, the food was very good, and we've already ordered a second time from them! Oh and the portions were really good for the price. Note: even the Malai Kopta was a good sized portion, although I still think the Malai Kopta should have been a couple dollars cheaper. But guess what ? On my second order, we got the same foods, including the Malai Kopta, so I guess we must have really liked it! Will definitely be ordering from them again."]], "Chauhan Ale & Masala House": [["Johny D.", "This is probably the best Indian food I have had in the US so far. The food although not authentic, is creatively designed and is a fusion of different Indian dishes n with a slightly Southern touch. Right from the cocktail, to the pork belly appetizer which melted in our mouths, every morsel was sheer pleasure and delight. The place has a great vibe and I would highly recommend this joint!"], ["Loralyn D.", "We started with the Tandori Chicken Poutine from the happy hour menu and it was amazing! Kind of like Indian French fries. Highly recommended!Next we had the kale appetizer based off others' recommendations on Yelp and it was very unique. However, I liked the Tandori Chicken Poutine better.Finally, we had the seafood plate and meat and three for our main course. The meat and three was lamb and it was very flavorful and fell apart in your mouth.My only critiques are there were a bunch of flies that kept swarming the table and the temperature in the restaurant was a little warm on a hot summer evening.We'll definitely be coming back for more!"], ["Megan K.", "What an eclectic and inviting space! Unlike anything in Nashville!Full disclosure: I am not a huge fan of Indian food--mostly due to the fact that I am a newbie when it comes to ethnic cuisine... that being said, I really loved my experience at Chauhan.First and foremost, the building is very accessible and parking is ample. The layout and decor of the building is really beautiful and mesmerizing. I went to Chauhan for lunch with my colleague a while back--she had a Desi Tiffin, or meat + three (\"Chauhan's ode to Nashville\"), which was a TON of food, all of which she raved about. I opted for a special in the grilled cheese/tomato soup combination, which was heavenly. Super flavorful, very enticing for a rainy Nashville afternoon. Service was great, space was amazing--this would be ideal for a date night! Can't wait to go back!One more thing--the restaurant itself offered a series of cooking classes, led by none other than Maneet Chauhan herself. This added element of intimacy really sets Chauhan apart, and yet adds to the inviting and embracing nature that Nashville is known for."], ["Vikram M.", "This was a truly memorable meal.  There were 9 of us including 5 kids.  We ordered almost everything on the menu.  The food is super inventive.  If you want something traditional and Indian, you can do that.  If you want something of a fusion of Indian and western techniques then you can do that too.  We did a lot of both and found everything very well prepared.  I liked the fusion dishes such as the lamb nachos and braised pork belly to be the most interesting.  Excellent vegetarian fusion options included a chile relleno with a saffron sauce that was delicious.  Be sure to try some of the house made beers that carry on the fusion concepts such as including elements of cardamom and chile in the brew.  Also, the cocktails are brilliantly made and worth each penny."], ["Isa I.", "I came with my family of 7 for the thanksgiving holiday and was looking forward to trying this Indian restaurant after hearing great things. Although the food was great- Unfortunately the customer treatment we received by the manager, Allison, was less than desired. We arrived at 8pm, and greeted by her with \"we are hoping to close early, so if you could please order quickly\". We didn't complain since we knew exactly what we wanted to order anyways. The tipping point came when we felt rushed through every bite. The food was great and our waiter was doing what she could to lessen the rush... But when we asked for the manager, Allison, she made no effort is accommodating us or even apologizing for how poorly we were treated. In fact, she had a very mocking demeanor which came across vey disrespectful. Please take a hard look at your managing staff as we expected to be welcomed warmly."], ["Kimberly M.", "Came here with 5 of my friends for dinner last weekend and had a great time. We had made a reservation in advance and were seated right away. The hostess and our waitress were both super nice. We ordered a great bottle of wine and devoured the Heirloom salad and tandoori bread apps. I had the Saag Paneer for dinner which was delicious. I also tasted the lentils which were part of the meat and 3 and those were yummy too.I definitely recommend and would definitely go back next trip but have to knock off a star for the Bollywood videos on the wall because they were kind of distracting right above our heads and the cocktails ordered, while they tasted great, could have used another shot. Overall though we had a super fun dinner! Great spot for ladies night."], ["Mark S.", "Ok...I know its Thanksgiving. A tough holiday to work in the service industry. But regardless of this fact the server was short and rude. The food was over -priced. ($16 for cheese curd paneer kabobs?!?! 4slices of tofu-like protien and some grilled onions. AWESOME. And a $9 draft beer?)  We ordered the chutney appetizer w/ naan. We recieved 5 sauce dishes with a half spoonfull of each chutney. One of which was simply a un-ripe mango core and the server told us to \"eat around it\".  And to top everything off...they forced a mandatory 20% tip that was added to our bill. When I asked why this was, the server just said, \"we are short handed\". No other explanation. Definitely not deserved. Yes its a holiday, yes you may have less employees. But why the hell would I spend $53 on an appetizer an entre that my girlfriend and I shared and tip the rude server a \"mandatory\" 20% for garbage service and a restaurant that is in a location that would scare most tourists away."], ["Dene L.", "I heard great things about this place but I found it pretty average. The food was good but not any better than Shalimar or Woodlands yet cost a bit more. The server was in a rush to get us out from the beginning and we were seated at the front door. I think because we snuck in with an early reservation before the heavy drinkers arrive. I had even heard from a friend that the waiters were dressed up and handsome but I found them to look as cheesy as the bad projections on the wall. Again, probably because it was early and it wasn't dark enough and I wasn't drinking enough. The hostesses were far more interesting with heavily drawn on bjork-esque eyebrows and short dresses.I had lamb masala and the sauce was great but the lamb was slimy and fatty and poor quality. I had to keep spitting it into my napkin so...I am happy to have action again in this area of what used to be the Gulch. I miss pub of love and 12th and porter as this area was a fun hang back in the day..."], ["Sooz X.", "Food was lousy. My drink (some tequila thing that tasted closer to an old fashioned) was over-priced and just didn't taste good. Other members in my party were mildly satisfied but we all left with the same feeling. . .we could have twice the quality/food at Bombay Palace for the amount we spent at Chauhan. Back to the cheesy lunch time buffet for me!"], ["Josh H.", "I've been here twice now, and I'm still trying to wrap my head around it. In short, the food and vibe are great, the service is not, and the prices are high. They're at a 3 right now, with room to grow to a 4 if they can work out some kinks, or a 5 if they work out those kinks and lower their prices.MENUS (3.5 stars):The food that I've eaten has been a 4.5, but getting there is a little tricky, as the menus are confusing to navigate. They have a bar snacks menu, which overlaps with the appetizers section of the main menu. Most of the main menu is what many would call fusion cuisine. Many of the small plates and mains are familiar western dishes with Indian flavors and ingredients. They also have a traditional \"Desi Fare\" section of the menu where you choose your protein and curry, but these dishes are overpriced.Rounding out the menu, they have a daily meat & three. Admittedly, I haven't tried this yet, as it's hard to justify the price tag, but I can't imagine this sticking around as a successful staple of the restaurant. It seems like one gimmick too many. Let's delete this and simplify the options.FOOD (4.5 stars):The food has been great. So far, I've stuck with the small plates and bar snacks.The best thing I've tried has been the garam masala pork belly, served with simple greens and fresh apple and radish. The chunks of belly were crispy and caramelized on the outside and wonderfully melt-in-your-mouth on the inside.They have their take on both fish and chips and Nashville-style hot chicken (of course). The fish and chips were okay, but the fish was sadly pretty limp. I expect more of a crunch from fish and chips. The hot chicken is quite good, though hardly authentic - the ghost pepper dipping sauce was the best part.Other good snacks include the tandoori chicken poutine (amazing!), the kale parkora chaat (lightly battered, well-seasoned kale chips), and the black eyed peas tikki (black eyed pea cakes with cucumber raita for dipping).DRINK (3.5 stars):For an \"ale\" house, I was surprised that their beer selection wasn't more extensive. You can enjoy a relatively small array of craft beers and traditional Indian beers (e.g. Kingfisher), but the thing to try is their custom beers brewed in cooperation with Cool Springs Brewery (e.g. Garam Masala Ale, Chai Milk Stout, and Saffron Cardamom IPA). They also have some nice inventive cocktails at the going rate of $10-12 per quaff.AMBIANCE & DECOR (4.5 stars):It's nice in here. The vibe is very contemporary and modern, notably the projections on the exposed brick walls, but it's complemented by traditional Indian patterns and artifacts. Nicely done.PRICES (2 stars):Overall, this place is just a little too expensive, especially for Nashville. If they can sustain at these prices, more power to them. In order for me to become a regular, I know I'll need the prices to come down. Given their north Gulch location and proximity to downtown Nashville, I especially think they should rethink their lunch prices and make a real push for their happy hour.SERVICE (2 stars):Front of house is a mess so far. Both times, I encountered awkward and poor customer service at the host stand.The first time, we walked in at 5 p.m. on Sunday. We were asked \"What's your last name?\" as if we must have had a reservation. We didn't. How about \"Welcome to Chauhan. How many are in your party? Do you have a reservation?\" Our subsequent service was also terrible. It was a trainer/trainee situation, so they get a bit of a pass there. But it was early on a Sunday night, not crowded at all, and we had to wait so freakin' long for anything to happen. The dining experience took nearly two hours for a total of 4 drinks and 4 small plates. Unacceptable.The second time, I walked in with a group of young professionals at 5 p.m. on a Tuesday. We had a reservation, but if you had seen us, you would have known to ask, \"Are you here for dinner or for happy hour?\" After waiting for 1-2 minutes (which was unexplainable because no one was there), we were sat at our six-top in the completely empty dining room, only to find out that happy hour is only available in the bar area. So we had to move, which seemed absurd, because we were literally the only people in the restaurant who weren't being paid to be there. The only breath of fresh air service-wise was our bartender Asher. He was great.As a former server, I really hope to see the front of house improve."], ["Morgan H.", "great cocktails, the mussels were the best I've ever had, I wish the calamari had been more meat than breading...the non veg thali of the night was on point along with the okra!"], ["Steven H.", "We've been Chopped fans for quite some time, so my girlfriend and I decided to try out Maneet's new restaurant.... It was a great decision. The decor is great and trendy, the staff was so pleasant and the food was amazing. We had the garlic Naan for an appetizer, so fresh and light. I had the shrimp moilee and she had the chicken korma. Both were amazing and would recommend both. The chef was even in the building! She came over to the table to chat and take a photo with us. She was soooo nice and bubbly. The whole experience was fantastic and will definitely go back soon!"], ["Kimberly V.", "We had a wonderful dinner here with another couple we were visiting in Nashville. The interior is stylish, service prompt and helpful, and the food was delicious! Great cocktails/wine/beer. Highly recommend tikka masala, korma, guppa shots, and kale chips. We also liked the garlic naan. Great dinner date out in the city!"], ["Gabriella L.", "I honestly don't understand why this restaurant only has four out of five stars-- it deserves all five and then some.Chef Chauhan has done something special at her ale and masala house, she's created Indian Southern fusion and pulled it off entirely. Her food preserves the dignity and complexity of Indian cuisine, while integrating some of our favorite parts of American eating. Some of the stars of the menu include the Tikka Masala poutine-- why has no one thought of this before!?-- and the korma.Her menu also provides a meat and three option that varies daily. It comes with a side of lentils, vegetables, rice, naan, papadums and of course the meat of the day. My husband orders this every time and he's never been disappointed.As far as vibe, this place is beautifully decorated, the staff is friendly, professional, and interested in making sure they serve everything from the kitchen with dignity.For people wondering if they should venture out and try something new, this is a great place to go. For the unadventurous palate, this isn't a place you should be afraid of. Eat here. You won't regret it. Seriously."], ["Kristina L.", "Full disclosure:  I am not very knowledgeable about Indian cuisine.  And this should be a 4.5 but Yelp won't give halfsies...Of course, taste is subjective.  But I must say when it comes to a new place that I am besotted with, Chauhan Ale and Masala House is it.  I went last weekend and must say it was a delight of the senses - The décor is lovely, the smells emanating from the tables surrounding me, the delight of my cocktail and complimentary nibbles (spiced, puffed lotus seeds) were intoxicating and I savored these things. I have read that others were taken aback about the ordering process and having to tell your server all that you want when you place said order.  That did not faze me since it was explained that this is to help the kitchen have everything come to you in a relaxing flow of food.  It was an agreeable pace; neither too quick nor too slow.  It allowed for plenty of time to savor but not so much that you were left wondering when your entrée would arrive.  The other two at my table agreed.Service was fantastic.  Our server took the time to truly walk us through the menu and explain items in great detail - down to making flavor comparisons if we were uncertain of an ingredient or flavor profile.  It was refreshing to have that type of assistance when perusing many dishes which are unfamiliar to me.We certainly were pointed in the right direction as all three of us were hooked.  I had the daily special ode to Nashville of the meat and three.  The main course of the evening was tikka masala and while outstanding, my only complaint was that for $20, I only received 4 chunks of chicken.  Truly, that was my only complaint of the evening.  But with sides, rice and naan I was more than full.Yes, I am now head over heels with this place.  I already have reservations for later this month.  I plan on being far more adventurous this time and branching out.  So yes, go try this new feather in the Nashville culinary cap.  Enjoy the ambiance, and the exotic flair that Chef Maneet Chauhan has brought to our fair city."], ["Daniel M.", "Innovative and Delicious Indian Fare wrapped in Southern style! Freddie is one of the best bartenders in Music City and possibly the known world! Keep up the great work! Y'all need to get here in a Curry!"], ["Rachel H.", "My new favorite restaurant in Nashville! My mom, boyfriend and I tried this place a couple of weeks ago and I've been dying to go back ever since. We had mussels and kale chips. We got some classic Indian dishes for our main meal and they did not let us down. Service was also very good from start to finish. And check out the bathrooms and all the pictures of the chef!"], ["Hansa B.", "I would have selected a 5+ rating if that was possible. Have lost count of how many times i have visited the restaurant, but still can't get enough.The lunch menu offers a great blend of indian with southern food options. My fav is the tomato lentil soup served with grilled cheese sandwich. If you can't make up your mind, order the indian thali(platter) that offers an interesting variety of small portion bowls that goes beyond satisfaction. Although i say 'small' portion bowls, the platter as a whole can definitely satisfy more than one tummy!The dinner menu is equally interesting. You can find the blend of cuisines here too. Like the hot chicken served with a ghost pepper sauce on the side, or the mussels in tikka sauce. The ribs on the entree menu cannot be forgotten. Ofcourse, beyond this is the traditional variety of curries and kebabs. And the indian bread....OMG! They actually have a garlic parmesan naan(bread)!!! After all the hogging....there is no way u wanna skip the desserts!And of course..........the Sunday brunch takes it to another level. Could u ever imagine a parantha taco?? Try it!!! n ull thank me for just mentioning it! Its impressive how Chef Maneet can create such tasteful, satisfying and exciting food, that u only want to keep coming back for more. Delicious!!....is just an understatement of the food served here.N not to forget.....the pricing is too reasonable for the indulgence u get with a perfect ambience at Chauhan!"], ["Katie I.", "First Sean, then Jonathan, now Maneet. Nashville is finally getting on the culinary map! It's really hard to find an Indian restaurant that just wows me after having my Indian friend/foodie cook a homemade Indian feast. We have an array of Indian in Nashville, which some are good, however, Chauhan is in a league of its own.First of all, I'm thrilled to see that side of 12th Ave being revived. I hadn't been over to that side of Broadway since 12th and Porter days. The build out is incredible. Indian trinkets meet modern swank and urban vibe. It's got just the amount of class without being too pretentious. We've been twice now, and I have noticed the drink menu has changed a bit. The first time I had an awesome drink which I described in the pic. I mean, how many drinks have star anise in them? This time I didn't see that one listed, so I opted for a white wine, which was ok.The showstopper here is the kale appetizer. It's lightly fried (almost like a tempura) on a bed of spicy garbanzo and mint yogurt. There are so many layers to this, taste, flavor, texture. It's freaking amazing and you should get it. Most unique appetizer in Nashville.They have a meat and 3 changing daily. Several curries to choose from and other entrée selections. The prices are very reasonable to me. Most curries are under $18. The saag paneer was pretty good, but my absolute favorite is the chicken korma. It is truly elevated Indian comfort food. They do give you a lot of sauce with whatever protein you choose, so box it up and take it home. I could drink the stuff. Tender chicken, the rice is perfect. Perfect for sharing. Garlic naan- amazing. We tried a side of dal this time, one of my favorite things ever. Sadly, it was just ok. It was a bit soupy to me. I believe the server said it was a 5 lentil dal that day, but looked like mostly white/light colored lentils. I prefer green, red, black. I may try this again as they change it. Was too full for dessert, but I will be back and back again. I truly believe for those of you scared of Indian food, this place may convert you. It's a great place for a date, girls night, any occasion really. I also noticed they will be opening up for lunch soon and there is a happy hour Sunday- Thursday. Also, Maneet has been there both times working it. She is amazing and we are so lucky to have her in Nashville. Well done, Maneet!"], ["Eliza R.", "Chauhan Ale & Masala House was one of the best dining experiences I've ever had.  I was absolutely thrilled with all of the food and drink I ordered!  To start, I ordered a chai milk stout from a local brewery in Cool Springs.  It was $10 for a pint, and absolutely worth it.  For appetizers, my friend and I split the masala dabba and tandoori bread, which came with a wheel of naan bread and a variety of flavored butters and chutneys.  We also decided to splurge and get an extra wheel of garlic parmesan naan, which was absolutely fresh and warm and delicious. The menu is really interesting and there is a variety of food to choose from, ranging from more traditional Indian (such as chicken tikka masala) to inventive Indian-Southern fusions.  I ordered the guava glazed BBQ ribs, which came with a cold fingerling potato salad and collard greens.  The ribs were incredible, with super-tender meat that was falling off the bone.  At this point, I figured I should just go all out and get dessert.  I had looked at the menu before coming to the restaurant and I had my heart set on the pot de creme, which they were out of.  In its place, I had a spiced maple jaggery kheer sunday, which was OUT OF THIS WORLD.  It had rice pudding, spiced pecans, and some dried fruit.  It tasted like everything I wanted out of a dessert: sweet and light and satisfying.  The perfect end to the most delicious meal.So, this brings to me to the Chauhan's only downfall, which is why I only give it 4 stars.  The service is painfully slow.  Friendly and attentive, for sure, but perhaps too much so.  The waiter tended to ramble on about each dish, and give his opinion on it.  I'm pretty familiar with Indian cuisine, so I didn't find it necessary.  The food also came out very slowly.  To put it in perspective, I had a reservation at 7:30 and was planning on seeing a film at the Belcourt at 8:55.  By 8:45, we still hadn't received our check, even though we were finished with our entrees.  We decided to just go ahead and order dessert since we were going to be late to the movie anyway!  We finally ended up leaving at 9:40 or so.  Normally I like long dinners, but since I had plans afterward, I was a little disappointed that everything took so long.  I'll end the review here; the food is fantastic, the ambiance is lovely.  I wanted to go back the next day to try more off the menu!  Just give yourself plenty of time when you eat here, and make sure you don't have any plans set in stone afterward.  I'm happy to have this addition to the Nashville food scene - there's nothing else quite like it."]], "Persis Biryani Indian Grill": [["Teresa B.", "I love the food here every time I get a chance to be in Mt. Juliet showing houses . I have to stop and have something the place is so clean , the food is amazing and the staff love to please you ."], ["Lauren S.", "My family is always on the lookout for good Indian and we were hesitant when we saw a new Indian restaurant in Providence. The food overall was good, but some improvements could be made. We ordered the chicken tikka masala with medium spice and it was very bland and the bhindi masala's okra was either old or too woody. On a positive note the chili chicken and garlic naan are good. I would be willing to give this place another try after they get some more experience under their belt. Until then, Taj will remain king of Indian cuisine in Nashville."], ["Victoria L.", "I was excited for this addition to the dining options in the Providence area. The first thing you may notice when you go here is that the interior atmosphere is pleasantly sleek/modern and the host will greet you immediately.Everything on the menu can be ordered in three spice levels, appealing to a wide array of taste buds: mild, medium, or hot. So don't be afraid! The menu is standard Indian fare with some upgrades and fancy presentations. Both times I've been, my meal has been wonderful and served quickly. My friend ordered the goat dish and it had a lot of bones in it. He ate around it and said it was delicious but the bones were unexpected. The service is very friendly and helpful and you'll never have to ask for a refill. Unfortunately, they haven't quite nailed the aspect of how often to check in with guests. I think perhaps they are so concerned with providing excellent customer service that they have become a little intrusive. Our waitress left to get us refills, but before she came back two other employees had already interrupted our conversation to ask if we needed water. Normally this would be considered wonderful, however this situation happened multiple times and became disruptive. I certainly hope they find a good balance soon because the food is delicious at a great price and I will definitely be going back!"], ["Aaron J.", "Came here with a large group of 12 people and the service for our party was great. We got there around 630 when it was a little less crowded and must have gotten nearly every appetizer, the Chicken 65 + grilled shrimp were so good we ordered a 2nd round. I really liked the Apollo fish too. The waiters kept the beers coming and we all did family style for the entreès with my favorites being the butter chicken, goat vindaloo (its spicy) and the chicken tikka masala, which was one of the best I've ever had. The garlic naan was on point and I had to roll myself outa there I was so full afterwards. Definitely check this place out, I think its pretty new. They also have 2 TVs behind the bar and were showing the MLB wildcard games."], ["Dagan B.", "The food was good, the staff was nice, the restaurant looked nice. The quality was a 4 but the mix of spices was a little off. The shrimp and goat biryani were good but the more you eat the less good it is, The naan was ok nothing special but not bad. The lamb vindaloo had the best flavor but the more you eat the less good it is. I dont know why the food is good in the beginning but becomes less good lol I havent experienced that much in my life. The chicken 65 was supposed to be fried but was chewy and not breaded and just kinda tasted funky... not terrible but not good either.I want to give a 4 but I just cant."], ["Fabiano L.", "Very good Indian addition to providence.They are still adjusting their service that is why I do not give 5 stars."], ["Cory K.", "Fantastic food and service is steadily improving as they get their feet under them. The owners and servers are as nice as can be, and they anticipate their liquor license being approved soon. All in all, it's now the favorite restaurant in Mount Juliet for me and my wife - we've taken out or eaten there 5 times since they opened less than a month ago! The clean white decor gives a great ambience - I'd call it \"fine casual.\"We have tried all the chicken entrees - they're equally delicious, though could use some diversity. The vindaloo is the most different from the others, which all resemble butter chicken. The biryani are all very-well prepared and makes a great side dish. Naan is so fresh, crispy-yet-soft... I want some now!The flavor absolutely comes alive in your mouth - if you've not tried Indian food, or it's already one of your favorites, you will love the experience at Persis."], ["Ella A.", "Wonderful food! Great service! We are visiting from out of town - wish we lived closer.  Paneer Butter Masala had wonderful mild flavor. Samosas also delicious and loved the Masala Chai Tea. Try it! You won't be disappointed."], ["Amol B.", "I have been to this place multiple times and the food was great every time. Authentic Indian food. One of the best Indian restaurants I have been to."], ["Sofia S.", "The food is delicious! I got the garlic naan and paneer masala... Such a comforting dish. I'm craving it now!"], ["Marcus M.", "This is an absolutely wonderful and authentic Indian restaurant.  The food is top-notch, and the staff is very friendly and helpful.  I got the chicken tikka masala, and my wife got the paneer butter masala.  Both were exquisite!  Prices are a bit high (no buffet here), but you're paying for quality --- it's worth it!This is an absolutely wonderful and authentic Indian restaurant.  The food is top-notch, and the staff is very friendly and helpful.  I got the chicken tikka masala, and my wife got the paneer butter masala.  Both were exquisite!  Prices are a bit high (no buffet here), but you're paying for quality --- it's worth it!"], ["Kurt B.", "Great new addition to the Providence area.  Had the Tikki Masala and it was delicious!  Will definitely be back!  The Garlic Naan was great too"], ["Andrew P.", "The good was great and it was very nice inside. Only thing I would recommend to the owners is to get some more waiters and waitresses and have more details on the menu.  I'm not even sure what I ordered but it tasted great."], ["Chris K.", "Fantastic classic Indian food, and very well executed.  Great atmosphere, great service, and delicious fare paired with traditional Indian beers. I will definitely be going back."], ["Becky C.", "Absolutely fantastic food! The chicken tikka masala, chicken 65, and the garlic chicken are all absolutely incredible, as well as the saar and garlic naan. Nice place. Very well-lit and clean. This is officially our new favorite place to eat in Mt. Juliet!"], ["Barb L.", "Our second time back. We were there for the first night of their soft opening and it was great. We went back tonight for their full menu and, if we could eat EVERY meal there, we would! Chicken Tikka Masala, Paneer Butter Masala, Plain/Butter Naan and Garlic Naan - all totally delicious. Wonderful rice - perfectly prepared.They were pretty busy and we are happy to see that because we want Persis Biryani Indian Grill​ to be her for a long, long time."], ["Kris M.", "We've been waiting for this place to open and they did not disappoint. Great food and healthy portions. We got the kids meal with the chicken for my son...like little Indian chicken nuggets. Phenomenal! Yes, I ate most of those. The best thing is you can tell these guys are working hard. It was nice to talk with one of the owners and get to know him a bit. We'll definitely be back. Whoever you have in the kitchen is NICE. I can't wait for the leftovers...always better the next day!"], ["Chris T.", "While I am not an expert on Indian cuisine, I've had enough to give an honest review. First, the food is well prepared. I had Palek Paneen. Pardon the surely misspelled name. My friend had the Chicken Masala. They were both flavorful. The garlic naan was my absolute favorite. As previous reviews indicated, the prices are a little high for this cuisine and service, but not this area. This restaurant is in the \"classy\" part of the city. The servers are nice, but not engaging. I don't think anyone there has ever served, they never took any of the dirty dishes away. It looked like we were at the dishwashing station. That is one of my pet peeves, if I'm sitting here knocking around empty dishes every time I grab my water, something is awry. Apparently the place is still under construction as I had to use the restroom hovered over a toolbelt and tools. Tools were scattered all over the floor."], ["Robert E.", "Very well prepared and delicious meal. I had the lamb chettinadu with garlic naan but also tried the dishes of the others in my group and each and every one was delicious. We'll be back to try the other dishes on the menu!"], ["Joy D.", "Would suit Non- Indians. Food is ok, less spicy and extremely costly. The price is more aligned to costlier cities like New York. Probably since this is only Indian restaurant in Mount Juliet, they are taking good advantage."], ["Ashley P.", "Best Indian I have ever had! The food was fresh and delicious. Staff are very friendly and attentive and restaurant is clean and welcoming. The paleek paneer and briyani were amazing!"], ["Rachel ..", "Best Indian food in Nashville... and it's in Mt Juliet!  We tried all the veggie lunch options, and all were delicious and perfectly spiced.  Can't wait to go back!"]], "Tandoor Indian Restaurant": [["R H.", "It's so clean and bright! Servers were helpful. The food was delicious. Had the korma, samosas and naan. Plus indian tea for dessert. I'll never have to go to that other place again! Thank you Tandoor!"], ["Nikki S.", "Awesome place! I had the chicken tikka masala and it was great. My dad who hasn't had much Indian food had the chicken makhni and he ate every bite. The portions were maybe a tad small but I would still not hesitate at all to eat here. I can finally stop driving to Franklin/Nashville areas for good Indian food!"], ["Wendy J.", "Ate there for the first time today. I was in a hurry so just got lunch to go off the buffet. The server was very attentive letting me know what items I could enjoy. I am vegan and appreciate when servers are knowledgeable about the ingredients. She even went to check on one item she was unsure about which is why I gave 5 stars because she really cared, she was not just putting on a show of concern. The food was delicious! I loved everything I got and the Naan was perfect. So happy this place opened!"], ["Jessica H.", "My husband and I had dinner here tonight for the first time. After speaking with one of the servers I learned they have only been open for for weeks now and don't have their beer or liquor license yet, that's brand new in the world of restaurants.  My husband and I convinced have a total of 9 years in the food industry and we really appreciate good service when we get it. The staff was very friendly and attentive without hovering, the atmosphere of the restaurant is comfortable and welcoming without being lazy, some still feeling fancy without being stuffy. With a healthy mix of booths and tables this restaurant was far from cluttered our crowded and is definitely family friendly. The food was absolutely outstanding and shockingly low priced, two entrees and an order of naan for $33.00. My husband ordered one of the Lamb dishes and the meat was cooked beautifully, I ordered Keema Matar and the flavor was exceptional, the spice levels were perfect for us both, which is always a good thing. The keema naan is great and the papadum is always my favorite. We will absolutely be going back, and soon I hope."], ["Jacqueline E.", "This is the best Indian food I have had in Tennessee! I work right across the street and I cannot wait to come back and try the buffet! I checked in on Facebook and while I was still eating 2 different groups of friends came in after seeing the post because they were so excited that there was a new Indian restaurant in town. I am going to continue to spread the word because this place is incredible! The staff was very friendly and the food was so delicious. I plan on becoming a regular."], ["John B.", "This is one of the best Indian Restaurants I have been to in Tennessee. The Vindaloo is world class. We also had Tikka masala and Alo Gobi both of very high quality. Can't wait to come back next time we are in Murfreesboro."], ["J C.", "In a town inundated with chain restaurants (read: Olive Garden, Red Lobster, Chili's), Tandoor is a culinary oasis. I was so excited to see an authentic Indian restaurant squished between The Chop House and Bonefish Grill. My stomach demanded something spicy, rich, and savoury, while not being greasy and salty. Tandoor serves a great chicken vindaloo. I got a spice level of 5 and it wasn't overwhelmingly hot for my Latino taste buds. I think that I could have handled a 6. The chicken and potato were moist and absorbed the spices and flavouring of the vindaloo sauce very well. I also got an order of garlic naan - perfect amount of garlic, butter, and herbs. The portions were large and I was stuffed with leftovers to take home. Moreover, they have a lunch buffet during the week, which has a lot of options for both meat-lovers and vegetarians. This place is awesome for those who are looking for a change in their dining experience in good ole Murfreesboro, TN."], ["Dee B.", "Yesterday, after watching the movie Second Best Exotic Marigold Hotel, we  wanted to have Indian cuisine for dinner, and I had read about this new place....  We had stopped by in the afternoon but  they were closed -- they close at 2:30PM after lunch, and reopen at 5PM for dinner -- they have a buffet at lunchtime and we will be doing that soon too... The decor is modern, cloth napkins, glass tabletops...We ordered assorted appetizer for 2 which was all delicious!  Also had the papadum (paper thin wafers that are soooo good!)  My tandoori chicken was huge, and very good although a little too mild for my tasts so will try something with spice next time, the lentil soup that came with it a tad salty but very good.....my husband's shrimp biryani) was ordered medium hot and it was perfectly spicy, delicious!  The mango lassy is not to be missed, like a milkshake and perfect cool to the hot spice.....can't wait to try the lunch buffet!"]], "Cafe India - Bakery and Cuisine": [["Hattie J.", "I've been here twice so far. The first time we ordered the Bhel Puri Chaat, which was delicious. A very nice option for a snack! The second time, we stopped by for dinner. I had the Peeli Daal...which was very flavorful and a generous portion. My boyfriend ordered  some Dosa, which he seemed to enjoy.The shop is rather small and seating can be tricky, and the service seems to be a bit slow, but otherwise, a great option for Indian food in the Franklin/Cool Springs area !"], ["Kiwi G.", "We have been to this restaurant several times and it has progressively gone down hill, we won't be going back again.There is only vegetarian, chicken and goat on the menu, (goat wasn't available last time we went). There is only soft drinks and beer available ( no wine). You now eat off paper plates with plastic knives and forks, it is a little cheaper than some other Indian restaurants around. The furniture and booths need upgrading as they are falling apart."], ["Munch B.", "The best place for Indian food ,if you want to try something different Other than paneer or chicken tikka masala.. Must triesChicken fried riceBombay sandwichPastriesCoffeeWorst to try:Gobi manchurian"], ["Alvin P.", "Hidden Gem.I've been here a few times now, all for ordering out, and I have to say the food is plentiful in taste and portion.   This is located a bit far out from me, but I've made the trip mainly because I think the prices make it worth the extra few miles of driving.   It's located in a strip mall setting with plenty of parking, and is pretty much within walking distance of the Galleria Mall.   The size of the store isn't enormous, I would say maybe the size of a large sandwich shop, but the people there seem to be friendly.  I've ordered these thing(s) over the course of a few visits:Veggie Samosa:  Very tasty, pastry is soft enough and the filling doesn't overwhelm you.  I don't like Samosas that are hard to break, and seem to crumble in your hands.  This has been a staple in every order of mine.  Samosa Ragada Chaat:  I tried this out, mainly because I liked their samosas, and this was very tasty as well.  The Chaat adds a nice flavor to the samosa, which is cut open.  Veggie Puffs:  Probably one of my favorite dishes to eat in terms of Indian food, and this is one of the few places I've seen that actually offer it.  The size of the puffs is much larger than I expected, and they taste very good.  Egg Puffs:  This one is enormous, with one boiled egg inside, and I have to say this was delicious as well.  Dahi Puri:  This one was a good dish as well, not quite as good as the Samosa, mainly because the Dahi was separate from the Puri for the take out order, and mixing and matching didn't work out amazingly well.  It's tasty though.  Pani Puri:  The dish was a bit of a disappointment, I didn't mind the Puri, but the accompanying masala water didn't taste authentic to me.  Onion Dosa & Masala Dosa:  I've gotten both types of dosa, and they have been great.  The portion size is large indeed and they do achieve the softness that I look for in most dosas.  I don't like them to be extremely crispy, I would like them to be borderline crispy but still slanting towards the soft side, and this place achieves it. Malai Kofta:  I think this was a good curry to order, although it's not the best that I've had in Nashville.  I can't complain about it, the portion is large, the taste is good, and it's something that most people would enjoy.  Veggie Biriyani:  I thought the Biriyani was good, but I didn't like the size of vegetables in the dish, almost all of them were very large.  I wish they would cut it down to smaller sizes, because the vegetables overwhelm the dish at certain points.  The taste is good though.  Veggie Pizza:  I tried this out mainly because I was just curious as to how they would do pizza, with low expectations, and those expectations were warranted.  This is something that I would most likely avoid, I didn't like this one much at all.  I think the best thing about the place is the prices.  They don't cost an arm and a leg to order out, and the food isn't compromised.  There is another Indian place I like better than Cafe India, but it's definitely more expensive (almost double), and every other place in the same price range just doesn't compare taste wise.  They combine very good prices, with excellent taste to give you a really good experience.  While I was there, I do think they also give you free refills on fountain drinks.  The people working there have been friendly each time I've visited.  The first couple of times I was there, the place was pretty empty, but the last two times, there seemed to be way more people there, so maybe the word is spreading about the establishment.   I would recommend this place to anyone that likes Indian food, and likes to save money when ordering out."], ["James M.", "I was pretty happy with my visit to Cafe India. It was a good mix of affordable, flavorful, and filling. My fiancee and I went here to pick up some take-out on a random weeknight. I called ahead for some Saag Paneer and Chicken Biryani. When I got there, I was craving some samosas and naan so I added those to the order. The samosas required an extra 8-10 minutes of waiting for the food, which was fine.Cafe India gets extra points for being the most affordable of the Indian options in this little part of Cool Springs. The food itself was good, not great, but good. I liked the flavor of the Saag Paneer and loved the Samosas (potato goodness). My one complaint was that the Chicken Biryani was made with whole chicken instead of chicken breasts or even just de-boned chicken meat which necessitated way too much search for tendons and bones while eating the entree. It's a pithy complaint, I know, but I just really don't care for going through searching for bones in my meal. In the future, I'll just order veggie entrees when getting Cafe India and will likely be very happy with the result!Pros:Affordable-This is by far the most affordable Indian spot in the Cool Springs area. Welcoming- While the decor is nondescript, the people are nice and welcoming. Flavorful- I enjoyed the flavors they had in their Saag Paneer and Samosas a lot. The Samosa in particular was a standout!Cons:Chicken bones in the Biryani. For some, this won't be an issue but I prefer to not have to dig through my meal looking for bones prior to eating it. The decor left a little to be desired but I didn't come for the decor.Overall:This is a decent quality and great value Indian option in the Cool Springs area. My fiancee and I easily made two meals out of our two entrees and one appetizer. It's a great option and we'll be back for an Indian fix, I'm sure."], ["Craig W.", "I have eaten at Cafe India a few times and it is always great! The spices are more traditional and less westernized as other Indian restaurants have become. Two of my favorite things are Pani Puri and the meat lunch special (see pictures provided). I highly recommend cafe India to anyone who enjoys authentic Indian cuisine."], ["Adam C.", "Prices and food are very good, service can be a little slow though. Paneer Tikka Masala is excellent and there are many vegetarian options."], ["Lyrad V.", "Yet another Indian restaurant has popped up in Cool Springs, and like the others, they haven't disappointed. Cafe India has better prices in comparison to others in the area. They didn't have my favorite dish listed on the menu (paneer butter masala), but they were happy to make it for me and it was good and spicy.Cafe India is a bakery, and has a large variety of items that look good, although I didn't try any of the baked goods, but may on a future visit."], ["Karen G.", "Food is tasty and delicious.  That's the end of the good news.  The food is served on Chinette paper plates w/ plastic picnic ware - there is nothing I hate more!  Every surface in the entire restaurant needs to be cleaned.  The front of the garbage containers are filthy, the glass cake cases are disgusting, and the floors/windows/bathrooms look they have never been cleaned - ever.  Behind the register are steel shelves/racks full of crap - this should be in the back out of sight.  We visited on a Thursday night at 7:30PM.  In Brentwood/Franklin this place should have been packed - it wasn't.  The most confusing bit is why they are attempting to sell cakes....not special Indian pastries mind you, but closer to Baskin Robbins w/ the catalog on the counter etc. Super Weird!We enjoyed our food very much - next time we will order take out so we don't have to look at the filthy restaurant or eat off of plastic ware."], ["Jill D.", "What a disappointment! It took an hour to be served. We had to ask three times for them to check on our entrees. The owner was quite rude and wouldn't acknowledge us. The Gobi Manchurian was decent. However, my husband's Chicken Tikka was below average. We finally left without my 11 yo being served!Overall, it was a terrible experience. We won't be back."], ["Anna J.", "Excellent Indian food at amazing prices! We walked in and were the only non-Indian people, so that's a good sign. The chili wings were awesome, but brace yourself it's very spicy. The chicken masala was the best I've ever had. The chicken was tender and the sauce was creamy and delicious. I also had the potato samosas. Normally they are served with dipping sauce (prob to mask how dry they are) but these were served alone, and it was so flavorful and moist! Yes they serve everything on plastic plates, but who care if the food is truly amazing, plus they can keep the cost down for all of us!"], ["Zainab K.", "As a Pakistani girl who is accustomed to eating South Asian food just about every day of her life, this place is WORTH IT! Because of my heritage I've always been (overly) critical of South Asian restaurants but the food here is wonderful. It's flavorful, plentiful, and affordable. Also, the staff here is really pleasant. Every time I order a new dish from here (their menu is pretty extensive), it always feels like home."], ["Michael D.", "Amazing Chaat, wonderful pastries...no frills cafe...good take away...best Indian I have had so far on Middle Tennessee!"], ["Bethany B.", "My husband and I actually turned into the wrong shopping center but I'm so glad we did.  We saw the sign for Indian food and decided we needed to stop in.  We'd been out running errands so we were both dressed fairly casually which was perfect because Cafe India is a bright and happy casual sort of place.  Come in, grab your own fountain drinks, paper plates and plasticware and then the incredibly kind proprietress takes your order and waits on you throughout the meal.  Everything we tried was absolutely delicious from the Chaats to the Tika Masala to the Black Forest Cake for dessert.  For sure the best Indian food I've had in America...and even better than some I had in India.  The menu is impressively lengthy with lots of veg and non-veg options, even a full pizza menu (I feel the need to go back and try the chicken tikka masala pizza!), appetizers, sandwiches....lots of options.  The kind of place that you could find a \"favorite\" meal, OR order something different every single time.  We loved being able to walk right in and sit down without a wait, but the place was hopping the whole time with everyone from a large group of friends to a young couple on a date to a family with little kids.  I've already requested my birthday cake be a Cafe India black forest cake.  It was SO yummy!  If you're looking for the best Indian food you've ever tasted at a price that easily fits in the budget (portions are generous as well) that's comfy and friendly and happy then you're welcome because we totally found it for you.  And the Nashville Indian community seems to have wholeheartedly embraced them which leads me to believe that the food is truly as authentic as I think it is.I'm lobbying for a 12th South location."], ["Michele S.", "Still loving it-so we went back the next night. (Who does that?) only people who have found a gem and can't get enough .On this trip we noticed we were 2 of just 4 Anglos in the place.One Indian family now living here said they don't  need to return to India anymore, now this great food is here.We believe it!"], ["Yash P.", "So I was in the area for work training and I found this place on yelp. I was excited becuase the menu looked great and reminded me of home cooked food. So when I walked in placed my order twice becuase the first time the lady at the register I assume miss heard me the first time, big deal. HOWEVER after she took my order she didn't even place the order. She left the receipt that she needed on the counter top and then proceed to take her lunch break. I waited patient thinking that someone else on the wait staff you just place the order becuase my receipt was still on the counter, nope I ended sitting there for 45 mins! During which I sat across from this lady on the other side of the counter while she ate her lunch hoping that she would tell someone about my order. NOPE DID NOT HAPPEN. Instead after the 45 minutes passed she came up to me and asked, \"Sir, what did you order again?\" I was furious, but I exercised restraint and said the two chicken wraps. I then proceeded to wait another 15 minutes for my food, which was not that great plus it was cold. I know I'm am a person with patients but this was a test of my patients becuase I have never waited over an hour for a to go order. In addition I have never had this level of crappy service in my life and crappy is a polite way of what I'm feeling. I would never recommend the place to anyone and for everyone in the nashville area I would avoid this place at all cost!!!"], ["Meg P.", "Been here on saturday. Arrived at 7 pm. Ordered goat biryani, garlic naan, butter chicken and pineapple pastry. Food arrived half hour after ordering. Food tasted fresh, spicy enough & great. We are happy we came across this restaurant. We plan on trying different items on our next visit. Well done Cafe India ;-) Please don't loose your charm (don't you become mediocre with time)."], ["Amanda Mae S.", "Great food, generous portions, FANTASTIC pricing (would pay at least double in a nicer setting). Order at the counter, casual setting, TONS of vegetarian and G-free options. Very excited about this place!"], ["Joanna F.", "Had dinner at this place. The waitress was really helpful in recommending what we would like. We let her know that we like spicy, so she recommended Rogan Josh Goat and Chicken Chettinad. They were both good. Served with rice and we ordered naan too. Minus 1 star for the slower service, but everything came out fresh and tasty. The prices were pretty good too. I am not too familiar with Indian cuisine, but I do like curries and their curries were definitely on the spot."], ["Vikram P.", "This is the best place to eat food, the food is very affordable and very tasty. A south Indian restaurant but has its fast food items. Challenge the cook and he likes to takes it. The only concern here is the use and throw plates, spoons etc which turned me down but it pays of at the actual cost of the food and I am happy with it. also the cleanliness must be improved very much. I always have good conversations with the management over here. I came directly from the bawarchi to here after they kept the money on my table. Please it's  a restaurant and people come to eat there. Do not put news channels and scare people with ebola news. Put some nice music or something else."]], "House of India": [["Tyler B.", "I just realized I haven't reviewed this place, and after having visited half a dozen times, I don't know what kept me waiting so long. I LOVE House of India. Before I met my husband, I was not a fan of Indian food. (He is obsessed with it.) He had to introduce me to Indian dishes he thought I would like, but I still wasn't impressed. After going to House of India, I realized it was only because I hadn't had AMAZING Indian food.This place has that AMAZING Indian food. Their chicken makhani is my favorite. I also love the chana masala, and the garlic naan is to die for!!! Get the garlic chili naan if you can handle spice, but beware, it is VERY spicy. I knew this place was legit when we took our native Indian friend here, and he loved it too. The lunch buffet is an excellent opportunity to try several different dishes if you are curious about Indian food or want to try this particular restaurant for the first time. It's also great if you are just craving it all and can't make a decision. They bring fresh naan to the table at lunch, but not garlic naan. Just regular butter naan. The service is also excellent here as well. They are very attentive and usually bring you a delicious rice pudding for dessert even after you tell them you are too full for anything sweet. They are very hospitable."], ["Shawn B.", "Food was ok. Nothing spectacular. One dish was overly spicy and the other was completely bland.Service was ok but a couple of the wait staff had BO issues .I guess I'm from New Jersey so maybe I'm spoiled from all the better quality of food that's available to us.I wouldn't visit this place again and won't recommend it. I'm certain there are better 'Indian' options around Franklin, TN."], ["Salman S.", "Have been coming here for over a year and i think now is the time to finally add my 2 cents for this place. If you have been here you already know there are 3 other places in the same block offering a Indian Buffet for $10 and they are all well kept and maintained. The only reason i come here every time is just one, i,e  the FOOD just tastes homely. First these folks hail from Punjab India which is the mother of home cooked food, 2nd their food just tastes the same every time no ups or down. The buffet is your normal buffet but everything is freshly prepared and served not just dumped on and left for 4 hours. They go for their usuall Daal Fry, Saag (spinich) which is made exactly how my mom makes it so makes it even more delicious. Do try these guys and you will get a yelp discount as well."], ["Michele S.", "Very attentive service and delightful flavors. Enjoyed dinner friends in the circular booth which is perfect! You don't get the idea it's in a strip mall at all. Seems more like a neighborhood place.All four of us enjoyed our food- Chicken Tikka Masala and Saag Paneer were fabulous. Nicely flavored. Will go again!"], ["Chris M.", "Having spent numerous months in India on two separate occasions, my bar for legit Indian food is set high.  \"House of India\" surpasses it with flying colors, particularly with their Chai (yes yes yes) and veg pokora.  Insanely delicious.  I'm here once every few months; can't wait to return.  Lunch buffet is where it's at."], ["Christy Y.", "Went for buffet, tandoori was dry and when the bones inside look dark that bothers me.  My seat in a booth had a permanent divot that if I sat there would have made me 2 inches lower than normal. Everything was kinda the same flavor, so my review is meh, glad I didn't get a stomach bug from my food."], ["Sarah M.", "Service was great and food is delicious. Tons of fresh selections on the buffet and yummy naan. Oh! Don't forget to try the Indian spice tea!"], ["Anita P.", "Excellent Indian food!! The service is great as well! No complaints from us. Definitely a great place to go for Indian!!"], ["Alex P.", "I love this place. The food is so delicious and they can make the food not spicy at all. They have great hours and easy parking. It's usually packed on the weekends."], ["Adelemm T.", "This place is amazing.Went in on a thursday night around 6pm. Wasn't that busy, but as the night when on it did continue to get busy. Definitely a popular place.Ordered Chicken Tikka masala and garlic naan. The portion looked smaller but it was definitely filling. I came in with my boyfriend and we decided to share. It does come with rice unfortunately I don't eat rice, can't vouch for that. We also then ordered the rice pudding with Indian Chai tea which was phenomenal.Friendly service. Not overpriced at all."], ["Leanne B.", "House of India had a relaxing atmosphere with and incredibly attentive staff.  We went for dinner, were seated immediately, and were treated very graciously.  I felt like I was in a very upscale restaurant with the way we were treated. The food was amazing. The garlic naan was just the way I like it - lots of fresh chopped garlic.  My husband reported his vegetable curry dish was \"the best Indian he's ever had\" (and we've eaten lots of Indian). My chicken biryani was very flavorful and spiced to my preference.  The chicken tikka my dad ordered (first time with Indian food), was \"delicious\".  They even brought us a sampling of rice pudding after we were finished. The owner is very proud of his restaurant and strives to offer the best. We will definitely return.  They have a  fairly substantial  lunch buffet.  Lots of great vegetarian options, too."], ["Prashant S.", "This is by far the most authentic North Indian restaurant in Mid TN. I really like their naan that is served on the table during buffet. The food is delicious and the staff is courteous. Their meat items are the best, I think. I didn't give 5 stars because I think they can use better quality utensils."], ["Michelle S.", "Chicken tikka masala extra extra spicy and garlic naan. Wow! Amazing stuff, go now! I'm an avid connoisseur of indian and rarely is it spicy enough. Kudos to great flavor and heat!"], ["Johnson K.", "My family loves House of India! We eat there at least once a week, and have never been disappointed. The service and staff is second to none. The ambience is lovely and authentic. There are so many options on the menu that there is sure to be something for everyone. My favorite is the Baingan Bhartha (vegetarian), my daughter's is the Mango Chicken and my husband has tried everything on the menu. If you're not sure what to get, Ranjeet (the owner) makes great recommendations. Make sure to get the garlic naan and a mango lassi, you will not be disappointed."], ["Michelle P.", "So I've been pretty hesitant to review here... and not because it's bad but because I think I've become an infamous \"to go\" regular! I have eaten here for dinner (INSIDE) before with a friend and thoroughly loved the experience, it reminds me of going to my favorite dosa places in Chicago (clearly I don't go here for the Dosas but it's as authentic and welcoming as Devon Ave was back up there. I promise if you want a solid Makhani, Korma, or Vindaloo (my favorite!) fix this is your place to go! Most portions are enough for two meals! They always give service with a smile and definitely fulfill my weekly Indian cuisine cravings :)"], ["Cher Y.", "Welcome to Cool Springs, House of India! Let me count the ways I love thee excellent food and service! Pros: -Food is excellent in flavor, variety, portion sizes and prices-Friendly service.  The owner walks around to check on customers.-Accommodates both meat eaters and veggie lovers alike -Nice dining ambiance-The leftovers taste even better reheated the next day...yum!Cons:-Limited drink menu selections for beer/alcohol"], ["Ken S.", "Great food, authentic atmosphere and incredible team. There are a few choices of Indian restaurants in the area but House of India is the best!"], ["Kasi Z.", "This was my first time going to an Indian restaurant and I must say that I was a fan. We went for their lunch buffet, which was great because you have a few options and as a newbie it helps to see the stuff before actually getting it. The food was very flavorful and spicy, and they have a lot of options! We looked at the menu out of curiosity and there are a lot of dishes to choose from if you come for dinner. Even though I didn't feel like I ate a lot I ended up really full, which was good!"], ["Hart P.", "Excellent India food. Not being one who knows a lot about Indian food, the staff was very helpful in selecting food we would enjoy.My wife and I have added this place to our date night rotation."], ["Mary F.", "So, we came, a little broken b/c our favorite Indian restaurant in Cool Springs--Swagruha--is gone and we haven't had the heart to try another place for months now. But, it was a Sunday. We were hankering for something that was not from our own kitchen. We rolled through our favorites that were close, in Cool Springs. Was there Indian food here to try?  We'd been to Biwrachi Biriyani Point. There was Bombay Bistro--hip, clever cocktails, excellent tikka masala. But then we found House of India on Yelp. *Eyebrows up* reviews were good and great. My lip curled. If Swag didn't survive, how could anything come close to appeasing my snobby demands?But, it had been so long since we had the Spice. So, we bundled ourselves up and highed ourselves to HOI. As we walked in the door, I thought, grrrr, this feels a little like the Raj's British parlor. We were seated in a booth with broken down springs. Someone lit the table light that smelled so strongly of petroleum, I wanted to gag. Sounds like it's going to hell from here, right?Wrong. I was so wrong. As one of my sons said, his sadness at missing Siva and Vijay made us feel grudging toward this restaurant. Each of the beginning dishes made us feel disloyal. We were discomfited by being there. But, one by one, we were won over by the food. We asked for the dishes to be super hot--spicy. And they were. My ears were ringing pleasantly. They do not play here. We had the kebab appetizer, the goat biriyani, lamb saag, tadad daal (yellow lentil as), chicken 65, and gulab jamun and masala chai -- hot sweet, redolent with spice. The tadad Daal was absolutely stand out. Very garlicky with strong notes of cumin and arse-kicking heat. The goat biriyani was far wetter than I preferred and heavier on cardamom than I expected but damned if I didn't get a little addicted. The lamb saag was smokey, earthy and delicious. The chicken 65 was not great. Too sloppy and greasy. Here, I missed Dr. Vijay's Chili Chicken. We also missed Siva's meticulous dosas and abundant freshly sliced red onions. Sigh. But, this food was very, very good. The environs don't necessarily appeal to us but the food is excellent. We will be back. HOI has a robust take out business so maybe we are in good company. While we miss the Swag family so very much, we are delighted to find a new Indian restaurant in Cool Springs that turns out exceptional food that is flavorful, garlicky, and highly seasoned. No hesitation here in the spice and heat. Delicious."], ["Stacie G.", "I love Indian food and have had a hard time finding good Indian food in this area. I have finally found my spot! The wait staff is amazing, the owner is very cordial and helpful! The atmosphere is also amazing. I am in love with House of India!"], ["Suranjan S.", "You cannot go wrong at this fantastic restaurant. Ranjeet will take absolute care of you -- every dish is superb. I recommend that you try a mix of dishes and share -- the kebabs are particularly succulent. I am familiar with authentic indian food; the cooks here come straight from Punjab. Other indian restaurants in the Nashville area are good, but House of India is in its own league. *Highly* recommended."], ["Coleen Q.", "We love, love, love this place.  Food is great,  wait staff so friendly and polite!  Just a wonderful experience EVERY time!!"], ["J.r. G.", "Even with ice and snow this indian masterpiece was open. Best I have tasted since living in NYC.Enjoy!"], ["Ross C.", "Love, Love, Love this place!! I travel a lot and they have the BEST chicken tikka masala hands down! Always look forward to my trips to Nashville so I can eat here. Friendly service and good prices. Yum!"], ["Dale L.", "Just moved from Wisconsin 5 weeks ago. We have tried most of the Indian restaurants in the area and this will be our 2nd time eating here this week. Food is amazing and very consistent. Recommend to anyone looking for great Indian...worth the drive for us."], ["Gregory R.", "It's not often I give a five star review on anything.  It comes from a lifetime of working customer service and knowing how to excel at customer satisfaction, and frankly, some places don't come close to five stars.  I give the best customer service, and I expect the best as well.  In fact I don't think I have ever given a restaurant a five star review.We have traveled from Spokane, WA and have many good Indian restaurants, but those do not measure up to the excellence experienced at House of India.  Ranjeet is the most well disciplined patriarch that greets you as you walk in the door, and says goodnight to you, when you take your happy belly home.We had the shrimp curry, and the chicken marsala, both of which were the best we have ever had.  The garlic (Naan) bread was a pleasant surprise, as it was brought to our table, we were hit in the nose with the garlic smell.  (always good to get hit with that, always!) You immediately think the taste of the garlic is going to be as strong as the smell, but pleasantly it is not.  It is a very mild breed of garlic, that is smooth and mellow.My wife had the Mango Lassi, and I had the HOT Tea.  Both were amazing with plenty of sweet flavor, no sugar needed.We were pleased to round out our meal with some rice pudding, and it cleanses our palate perfectly.  (well perfectly for me, but my wife added some sugar to it, because she is so sweet!)I have never been to a more pleasantly professional Indian atmosphere.  It is full of 'Yes sir', and 'Yes ma'am'.  Authentic Indian doesn't get any better!  Ranjeet, when are you going to open 3 or 4 more locations?  This is simply the BEST!"], ["Katie S.", "Our go-to Indian restaurant. Check it out if you want amazing naan and tiki masala! I would eat here every day if I could."], ["Tina Y.", "Definitely the best indian buffet in the cool springs area. MUCH better than bombay bistro. Love that they have chai on the buffet. They should definitely consider adding some chaat though. Also, a little less cream in the chicken tikka would make it perfect. Overall, great food. I'll be back!"], ["Becky C.", "We just had the lunch buffet at the House of India and it was absolutely fantastic! Lots of different choices, with old favorites like tandoori chicken and chicken tikka masala and some other options that I haven't had before. Everything was hot, fresh, and delicious!"], ["Tristan T.", "Continues to make superb Indian food.  If you have not done Indian give this place a shot.   Iam certain you will enjoy it."], ["Phoebe D.", "My family and I have been coming to this place since it opened and it never disappoints. Coming from a long line of curry lovers from the UK, this is the place that has the most authentic Indian food with the vibe of an Indian back home in England. This place is great for groups and for families with children of all ages. I love love love The House of India"], ["Lesley L.", "Best Lunch Buffet ever - and I would say we are Indian food gurus. Pleasant, friendly, speedy service. Our go to place."], ["Alex K.", "I was recently introduced to Indian food by one of my coworkers while I was on a business trip in NYC. I immediately fell in love with the all of the different flavors and got hooked.  I've only been to a couple of Indian restaurants and I'd have to say that house of India was the best. All of the food there was delicious. The chicken tikka masala was very flavorful, as was the garlic naan. I went here with my fiancée for the lunch buffet. I think it was about $10 per person which is pretty reasonable considering that you can easily pay over $10 for one dish if you were to order off of the regular menu. The staff was extremely nice and attentive. Waters never ran out and the naan kept getting refilled. We will definitely be back."], ["Robert B.", "The food was great and room was very clean and neat.The service and management treated us like VIP. It was a great meal! This is the place for Indian Food in Franklin/Brentwood.Cheers!"], ["Rachal J.", "The food portions were huge, staff was friendly and prices decent. I eat Indian food regularly, and this was very good. If I lived in Franklin, I would be a regular customer. Will return next time I'm in town."], ["Jason C.", "Grrat lunch buffet, friendly and promptly service. Keep yo hands off my chicken Tikka masala!  It's da bomb! Highly reccomend!  ,"], ["Veronica M.", "House of India was a great experience. I ordered the tandori dinner for reasonable price. My expectations were gladly met."], ["Miranda P.", "This place is incredible actor trying multiple Indian restaurants this place takes the cake everything is fresh and clean. The atmosphere is beautiful. The doughballs are kept warm, and they even keep chai tea hot, and the mango pudding is delicious. all of the chicken is a very high-quality and water is continuously kept. The manager is very kind and everything was really amazing. don't fret non-is actually brought to your table fresh after sitting down for the buffet. I urge you to try this place. I live in Atlanta at the moment and have been to around 7 indian places and this one is by far the best all around. I will be bringing my father back to try indian food for the first time."], ["Brian L.", "Delicious tikka masala in Frankilin, best option in the area if you're on the hunt for Indian"], ["Pat M.", "Great place to eat in Franklin! Chicken Tikka masala, chicken saag pander. All delicious! I highly recommend it!"], ["Lance L.", "Excellent service, very good food. Very nice atmosphere. I came here for lunch on a Wednesday, and was greeted graciously by the host and seated in a peaceful booth. The buffet table had all the \"Indian Buffet Standards\", and then some. It was a very enjoyable meal, because of both the food selection and the atmosphere."], ["Jesse P.", "Mango lassi drink, Lamb curry (Indian spicey) and naan bread. Everything was phenomenal. Lamb curry was perfectly spicy with plenty of exotic flavors. Not overwhelmingly spicy either. Lamb was cooked perfectly and very tender. Now back to my food. Nom nom"], ["Sally R.", "I work next door. How much more tasty and convenient can it be? I often get the samosas for lunch because they are perfect to satisfy my hunger but keeping a light stomach for yoga. $1.99 for lunch! Yes!"], ["Rose D.", "I love Indian food and am often dissapointed but this place is AMAZING! Everything we tried was absolutely delicious and the service was great. We had chicken curry, chicken tikka malsala, garlic Naan and a mango lassi. They even threw in rice pudding for dessert which was very enjoyable. We were just passing through and stopped for dinner but if we lived locally I would eat here often!"], ["Elizabeth F.", "There are no words for this restaurant... It's so blissful. It's a must try! Best gulab jamun I have ever had!"], ["Preston R.", "The service and food here were extremely good. We loved using our check-in offer for a discount. The menu said there were no refills on soda/water which had me concerned, but they didn't charge us for refills. I'll be back!"], ["Tony C.", "Absolutely terrible service. Have been waiting 90 minutes and still no food and was given attitude when asked. At least 4 tables around us walked out tonight. Such a shame. Won't be back"], ["Bil J.", "We've been around the country (and several times to London) and House of India serves among the very best we've experienced in Indian cuisine and the service is impeccible. We highly recommend!!Bil and Callie Jackson"], ["Sarah W.", "This is one of my favorite Indian restaurants!  The service is excellent, and the owner is fantastic!  The chicken Tikka Masala is fantastic.  The okra is delicious.  If you don't know what to get, just ask and they will make great suggestions.  We visit at least once a week, and we never have bad food or bad service."], ["Wasana E.", "Been waited for about a hour and about to walk out. The food was good, but the service was terrible no apologies only excuses from staff and very unfriendly."], ["Brian B.", "House of India is the best Indian Food hands down in Franklin. I ordered food to go for my family if 9. Ordered five entrees, two appetizers and some nan bread. It was enough food to feed my family for three meals. The food is just delicious. The spice and flavor is perfect! Additionally they threw in a couple of free desserts and mango drinks! Will be back many time over!"], ["Rich F.", "The food was wonderful, we had the chicken chilly and the shrimp curry. Both dishes were prepared perfectly and the service was excellent."], ["Kathy D.", "I ordered food online and had the food delivered to my hotel room. It was super easy to order via the web and my food arrived within 30 minutes.  I've had Indian food before, but by far this has been the best Indian good I've had! I highly recommend this place and when I am back in Nashville again, I'll be visiting their restaurant or order online again for sure!"], ["Pete D.", "Four and half stars, great food and service.  Very authentic and tasty, food is prepared mild but they will ask if you want it spicier.  Went here for my birthday dinner and was extremely pleased to celebrate here.  I will certainly return to House of India."], ["Levi B.", "Thankful that I got introduced to this restaurant. We have been to 4.5 star Indian restaurants in NYC and LA that do not hold a candle to this place. We like the other Indian restaurants in Franklin and Nashville but we LOVE House of India. The food is the best we have had. Perfect spice, perfect flavor. Our favorite, of course, is Chicken Tikka Masala. The bonus is that the owner is so accommodating and the servers are friendly and hard working. Cannot recommend this restaurant enough. And, we're eating here tomorrow night, too!"], ["T F.", "We chose to eat here thanks to fellow Yelpers! Excellent service and they were patient with the first timer at the table - and above all,  really really good food!"], ["Brian Z.", "Very nice dinner, excellently prepared and authentic. Very professional and friendly staff. I asked for my order to be spicy, and it came exactly how I like it. I will definitely be back soon!"], ["BILLY W.", "My favourite restaurant. Great food and great service. The chicken tiki marsala and korma are fantastic. Any time I'm in Franklin at lunchtime the this buffet is my first stop."], ["S. S.", "I took my adult son here for a special occasion and for an eating adventure. We had a really nice dinner. The people who served us were very friendly and happy to tell us about the different dishes and to answer our questions.  If you are new to Indian food ask for the most poplar chicken dish."]], "Shalimar Restaurant": [], "The Clay Pit": [["Derek J.", "The price was a little more than I expected for lunch.  It runs almost $10 for the lunch buffet.  I like how they serve the buffet for health reasons, but I also didn't like to wait for a rush of people to be served before I could get a second plate.Food is good."], ["Alex B.", "The food is amazing. Great vegetarian choices as well. The staff are always friendly & welcoming. Unlike many indian buffets, they cook your bread to order. It's always hot & delicious."], ["Rahul I.", "Lay off on the salt!!!!!  I took my wife, my mother, and my two aunts (from India), here, as we were driving from Chattanooga to Memphis and stopped for Lunch.  Good grief.  They need to lay off the salt.  No one was impressed."], ["Chris M.", "I went here for a late lunch around 3:30PM today. I had been meaning to go by this place for over a year now, and I'm glad that I did. Although no one was there this late in the afternoon, the food was still GREAT.I got the $6.99 special, rice with veggies, lentils, and spinach. Although it had probably been sitting for a couple of hours since lunch, it was still extremely good. I love Indian food anyway, but this place is great... and in Murfreesboro!I'm going to be going by here on a regular basis. You should too.-Chris"], ["Trace S.", "The food at the Clay Pit is super good! And I'd say pretty hard to beat for the price! It's a little dingy but I don't care when the food is that good. And the owner & staff are as friendly as they come."], ["Heather S.", "I have been going here for a couple years and I love it. I always stop here on my way back to Nashville from Chattanooga. The people who work here are so so nice and the food is really good. I like to get a little bit of everything. The garlic naan is yummy"], ["Kiran G.", "I went to this restaurant recently. It is very small and far away from Nashville (25 miles). The food is really good. We ordered samosas (very good), fish tikka, chicken tikka masala, naans, sweet lassi, alu parata. I liked the food. They were very friendly and took care of us very well. Nice little restaurant. It is not the best but definitely worth trying every now and then. If you are MTSU student, you can have some discount."], ["Eddie D.", "This place is usually mediocre compared to other Indian buffets I've had. Today, however, everything was much better! If you are looking for something different in Murfreesboro, don't be afraid to give this place a try!"], ["Larry N.", "Pricy and small portions"], ["M. Dinne F.", "As we say up north, the food was \"wicked\" salty.  Naan was good, pakoras were really salty but otherwise had good flavor.  Played it safe and had chicken tikka masala and I have had better.  Not bad, just not the depth of flavor I am accustomed to with Indian cuisine.  You could do worse but don't give up on Indian if the mediocre food at the Clay Pit is your first experience with the cuisine.  Keep eating...."], ["Carla C.", "YUM!!!  The place has great food!  The buffet is tame so that any newcomer can experience the cuisine, yet it is still full of flavor and thoroughly enjoyable.  Very bare bones place, but nice folks, excellent food, good prices.  SO HAPPY they're in the 'Boro!"], ["George N.", "Very basic, they have a good lunch special. Just wish they had more variety with the buffet. No creativity. The buffet is not that fresh, but its OK for a quick lunch. They could do a lot better. But this is Murfreesboro."], ["Eric B.", "this was actually my introduction to indian food. my homeboy and i went here and i had NO idea what i was getting into. this place is so very win for two reasons:1. sambosas on the buffet2. GULAB JAMUN ON THE BUFFETfried balls of felicity. those of you still cursed with a murfreesboro address (sorry) should check this place as soon as possible!eric b"], ["Melissa L.", "I visited for the first time recently. It does not have an appealing exterior so I was prepared for the food to be bad, but it was actually quite good. It was a buffet but not a help-yourself buffet. The portion was adequate and the food was yummy. I would recommend it for lunch."], ["Buck N.", "Bit of a surprise finding an indian restaurant this good in Murfreesboro. Buffet is reasonably priced and they always have a nice variety of items with occasional things like chili catfish that you don't find at most indian buffets. Simple restaurant with a nice attentive staff and they always have soccer on. Always look forward to going to this place."], ["Timothy B.", "I must say I'm a fan. There are better places, but they do have some good food. The price is pretty low and the food is good. If you are looking for the best Indian food, this probably isn't it, but I think it's worth a giving a shot if you haven't already."], ["Scott H.", "Good place for some informal indian food.  Friend had the goat curry and enjoyed it, I had the Chloe Peshawari (chickpeas) and it was delicious.  There's a $9 dinner buffet or you can order a la carte from the menu."]]}