{"Pomodoro East": [["Margaret S.", "Food is fantastic as is the atmosphere. Their patio is great on a nice evening or for brunch. The staff there is always helpful and have thoughtful suggestions. Happy hour at Pomodoro is the best. Great cocktails and wines for $5 plus some of their best bites for under $10. Great place for a date/girls night."], ["Adam H.", "I have always enjoyed Pomodoro! The meal is always consistently delicious, and the wine selection is superb. I love sitting outside on their fantastic balcony in the cooler months! I regularly get the pizza, always fab, and enjoy the spiedini as a pre-meal treat (try it, you'll love it!!)"], ["Dax E.", "Great place. Gotta go! Food is locally sourced and high quality. Great tasting dinner options. Haven't eaten there for lunch. Predominantly Italian foods. Pizza is great and prepared in a wood fired oven. Reclaimed wood and cozy atmosphere. My wife and I looked into having our rehearsal dinner here and they are ready for those events but we ended up going with another. Great people. Great service. Good outdoor seating for fall and spring. Parking can be challenging on busy weekends. Great brunch. The cream donuts are amazing. Can't get them anywhere else in Nashville. Awesome mimosas and Bloody Mary bar. Beer selection is small but has good variety. Dessert options are few but pretty good. If you're looking for a place to go when other places are packed with long waits, this is a perfect back up. We no longer go to those places and just move straight here. Small waits when there happens to be. Definitely worth the extra drive into east Nashville. Our guests and we are always pleased."], ["Rachel G.", "I thought it was pretty subpar Italian food, especially for a foodie city. Maybe I just ordered the wrong thing. Or that is what I'd like to believe. Started with some olives and fried mozzarella. The olives were olives. Pretty hard to mess up. The mozzarella was lacking. For my entree I had some butternut squash and lemon pasta and it was really hard to taste anything butternutty about it, which was disappointing. The atmosphere was fine - not too crazy for a Saturday night and the service was attentive. Not sure I'd make it a point to go back."], ["Oluchi N.", "Checked out Pomodoro East for Burger Week with a friend. I'd never been here before and, to be honest, I'd never had an interest in going here for anything. I don't really get excited about Italian food...Anyhow, we came during their happy hour and I ordered a martini that tasted like a mix between a lemon drop and a mojito. Yum! It was a little sweet, even for someone with an insane sweet tooth like me, but it was delicious! Next came the main event: their Italian Burger. I don't even know where to start. It was phenomenal!!! Granted I had low expectations from the jump, but it was probably the best burger I've had in a very long time. Such a pleasant surprise! Here's a description in case you're curious:\"Beef burger served on a brioche bun with sun-dried tomato mustard, red onion jam (freaking amazing), Caesar dressed romaine, provolone cheese and fennel pickles, served with rosemary Parmesan fries.\" @_@ It was soooo good! Who knew an Italian place could do burgers so well?! If they find a way to bring this onto the menu for keeps, I'll definitely be at Pomodoro East way more often. The staff was really friendly too! Unfortunately I've had too many run-ins with rude and blasé East Nasty servers, so I was expecting that again. But our host and waitress were great. All together, the food, drinks, and people left me with a great impression of Pomodoro East."], ["Angela M.", "Never had a bad experience here and beg several times, both by myself and with friends. First time I came for happy hour and was pleasantly surprised by both food and drink being $5, and delicious! Dinner is yummy and today I came for brunch and was greated with a different menu: blueberry hazelnut bread pudding with tripled Berry whiskey sauce, tiramisu waffle, Tuscan donuts filled with tiramisu cream, meatball Benedict and what I got: prosciutto omelet. There were so many other good looking things on the menu  (and it wasn't packed at noon) that I'm already planning when I will be back to try the other things. By the way, the ambiance is great and the outside patio is delightful as well, in a peaceful part of town."], ["Andrea R.", "Very clean and nice atmosphere. The main dining room was a little close set due to several large groups, so when being seated, we asked for a table a little farther away from a large group and the hostess told us they were all \"reserved.\" I wasn't surprised to find that 1.5 hours later, one of the three requested tables was...still available. Nice attempt to appear exclusive - I'll conform and make resos next time I come to Hipsterville.  Anyway, we had the ahi tuna Caesar salad entree, the chicken Parm, and the tiramisu, and they were all very good.  The Caesar was the best. There aren't a lot of selections on the menu and not very many traditional Italian dishes, but I don't think you'll have a problem finding something you'll like."], ["Lauren T.", "I had been wanting to try Pomodoro East for a while, so maybe my anticipation had just heightened my expectations. It was ok, nothing too special. I ate pizza and the olives appetizer. I was disappointed that the olives didn't come with any focaccia bread. I assumed it was a norm to serve breads with olives. The pizza was pretty good. My group didn't love anything too much, which is why it was merely an A-OK experience."], ["Cvcvc C.", "My fiancé and I decided to try their brunch, and drove all the way down from Clarksville! We were so excited to try their menu. We had a reservation at 11:30 and showed up a little early, but we were seated right away. We both ordered the tiramisu waffle because that was what we based our decision on to come to PE for food. After we ordered, our server informed us they \"ran out\" of the tiramisu waffles. WHAT!?!?!! Does that mean they're frozen waffles? Bleh. We replaced our orders with other items which were delicious, but we were just kind of confused and disappointed. We may come back, but apparently we need to get there early so we can order what we want."], ["Melinda R.", "Wednesday night, 6:00, walked in and grabbed a table at the bar. Cute place, great service, good food.  Had the carpaccio, calamari, and shrimp scampi pizza.  All were very, very good. Can't wait to go back. Did I mention the service was excellent?"], ["Sky W.", "The food is great. You don't want to miss happy hour from 430 to 6. A lot of options on their menu. I had the mixed green salad, calamari, and the baked penne.... All of their food is super delicious. For dinner time they serve this cornbread with a doing sauce... Different right... Right! Since I came for happy hour, we weren't served the cornbread which is fine. When you come, make sure you sit in front of the kitchen, is practically an open area for the most part. I would say the best part about it is that the aroma is one you can't recreate... It just smells soooooooooo good. Everything looks great. Some of the walls are wood panel, brick, or ton... It just depends on where you sit. The decor of great!! Ambiance, atmosphere, libations, and food... All great. That happy hour menu, you don't want to miss it. They do have limited hours as a restaurant. I also had the cucumber drink... Not sure exactly what it is but it was really good. My waitress for the evening was excellent! I wish I remembered her name, very nice and patient with/towards us. I will be back."], ["Bridgette C.", "I can sum up my review for Pomodoro with three words: Fig and Pig.  As in, the fig and pig flatbread.  This could easily be one of the best flatbreads I have ever had.  Savory, sweet, fresh, just yum.  Also, nice restaurant, easy parking, great services, but seriously, I'll keep it short and sweet: fig and pig.  You're welcome."], ["Ariel L.", "Allowed me to leave  a review in Spanish for 357.000 Latinos in Tennessee.primero quiero hacer notar el order y la limpieza, la comida estuvo muy bien presentada y los tragos realmente buenos, el estacionamiento ademas de gratis es espacioso, el happy hour, asi como el menu fueron mas que convenientes por precio y calidad, pero quiero hacer un especial mencion al excelente trato de los meseros. sin dudas un lugar para recomendar y volver, definitivamente esta en nuestro top 5 list en Nashville. totalmente recomendable! un truco: hagan reservaciones por adelantado el sitio esta de moda y todo el mundo quiere estar ahi, especialmente los fines de semana.Ariel LunaOwner of argentinagrille.com& vivamarketinggroup.com"], ["Joany H.", "Great happy hour!! We had to sit at the bar because the patio was full but they let us watch NBA at the bar Cavs vs Orlando eventhough NBA is a weird term in Tennessee. The drinks are amazing, bartender really attentive and friendly. I would go back to try the brick oven pizzas but Happy Hour was everything you could ask for on a Sunday afternoon."], ["Michael B.", "I'm a little disappointed in the website experience. I loved the bucatini carbonara and called to place an order and they had taken it off the menu and not updated their menu online to reflect the change to some vege pasta dish. Got my hopes up to only be crushed when the rude young lady on the phone exclaimed \"we dont have that\"... Womp womp"], ["Christa P.", "What a disappointing place. We ended up going here on a Wednesday night, it was empty. The waiters and chef were standing around the bar and talking - which is fine when it was slow, but our food came out not tasting well so you think the chef would care more. The service was very nice though, very kind and tried to fix problems. We ordered an appetizer and received bread and fried calamari - both were good, not amazing. I ordered homemade pasta with meat sauce and my husband ordered the steak. His was overcooked and mine was horribly bland. I said the sauce had no flavor and really wasnt seasoned well nor had flavor. They said their sauce isnt different than the typical type of bolognese and some people dont like it. I ended up sending both our entrees back and decided to leave. They brought us out a dessert as an apology- which was really good, and a kind gesture- but I wouldnt go back."], ["Kevin P.", "I have never bothered to write a yelp review before but this place was worth it. Food was out of this world delicious. The dishes were creative and upscale. Our server was of course attentive and knowledgable. But the best part was that the prices were incredibly reasonable even though the food was the same quality as more expense restaurants in town. Very impressed and we will return."], ["Jessica M.", "My mom and I went here last night and I think this place is the best Italian I've had in Nashville.  Nice ambience, very good food (the shrimp piccata pasta was amazing), good service.  I also liked the very creative menu."], ["Chad P.", "This is a great Italian spot located on Porter and the corner of Eastland. The patio is fantastic! Their pizzas are all very good, and the bolognese is incredible! The price is fair, but a little pricey. It's a great east Nashville spot for your Italian fix."], ["Greg B.", "Great neighborhood restaurant on the East Side of town. The service is very friendly and able to point you in the right direction. Happy Hour has some great deals ($5 drinks and apps). I recommend the steak and spaghetti, its definitely restaurant quality spaghetti, I have never had spaghetti was such flavor. The steak was great, cooked to perfection and tasted amazing. My girlfriend and I were out of there for $40, not bad for a classy restaurant with great food. 5 stars for location, ambience, food, service and happy hour!"], ["Bart A.", "Nice spot, great food, good atmosphere.  Service is above average.  I had calamari appetizers, light breading and delicious sauce, followed by scallop entree over butternut risoto.  It was excellent.  Partner had flank steak with fries, also excellent.  We were inside, there is also a large patio, crowded on a warm Sunday evening.  I'll definitely go back."], ["Todd H.", "Exceptional service and food. Everything was great! Berry salad, pig and fig pizza, flank steak, and sorbet to top it off. Great place for kids and large parties."], ["Ethan O.", "Finally had a chance to visit Pomodoro East last week. I must say, it was an overall very good experience. We had a 7:15pm reservation and the hostess and everyone were very bubbly and quickly found a table for us. Our server was very busy but never once neglected us and made some great food recommendations. I can't remember everything we ordered or the specific names but the Speidini (sp?), onion rings/straws and Trout were exceptional. The pesto chicken pizza was a disappointment but we didn't complain. The server noticed my wife hadn't finished the pizza and comp'd it from our bill. After 2 appetizers, 2 entrees, one side and 4 drinks, we walked out for $75 before tip. Not bad at all. If you haven't tried Pomodoro East, do yourself a favor and make a reservation. We will be back very soon!"], ["Eric B.", "This restaurant is inconsistent at best.  They have a nice patio, but it's somewhat spoiled by proximity to a busy road.  Both the food and service are inconsistent: sometimes things are really good, but sometimes they're pretty bad.  On the plus side, they're open on Sunday evenings when a lot of east Nashville is closed."], ["Russell M.", "Super cool place, inside is awesome looking and the patio is nice. Food was great, we had the hummus, crunchy trout,  and salmon pizza. Lucky for me my girlfriend and I share. I live close to this place and I'll definitely be back. So if the experience was great why the missing star you ask? We stood at the door and nobody waited on us. We ended up awkwardly going over to the bar. Somebody should have greeted us and asked were we wanted to sit. At this moment they were not busy so there was no reason.  Other than that it was a nice place to eat."], ["Michael M.", "Fried green tomatoes on the same menu as Spedini.  Yep! Four stars with geography considered (Nashville is not known for Italian food)The interior leans more towards a pizzeria than an Italian Restaurant but don't let that fool you, this place is for real. Farm to table, and I believe it. The veggies were fresh. Party of Five AppsEggplant Napoleon - mind blowing Spedini - They used white bread instead of semolina loaf but once we got over it the flavors burst on the sceneFour Cheese Penne - One of the best we have ever had. The cheese flavor addictingCrispy Polenta - w/ bolognese (red sauce & meatball) loved itEntreesWife had a special tomato dish which she finished (rare)Three sons had pizza - thin crust, great sauce, loved itI had tortellini w/ eggplant that screamed freshStrawberry Shortcake. Five spoons fighting for dominance........gone in 30 seconds!Overall, this place impressed and I wouldn't hesitate to go back. If I had to complain the wine list was weak. Is it possible I'm becoming a wine snob? NOT......the wine we had was good"], ["Caitlin D.", "And now I have a new favorite restaurant. We sat at the bar and I had a fancy cocktail with gin, fresh juice, and muddled mint, it was incredible! Later I had a glass of the house wine, which was a very fair price for the quality (only $7, and it was a fantastic wine). The chicken and wild mushroom pizza was the best pizza I've ever had, it was full of intense flavors! They make the dough fresh, it's a hand-tossed thin crust pizza. We also tried the potato filled ravioli with lump crawfish meat and lemon sauce. Oh my goodness! It's hard to describe how delicious it was. Everything that isn't from the sea is local, raised appropriately (ie, grass fed beef, free range chicken, local veggies, etc.). So not only are you getting delicious food, it's healthy and conscientious! Oh and I almost forgot to mention, the decor is very tasteful, lots of wood beams. There is an outdoor patio as well. This would be a fantastic place to take a date, or even a large group (there is a giant table for big parties)."], ["Stefanie P.", "Went to Pomodoro East with 2 friends. We weren't sure what bottle of wine we could all agree on so the waitress gave us a few samples to pass around (very cool) and we started with that. We all got something a little different. I got a pizza that was $8-$9 and good. The cheese you could taste was super fresh but the flat bread was plain and simple. My friend got the mahi mahi that had great presentation, and she said was pretty good, and my other friend got a pasta dish half size order (you can get full or half size) the half size seemed like a true real 1 portion of pasta. We got some bread and olive oil pre meal we all scarfed down. It has an open kitchen. Real table clothes and napkins but the prices aren't that steep but I'd also say the food isn't worth more than its priced at. If you're looking for an affordable a bit nicer Italian restaurant this is it, but this isn't a place to propose to your girlfirend. A nice casual restaurant but by no means was anyone dressed up. The staff was nice but seemed a bit 'green' but could just be in part of the 'new restaurant' kinks. I'd likely go back for a weeknight dinner. I recommend making reservations as this place is pretty popular because its new. My favorite out of everything I sampled was my pizza! Hooray for local business!"], ["Jessy Y.", "The interior of this space is almost unrecognizable to anyone who frequented the former Cooper's on Porter. Gone is the wall behind the bar, which now opens to show inside the kitchen. The weird booths in the middle that segmented the restaurant have been replaced by two brick columns, which gives it a much more open feel. We sat in the back, where an open garage door overlooks the patio, allowing in the fresh air while still keeping us out the rain.Their menu design needs a little work, but they have an impressive wine list, though more bottles than by the glass, and several beers in bottles, though only two drafts. We didn't get an appetizer, though they had a nice selection plus a special not on the menu. Instead, we split a Caesar salad. The dressing was really light despite coating the lettuce entirely, but could have used a little extra oomph. The croutons were made from the same bread we were served with olive oil -- nice and garlicky.Speaking of garlic, let's get to the entrees. I ordered the half portion of the potato-suffed ravioli with crawfish tails, butter and lemon. Very flavorful, with a nice garlic-laden broth of some sort as a sauce. The crawfish tails were huge, very shrimplike for what I'm used to (I'm from around here, so growing up I ate my share of \"crawdaddies\" that didn't resemble these at all), and the potato filling in the ravioli was basically creamy mashed potatoes -- smoother than the consistency of the usual ricotta. The ravioli was slightly undercooked on the edges, but I still inhaled it. And a great deal for only $9 ($17 for a full portion).He tried the pizza with lamb sausage, fennel, tomatoes and arugula. Not too crusty, but not cracker-thin (we both prefer a crust on the thinner side), and generous with the toppings, though a little skimpy on the sauce, but that may be their style. No complaints -- and at $11, a decent deal for gourmet pizza.We arrived around 6:30 on a Friday night and were sat immediately, though probably just in the nick of time, since there was a huge line out the door when we left. As far as service goes (since I've seen complaints), our drinks took a while to arrive, but our server was very apologetic. And at least two other people (owners?) stopped by during the course of our meal to ask how everything was -- I imagine they just want to make a good first impression, which they certainly did. When our food didn't arrive as soon as she had promised, our server offered to buy us a second round of drinks, even though we weren't complaining. And then our food arrived immediately after that. So ... free drinks for not-really-that-slow service? I'll definitely be back.Although to second another reviewer... where was the hostess stand? And more importantly, this place needs a website, or at the very least a Facebook page. I know it's owned by the same folks who run Eastland Cafe, so I figure they are just trying to do a soft opening for a few weeks before they start heavy promotions, but if it weren't for a food blogger posting about them, I wouldn't have known they were open."], ["Melissa B.", "I'll rate this a 2 only because the drinks were well crafted. Other than that, I can't really say much else was good. I ordered a salad that was never made. The manager didn't seem accommodating. Just an, \"eh sorry.\" The happy hour specials are great, but I would rather pay $5 for something else."], ["Kristin Marie S.", "I haven't been for dinner but I stopped in for happy hour.  It started a little rough because they didn't open until 4:30pm and I showed up at 4:15.  I wish they would have sat us on the patio and let us wait but instead we patiently sat on the bench outside.  Once we were finally seated it went uphill.  The pizza was incredible, instead of sauce they made a corn puree, added cheese, roasted corn and something else (I can't remember but I think spinach!)   I had a small piece and my boyfriend ate the rest.  This was because I had dinner plans and didn't want to spoil my meal.  As for the happy hour drinks they have wine and champagne.  Any place that has champagne for happy hour makes me a happy camper (not necessarily the net morning).  I'll definitely be back for happy hour and possibly a full meal.  The service was friendly and the patio has some decent neighborhood watching.  We saw three crates fall out of a milk truck at the stop sign.  The driver forgot to close the back door.  Then we watched random people stop and collect the crates, but not the milk."], ["Robin B.", "Great neighborhood spot for happy hour.  We sat on their outdoor patio and enjoyed their drink specials and happy hour menu.  Everything we tried was delicious- couldn't pick one favorite over all.  We will have to go back and try their regular dinner menu the next time we visit Nashville."], ["Carolyn M.", "I was sad when Cooper's closed, but now I am oh-so-very happy. I had yet to find an Italian place in all of Nashville that I really liked, and now I have this amazing place blocks from my house. The inside has been redone and is much lighter and brighter. I sat at the bar, which has an excellent view of the brick oven and the kitchen. The bartender, Quentin, was fantastic. My water was never less than half full and he was just prompt and attentive with my entire meal. The gnocchi starter is hands down the most delicious gnocchi to be found in these parts.  The house salad is a nice blend of raddichio and greens with roasted red peppers, onions and olives. Perfectly dressed and seasoned. The bread is fresh and served with flavorful olive oil (I kind of wanted to order a glass of it, neat). I had the crab ravioli as an entree; it was tasty but a bit on the salty side, which is right up my alley, but if you're watching sodium, you may want to skip it. I guilt-ordered my working-late hubby the pork to go and he loved it. Perfectly cooked at medium, excellent flavor and well-complemented with a square of polenta. Nice selection of wines by the glass and the housemade limoncello was the perfect cap to the my meal. If you decide to check this place out, you'll probably see me at the bar. I have a feeling I'm going to be quite the Norm at this place. Kid-friendly too."], ["Amy C.", "Great FOOD, Great Patio and an even BETTER Happy Hour! From the Eastland Cafe family of restaurants, Pomodoro East does not disappoint! I have found a new \"regular\" spot for me and my husband to unwind after a long day st work!"], ["Grace G.", "Let's see. Their background music seemed to be a Kings of Leon Pandora station -- every third song was KoL. The oil/vinegar dip tasted like NyQuil. The Crespelle (crepes) arrived on a very hot plate, but were cold throughout. Veggie lasagna was good, but not amazing.  The most positive thing I can say was our server was good. I doubt we will ever have a desire to try this place again. I wonder what restaurant will be in this spot by next year?"], ["Wm Z.", "This was our first visit.  After tasting hors d'oeuvres from Pomodoro East at IL CARNIVALE, my partner decided that this was where he wanted his to have his birthday party. I made the reservations 3 weeks in advance for a party of 14, and called an hour prior to notify them of last minute changes to the guest list reducing out party to 12. I also asked if it would be okay to bring a birthday cake and was told that would be fine.  They were gracious enough to call me back immediately to let me know about the $1 per person cake fee. I have to admit this was a new one for me, but after a bit of research, I discovered that although most American dining customers think a cake fee is ridiculous, its now a very common practice  across the country, and has made its way to Nashville.  As for the cost of $1 per person, that appears to be a bargain compared to elsewhere in the nation, where the going rate is $1.50 to $2.50. Take your bargains where you can. That's the last one you get at Pomodoro East.Although the table tops are spacious and comfortable, its negated by so many of them being in such a small space. We were seated in what seemed like the front doorway and, as the night progressed, became packed in like livestock in a cattle car. The bar was 3 feet behind my chair, and I was bumped and had to move many times throughout the evening, I also could not get comfortable because the location of the table legs required me to keep my feet to the side of my chair.Their beer and wine prices are ridiculously high for the selection.  I tried to find a more polite way to phrase it, but there is no getting around it. I also observed that those among our party that ordered wine by the bottle received better drinks service than those of us who had ordered glass of wine and then switched to water. Refills were slow to say the least.  Actually, all service was slow, but we debated on whether that was because of the servers themselves or because of the shortage in floor staff. We had two very friendly servers for our party, but they also waited on other tables with large parties, and it seemed that one didn't know what the other had done. They attempted to take our orders twice.  It would been better to have had one dedicated server that we could have more easily found throughout the evening.All of the appetizers were unbelievably tasty, but do not order one as your main course unless you ate just prior to arrival. It is truly an appetizer portion. The two people who ordered appetizers as their meal, added a side once they saw the size of the appetizers when they arrived. The salads were also very good, but the FRIED GOAT CHEESE SALAD is really a misnomer.  There was minimal goat cheese.After the main course, it was the  table consensus that the food is some of the best we've ever tasted. If only, everything else had been so nice.At precisely the Two Hour mark, it became apparent that they were wondering how quickly we were going to vacate, although one member of the party was still in the middle of her meal because of a kitchen mix-up.When the bills came, they had charged the cake fee. Although I knew about it in advance and asked that the fee for everyone be charged to my tab, the server had no prior knowledge of any such fee, so I'm guessing we may have been the first. The most asinine part of the visit was saved for last: the 20% gratuity added.  Everyone's jaws dropped! After the lackluster service, I can assure that not another penny was added at my end of the table.As friendly as the staff is, and as amazing as the food tastes, the balance of the visit was mediocre at best.I feel it necessary to reiterate that it was some of the BEST FOOD we have EVER eaten!"], ["Darren L.", "Not my kind of place.Service was not bad but definitely a little preoccupied with getting ready for something or someone else....even though there was only 1 other table occupied in the place at the time.No thanks."], ["Ora B.", "I ate at Pomodoro East for the first time with a friend visiting from Philly. It was recommended by a co-worker and I had been wanting to check it out. It wasn't busy when we arrived which is rare for East Nashville restaurants. We decided to come also because it was $20 bottle of wine night (no brainer). We had a nice server and ordered a bottle of wine and the Spiedini for an appetizer. It was delicious. Then we both ended up ordering the Bolognese. It was ok. Not the best I've had. The pasta was tasty but the sauce was just ok. I was looking for something more because the waitress had said it was one of her favorites. I'll go back, but will order something else. I liked the atmosphere and the appetizer and of course the wine special. I'd like to try dessert next time. I'll probably come for the happy hour menu next time or either the brunch, it sounded interesting."], ["Hannah C.", "Definitely didn't live up to the hype or execute their ambitious menu with any real flair. Service was average, a little awkward and crowded floor. Cocktails were ok, and came after sitting on the bar a little too long, with melted ice and poor blending.They seated us at a table barely big enough for two with our 5th person sitting in the serving aisle even though we had reservations. My chair rubbed against the persons behind me all night and couldn't get out to use bathroom without climbing over people.Food was lukewarm in spots, literally as well as metaphorically, my ossobuco was actually cold in spots. The salads were well done and the cheese good but portion far too small for the money. Wine list is excellent and reasonably limited.Bar service was great and friendly, and appetizers were good but not very imaginative.The panna cotta was a gelatine loaded milk product, not the velvety semi firm creation it can be. The chocolate pave was a little dry and average side sauces. Nothing special."], ["Sean S.", "Last night we had dinner at Pomodoro East after hearing mixed reviews from our friends. The hostess said they had reservations coming in, so we could choose to sit at the bar. One of the first things I noticed were the beer prices. They are the highest I've seen in Nashville! Some examples: $7 for a draught Blackstone or Fat Bottom and $5 Yuengling bottles. We opted for water.For dinner my wife and I ordered pizzas. The pizza prices are reasonable and I'm a big fan of wood oven pizza, especially Bella Nashville in the Farmer's Market (YUM!). I had the pork and fennel sausage, and my wife had the corn puree. Both were too heavy on the cheese and it really dominated the dish. Both were just \"meh\"For dessert, we ordered the bombolini. The donuts were fine, but the dough was a bit dense for my liking. I didn't care for the vanilla gelato, it was very icy, but the lemon curd was good. There just wasn't enough of it!We had an ok time, and ok food. We'll probably come back for happy hour in the future (we live just down the street) but I don't have much desire to come back for dinner. It's just not worth the cost.On a side note, the bartender was great! She was very friendly and attentive and didn't treat us differently because we didn't order drinks. She gets 5 stars."]], "Margot Cafe & Bar": [["Kimberly S.", "This place is amazing, but I always seem to forget about it as an option. I really need to change that. The ambiance is superb, and you feel like you've actually been transported to a small French bistro. The place is straight up cozy. Service is also always professional and smooth. As far as food goes, their menu changes daily to reflect what's available at the market. There are a few staples that stay on the menu such as their potato chips and olive oil blend. The potato chips are insanely light and crispy and served with a delicious, garlicky aioli. The olive oil blend with housemade focaccia does not sound like much but is also a must order.For entrees, I generally order one of their fish dishes or the homemade pasta dish. I've always been pleased with the quality of the fish and the pairings. And let's be honest, fresh made pasta never disappoints.I highly recommend trying Margot for your next date night or special occasion."], ["Abby P.", "My favorite restaurant in Nashville!!I have been here many times with my fiancée and various friends from out of town. The menu is always changing but we have never ordered anything that was less than amazing. We always have their fresh focaccia which we love, and as non-drinkers we are obsessed with their unsweetened peach tea. They serve local beef and fresh fish which are both very tasty. The environment is nice but very comfortable, the service is on point. I can't say enough about this restaurant!"], ["Randolph R.", "Went there tonight with my wife and a good friend. We each had a different starter and entree. The food was excellent and the service was very good. I would have given this place a higher rating if the atmosphere would have been better. Do not go there in the summer time. The place was so hot, (we sat upstairs), that we were too miserable to eat much of our entrees. Our server was sweating so profusely his shirt was soaked through. We will try again in the Fall or Winter, but reading other reviews leads one to believe that this has been an issue here in the past."], ["Julann C.", "This place changes their menu daily and is so open to an amazing dinning experience. We so enjoyed the whole dinning experience. Give it a try you won't be disappointed."], ["Lindsey B.", "Wow. Just wow. Such a gem in Nashville! This is such an incredibly well-designed restaurant with amazing food and waitstaff. The owner was so kind and welcoming. The menu changes every day depending on the season and availability of items. Made with love! The dessert menu was incredible, too. Don't skip Margot's on your next trip to Nashville!"], ["Kent I.", "5 stars for the memories, but only 3.5 stars for the food. We loved returning here for our 10 year anniversary after eating here on our first date. Everything is much the same--cute, trendy, and eclectic with good food. But after living in places with better food than Nashville traditionally has had, we enjoyed, but were underwhelmed by the food.  And parking around there is pretty terrible.  But we really enjoyed the night and are thankful for the memories. Margot will always hold a special place in our heart."], ["Ashley K.", "YES, YES, YES. Absolutely the best. Amazing romantic environment, great food, and such a great place for any special occasion. Have been here multiple times and every time - we love it more!"], ["Dan H.", "I have been holding onto this review for over a month now.  Let's see how much of the meal I actually remember.Sue and I were staying in East Nashville on our last night in town.  Before heading that way Sue did some research on places we might want to go to eat for the one dinner we would be there for.  Margot Cafe came up as one of the choices and we both agreed that it would be the place we would go to.You will spend money here, but it will be money well spent.  Or at least that is my opinion.We started out with some cocktails and segued into an appetizer of Monkfish spread with crostini.  I grew up with whitefish salad.  Monkfish is very similar.  Our server (Greg who was fantastic at his job) brought us some extra crostini when he saw we were out and still had spread left.For my main dish I had a Sheepshead fish which I had never had before.  Don't quite remember what came with it.  The fish was mild and simply prepared, but I always enjoy simple food.For dessert we had a Pumpkin Spice cake with goat cheese cream.  A very nice way to end the meal.This was a wonderful experience for our last night in Nashville and nice to see a spot like this in a very small neighborhood on the east side of town.  I hope to get back and explore around more of East Nashville.  This left a good taste in my mouth."], ["Heather R.", "You know you are in a place that is probably serving fresh food when the menu changes every day. And at Margot, you can taste that freshness; nothing seems to be prepared ahead of time, but rather carefully crafted each day.I will admit that I have only been here for brunch; each visit was a magnificent journey of tasty euphoria (not to be over the top or anything). Back in the days of my gluten-eating glory, I would order the basket of pastries with brunch--for anyone who has not developed a severe reaction to gluten (and possibly even to those people), this is still a highly recommended course of action. The pastries are flaky, light, featuring an array of glazed, nutted, and fruited confections. The last time I visited Margot for brunch, I indulged in some sort of egg deliciousness--an omelet featuring a variety of seasonal vegetables and cheese. This also was prepared to my order, and tasted fresh, perfectly seasoned, and worth it. Though the menu may be a little pricey here, it is the kind of pricey where I always walk out going, \"Yeah. That was worth it.\""], ["Katherine R.", "Went here for brunch with a friend.  I'm not sure what our waiter was doing, but it took about 30 minutes for him to take our order.  (Came by our table four times before we ordered??  Maybe it was because we got there at 11 when they opened.)  Took a while to bring the food out as well, which wasn't a huge deal since it was a lazy Sunday.  But, hers came out steaming hot while mine was lukewarm.  I had the steak, eggs, and fries; they were fine, not great.  On the plus side, I asked if they could do a spicy Bloody Mary, and it was excellent!  I think if i lived in the neighborhood I would go back some because it is a really cute place, but I don't foresee myself driving across town for it."], ["Anthony S.", "Margot is situated in an up and coming neighborhood of East Nashville. If hipsters make you feel less of a person then it is worth the loss for a meal at Margot. Not only will you surely encounter a hipster or two but you may even have your food served by one. Its best if we comingle people! Margot is a restaurant which offers up a new menu each night for its patrons making the dining experience unique and fresh (which you can taste). If the following items are on your menu then I would highly recommend you order them. First, the homemade chips with aioli are to die for...seriously this combo should be considered culinary cheating its so good! Their assorted olives are wonderfully fresh and marinated. Next up, you should definitely order the roasted cauliflower with harissa - woah! I ordered the steelhead as my entrée and its grilled flavor had me making sounds at the dinner table of a business meeting that I should have probably been more reserved about. Margot is a safe haven for anyone with taste buds. Trust me, you're gonna like everything about this joint."], ["Casey H.", "It's been over 2 years since my last visit to Margot's. We came here for brunch this past Sunday around noon and had a very short wait of 10 minutes. We sat in the screened in patio. It started to get pretty warm after an hour.We ordered the Bloody Mary with the cucumber infused vodka, sangria, steak and eggs and fried quail. Great:Bloody Mary $8- The Bloody Mary was fantastic and very well balanced! It was not overly salty, peppery or tomato-ey like most that I have had in Nashville. Additionally, it was garnished with a green olive and pickled green bean. I've never had a pickled green bean before and enjoyed it! Steak and Eggs $14 - Got the steak medium and eggs over easy. The steak was seasoned and cooked perfectly. The eggs had a nice crispy bottom and the yolks were runny and bright yellow. The fries were crispy and not greasy. Just wow!Fried Quail $10- The fried quail was fried and the meat was moist and tender. It was accompanied by a pickled watermelon and pepper salad. YUM... Okay:Sangria $8- I wasn't a fan of the sangria. I couldn't taste the wine... it was much more fruity and tasted more like grape juice.I can't wait to go back. :)"], ["Nick C.", "My lovely wife and I shared all of the dishes below:Starters - olives and the homemade chips1st course - tomato soup and shaved foie gras salad2nd course - veal and the clam and gulf black drum boullibaisseDesert - fig tart with honey walnuts and ice cream and a chocolate cakeEverything down to the homemade Rosemary sea salt focaccia bread was top notch.  I'll put this meal in the top ten.  Great job Margot!!!!The service was fantastic as well.  Chef Margot was greeting people as they came in and making visits to the tables. If you are ever in East End, Margot Cafe is a must."], ["Marcus B.", "I went here for dessert. I'd just eaten dinner across the street at Five Points Pizza when I was literally in the car about to drive home. I had a craving for a sweet tooth, so I turned to Yelp to see what options were available. I saw a picture of the goatcheesecake that someone else uploaded and I knew I had to have it. Unfortunately it wasn't meant to be. The place has a menu that changes pretty often. No worries! I ended up getting something chocolate and whipped cream on top. I also had a pear dessert (it had tartin in the name). My apologies for not getting the names right. Anyway, I devoured those dishes and would've licked the plates if it wasn't considered uncouth to do so. Oh yeah. They offer tea from High Garden!Most of the tables were taken due to reservations. There were open seats at the bar so we were seated there. No complaints here. The staff was really courteous. I really liked the atmosphere of the place. They were playing music that really played to it as well. It was noticeable but it wasn't overbearing or at all distracting. I will be returning with my girlfriend for a surprise date.Brian is a bartender here and I just want to mention him in this review because of his kind words and actions. Here's hoping he has a strong return from his leg injury."], ["Caroline K.", "After being quoted an hour-long wait for Sunday brunch at Marche Artisan Foods, we wandered over to Margot and were seated in a manner of minutes. I have no comparison on which to judge the 2, but we were more than happy with our selection! My friends and I were seated on the covered patio, which made us feel like we were dining al fresco yet still avoiding the outside chill. The table next to us was enjoying the most delicious looking sticky bun, so along with our huge french press of very tasty coffee and bloody marys we started with the breakfast pastry trio: sticky bun, coffee cake, and croissant. The croissant was not bad, but we all agreed the sticky bun and coffee cake were the real winners. Would definitely recommend if you have enoug people to share. As for our mains, my friends had a duck sloppy joe and quiche, and I had poached eggs and pork belly over grits. All I can say is that I would happily eat that every morning for breakfast. Absolute perfection and I practically licked my bowl clean. The other dishes also had high praises, but mine appeared to take the cake (or sticky bun in this case). Do not miss this dish if you see it on the menu!Overall we had a lovely brunch that couldn't even be ruined by the guy vomiting out of his car door as we walked in. Alas, delicious food and bloody marys really do make everything better!"], ["Susan H.", "Another trip to Margot and another amazing meal.  There are so many options in Nashville right now but this restaurant should be your first stop every time.  The service is beyond incredible and the food...delicious and so beautifully presented.  Out of all the incredible choices, this one is my favorite."], ["Christina W.", "I think working and dining at these types of restaurants so often has made me...dare I say....picky. Let's say...good taste. That makes me feel only slightly better. Came here for a birthday brunch. I had a mimosa (one with st Germaine) and a Bloody Mary. Both were good. Mimosas are pretty basic. I've had better bloodys. But it did its job. We shared the bread trio app to start. It was good. But neither it or my entree (which I forget and it lacks relevance because they change their menu) was impressive. Just ok. Service was good. And I enjoyed the aesthetic of the restaurant. But honestly, I have no draw to come back."], ["Ted H.", "My wife and I come here for special occasions. Our most recent visit, October 21, 2015 was fabulous. The meal and service were great!"], ["Courtney B.", "Possibly the best brunch I've ever had. Highlights: strawberries and cream starter, steak and eggs, sugar snap ricotta crepes. Mimosas not too shabby either. Gorgeous atmosphere."], ["Garen M.", "Nice, first class dinner place. We had party of 8 and everyone raved about the food. Prices were decent and our server was excellent. We had everything from steak to fish and all the sides and appetizers. Everything was well prepared and fresh."], ["Bob S.", "Had brunch today!! Marche was to busy so walk around the Corner and only had a 20 min wait. Brunch is off the menu. I had the 12 dollar steak and eggs with crispy potatos. My Guest had the squid sandwich. Both were excellent. These eggs were cooked perfect over medium!  The steak perfect and tender! Service was excellent! Just think it was only 2 bucks more than Waffle House. Lol"], ["Maggy P.", "Had heard great things about Margot's all the way back in NYC - and all of it was well deserved. Great service, delicious southern food with an upscale twist. Expensive but worth it if you want to treat yourself. We had the fried eggplant appetizer, a steak and a pork belly dish. The steak was to die for."], ["Maggie H.", "This is place is really good!We came here directly from the airport and made it right before closing. I half expected them to turn us away since it was 15 to 10, but they happily sat us and did not rush us through our meal at all. I tried the quail, the skirt steak, and the goat cheese/mushroom/corn pasta. The quail was served over a bed of arugula with roasted peaches. So yummy. The steak was very tender as well, even though we ordered it medium. I would have to say the pasta was the weakest dish (kind of dry/needs more sauce?), but maybe I just need protein in my diet.We ended the meal with a slice of chocolate layer cake. While the cake looked super ordinary (I didn't even bother taking a foodie pic of it), it tasted SO AMAZING. Super moist, just the right amount of frosting and sweetness, gobble gobble.I don't know when the next time I'll be back in Tennessee, but I sure will miss this place.If you're lucky enough to live close by, don't pass this place up!"], ["Kristin Marie S.", "I always think Marche is the best, then I go to Margot and remember who started it. The brunch is to die for. The dinner's are rustic and delicious. Margot really has the whole package (food, ambiance, chef, and staff.) The brunch is also totally affordable, the dinners, in my world, are special occasions."], ["Marcia M.", "I bet your jaw dropped in utter shock when yet again, I award Margot a 5 star review, right? How could I not? This joint is about as solid and consistent as it is humanly possible!On this go round, I joined a reservation of 6 for Dining Out For Life last night. My friend Cindy was the host for the night and noshing for a cause was a fabulous excuse to indulge. 50% of our bill would benefit Nashville CARES. I always appreciate business models that contribute back to their community and this generous participation level impressed me!On to the food...Why oh why do I lose all sensibility when it comes to portion control each and every damn time I order the house-made potato chips from here? I become a ravenous Wildebeast over this large bowl of perfectly crisp and flavorful chips. Due to my vegan diet, I don't dip it into the accompanying aioli sauce but from the looks of what was left of it... my friend Rachel certainly approved. Next, I communicated to the server that I was totally open to whatever the chef and kitchen would like to concoct for my vegan dish and was not disappointed when he suggested a vegetable penne pasta dish! He was informed enough to know that the other noodles that they had in stock contained egg so the penne was the right choice for me. Well done, mister. Well done!The pasta and veggies were perfectly seasoned and bursting with flavor. And, how could I mention a feast at Margot without mentioning the wine list? I have literally never had bottle or glass here that I didn't absolutely adore. The 2 glasses of  Malbec ($9.50 a glass) that I enjoyed offered up a robust yet smooth experience. Margot is a cozy and comfortable spot for me where I run into friends and other people that I know each time that I am here. Whether you're looking for a romantic or special occasion dinner, casual night cap, or Sunday brunch, you won't be disappointed."], ["Shaneka L.", "Dined here 12/22/13, it's a hip intimate dining room with an open kitchen, I was sat immediately by the manager who set up my table, dressed it with menus before returning to greet awaiting guests. Waited 5-10 minutes for my server to come over, she seemed friendly recommended a nice wine before disappearing for another 10 minutes or so. So, it's that kind of night, I pulled out 41; Portrait of my father and started in on GHWB beginning his presidency, got to his visit in China before my server returned, offered recommendations, took my order and set off again. Had smoked salmon as a started, was amazing followed by beef  bourguignon, only several pieces of beef but still very good, my server came over as I worked my first bite into my mouth to ask how it was (haven't seen her since she took my order, another server brought and removed my starter and my entree), waited 10 more minutes after I finished my entree for my server to reappear. Finished my meal off with the Buche de Noel which was sublime, I placed my credit card on the table to speed the process along, as I signed the check my server asked what book I was reading, took a little more of an interest in her guest. I still over tipped because the food was great and it was understandably busy but my server never apologized for her delinquency between courses. I came to Nashville from New York and was thrilled about dining here, I left disappointed especially after an fantastic dinner I had the night before at Red Pony."], ["Ben G.", "My wife & I hit up Margot for Sunday Brunch not too long ago.  Luckily we were able to get a last-minute reservation, because this place is popular.  Most people in the 20's - 30's age group who are in the upper-middle class spectrum seem to speak in reverent whispers of Margot Cafe.  By many accounts it's at the forefront of a great new wave of culinary excellence in Nashville.  We are food nerds.  We were excited.First, the \"bad news\"; the menu seemed a little limited compared to the sample they had online.  Now, I recognize the \"farm to table\" schtick and that the seasonal availability of certain products will affect the contents of the menu.  But it still seemed a little light to me considering that we were in the middle of summer.The service was a bit on the slow side; some tables for two were served before us even though our table ordered first.On to the good news: my eggs with duck hash was outstanding.  My wife's plate, which once held a pancake, was practically licked clean.  The bill for the brunch was also reasonable.  Although the service seemed slow we weren't in agony and were able to get out of there in a reasonable amount of time.I'd definitely return to Margot for dinner if I lived in the area to give them another shot.  It seems that maybe Sunday brunch is always a madhouse and that some of the waitstaff is hung over.  Maybe.Or maybe Margot is just a really solid 3/3.5 star joint."], ["Rachel L.", "Everything about this place is scrumptious and beautiful. It is the most delicious and lovely brunch experience in Nashville. The menu is always fresh, locally sourced, and made in house. It's the ultimate Nashville restaurant for a romantic date night. The atmosphere is as charming, cozy and warm as Vincent Van Gogh's Café Terrace."], ["Sheena T.", "I went to Margot for brunch on a Sunday, and it was middle of the line. The food was pretty good, nothing to write home about but not horrible either. Our table had a pimento cheese sandwich, pancakes, and I had a black bean breakfast dish. The food was fine, but my big complaint is the drink I had.They had an excellent brunch cocktail menu, and I typically go for the champagne drinks (hello mimosa and bellini!) but this time I went for a bloody mary and I wish I hadn't. I'm not sure if the mix was just off or if they didn't combine it properly, but I didn't finish it and everyone else at the table tasted it and it was off to them as well. It takes a lot for me to not drink a bloody mary, so let that stand alone. There were other people drinking them around me, so maybe it was just a fluke that mine was bad.That being said, I loved the atmopshere and I would definitely try it again for dinner to see how that compared to brunch. And next time I'm sticking with champagne!"], ["Mark S.", "It pains me to read some of the recent reviews about Margot's, has it changed recently? I don't recall ever doing a review on this restaurant so I shall now. I've eaten there several times - some strong suits: 1. The ambiance is great! Former gas station, bring guests here and they will love the feel of both the neighborhood and the restaurant. 2. Margot McCormick has an intuitive feel for both provincial and Italian cooking, she is also very welcoming when you meet her. 3. I always love the fried green tomatoes when available. 4. They are good at their house cocktails, I especially liked the cucumber-infused martini and the French Malbec wine (Malbecs didn't do too well over in France - one normally associates that grape variety with Argentinian wines.)One negative - I ordered a tri-tip steak beef entree once. It was cooked to perfection but was more chewy than the gum I got with Topps baseball cards. Later in 2012 I ordered a tri-tip from City House and it was cooked just as well and just as rubbery. Moral of the story - avoid tri-tip, not Margot's and City House! That having been said, both places should stop putting that cut on their menu, it's better suited for the rescue mission or international aid. Great for food cost but bad for customer satisfaction.Another thing that perplexes me - one review was pretty favorable but gave three stars. Doesn't the reviewer understand how much that rating hurts on the Yelp community? Try Margot's out, you'll be glad you did."], ["Queen B.", "I have returned from yet another birthday dinner at Margot's..  This time I went with 3 other women that had never been to Margot's.each of us ordered an appetizer, a glass of wine and then an entree.whomever said that the venison was to die for was absolutely correct.My venison melted in my mouth.Salad for an appetizer, one person had the mussels, another person ordered the pizza.From appetizers to wine, to entrees to our waitress, Jordan, everything was absolutely perfect. Our waitress was courteous, helpful, kept our water glasses filled, kept empty dishes off the table, never interrupted our conversation.We sat outside on the porch with a bunch of heaters roasting us from above. It was actually quieter outside on the porch, than inside with all the other people.It's too bad that others say that it's too inconsistent to dine here.This was probably my 7th time dining here and I have yet to complain about service, food quality or presentation.  I did have a brunch meal here once and my meat entree was very small and I did complain about it, but since then, all entrees are nice American sized portions.All four of us were so full from dinner, none of us could fit dessert into our tummies.None of us had any complaints.It was a remarkable dinner with finesse.I highly recommend this eatery for special occasions, dates, friends family...  I don't think it would be a good place to bring children.It's more adult oriented.My venison was cooked to perfection, tender, tasty, MR, no gamey taste..  It was truly exquisite.  5 stars, hands down!"], ["Blair S.", "As I walk into Margot Cafe, the smell of spices, meats, and seafood that fill the air send my hunger level surging. This is the kind of food I dream of.The menu is one page and varies daily, so if you're a picky eater this might not be the place for you. For the rest of us, the food is cooked to perfection every time. Perfect taste, perfect texture, perfect temperature, perfect freshness, perfect portions. Margot knows cooking in a restaurant is both an art and a science, and she's studied hard. I've never even a bad part of a meal here.Service is timely, helpful, and not overly intrusive. Drinks never go empty, yet those annoying, pointless half inch water refills never interrupt your meal. Dishes come out in the right order even if you have a large, high maintenance group. Diners with reservations are seated promptly, whether you have 2 or 12. If you're coming with a  party of two, ask for one of the intimate corner tables. Don't forget to make reservations well in advance on holiday weekends or in graduation season.Prices are high but not undeservedly and not astronomical. Expect to spend $30-$50 per person for dinner without alcoholic drinks. The food is mostly French, so order wine and have a nice romantic night."], ["Patricia S.", "I'm jumping right on the farm-to-table-restaurant bandwagon. Fresh and local wins me over every time.The salad we split was super fresh and flavorful featuring buttery lettuce and roasted beets. My friend ordered pork, which she said was divine, especially with the accompaniments. My grilled trout with kale and white beans was just ok. The beans and kale was my favorite part. The trout wasn't as flavorful and flaky ask I would've liked, but it was still good. A note about reservations: They are absolutely necessary to get a table here, but don't count on the reservation being honored on time. We arrived early for our reservation, and ended up waiting almost an hour to be seated. There were plenty others that waited quite a while for their reservation, as well. Overall, a quaint restaurant with a kitch-y feel and friendly and attentive service. While the food is good, nothing blew me away, but I appreciate the concept and, honestly, the execution is commendable."], ["Daniel S.", "I like Margot's food, but I don't love it. And for the price you are asked to pay, I would expect to love it. The ambiance is a little underwhelming but the service is very good."], ["Melanie K.", "Daily Rotating Menu = Daily Rotating Star Rating....I had the pleasure of attending this gem for a birthday celebration. Although we had a reservation we still ended up waiting another 15 minutes before our table was ready. I highly recommend that you make a reservation as this dining area is creative, but small. DRINKSOur group started at the bar and tried the Side Car and Pear Martini. I am a Side Car fanatic, but many restaurants have trouble executing this drink. However, both cocktails we received were smooth and flavorful. For dinner you can never go wrong sharing a Spanish Red, although Margot's offered an extensive list of Red, White, Blush, and Champagne.APPETIZERWe were very interested in the rotating menu that Margot's offered. The appetizers were not as elaborate as I expected and the cheese plate ended up being pretty simple and unoriginal, but the Dried Tomato jam was very delicious.ENTREEFor Dinner we shared the Gnocchi, the Venison, and the Flank Steak. The Gnocci was covered in an amazing tomato sauce, there could have been more sauteed vegetables, but the Gnocchi was perfectly light. The Flank Steak was flavorful and was served with great earthy mushrooms. Steak and Potato dishes are more like safety dishes for diners so it is hard to discuss anything more about the dish. Finally the Venison was AMAZING!! Not only did we even debate if this dish was truly deer,since there was not a single morsel of gamey taste, but it was served perfectly. My best friend and I immediately regretted getting the Flank Steak, but luckily her husband allowed a trade in entree dishes so her and I could devour the rest. If you ever see the Venison on the menu you must order it.DESSERTWe shared a chocolate cake dish that was very sweet and rich. It was plenty for the four of us to share after such a decadent meal.REASON THERE IS NO FIFTH STARYou know that adage that \"You can do a few things great but only many things well\"? Well.....Margot's does fit this bill. Although some of the dishes we had were standouts, most were not very memorable to other fine dining restaurants I have been too. Since the space is a gutted garage or home there is little insulation and it can be a little cold in the winter and it is loud all the time. I did love this dining experience and thought everything was very good, but only one dish stood out to me. I know Margot's is known for their daily rotating menu, but I would advise having a seasonal menu instead. With so many rotating dishes you can choose the standouts and consistently deliver a great meal experience."], ["Stephen G.", "Weekend in Nashville and too many choices of great new places to eat.  This restaurant had the reviews and strong comments from most every one we talked to, so it became our Saturday night out.The menu was simple and elegant, and what a treat to see Margot there in here restaurant overseeing it all.  Started with a goat cheese and toast points, then moved on to saffron mussels, and finished our appetizers with a great beet salad.  For entrees we had the house made linguini with squid, and the best meal of the evening, a grilled salmon.All of the food was wonderfully prepared and presented.   Our waitress was also extremely well versed in the food she was serving which was impressive...... But somewhere along the ride I got the feeling our server just wanted to show her knowledge of food in general was much greater than anyone she could serve it to.  It was subtle, but turned what was a damn great dining experience into just a really good meal.I keep thinking what I may have done to bring this on (not wear shoes, order PBR in a can, or blow my nose in the linen napkin) but I just can figure it out.I would recommend this restaurant, and find the food quality very high.  It just proves again that the wait staff have a very significant influence on dining experience."], ["Cory C.", "What a great little place! I should start by saying our waitress was very knowledgeable of the drinks and menu she was able to answer every question we had and made great suggestions. I could tell she was a pro! The menu changes a lot which is a great idea you always have to try something new. After a long look at the amazing choices on the menu I decided on the duck breast which was prepared to perfection. Perfectly seared! I had a dream about it last night:) can't wait to get back and try something else. Do yourself a favor and come to Margot!"], ["Jon D.", "It's really merely decent. And as much as I dislike being the out-of-towner who doesn't quite appreciate the food ethic of the locale, the food was really a mere three-star experience on my palate. Margot does get the one star bump for a cozy ambiance and service which speaks volumes of homeyness, but the food did balance precariously towards the uninspired.But to begin with the highlights, the dining room is cozy. It feels like entering the kitchen which is open to the dining viewer with all of its hustle and bustle. The hosts are gracious and in particular, our server was very helpful and attentive in explaining to us the offerings of the eve. The potato chip appetizer came with a delightfully light garlicky aioli which was a fine opener. The soup of the day was a sweet potato bisque which was quite delightfully spiced with herbally infused oil, which added the slightest amount of bite to brighten the palate.The entrees were fomulaic and uninterested in execution. A protein, well cooked and seasoned, over a vegetable. The steak went with potatoes. The muscovy duck breast with brussels sprouts. The fish was accompanied by roasted squash. Yes, simplicity is sometimes king, and everything tasted pretty good. But in totality, it was boring. It was something that could have been home cooking. And I love home cooking, but color me uninterested for the evening.It was enjoyable, yes. There is a certain lovable quality about this place. For those looking to be satiated, a positive choice. But for those seeking inspiration? Perhaps seek elsewhere."], ["Erin H.", "You really can't go wrong with a restaurant that changes its menu daily.  You get the freshest food and good flavor combinations.  Not sure what I can really add to all the other glowing reviews, but here it goes...Started with the cheese plate appetizer.  On the day we were there, it was the most delicious blue cheese along with some pickled beets and toast points.  I'm not typically a fan of beets, but the combination was fantastic.  Next I had the salad.  Nothing super special about it, but certainly good.  For an entree I went with the sirloin.  Cooked perfectly with fresh green beans and new red potatoes.  I was stuffed when I was done, but everything was so good I just kept eating.  I can only imagine how good the desserts were.  Adding to the outstanding food, was the excellent service and the welcoming interior.  Margot is definitely a winner."], ["Sarah H.", "The food was really good, but it wasn't the best meal I've had in Nashville. We had the fried green tomatoes with blue cheese topping, a lamb topped flatbread, ribeye, the soft shell crab with a sweet corn mixture and the blackberry lemon tart like dessert.My boyfriend's ribeye was cooked perfectly; it was tender and flavorful. The fried green tomatoes were good, but not great. The flatbread was surprisingly flavorful, and the soft shell crab was almost wonderful. It was very warm and flavorful, but there were several small pieces of shell I periodically tasted. Obviously, it's impossible to get every little piece out, but it was a nuisance. However, the corn made up for it, and the portions were large. Our dessert was fabulous, and the couple we ate with's peach bread pudding was even better.Our server was attentive, but had a chip on his shoulder. I am a Sonoma wine girl, and I know little about Italian or French wines. When I asked for something similar to a Sonoma Pinot noir, he snootily told me they don't serve anything like a Sonoma wines. He then proceeded to try to get me to order a Shiraz blend- Thanks but no. Our meal continued in this manner. Someone at our table would mention how good the rabbit looked, and he would chime in and tell us all about it. He made his opinions a little too clear, to the point of almost being forceful. Prices were reasonable. Parking was a little difficult, because the lot was full. I'd certainly dine here again, but it wasn't the \"last meal\" I was hoping for. I thought it was one of Nashville's better restaurants, but not it's best."]], "Carrabba's": [["Martin L.", "We arrived at the restaurant and we must have timed it perfect as we were seated immediately. This is always a great start. I know that isn't always the case but we caught them before they became busy.     The service was very good as my glass was never empty. The food was terrific. There was enough to split the plate in half and take half of it home to have for lunch the next day.      A really good dining experience."], ["Queen B.", "Raining cats and dogs and we don't want to mess with valet or crowds, so we chose to go to Carrabba's for a cozy, warm, homey, familiar meal, with an alcoholic beverage.. knowing, we won't be waiting for a table, for a good hour..This was perfect.  Went to the movies, came here, ordered martini's, salads, entree's and looked at the dessert menu.Two of us had 1/2 chicken breast meal size/ different recipes.Another had a Caesar salad w/grilled shrimp.Two of us ordered specialty martini's and one ordered a Cosmo.We sat, we chatted, we drank, we could hear one another, there was no competition from the music, nor other diners..  Noise level is non existent.. but we were also in a booth at the front of the restaurant, in the bar.. Nice and quiet in there.  Perfect for a few friends to visit, eat, drink, and relax...Staff was great, food came out hot, attractive, decent sized portions..Drinks were small.. little martini glasses.Salads were fresh. Dressing was good.Water glasses were constantly filled.Great second choice, when over at the Mall."], ["Lynne P.", "Good old standby for Italian food.  I know that Green Hills gets a lot of negative comments because of the crowds, but this Carrabba's is really nice and the waitstaff and cooks are wonderful.  I got the  Tag Pic Pac which is Tagliarini pasta in Picchi Pacchiu sauce of crushed tomatoes, garlic, olive oil and basil.  It's light and you can get chicken or shrimp added, though this time I didn't get either.  Of course, no trip to Carrabba's is complete without the bread and the oil/seasonings to start out.  Yum, Yum!  Plus, I always get the house salad and it never disappoints. No complaints here--"], ["Beth B.", "We ate here last night and were disappointed in the service.  The waitress took our drink orders - just a glass of wine, a glass of sparkling water, and two plain waters.  It took a good while for the wine and sparkling water to arrive, actually just as the salads came (she had taken our dinner orders when she brought the regular waters).  Not good if you want to enjoy a glass before dinner.  Only a very few minutes after the salads arrived, the main courses were brought out.  Our table hardly had room for it all.  Very poor coordination.  It was not easy to enjoy a relaxing evening out with all this happening.As for the food, my wood grilled chicken was delicious, but my husband's pasta bolognese was not.  I'm not sure about our friends' dishes.  It might be okay for lunch.  The atmosphere was nice.  The salads were good and my main was fine.  We won't go out of our way to return, though, as there are so many other wonderful choices here now."], ["Dae R.", "I went here with my friend, and had a very good meal! Our server was great, and the food was delicious. It was the first time that I'd been to a restaurant that had correct portions, so I left filled yet satisfied. I was surprised that there wasn't many patrons in the building when I went in, but I was grateful for the quiet. I will definitely try going back to this location in the future."], ["Ghia W.", "Italian place, I will say I have to comeback in this restaurant again.. Clap! clap! for their entourage, I love how its romantic and peaceful on weekdays. Servers are friendly. Except she messed up on putting the cheese, she sprinkled it to me too! Anyways, if you come here make sure to order the crab meat for your appetizer, its the bomb. They only serve 2 small crab meat on your plate and you will never get enough of it. I would say the crab meat is expensive, its $9+ for a tiny crab meatI ordered the \"Crab ravioli\" and a \"Champagne shrimp scallop linguini\" for lunch and they are both served in a very good proportion. But the linguini noodles was kind of hard. I don't know if its how they served the food or they just messed it up, but make sure to bring it up when you order it, if you are wanting to have a perfect dinner. And for the win! Try \"Roscato\" not Moscato. A red wine that every Italian restaurant should have."], ["Beth G.", "We went for a few minutes before a school function. Happy hour special was crazy good for food specials. We had the bruschetta and the mussels. It was fairly reasonable and fast and the service accommodating. Would I go again? We used to like this place, not love, but they could have made the experience better.  Add bread to apps etc. It was just a place we went. With everything popping up, no need to really stop in unless we have to. Prices higher than average aside from happy hour."], ["Punam D.", "Came here for lunch on Tuesday. The restaurant is large and impersonal, and looked a lot like a TGIs. We knew we had a massive dinner ahead of us that evening so we opted for the soup and the salad. The soup was Sicilian Italian Chicken which was their minestrone with some cooked chicken thrown in. It was acceptable and nothing special. The salad was iceberg lettuce with tomatoes and the usual trimmings. Ok. Service was fine if a bit saccharine. Meh."], ["Eiko M.", "We visited Green hills mall for the first time. My son gets hungry so we were looking for somewhere to dine in. Found this restaurant, we decided to go in. First impression, this place smells so bad!!! It's like fake cheese and puke. The floor is sticky. We got out right away because we were sure the food here is not going to be good."], ["Neisha C.", "I love the Chicken Bryan! If I'm feeling a little risky I'll switch it up and get the Chicken Marsala. If you go, ask for Ben D for a server. Keisha is the best bartender to walk foot into Carrabbas."], ["Max K.", "Solid place for dinner.  The portions have gotten smaller over the years, but the food is delicious.I believe they are planning on closing this location soon, so hurry up if you been wanting to try it or don't want to drive a long way to get it."], ["Pame C.", "Horrible service. Salad was not fresh. Drinks are over priced , small portions .Hair in my food and very poor management."], ["Jason D.", "Used to be a great place but since new management has taken over the place has spiraled downhill. The server I had was really nice but the place looked like a circus. I was there at a prime time and there were more servers standing around then there were people in the restaurant."], ["Ryan W.", "Quite restaurant. Food were not what I expected . I like Olive Garden better. I ordered the filet steak medium. But I got a medium rare with blood. I asked for re-grilled, after 10 minutes I got a well done steak. And I don't like it at all, it's not worth $24.59！but I like their chicken Bryan-Goat cheese on chicken white meat. I rate 6 out of 10."], ["Nashville T.", "I got food poisoning here in March.  Health department wasn't helpful and blamed it on an Arby's that I ate 5 days previously.  My spouse called manager the next morning.  Finally heard back from them 2 days later.  Some child could have died eating the fettuccini or connoli.  Guess we will never know.  We have eaten here about 20 times and Will never go back."], ["Da Deacon H.", "I love this Carrabba's Italian Grill location!Greens Hills shopping area provides a location to accommodate all your shopping & eating needs. Yes this area stays somewhat busy but offers plenty of parking, as well as covered parking in the garage. My fam and I ventured here for lunch and at my surprise really enjoyed my food and time there! Pros: Waiter very friendly, and maintained contact with us throughout the meal making sure we didn't need anything, our food came pretty darn fast, everything was hot and made just the way we like it.Cons: My salad could've been better, I noticed that my lettuce had that kinda stale taste to it as if it was on the verge of going bad in a day or so:( Other then that 4 stars!Will return"], ["Larry S.", "We stopped in for a late lunch while shopping in Green Hills, and we had most of the place to ourselves.  I'm sure that the staff had plenty to be doing behind the scenes, but our waiter still managed to be very attentive. We had the soup & sandwich combo.  I'm kind of a fan of panini sandwiches, and the steak panini was all that I hoped for.  But it was the lentil soup that blew me away.  It was thinner than most lentil soups, and was made with Italian sausage.  And it was awesome.So if you've already put the time and effort into finding a place to park in order to shop in Green Hills, treat yourself to Carrabba's!"], ["Dara P.", "Tried to have a nice lunch yesterday before work, bad experience!!! We were seated, waited, then got our coffee, waited. Others were seated, waited, our server took their orders before us, waited. Manager came by to talk to the other tables, not ours! Salad arrived with a huge \"slice of ice\" in the middle of it. Server took it to Manager who brought the ice back to the table (minus a new salad), to tell me it was just ice, DUH, where's my salad? We cancelled order and left. The Manager was very rude!!! Used to be our favorite place, not while he's there!"], ["Joshua L.", "Great service and great food"], ["Natalie D.", "Delicious! Great, consistent food.The pasta carraba is a hit! The Trio special is a deal . The bread and olive oil fantastic.Must get the chocolate dream Good service."]], "Maggiano's Little Italy": [["Alisha W.", "Great live pianist to match the hype of the weekend!  We all sat in the bar so we could enjoy the pianist playing.  Nashville is all about the live music, country to classics.  It really adds to your dinner when you hear some of your old favorite tunes.  The service was great for an extremely busy Friday night. We all split a few apps and salads.  The cheesy bread is amazing and the spinach salad makes up for all the carbs we ate! I had the chicken marsala for dinner and it was fabulous!  I will be back!"], ["Bob M.", "Oh my.   Ordered salad.  Wrong presentation. Manager apologizes. Taken off bill.  Replacement wrong also. Alas manager says we make mistakes.  Oh god wrong answer   Have fun. By the way the piano was great."], ["Joanie S.", "Awesome service for groups. The food is to die for. The experience with the piano music is magical."], ["Roshotta M.", "Food and customer service was 5 star!!!!. Thanks Eric for being such an awesome waiter."], ["Kevin S.", "As a treat before I go into chemo treatment tomorrow, we decided to go out to Maggiano's for dinner. This was a great decision!! First, the decor was first class and very clean. We were greeted with a smile and promptly seated. Then our waiter(s), Shane went to work which also included his \"brother\" Addison. Between the \"better than excellent\" service, recommendations, and help, then came the \"to die for\" Italian food. Words cannot describe how great the food was. Large portions and with the meal for two, you get two large portions, different if you choose, to take home. WOW!! Hats off to Maggiano's on West End in Nashville, TN. Shane and Addison are masters of their craft!!!! Thank you very much!!!"], ["Julie B.", "Craving Italian food during our visit to Nashville and Maggiano's hit the spot. As delicious as the food was what really won me over was the service. Our waiter Ross was impeccable, attentive, polite & easy on the eyes! If I lived nearby I would go back whenever craving Italian food & ask for Ross to be my server."], ["Petie D.", "Ok, what happened? We used to love this place, the food is still exceptional BUT between the 'assistant' and the waiter - we were rushed so much it was uncomfortable.  The waiter seemed disappointed when we ordered just one drink, but we ordered apps, meals and dessert so it's not like we were tying up his table.  Additionally, there were many many empty tables... And for much of our time there it was so noisy we couldn't hear each other.  This truly used to be one of our favorite places, sadly it's not any more.   If you must have, order take out - ugh, so disappointing."], ["Nathan L.", "This place is so cool! The service is friendly, the ambience is nice, decorations on point, food is also pretty damn good. You even get one to take home with you if you order a classic dish! Highly recommended."], ["Mia S.", "I had heard several times that Maggiano's offered a significant military discount. Well I just want to take a moment to give them a shout out. They give a 50% one which is unheard of. Not only that, the manager came out to personally shake his hand & gave a little speech that bc of his service, people have the freedom to sit & enjoy meals at their restaurant. He seemed very sincere & it was heartfelt. We will be back..not for the discount but for the appreciation behind it. MANY others should take note. That place was UH MAZING TOOO & we have loads of leftovers. Hats off to you Maggianos"], ["Julie T.", "5 stars doesn't even begin to cover it!! I have traveled many places and this rates in my top 5 for sure. We had GREAT service. The food was amazing. We had the pleasure of sharing the family style service.  We are full bellied and enough to take home to eat for two more meals!!  The bruschetta was one of the best uv ever had."], ["Gail D.", "Had lunch there yesterday.  Chris, our server, was awesome.  The food was spectacular as it usually is.  Atmosphere was nice and private.  My favorite entree is Linguini de Mare if you love seafood.  The calamari appetizer was tender and meaty and we had plenty left over to take home.  Mini tiramisu was the perfect size for one dessert and very delicious and always fresh.  We'll definitely be back again."], ["Dee W.", "Enjoyed our meals. Atmosphere is nice, not fancy but nice. Portion size is huge.   Grilled salmon was excellent and came with rice and alfredo sauce. Pasta and meat sauce was good and bread was excellent.    Very loud and hard to carry on a conversation  Reservations are a must."], ["Terri H.", "Romantic Italian Atmosphere!We have dined here a few times.  My favorite time to be here is when they have a pianist playing beautiful romantic music!  The atmosphere is cozy and romantic even without the piano music.  It is a great place for a date night.  They have a great house Chianti.  You can choose to order from the individual menu or the family style menu when you have a large party.  We decided to order from the regular menu.  I ordered the Chicken Marsala and hats off to the chef because it was amazing!  It is lightly floured chicken with sautéed mushrooms and onions in a Marsala sauce.  Angel hair pasta comes with it which is by far my favorite pasta."], ["Melody Q.", "One of the best Italian places I've ever been too! Great service and food. The long spill they give at the beginning was a little much but maybe because that was our first visit, no biggie though :) I felt like I was in Italy eating there! Great experience!"], ["Amornwan D.", "The food was awesome; however, the hostess ruined my night. They were so ignorance.   They didn't smile. They were not friendly.  They put my table in the corner next to two big parties - more than 10 people each group.  When the waitres or food runners served food to those people, they carried food over my head. Their butt hit my chair and one of the guy elbow hit my head."], ["Thomas K.", "Perfect family meal and atmosphere!  Excellent service, great food and good prices. My family and I will definitely be going back.I recommend Maggiano's to anyone looking for good Italian food!"], ["David C.", "Love this place. Always a pleasure. Loved going to the NJ location when I lived in NY. Now I live in Nashville and I have the same great experience here!"], ["Amanda H.", "Great food, perfect atmosphere, attentive wait staff! First time here tonight! Will definitely be back when back in Nashville. Highly recommend!"], ["Darren C.", "Reservations - that's where it's at! This place is bumpin and we got our table with zero wait. Valet parking too! Serving sizes are just right, and (first time here), there are menu items that offer a \"get one for here, get one to take home\" feature. Everything is made to order - fresh!  Seems like a great place for gatherings  or special occasions - so dress like it...  Friendly staff, all dishes were excellent - lasagna, Alfredo, chicken caprese salad, bruschetta, all spot on.  The wine is a little pricey, but overall, you get what you pay for. We'll be back!"], ["Michael B.", "For the money and the generous portions, Maggiano's is great.  Made a reservation early in the day for 10 and they were ready.  Of course, this was a Tuesday.  Great atmosphere for gathering a group of folks together, the apps are great, good wine selection and all the classic dishes....I mean, for what it is, it is what it is. SOLID."]], "Coco's Italian Market": [["Michelle N.", "Really good food -  I don't do \"pizza\" at Italian places - I order actual dishes, and they have REALLY good classics here."], ["A B.", "Lunch customer here & Coco's does the trick. It took me figuring out what to order & what not to order before I settled on some staples. For myself, the panini's are most consistantly satisfying. The Formaggio panini is excellent!"], ["Judi T.", "Couldn't ask for better hosts or better food. Artichoke and hamburger pizza is to die for!!  The attached market has all the stuff I remember from visiting Italy including house made gelato and candies. You just gotta try this place!!"], ["Ying M.", "Had a lovely brunch here yesterday- the bruschetta, espresso and the tiramisu were divine. I felt that the food was comparable to Bella Napoli but less expensive. I had the fettuccine and meatballs, which were good but not as impressive as the other dishes.The restaurant is very cute- when it's cooler outside I'll try sitting on the patio. I was also amused by the bocce court outside.  Service was ok- nothing special. It seemed at times that our server was more interested in turning our table than in serving us, but perhaps it was just especially busy. I'm very pleased to have found this place, as there is a dearth of good Italian food in the Nashville area. Food is good, prices are reasonable, what more could you want?"], ["Jennie Anne R.", "First time here. Meatballs were so good and tender. Food was great. Authentic Italian. Will be back very soon!"], ["Mindy J.", "I have been searching for an Italian deli ever since I came back from NY and I think I've finally found it!!! It's a market/ restaurant... Doesn't appear to be much from the outside, but the inside was warm, inviting and clean; and it smelled SO good!It wasn't very busy being only 5:00 so I was seated right away by a nice young man, forget his name, Who also waited on me, and did a great job.... And he had a great smile. A+ for customer service!Now onto the meal... Outstanding!I ordered a glass of Merlot (great taste) and a \"Torpedo\" sub with Hot Capicola, Genoa Salami, Proscuitto de Parma and Provolone with Roasted red pepper mayo- MMM!!! Sooo Good!!!... (It also comes with red onion and roasted red peppers, which i cannot eat and it came out perfect,... but if you like them, I bet they would be a great addition)And my sub came with an order of really good pasta salad as well.All of the meat was very fresh, and I can't wait to go back next time and order some to take home from the market side!All in all, it was a great meal, I will be having the 2nd half of my sandwich for lunch today :)Good, FRESH food, Great service, and Good wine! My kind of place"], ["Loni S.", "My husband told me about this place, and he finally took me!!! It was everything I had hoped for an authentic Italian restaurant!!! A must go!"], ["Ariel L.", "ok, I'm of Italian descendant, went to cocos just because I founded on internet, nothing special, in my opinion its only Fazzolis  food,  very cheap ingredients, sauces from cans, Mexican oregano, gummy pasta, nothing fresh or original, plus ...pizza without yeast? really? come on !!! even the pizza was incredibly bad prepared, but most intriguing was, if you call yourselves Italian why do you dishonor our cuisine, with this kind of  food? please do not go there..save time and money...they have a cook that does not taste their own food...!!!"], ["Woody B.", "My chicken parm was delicious and was plated in a manner that was better than most. The lady serving us was hustling and truly worked hard.  There was a long list of possible beers to be ordered, however, there were only two on-hand; Angry Orchard and a really dark beer.  They fell short in that area.  I wish they served a bread while we waited.  If you are close by and want Italian, definitely go."], ["D D.", "Fantastic pasta and great gelato. Service was good but we had to wait on water refills and to order dessert longer than we should have. 6:00pm Sunday night is def one of their crunch times. The meal was delicious and a bonus was coming home with goodies from the Italian market to enjoy later."], ["Gina M.", "Decided we needed and updated review.  It deserves every star because: 1. One size pizza and it is large for $10 bucks.  Feeds 2-3 and put a few toppings on it for a couple more dollars.  Hand tossed and my favorite pizza in town, hands down.2. Staff is great.  Everyone is just happy.  I like that.  3. If we are eating meals instead of pizza it is a bit more expensive ($12-$15 mostly) and worth every penny.  4. Did I mention the yummy, large, $10 pizza?5. buy your deli meats here.  This puts Boars Head brand to shame.  The prices are all about the same and the turkey tastes like it is off the bird.  Don't order it too thin or it will fall apart, like on a real bird.  And  it doesn't have all that preservative crap in it so only buy what you will eat over the next couple of days.  Their cheeses are great as well.  I also buy their brand of pasta sauce.  It is perfect and only $5.95 I think.  Worth the extra buck to not have Ragu.  6.  Great espresso drinks, hot or cold. 7.  The desserts.  Be warned that when you ask for the cheesecake it is as much as the pizza but it is HUGE and the best I have ever had.  The other desserts are wonderful as well but it is hard to not just throw down a tenner for the cheesecake and share it.  Can you all tell, that I love this place."], ["Caroline H.", "I had a not-so-great experience at Coco's that is pretty unfortunate. I was psyched to try some authentic NY-style pizza and Italian food! My parents are from upstate NY very close to where the Coco's purveyors originated and I grew up in the fair land of New Jersey, so I know some good Italian food....the problem is I DIDN'T GET TO TRY ANY! My lunchmate and I ordered some caprese salad to start with (I pronounced it Cuh-preeze-eeeee, I get it Mr. Waiter from Nashville that people in Italy probably say it differently but don't be a snob and correct me) which was fine and standard fresh tomatoes and mozz. I ordered a Margherita pizza for us to split....and it never came. We waited and waited. The waiter came to ask how everything was (otherwise he was a friendly but aloof guy). I inquired about the pizza and he said \"Pizza? what pizza?\" and I said \"the Margherita we ordered?\" and he said \"Oh I never put it in\" and I said 'well that's a shame\" and he said \"would you like to wait for it?\" This is where I should have said \"sure\" but I didn't because I was starving and REALLY MAD so I said \"NO just the check please.\"He didn't offer to even take our coffees off the bill. I *promise* one hundred times over that I am an easy-going customer, but when (on a not-so-crowded mid-afternoon) you bring two women a plate of tomatoes and think that's all they're going to eat without even double checking? I have a problem with that. I am getting fired up about it again just writing this out. Sorry, Coco's. I wanted to love you, I really did. You could have impressed me with an apology. You could have won us over with an offer of our pizza in a to-go box. You didn't. You just brought us our check and made me ANGRY.Cute place, though. Just can't recommend it. Yet. Perhaps I'll try again someday because I had such high hopes!"], ["Linda A.", "Usually I don't make a big deal about prices at restaurants, but holy moly this was a bargain.we had a caprese salad, Italian side salad, a wonderful Margherita pizza and beers and our bill was $28.53.  That is incredibly reasonable.  To top it all off, everything was so delicious and we enjoyed the homey atmosphere.  So glad we randomly noticed this place a few weeks ago.  We'll definitely go back as we'd like to try the pasta dishes."], ["Kenneth D.", "We actually came with the intention of purely playing Bocce Ball, but decided to go with our gut instinct and stay for brunch. Great decision. The selection of imported goods, the gelato and the dessert case were enough to make anyone hungry, but they had me at the smell of pizzas baking.I decided to go with the Italian Beef Sub, since I was really interested in trying the fresh baked bread. The bread was certainly a great base, crunchy outside with a nice chew to it. It was served with a decent amount of fresh sliced beef and topped with tons of cheese. If you stopped there it would have been a very successful sandwich, but the giardiniera put it over the top. It was served with a side of pasta salad, which was pretty good, not the best I've had, but sufficient.Two things not to skip here: the espresso drinks and dessert. I would come back for those alone. The Amaretto Chocolate Espresso wasn't overly flavored, and the foam was fantastic. As others have stated, please do yourself a favor and get the Chocolate Explosion Cake, it's excellent. Light whipped chocolate filling suspending chunks of cheesecake, with a moist chocolate cake base...if that doesn't turn you on, even a little bit, you may not be alive.The service was great, very attentive, but not overly so. Our server was very friendly and made sure we were never low on anything. Judging by the reviews, I guess service may be hit or miss, but our experience was flawless.We'll be back to try some pizza and so I can work my way down that dessert case. Oh, and the Bocce Ball, don't be scared."], ["Michael M.", "Nah, maybe 2 1/2 stars because the prices are so low. Went there tonite for the first time. Played bocci ball on artificial turf. Huh?  I'm used to the crushed oyster shells; got my head handed to me.Ok the food. The market part is sparse and not top shelf Italian products. How do I know? because I  fill my suitcase every other week with bread, cheese, and anything else I can legally take on a plane when I travel back from North Jersey. They need to kick it up a knotch but then again if nobody knows better. Rao sauce? I dunno, tourist sauce. The cheese selections - anemic. We didn't buy a thing. 'nuff said.AppetizersI had the Manast as an appetizer and it was bland; no taste and watery. I added pepper and a mountain of cheese which helped. Boys had calamari which they liked; they said the marinara was one of the best they've had in Nashville.Secondi PiattiI had the Tortelilini Ellligston.  Bland again, no taste. Cheap cheese on top, the pasta was fresh but I was not impressed. Added lots more cheese and pepper. Helped but I've had agita for the past two hours! Boys had quattro formaggi pizza.  They enjoyed it but the crust was soggy from all the oils in the cheese. Wife had the Creamy Chicken Marsala. The chicken was dry and the dish so salty she couldn't eat it. The garlic bread wasn't, but getting decent bread in Nashville is like trying to buy a Speedo in Siberia.The wine was ok, I do like ordering vino I've never tasted before. The service was menza menz. Never refilled my wine glass which was a goblet. We skipped dessert and got out of Dodge.  I probably won't go back.  I'm about to say 'uncle' to Italian Restaurants in Nashville and just stick with barbecue."], ["Katy T.", "I really, really, really want to like this place,  but the fact is that it just isn't good.  In fact, I wanted so badly to like this place that I gave it nearly 10 chances, and each time, it was a major disappointment. It was my meal last night that prompted me to write a review. As I looked online, I could not believe how many people gave this restaurant four stars. I can only attribute it to the fact that for many, the Olive Garden is the epitome of good Italian food. The Olive Garden, honestly,  would be a step up from what they serve at this place.Let us start with the bread. It is absolutely terrible. That is all I can say about it. They don't even try with the bread. Now let us move on to the red sauce. Absolutely no flavor whatsoever. It is almost as though they open a can of tomato paste and just heat it up. I can't tell you how much salt I had to use just to taste anything. The first time I ate here, I don't remember the sauce being so bad. I wonder if they got a new chef or something.The service definitely leaves something to be desired. Last night, I felt as though the servers could have been supported by management a little bit better. There was a very rude family with about five children who were running around the restaurant spitting through straws, and the waitresses and waiters had to maneuver around them. It was really bad, and management should have done something to correct the situation. I certainly did not enjoy my meal because of this family, and as I looked around, I noticed other people who were very irritated. This is a tough situation in a restaurant, but management needs to have the balls to take care of it.The market part is very cute, and I was happy to see that they started making their own fresh mozzarella. I bought some, but I haven't tried it yet. Desserts are okay, but I wonder if they are made in house. Regardless,  I definitely will not be back."], ["Mike A.", "For me, this is literally as good as it gets. I've driven by this place occasionally for the last handful of years and have always wanted to stop in. A profile of it on the show TN Crossroads finally got me to do it. Had dinner here and could not have been more satisfied. The low-key market style setup really gets my attention. Not a particularly formal place. Definitely not touristy. It has an authentic feel that does not try too hard like so many places in Nashville do. The service was top notch. Our waiter was young but knew the menu very well and all the nuances that go along with serving authentic Italian food. We had the Bruschetta to start and I knew it was going to be a good meal when I tasted this. I could have had a second order of it. Then I had fettuccini and meatballs. My dinner partner had the chicken parm. I tried it all...all delicious and as good as I've ever had. A glass of house red wine was $5. Can't beat that. Portions were excellent size. If you've gotten this far in the review you know I will have nothing bad to say about this place. So just do yourself a favor, cruise on over to Charlotte Ave. and check this place out."], ["Alan d.", "Do no t order the penne al fresco. Sauce was basically salty chicken broth and chicken was rubbery."], ["Yuleidy K.", "I am rating this restaurant just 4 stars simply because of the dish I had. We had a great experience, and a great waiter. We ordered the ravioli for an appetizer and they were great. Our Caesar salad was very crisp, fresh and delicious. I ordered the Eggplant Parmesan and it was just OKAY. I've definitely had worse, but not the best. The Eggplant slices too thick in my opinion. We ordered a side of meatballs and they were GREAT! Best meatballs I have ever had! I highly recommend them!!! The tiramisu was fantastic! When you're done eating or if there is a wait, shop around in their market. Great finds!"], ["Rosie L.", "Took the family to this great local place when we visited recently.  Casual atmosphere, not stuffy and family friendly.The appetizers were divine!  Bruschetta, caprese, and calamari - all awesome deliciousness!  Bruschetta and caprese had the most amazing balsamic glaze.  I bought a bottle to bring home.  Bruschetta was delightfully soft in the center with great veggies on top. . . and did I mention the incredible balsamic glaze???  The caprese was so fresh, OMG the cheese just melted in your mouth and the tomatoes were off-the-vine tasty.  The main courses were good but not of the same caliber as the appetizers, surprisingly enough.  Their version of Chicken Marsala is a white wine sauce which was actually quite good - just not sure it can be a true marsala with white wine.  The seafood arribiata was delish and the Cinelli's parmesan with eggplant was good but the sauce on both was quite bland and acidic - very little seasoning in the sauce and a bit watery.  Same with the fettuccini & mushrooms - sauce just so-so.The market is fun but I agree with other reviewers; the selection is only slightly better than a good World Market.  The olive oil selection is good, the bakery/chocolates are exceptional, but the market should not be the focus of the experience at Coco's.  I am so glad to have been able to purchase the balsamic glaze and have found it for sale elsewhere closer to home so I'm happy.Overall a good dining experience - I'd go for the appetizers again but maybe try the pizza, since so many say it's good.  The main courses, at least the ones we tried, just weren't good enough to try again."]], "Joey's House Of Pizza": [], "City House": [["Chloe R.", "This was our first stop in Nashville and it was a wonderful way to start out weekend! The bartender suggested a bottle of red (Primitivo) that was just what we were looking for and we had the ricotta, grana padano, garlic and mustard greens pizza. The mustard greens were an amazing addition - spicier than the more common arugula! The restaurant is in Germantown, a more up and coming part of Nashville, and it took longer than expected to get an Uber to the bars after eating. Overall, a great date spot and the service at the bar was just what I look for when traveling - the bartender suggested spots to check out in Nashville and in Chattanooga during our trip home!"], ["Brent S.", "It was our anniversary and wanted to try a place we had never been. After hearing some good things we were excited to try City House out. When we arrived we had some time to kill so we decided to grab a drink from the bar. We were rudely greeted by the bar tender who then proceeded to take a very long time to make two drinks. The drinks were not very good, considering the other amazing options in Nashville. We had asked to close out once we got our drinks, but she refused to do it then. An hour went by, my wife went a sat at our reserved table while I had to ask two more times to close out. Then they gave me the wrong bill, to the tune of $72.00.... For two drinks...needless to say that was another nail in the coffin. Once we sat down, our waiter was very helpful. However, we ordered a glass of wine and another man who brought it to us quickly said what it was and with it being loud in the restaurant, I asked what he said the wine was because we thought he had said a different wine than what we ordered. He then quickly, with attitude, said the entire name of the wine as it's listed on the menu and turned away. We ordered the clams with white beans, which literally had 5 clams. I counted. The dish was okay, but not great. We also had the Belly ham pizza with the egg. Honestly, there was nothing special about it. It tasted good, but was no where near Desanos flavor profile. After spending $75 on the meal, we were very underwhelmed and left regretting our decision to go to City House on our anniversary. We have had MUCH BETTER experiences and MUCH BETTER food at other restaurants in Nashville."], ["W. John R.", "We dined here with some friends who moved to Nashville awhile back. When your local friends recommend a place as THE restaurant you have to try when you're in town for the first time, you have a high expectation. And this place most definitely delivered.My first pleasant surprise was the cocktail menu. Whenever you see an assortment of bitters, egg whites, citrus zest, and other creative ingredients beyond the standard liquor-and-soda, you know you're in for a treat. I ordered two different drinks just because I was so curious, and both were pour to perfection.We had a relatively late lunch at Centennial Park, so we weren't starving enough for appetizers. Our friends ordered the calamari and it looked phenomenal. My main course was the chuck steak. I was nervous ordering what is generally looked at as an inferior meat at that price point, but my fears were completely unwarranted. The lemon/Parmesan/onion combo was a different take on steak, and I devoured every bite.I felt badly for our waiter, who tripped going up the steps and lost an entire tray full of empty water glasses.Note: be careful if you're planning to hit this restaurant up on the same day as a baseball game. There isn't a dedicated parking lot, and the street parking is completely packed due to close proximity to the baseball stadium. There were paid lots nearby charging money, but instead I found an open street spot - but it was about 5 blocks away and a ten minute walk back to the restaurant."], ["Michael U.", "Items Selected:Frico: Buttermilk Cheddar, Sweet Potato, Chilies, Scallion, Cider VinegarBelly Ham Pizza: Mozzarella, Grana Padano, Oregano, Chilies, EggCornbread Gnocchi: Chard, Tomato, Tesa, Chilies, GMRSConchiglie: Mushrooms, Parmesan Fonduta, Garlic, Lemon, ParsleyRice Grits: Chicken Sausage, Greens, Red Onion, Garum, Grit CrumbsSausage: Rhubarb, Orange, Vidalia, Peanuts, CeleryYellow Corn Grits, Turnip Greens, Pot LiquorStrawberry Ice Box Pie: Preserves + Braccheto Jelly, Vanilla Malt Snickerdoodle Crumbs, Mascarpone CremaCookies + Cream Panna Cotta: Sipping Cream Caramel, Chocolate Toffee Meringue Crumbs, Mascarpone CremaTennessee Waltz Cake: Chocolate Buttermilk Praline, Bourbon Zabaglione, Coffee ButterscotchAlmond Ricotta Pound Cake: Lemon Marmalade, Lemon Ricotta GelatoFrequently named amongst the best restaurants in Nashville, and yet another in the long list of places proudly promoting a seasonal menu focused on Italian accented Southern fare, it was at City House that the trip's final dinner with family would be enjoyed and although some aspects of the night were marred by an exceedingly loud group of bachelorettes and service that seemed far more interested in tables to whom he could push expensive bottles of wine the food itself was mostly quite good, a few significant highs and the rest at least well enough prepared to let the quality of well sourced ingredients show.Situated in an old home with seating spread amidst a large downstairs and two rooms comprising the space above, it was at first that our seating in a small former bedroom seemed a bit unfortunate but once the bridesmaids became well lubricated even the warm, stagnant air was preferable to the shrieks and shouts echoing off high ceilings - our server more than once pulled to assist another young man that appeared to be an overwhelmed trainee as thirty minutes passed between ordering and first courses that never once saw our party checked in on at all.Eventually mentioning the lack of attention to our server, a confronting attitude offered where an apology would have been far better made, it was thankfully here that appetizers arrived, the crisply fried cheese and vegetables offering a slight bit of heat amidst hefty aromatics while the lightly charred pizza featured a crust robust enough to stand up to several unctuous toppings, the signature cornbread dumplings dotted in pancetta, tomatoes, and greens certainly as hefty a plate as would be expected, a dish best shared to be sure as a half-portion would serve smaller appetites as a meal in itself.Onward to entrees, at this point visibly seeing patrons in the larger room wince at the behavior exhibited from the party of twelve, it was another large bowl of pasta that proved the best of three plates for as good as each sausage was the accoutrements leaned heavily on the use of onions with the chicken version all the more confounded by what seemed like nothing more than raw lettuce, an odd choice to say the least, though certainly not as unpalatable as the side of corn grits that was so bracingly bitter than it went almost untouched, a 'your mileage may vary' plate to say the very least.Having heard many positives of the City House dessert program, enough so that the meal would culminate in an order most easily stated as \"one of each, please,\" it was here that I was glad none of the entrees compelled me to overeat for as much as the prices of some savories seemed a tad excessive the $8 sweets were portioned exceedingly generous, the lightly set panna cotta most certainly the lightest of the quartet despite its bold flavors while the strawberry tart melded cream and fruit flawlessly, both cakes far more decadent with the poundcake potentially containing as much as a stick of butter per slice and the layered Tennessee Waltz just boozy enough to tantalize the tastebuds up front before dissipating into notes of coffee and caramel competing for top billing amidst a buttermilk tinge."], ["Sheena T.", "Man... I hate when I have to write an update for a place that has gone down, but I had to for City House. Stopped in for dinner the other night and had a very lackluster experience. We started with a raw cauliflower and cabbage dish with a light red wine vinegar that was pretty good. It came out quickly and we thought we were off to a good start. Not so much. It took a long time to get our entrees and we were a party of two. Once they came it was not worth the wait. I had the chicken with a side of mustard coated red onions. If that sounds weird, it tasted really weird too. The chicken wasn't very moist, and I made the comment that  I've had better rotisserie chicken at Publix. My dish was very blah and the onions were just not good. My BF had the grits with a lamb sausage that he enjoyed, but again, I thought tasted oddly. It was kind of tart and I just didn't think it went well together. The two highlights of the meal were the chard side and the fuzzy beer drink. Both of those were excellent, but overall, the meal fell very flat."], ["Krystal L.", "The worst meal I had in Nashville. Seriously sad.DRINKVery very bad cocktails. Ordered the Old Fashion at the bar and it tasted like a cheap berry cocktail. We moved to our table and I asked for a red wine to replace the drink. I was unsure if there was some uncertainty about me not wanting the cocktail so when a man brought the wine and I explained the situation, and attempted to hand him my cocktail back. He refused and said he would tell my server. Unpleasantly, that did not happen and instead we were stuck with the icky cocktail on the bill. Even after I explained to the waitress (she approached us when I wrote her a note on the bill). She profusely apologized and then left. Ok.....you are actually not sorry. Because if you were you would have tried to help us remedy the situation. The cocktail was $10 but at that point it was on principal. FOODCarrot/cabbage/white sauce/peanuts appetizer: This was basically coal slaw but for $9. Not worth it.Cornbread Gnocchi, Lamb Sugo: Ok....What the HECK. What the heck was this?? I will tell you. Someone cut up pieces of corn bred, fried it, and put it in a bowl. Oh, and sprinkled a little pulled lamb on top of it. It was ridiculous and was basically eating corn bread drenched with olive oil. Belly ham pizza: Actually very good. I would recommend this. SERVICEA bit disorganized. Again, the drink situation was pretty disappointing. Overall, a very poor experience for valentines day, especially with all the great food we had the days prior. Will not recommend to anyone."], ["Loralyn D.", "I think this is my all-time favorite restaurant in Nashville.  Definitely top 5.  The food, atmosphere, history of the building, and quaint neighborhood make it a wonderful experience.The menu changes throughout the season, which forces me to order something a little different every time.  I think our favorites are the gnocchi and pizza.  Delicious!Make a reservation or expect to sit at the bar on a weekend night.  The bar is fun to sit at because you can watch the food being prepared."], ["Chris B.", "I have a love hate relationship with this restaurant. Having been here 5 times I have had 3 great experiences and 2 mediocre meals. Each time the food is excellent it convinces me to return to simply let me down followed by someone from out of town wanting to come here and me begrudgingly returning only to be surprised by good food again. Consistency is king in the food industry so i still dont know how I feel about city house. WHat I can say is when its good its very good and when its not good you will leave very disappointed."], ["Simon M.", "Saw a piece on this place on the 36 Hours TV show. It is in a nondescript building, with little signage, so look carefully. It has a vibrant atmosphere with a limited menu, which I suspect changes often. The server was attentive but not what I would call warm. I had the October Bean Soup. October beans, peppers, grits, garlic, chilies and pecorino. Fantastic! My wife had the Olives, Taralli, which she liked and there were enough to share. We also shared a Margherita Pizza which was good. A little noisy when there all lots of diners. There is a large bar area and an outside screened area. We recommend it."], ["Amelia V.", "Last night was my first time here and it happened to be \"Sunday Supper\" which just means that their menu is different than usual. I was excited to see that there were so many Italian wine selections but they were all wildly overpriced. Any cheap Chianti would have made me happy but I had to go with a $14 glass of Sangiovese. I was underwhelmed with the atmosphere (plain, industrial, open space) but even more unimpressed by the taste. My pizza was so terribly salty that it made all the other food taste salty, too. When the server noticed that I wasn't eating much, I told her it was too salty for me and she said \"it's a good kind of different\" without asking if I would like to try anything else or make an exchange. Simply put: there are many finer places to experience Italian food in Nashville."], ["Cait C.", "These guys are trying way too hard to be trendy and failing just as hard. They are trying to force the fried egg on pizza trend, but the eggs were almost raw, and made the pizzas extremely soggy which was disgusting. I can not recommend this option if you are ordering the pizza. The cornbread gnocchi were very large and very dry, which is the opposite of what gnocchi should be.We had the berry tart for dessert which was 3/4 soggy stale shortbread, should have been 3/4 fruit and a nice buttery crumbly shortbread.The pizzas without the eggs were pretty good, but i didn't come here for pizza. We enjoyed the salad and the octopus the best and would eat those again for sure."], ["Jeff D.", "With all of the national hype surrounding City House I suppose I was expecting more. Hype can do that. Likely this was a perfectly delightful place and buzz happened. Buzz can be a good thing for a restaurant as it struggles to attract attention. When it gets out of hand it raises expectations to a level only a slim group of places can attain. I believe this is the place City House finds itself. The food was good, the service was excellent and the vibe was lively. This was a perfectly fine meal and under normal expectations I would be satisfied. The hype unfortunately left me wanting. Too bad."], ["Janet H.", "Made a reservation for the Sunday Supper during our first trip to Nashville based on the Yelp reviews.  The restaurant is located within an old carriage house in the beautiful and historic Germantown section of the city.  The entrance is located around the side, past a cute mosaic-floored screened summer dining porch.  The main dining room is sub-street level with a large open concept kitchen with bar stools overlooking the kitchen.  We went upstairs to the original portion of the home with very tall wooden planked ceilings and distressed brick walls.  Loved the openness of the space, but it was rather drafty and loud, but still spectacular.  The waitress was very helpful and gave us great recommendations on what to order.  My husband hates organ meats, but I convinced him to try the heart with broccoli, red onions, peppers and citrus dressing, which he loved.  We also ordered the wings and the homemade sausage \"snack\" with kohlrabi, apple, and horseradish cream.  We had the chuck and ricotta pizza with an egg on top (besides the sausages, they seem to be known for their crispy homemade  pizzas and just about every table group had the popcorn snack--but I was nervous about the fat content of the chicken fat topping).  We ordered the large pork meatballs which were just the right amount of sauce and spice with lots of garlic.  Dessert consisted of a caramel-topped apple skillet cake with whipped cream, I didn't care for the whipped cream or the sweet pickled apple chunks.  I thought they were too tiny and the cream needed more flavor.  We made the mistake of ordering probably one more dish than we should have, as there was lots of food.  Also, more distressing was that all of the food came out at once.  Our waitress apologized profusely, and even gave us an extra dessert, but the pizza chilled quickly, who likes a cold over-easy egg and the meatballs were freezing by the time I got to them.  This has been a major breakdown when you order tapas-style plates for sharing.  What didn't help matters is that I am a slow eater and the room was chilly to begin with.  For this reason, I am giving them 4 stars.  With some minor tweaking, this could be great.  I would love to try it on a regular night.  This menu apparently changes frequently, so I would definitely give it another chance if I come to town again."], ["Corie K.", "A must-try if you haven't yet. I always order a moose to drink ( I'm not a drinker but it's my best cocktail in town ) and we always order the belly ham pizza (it's also the best in town). And always great service. I've been here a handful of times and sat at bar, table, and pizza counter- all provide a great experience. The chefs are serious about quality too - we witnessed them refire our pizza when it came out a bit more charred than they'd like. That's a great sign that they check and care for the food they send out of the kitchen.Every course was amazing- drinks, apps, entrees & sides, coffee & desserts. They are also consistently good, even with a seasonal menu. I always leave full and happy, and most of the time with leftovers for later."], ["Vickie R.", "I wasn't expecting to be able to find anything lighter than what most people know as \"Southern Food\" in Nashville, but my stomach and I were both happy that we did. This was a place that wasn't even on our radar as we were doing research on places to eat in Nashville since our meals were limited and we've never been to the town, so it was extra fortuitous that it was introduced to us by meeting up with friends that have moved there. My dish was a White Corn Grits, Clams, Greens, Red Onion, Garum, Grit Crumbs. The grits was full of the rich clam taste from the broth and the clams were amazingly tender. The dish looked small in size, but there was definitely enough food to make me full. Honestly, I wasn't all that hungry and my stomach wasn't feeling the greatest that day, but I made the special exception for this dish, and I would've licked the dish clean if no one was watching. It was truly a pleasant surprise in so many ways. We had great service and I loved the industrial ambiance of City House. I do hope to return when I visit again."], ["Hart P.", "Wife and I came here for an evening out. We enjoyed ourselves. Nice open atmosphere made us comfortable.Enjoyed thin crust pizzas with gourmet toppings.You do pay for the status of the restaurant.i agree that parking is tricky as all the area lots tow, even when the business is closed."], ["Courtney M.", "We came to City House on a recommendation by a local friend -- seems like a great choice for a Sunday dinner! Word from the wise... make a reservation. They were booked up on a Sunday (apparently it's a special rotating menu night which people come specifically to enjoy) and despite there being multiple open tables scattered throughout the restaurant, the only seats available were at the bar... Bar seats aren't awful as they overlook the small kitchen/prep area. I liked being close to the wood burning oven - smelled great, plus it was warm!For food, we had meatballs and split a pizza. The pizza was a bit disappointing -- quite soggy. The meatballs were our favorite part. Service was spotty. When we had a server, he was great. But drink service was seriously lacking as we frequently had empty glasses (as did the folks to our left and right). I would return to give this place another shot and to try their everyday menu that our friend praised."], ["Marla S.", "Very friendly, but very busy and seemed to need more help behind the bar. The bartender was working non-stop and at a quick pace, but was slow to get drinks because of the volume she had to manage. The food was great, but not excellent. Cool atmosphere - house with screened in porch and somewhat industrial on the interior. A nice little getaway from downtown Nashville that isn't a long drive."], ["Steve E.", "Hard to say one restaurant is the best with the food scene explosion in Nashville. But this is the best, IMO. Others (Lockeland Table, Etch) are a notch above but this is like...home. We had the trout and the Calabrian sausage with summer peaches and pickled onion. Sides were a cabbage concoction and pecorino grits. It was all just silly good. Reminder if you haven't experienced it: The Belly Ham Pizza ( I am in the minority, and prefer no egg) is THE BEST SINGLE FOOD ITEM IN NASHVILLE."], ["Joe F.", "This food is by far one of the best in Nashville, and would be a strong contender in any major market.  In fact, City House could go head to head with any major market restaurant.  Wake up James Beard!"], ["Caitlin N.", "City House is in a beautiful old building and has a great open kitchen.  Service was fine but not as attentive as we would have liked. It was hard to get our server's attention as it was very loud. The food seemed unique on the menu but we didn't feel it was anything to write home about once we tasted it There were four in our party and two ordered pizzas which the table felt were the best meals of the night. One of us ordered the corn bread gnocchi.  It was extremely heavy and she barely ate it. We did enjoy dessert. Overall we left a little disappointed and wishing we had gone to Germantown Cafe."], ["Alyson W.", "City House is actually one of the best cheap eats in Nashville...Yes, I said cheap.  One of the great appeals to City House is that you can go and drop some serious cash, or you can go for a quick delicious bite and not break the bank.  I always opt for their pizzas... ALWAYS.  The belly ham pizza is one of the most unique dishes I've had in Nashville and makes so thankful that I live here, and also that I'm alive.  All this from a pizza... indeed.  Hint: the chile sauce can be placed on the side because yes, its very spicy."], ["Olivia S.", "Love this place. I've never once been disappointed in food or service. The wait staff is always so knowledgable and quick to fix you up with their favorites. Great drinks, great, simple atmosphere, and great folks. If you get a pizza, get the egg on top! Just do it!"], ["Marisa L.", "Great food with a seasonal menu. Fun place to share a few dishes family style. Way too loud in the restaurant, though. Love the side porch when the weather is nice."], ["Samantha S.", "A year ago, this was my go-to spot.  Not anymore.The menu has barely changed in YEARS.  Literally.  Especially the entrees.  I came here once in August and our server put in my husband's order but forgot to put in mine.  I had ordered chicken so of course this took much longer as expected after she had realized she messed up (as his food was coming out).  It's a two top.  How do you forget and only put in one order? Cool, no problem. We didn't complain at all but they ended up taking both of our entrees off of our bill which was not needed but very much appreciated because we ended up being there way too long.We came back last week.  I had a pizza (blah) and the pasta with lamb (absolutely terrible).  The margarita pizza had zero basil on it (the server said was only available for one week of the entire summer?  what?)  and the \"lamb\" pasta tasted like noodles, pulled pork (and not the good kind) with cheese sprinkled on top.  Barely edible.  The server asked how our meal was.  My response was, \"it was different....\"  We got our check and left extremely unsatisfied.There are PLENTY of amazing restaurants in Nashville that are killing it in the food scene right now.  I'll gladly spend my hard earned money at Rolf and Daughters, Etch, etc."], ["Sarah P.", "Two words: Sunday Supper. It's their once-a-week, always unique menu that's good for two! Another sweet find thanks to a local! Reservations fill up quick, but the bar because is first come, first serve. I was not angry about the brick-fire oven and being at the bar meant being able to talk to the chef's who were super nice. Their drinks are on point and in typical Tennessee fashion, their bourbon & whiskey selections are seemingly endless."], ["D C.", "The vibe when you walk in is energetic and upbeat. We started with cocktails that were made terrific. We then had the cheese and sweet potato appetizer and the broccolli appetizer. Both had great flavors and we really enjoyed them.  For dinner, we got the margerita pizza and the cornbread gnocchi. The pizza was so light and thin and absolutely scrumptious. The gnocchi was good but very heavy...the least favorite dish of our night. For dessert, we shared the layer cake with zabiglione. It was delicious as well. The waitress was attentive and knew every aspect of the meals and drinks/ how they were made and even made freat suggestions based on our info about what we like.Dinner for two with cocktails was about$100. I would say very reasonable!! And I loved that everything is out in the open and the chefs cook in the dame room we eat."], ["Janet Y.", "I heart City House. It has such a homey but urban/hip vibe. The food is excellent, and it was clear that the servers were knowledgeable. We started our meal with a couple of appetizers that were seriously out of this world. The octopus tasted like tender scallops and the frico cheese/potato tasted like a crispy scallop potato! I ended up getting a pasta with anchovy in it-- it was phenomenal. I had leftovers, and I ate it cold the next day, and it was even better! My friend had the springer mountain half chicken, and it was so tender and juicy. I think I'll get that next time!What I like about City House versus some of the other new and hip restaurants in Nashville is that the menu is more extensive with price ranges that can suit more people! For that reason, I think it's perfect for a group dinner or a romantic date for two. Bravo City House!"], ["Karen K.", "Two stars for the food alone. Blood will run out of your ears from the noise level but you will still be able to hear the sarcasm from \"the Manager\" when she \"responds\" to your concerns. There are WAY better restaurants in Nashville with none of City House's pain points. Never again."], ["Angela P.", "The pizza at City House was so good - and I'm from Chicago!  We had the peach/red onion/cheddar and the margarita pizza.  The peach was my favorite, I ordinarily despite onions on anything, but the onions complimented the peaches and cheddar and weren't overpowering at all.  The menu here is very limited.  So if you like options, or menus like a novel, go elsewhere.  Sometimes though I like not having so many choices.  Then I don't get indecisive when the waiter comes around.I made reservations here for our anniversary dinner.  We were seated right away.  I mistakenly thought City House was an intimate, romantic place.  I was caught offguard when we walked into a bustling, lively, open dining room.  I didn't mind this, it was my mistake anyway, but I didn't really like that the tables were so close together.  When I sat in the booth, I had to squeeze through the tables and felt my ass rub on our neighbors' table.  Would it kill them to arrange the tables a few extra inches apart?  Because this also meant that I overheard their conversation, and it was difficult to relax and have an enjoyable conversation with my husband.I wouldn't recommend this place for a romantic dinner or a date night since it's a little noisy in here.  But our pizzas were outstanding, so I wouldn't take back the night and go elsewhere.  I'd suggest this more for nice lunch or with a small group of friends.  The food alone is worth the five stars!"], ["Lindsay R.", "The cornbread gnocchi is tasty but quite filling, the cocktails are strong, and if you go in a party of 2 you are likely to get a seat at the bar with no wait. Service is great and so are the sides, thought the entrees were a little above average. Great place to go if you want a good meal but don't want to go over the top. Some portions are overpriced for the amount of food you get. There are not nearly enough wall decorations."], ["Adam H.", "A Nashville meal so good I had it twice in my 5 day stay.Food: Appetizers were original and delicious. House cured salami and Wisconsin cheese was great, as was the frico of broccoli. The ciccioli of white beans was surprisingly good and full of garlic. The pork belly pizza was one of the best wood-fired  pies I've had. Their trout was fresh and nicely prepared, with peanuts, raisins and lemon. A standout was the bread gnocchi. I don't know how they did it, but it was the perfect combination - and in their delicious tomato sauce? Wonderful.Service: Knowledgeable wait staff, all of whom have beards that, unlike in NY, are not ironic. Amicable and attentive.Ambience: It felt like a classy hipster joint with high ceilings and an industrial look but with nice woodgrain everywhere. Cool atmosphere.Bottom Line: You cannot go wrong at the City House."], ["Sydney S.", "This restaurant was so unique. We went for \"Sunday dinner\" that changes to a completely new menu weekly. With four of us, we shared salads, some small plates and a pizza. It was all uniquely flavored with interesting combinations that were surprisingly very, very tasty. If you are ordering drinks, try the Moose. It's an interesting flavor-- a little dark and kind of bitter, but still very enjoyable. The atmosphere was super chic and hip, but relaxing. Oh! For dessert, we had the ice cream sandwiches. If you don't get anything else out of this review, I hope you understand that these are to die for and WORTH IT."], ["Hunter B.", "My fiance and I's favorite dinner spot in town.  Unique cocktails that are strong, and food that appeals to me in all the right ways.  No frills, fresh ingredients and made right in front of your face!  We love to sit at the bar and watch the food roll out, it never gets old!  Our favorites are the octopus to start and pork belly pizza,  although we did try the cornbread gnocchi last time and it was also delicious."], ["Rebecca F.", "I don't get the hype about this place. A group of my friends went on a Friday night for dinner, and besides the pork belly pizza, the food was average to say the least. On the menu, it was described much better than it actually looked and tasted. Not to mention we waited over an hour for our entrees, and when we spoke to the manager about the situation she condescendingly responded, \"This is a typical wait time in Nashville on a Friday night.\" We thought that was pretty rude considering we were from a much larger city, yet have never heard that particular excuse before. Anyway, I think there are many better places to try in Nashville that have friendlier staff and better food. We were really looking forward to our visit and heard great things, too; However, this visit was just not the best way to start off our weekend in our favorite city."], ["Poppy C.", "Probably the hottest sophisticated scene in Nashville.  Everyone dining seemed young hip and urban.  I saw more diversity in this dining room (2 other Asian girls)  than the 20,000 people at the Bridgestone Arena the night before... admittedly that was for Iron Maiden...  The open kitchen was full of dudes in baseball caps with full on hipster beards and gauges.  Our server was NYC cool and everyone had several tattoos and I saw a few full sleeves.  Minus a few stars though.....Strong drinks, nice but not carefully crafted and took forever to get.  We had to wait quite a bit at the bar.  I thought perhaps the two female bartenders were just not very good nor observant but they were quick to help a couple that arrived after us and had no problem getting wine for the servers to bring to diners.  The couple that arrived after us also got their drinks before we did.  The server had no problem however requesting we close our tab out when we did get our drinks.  Kind of annoying and I'm pretty sure I hadn't had time to piss any of them off yet so not sure why the bad service there..... Pizza was okay, looked better than it tasted, crust was average.  Octopus was very very good, perfect texture.  Catfish was nice, grits were amazing.  Chocolate panna cotta extremely yummy and a very nice ending."], ["Jessica S.", "I decided to come here to celebrate my 24th birthday. I have never been here before. I used to live in Italy and after reading their menu online, I knew I had to try their food. So, off we went! We decided to order a pizza as an appetizer (I definitely recommend this). It was fresh, delicious, and came out of the oven pretty quickly. We ordered a bottle of wine and decided to each order an entree and share it. We got the fettuccine with lamb sugo, gnocchi, and trout. AMAZING. It was like a mouth-gasm. So so so so SO delicious.The only downfall was the service. Our waitress was extremely knowledgeable about each food item but she was pretty slow when it came to serving water and getting our wine. Also, the hostess was just straight up rude to me. Not appreciated. Other than the crappy service, I'm coming here again for the food. It was incredible and too good to pass up. If you're ever in the Nashville area and craving some real Italian food, this is the place to go."], ["Katie H.", "My dad's sausage was so salty he couldn't eat it. My mom's white bean soup was also inedible and my side of turnip greens were so bitter I had to spit them out. Now, there were great portions of the dinner, however, if I am going to spend $150 on a meal, I don't want any part of it to be unsatisfying...especially given the fact that there are about 45 restaurants in this city that can provide a flawless meal for the same or a lesser price"], ["Nickie G.", "Since there are 200+ reviews here, I will keep it short for once.Hard to find....building is practically unmarked.  It is a brick building, entrance is on the side, off the road, so when you see what you think SHOULD be it, park.  Look in the window and when you see tables/table cloths you have found it.  Go around the side and enter.Specialty cocktails were fucking yummy.  My server recommended a gin one that she called an \"old lady drink\" and, well, call me an old lady because I loved it.  (She loved it too...told me she had an \"old lady\" palatte hehe)The pizza I got (can't even remember which one) was great and made better because they asked me \"do you want a fried egg on it?\"  A fried, runny, over easy egg on my pizza?  Yes, yes I do.  It was delicious.Verdict: very good.  They had things other than pizza too so more things to try.  Wish they were open for lunch too."], ["Scott T.", "Simply amazing. We went Sunday night, which is a unique experience. On Sunday they create a different menu than the rest of the week. I was told the Sunday menu is never recreated. We started with fried summer sausage, chow chow, and buttermilk cheddar. The trick was to get a little bit of all three in one bite. The combination is salt, sour, and creamy was fabulous. For our main dishes, we had the chicken and jalapeño sausage over cucumbers, vidalia onions, cabbage and a sausage and potato pizza. The sausage had the flavor of jalapeño without the heat, so my wife could enjoy it as well. The pizza was so delicious I ate most of it myself. Dessert was a peach cobbler and a caramel pecan chocolate mini pie. The cobbler was one of the best I have ever had. I prefer a more pie type crust, this was more a bread type. Not being a fan of pecans I was wonderfully surprised how good the pie was. This was one of the best dining experiences I have ever had. We sat at the kitchen bar so we got to watch the kitchen crew make everything. Our waiter was very professional. The only bad is the dishes we had will not be available again. The next time we are in Nashville we will definitely stop in."]], "Caffé Nonna": [["Ricky P.", "Went here for a special occasion and it was well worth it. We got the Agnolotti (smoked gouda ravioli) with sun-dried tomato cream sauce and the Cappellini with Arrabbiata and Meatballs. Both were superb. The ravioli was a little rich, so a good suggestion is to mop up the sauce with bread. The Arrabbiata sauce is spicy but not overwhelming and the meatballs are incredible. Washed it all down with a bottle of Malbec and called it a night. Well done, Nonna."], ["Queen B.", "As inviting as the menu is, as friendly as the staff was, as nice as the neighborhood was, as talked about as this place is...  I'm still reeling over the fact that they charge you $4 --  penalize you $4 for having an allergy to wheat.Yes, I was charged $4 extra dollars to eat GF pasta.  Do they charge people extra, in wheelchairs, to eat there?Do they charge people extra, with peanut allergies, to eat there?Why are we being penalized for food allergies that are of no control over us?  Is it really that much more expensive to buy say... Trader Joe's GF pasta at $2/pound?  I'm sure they're not boiling up 1 pound of pasta for my meal.. In fact, I'd venture to say they were boiling up 2-3 oz of dry pasta to serve me..I can't even think about dinner, ambience, portion size, taste, or dessert when I'm thinking how they nickled and dimed me for more money to eat there...I say, those of us that get sick on certain foods, bring the certain food with us and say, \"Please cook this up for my dinner, thank you.\"Is that what it comes down to?  It's not about the $4 which is less than a pack of cigarettes, now a days.. It's the fact that they're price gouging when they don't have to..I'm still reeling over the fact that this restaurant is taking away leg room and charging us more for the seat.Dinner?  I don't remember.  BUT, if I ever return, I will bring my own $2/lb GF pasta and request that they cook it up for me..   Price gouging doesn't sit well with me."], ["Melody F.", "Came here because we wanted to try a triple D locale in Nashville. This cute place is located in quaint neighborhood. There is NO PARKING. So be prepared to find a spot on the street or nearby neighborhood and walk a few blocks. Don't even think about parking in the 3 parking lots designated for McCabe's Pub. A guy chased us down to move our car after we tried to park there. Food was good. My son definitely had the best dish which was recommended by our server--the Pasta Angelina. It was outstanding. The rest of my kids had run of the mill fettuccine Alfredo. My husband and I split the Cheese Ravioli with tomato cream sauce with shrimp & scallops. Shrimp were over cooked and chewy. Scallops were good. They bring out crusty bread with dipping oil before dinner. We were too full to have dessert but choices sounded wonderful. We sat on the small patio, so I can't comment on the indoor ambiance. The patio was very small but fine temp with ceiling fans (it was a hot night, but sun was already going down).Overall, I would come prepared to search for parking and order one of the top 3 things listed on their menu. The Angelina was great. We didn't try the other 2 (lasagna & pork shank) but it is what they are known for.  We were from out of town, so not sure if I would come back again just because of inconvenience of parking. But the Angelina dish is pretty awesome, so if anything brought me back, it would be that!"], ["Jason D.", "Visiting from Memphis. Got the heads up on this cute place. Small, nice, cool place in a ultra cool little neighborhood. Food was good. Calamari was appetizer. Came good. Not over done. We had a pasta dish and a 10\" pizza.  Crust was really good. So why 3 stars?  We went to diner early. Not many people there yet. The service was awful. Had to ask for a box for the pizza twice and after the second time it still took awhile to get it. Would not try again."], ["Tiffany N.", "It was okay. the restaurant is nice, and we sat outside. The bread and olive oil was really good, but other than that the food was just okay. I got the vegetarian lasagna and it was creamy and fresh, but in my opinion not worth the price point. my Dining partners got pizzas which all looked good, but they all said they tasted average."], ["Christie B.", "Oh my goodness, this place has never failed me! It's one of my favorites in Nashville. It's consistently delicious, the service is great and it's quaint. I like tiny restaurants so that's another plus. The parking sometimes is difficult but if you get there kinda early it does not seem to be as bad."], ["Adrianne P.", "I really enjoyed my experience Caffe Nonna. Service was great. Price was reasonable. I loved my dish, Pesto Cream pasta. It was comforting and left me craving for the leftovers. Would I go back? Definitely yes. I really appreciate what this restaurant had to offer. Highly recommend."], ["Lisa S.", "Perfect weather. Awesome service. The pizza was amazing. We had the special - Italian sausage and peppadew peppers. Delicious! Family friendly and great for a date night as well."], ["Jared K.", "Caffe Nonna is a small neighborhood place, which is just what we were looking for. My dad had actually seen it on Food Network or the Travel Channel or something, so he was anxious to try it out.  It's not too loud in the dining room, making it perfect for relaxing and having an actual conversation. The atmosphere here is also very laid back and welcoming.We started things off with the Tuscan Bruschetta and Calamari. The bruschetta was terrific. The sausage was flavorful, and the bread had soaked up all of the juices. The greens and beans were a nice touch, and the red onions added a good bite. The calamari was also really tasty. It had a very light breading, and the lemon aioli was just acidic enough to zest things up a little. My wife always leaves me the little tentacle bits, which are her least favorite part, but thankfully I love them!I went with their dinner special, which was smoked salmon atop orecchiette pasta, in a whole grain mustard sauce, with assorted vegetables. This dish was sooooooo good!!! I loved the strong mustard flavor, as well as the nice crunch of red onion. The salmon was very fresh and didn't taste fishy at all. I'm a big guy, but this plate was more than even I could finish. I'm sure our two appetizers may have contributed to that somewhat, but it was still a lot of food.We will definitely be back to Caffe Nonna!"], ["Stefanie P.", "What a lovely intimate Italian restaurant! I got the spinach gnocchi, and sausage brushetta. Both items excellent. If you don't like cramped, close seating this may not be for you. I felt like the food was fairly priced and good. Looking for a nice date night but don't want to break the bank, this is a perfect place. I'll be back! **Support Local Businesses it's important!**"], ["Gaby L.", "Dined at Caffé Nonna last weekend and loved it. My husband and I had tried to eat here before, but they close some hours between lunch and dinner, so be sure to check their schedule. Also, I highly recommend getting a reservation at least a day before you plan to go. We wanted to make a reservation for 6pm, started calling since noon but nobody answered. Got a hold of them until 4pm (an hour before they opened) and they only had open reservations for 5, 5:30, and 9 (or open seating in the patio, but it was really hot outside!)As other reviewers have mentioned, they don't have parking, but that's not really a problem as there's always parking on the street (you may have to walk one or two blocks). The restaurant is small and tables are really close together, which gives the restaurant a very homey feel. Our server was very nice and gave us very good recommendations. We ordered the seafood bruschetta as an appetizer and it was delicious and had a beautiful presentation! Highly recommended. I ordered the lasagna and my husband ordered the lamb shank and both were amazing. We will definitely come back soon!!"], ["Tracy F.", "My husband took me to Caffe Nonna for my birthday last week.  I'd been SO excited to try the food, as many of my friends and colleagues in Nashville had been raving about the restaurant for awhile.  I was so very happy to find that the food was, indeed, delicious, the atmosphere was adorable, and the staff did everything they could to make my birthday a very happy one.Our meal began with a delicious bottle of prossecco, a small plate of the house made bread and olive oil, and an order of fried calamari.  The portions of both the bread and calamari were small, but we were happy about this - we didn't fill up too quickly for the entrees still to come.  For dinner, we shared the Seafood Angelina and the Chicken Tango.  The chicken dish was good, with a tender piece of chicken breast over a ragu of summer vegetables, though I was missing the marscapone crust on the chicken - perhaps it was there and I just couldn't taste it?  The winner of the 2 dishes, though, was BY FAR the seafood pasta.  All of the seafood was fresh, cooked perfectly and full of flavor.  The pasta was made in house that day and absolutely delectable - we almost asked for another small plate of pasta to soak up the leftover sauce!  Our meal ended with a complimentary order of tiramisu, decorated with fresh whipped cream and a candle to make a birthday wish on.  It was a very nice and heartfelt surprise from our waitress, who seemed to go above and beyond the call of duty to make my birthday celebration so nice.I take away one point for the high price of the appetizer (which did not contain $10 worth of calamari), and for the fact that we were seated right by the front door.  There was a curtain blocking us from the hostess station, though the constant opening and closing of the door blew the curtain into me - and into my food - on more than one occasion.  Despite this, we WILL be back to Caffe Nonna, and we look forward to our next visit!"], ["Rodney B.", "Very good overall. I had the chicken saltimbocca sandwich. Presentation and flavor was decent. I do wish the chicken had been marinated and made of flattened cutlets versus chuncked though. The white meat could have used a bit more flavor provided by marinade. Others in my party had the chicken salad sandwich which rated 4 stars, the smoked gouda ravioli with basilica sauce rated 5 stars, and capalinni with basilica rated 5 stars. Overall a very nice lunch experience. Great fresh food nicely done in a quaint but relaxed atmosphere. Expect to spend an average of $12.00 per person for lunch, and double that for dinner."], ["Cari J.", "I visited a couple of years ago and loved it, so I thought I'd give it another try and see if it was as good as I remembered. The restaurant is tiny, and in some ways that makes it cozy. My friend and I were sat up against a wall, where it felt like we were frequently being bumped into. The seating arrangement honestly detracted from the meal a little. I ordered the Mediterranean cheese sticks, which were sticks of feta topped with basil leaves, wrapped in phyllo dough, baked, and served with chopped tomatoes, olives, and capers. It was very salty but delicious! For dinner, I ordered the fettucine with their amatriciana sauce and grilled shrimp. It was delicious! The pasta was perfectly cooked, the sauce was savory and a little spicy, and the shrimp were tasty. I saw someone order the tiramisu and had to try it myself. To me, it was the best part of the meal. Perfectly sweet and creamy, with just right proportions of espresso and mascarpone. Overall, it was a nice dinner. The price was a little steep and the seating was less than ideal, but it was a darn good bowl of pasta and ther best tiramisu I've ever had!"], ["JC L.", "What can I say?  This place never fails to impress.  I almost don't want to write a review because it's like a hidden little gem in my favorite neighborhood.  Only it's not so hidden I suppose after being featured on Food Network.  The lasagna is amazing and my husband always gets the chef's feature. Also, the Tuscan Bruschetta is excellent! I highly recommend this place for a special occasion or just a fun date night out."], ["Lisa S.", "Caffe Nonna, on Murphy Rd.,wonderful, I had the 'Seafood Angelina' it was delicious ,the staff were welcoming and professional."], ["Nita L.", "The Seafood Angelina was amazing. The seafood was on point! It reminded me of the pan roast from the Golden Nugget in Reno, NV, but with linguine added. The wine was delicious, the Caesar salad crisp, tangy, and cheesy, and the tiramisu at the end was to die for. The service was impeccable and my waitress did a perfect job. I would recommend this restaurant to anyone wanting amazing food and great service."], ["Chad L.", "Food was good, had the Margarita pizza. Server was very unprofessional though. Couldn't remember to bring out sweet tea, but didn't forget to charge it to me."], ["Ella S.", "I always get the noke with pesto cream and chicken, it's savory and delicious!  It's the closes to my Sicilian grandmas cooking I've found."], ["El E.", "I went here for a business dinner with my colleagues.  I have never been in the neighborhood before.  Parking was a little difficult.  Ended up parking several blocks away and scurrying accross the street to avoid traffic.  The wine was a great start to the meal.  The atmosphere was small but nice.  I order lamb roast.  The portions were very large.  I could not make it through everything.  The meal was good....maybe a little bland.  I caught myself eyeballing my neighbor's plate.  It may have been that I just picked the wrong item for me."]], "Villalba Italian Restaurant": [["Ronette T.", "The Salsicca is to die for the bread & sauce is delicious & the manicotti was perfect the ambiance & service here is great as well.....this place is definitely the diamond in the rough."], ["Dagan B.", "This is some very good Italian food, The Sicilian pizza is amazing right up there with Desanos and I dont say that lightly but its cheaper which gives it the edge, The spaghetti in the chicken parm with its fruity like tomato sauce was a masterpiece all to itself. The chicken parm was really good and covered with mozzarella. The cantina chicken was my least favorite while good it wasnt special. The bread with marinara sauce that you get isnt fancy its just good. Go here trust me its good. I am picky with 5 stars. I would give this place a 4.5 if I could because of the chicken cantina but its better than a 4 for sure."], ["Dee a.", "First off, this is not a place for a quick meal. We got there at 7 on a Sunday and they were already busy. They had three servers going about a mile a minute hosting, serving, bartending and busing tables. We had to wait a while to be seated, wait a couple minutes for our drink order, and then about 20 minutes to get our appetizers and another 30 to get our food. We were there just under 2 hours all told. During that time people were still coming in and having to wait to be seated, often even longer than we had waited. That said, it was some of the BEST Italian food we've had and I was surprised to find it at Nipper's Corner, so far from the main hub of Nashville. The dressing on the Caesar salad was flavorful without being overbearingly fishy and my salad was not drowning in it, but well covered. The crab cakes were lemony and garlicky and delicious. The cheese bread was also very good with fresh, flaky bread brushed with garlic and herbs and covered in gooey cheese. My husband ordered their lasagna. Normally to the husband food is food is food and he's mostly indifferent. Not to this. He said it was \"amazing\", and that the noodles did not taste like regular plain ole box noodles. This was the first time I've ever seen him try to continue to eat after stating he was full. He thought it was that good. He normally gets testy about long waits too, but stated he would be willing to visit again, and wait again, to have their food again. I agree with him. So, not your pop in pop out quicky meal type place, but definitely worth it if you don't mind the wait. Or maybe try them on an off hour for quicker service."], ["Phil C.", "Wow! What a find. This place is fantastic!  I ordered the Salmon, which was cooked perfectly.  We will absolutely be coming back here. The service was awesome."], ["Shirley F.", "Spaghetti and meat sauce is excellent as t this location. I also had cheesecake which was simply to die for. I have would definitely east here again."], ["Charles S.", "Villalba is a welcome addition to the dining options in Nipper's Corner. It's certainly one of the best restaurants in the area, but that says more about the lack of competition than it says about Villalba's quality. The service was friendly, albeit a little slow. It WAS Friday night during the dinner rush, so I can't really complain. A couple of changes would definitely improve the service experience:One, employ a bartender. The woman who I can only assume to be the manager/owner was manning the bar as well as seating tables and running food. It was no small surprise that there was no one seated at the bar as a result. It's a shame, because the bar is certainly the most attractive seating option in the restaurant. Two, designate or employ a host/hostess, and get a stand of some sort. The tables come right up to the entrance in the restaurant's current configuration. They probably could afford to lose one table near the entrance to allow for a host/hostess and waiting area, considering there was no wait for a table in the middle of the Friday night dinner rush. My wife and I just milled around near the door until we were acknowledged by an employee. We and the diners at the tables nearest the door were slightly uncomfortable with the situation. The food was lackluster at best. The tomato sauces on our dishes tasted as if they came from a can. There was a tinny acidity that doesn't come from home-made sauce (unless you're cooking it in a reactive pan of some sort and leave out some fairly basic ingredients). I certainly can do better at home for less expense. In short, they're better than the Italian chain restaurants in Nashville, but I can't in good conscience recommend them above Molinari's in Cool Springs or Mama Mia's in Crieve Hall. Their price point is SLIGHTLY below those two I mentioned, and they do have a pretty good wine/beer/liquor list, which is certainly an improvement over their independent competition. I'll likely return and order something else (without tomato sauce) in hopes that I'll find something I like, because their location is VERY convenient."], ["Naeveah O.", "So it was late this last Monday and we didn't want fast food. We had passed this place a few times and after reading reviews figured it was time to try. So glad we did! I got the lasagna and fiancé got chicken fettucini Alfredo. Both were delicious but I think I liked the Alfredo better. Both meals came with garlic bread which was yummy with the sauces. We got one slice of tiramisu to try and each ordered gelato. Fiancé got hazelnut and I got pistachio. Gelato was pretty good but the tiramisu was amazing. I might have to buy a whole cake sometime!"], ["Tony H.", "Great Italian does exist in Nashville, and lucky for me...it's just around the corner, Nipper's Corner that is.The family \"gets it\"...it's like you're going to  their home for dinner.   They cleaned up the house in preparation for you(squeaky clean), the family put on a welcoming smile(outstanding and attentive staff), and somebody's grandma rolled out a feast(Mama Mia)!  Really, it's the gentlemen of the family in the kitchen...and they engaging you thru the window!We ordered 4 dishes, and couldn't keep our forks out of each other's plates as we tasted everything.   The Lasagna stole the show with its beautiful marinara and aromatic fennel Italian sausage...simple but spectacular.   The Chicken Marsala was blessed with heavenly mushrooms that were so good...they felt sinful.  The Chicken Parm was classically prepared, and spot on.  Even the Fettuccine Alfredo left stars in our eyes with the rich creaminess sparkling with the Parma tang.  And did I mention the Tiramisu...perfectly prepared with a pronounced espresso flavoring.  On my first visit, I ordered take-out pizza; and, the family loved it.  I was so impressed by the place and the pizza, hence the dining experience tonight. Another favorable review mentioned that it does take a while, agreed.  But it's evident that it's \"homemade\" to order, and if that's the trade off for this...I'll happy take my seat and wait as long as needed.   After all, that's what the vino is for!Hurry before everyone else latches onto this place!  I'll be at the table in the corner"], ["Jenny K.", "Just moved to the Nipper's Corner area and was so happy to find Villalba! Went there for lunch. For $7.50 you get a main course meal plus a soup or salad. With that and the free bread and maranara sauce - I was stuffed and still had half my eggplant parm sandwich left! It was delicious and we will definitely be going back. Employees were really friendly and it very much felt like a family restaurant. Loved it."], ["Keith H.", "Finally a decent Italian restaurant in the nippers corner area. I would not call it a authentic but it is very good. The wait staff and servers are always very efficient and courteous. The only problem I have is they need to be more consistent with their food. I enjoy their lasagna and sometimes it comes with a lot of sauce, sometimes just enough sauce, and sometimes hardly any sauce; and the amount of meat and cheese on or in the lasagna is inconsistent but it always has a good flavor."], ["Chloe B.", "I always try a place more than one time in case the first time around was just a bad day for the servers or cooks. My boyfriend and I went there once a few weeks ago and the service was horrible and the food was just meh. I ordred some Pizza thing and my BF ordered lasagne. Both were OK, but I certainly wouldn't say they were the best in town.So, we decided to go again last Friday. We sat there for 15 minutes waiting for someone to take our order after our beverages were delivered, and another 10 minutes for the bread to arrive. I ordered a chicken Penne pasta dish, but the chicken tasted funny. One of the reviews I read said that they thought that the chicken tasted like goat. I had to laugh because. although I've never eaten goat, I guess that's how I would imagine it tastes. I also got my pasta dish like 10 minutes before my boyfriend got his gross looking pizza, that he didn't even finish, which isn't a normal thing for him.I guess Villalba is to Italian dining as Taco bell is to Mexican."], ["James S.", "Great Italian food. I've only been there for lunch because they have bargains for lunch. You start with amazing toasted bread to dip in fresh marinara. Love the calzone and pizza, my friend liked the spaghetti. They did lose my order one time and quickly comped the meal, but that was an aberration. And it's very clean."], ["Jinesh P.", "One of the best family owned Italian restaurant, esp. for my vegetarian friends in town. We customized their fettuccine alfredo for which they charged exorbitantly but that taste was well worth the price. Quantity is enough for a to-go. Also their veggie appetizers and bread starters are really classic.I would recommend their eggplant sandwich for another veggie option.Very cozy ambiance, well laid out and much better than the costly Maggianos."], ["ronald l.", "First visit, wasn't too impressed as yet, but I will try it again. I had a pizza and my wife had pasta and a salad. We frequent Coco's Italian Bistro as well as Porta Via for our Italian nights. In contrast, this is not as interesting or idiosyncratic as either of these other alternatives."], ["Dan H.", "Delicious Italian classics. Fresh garlic bread and marinara brought to the table as a complementary appetizer, fast service, tasty entrees, ridiculously good tiramisu."], ["Eric W.", "I'm sorry. I rarely, if ever write one star reviews. Every establishment can have an off night.  However, our visit tonight to Villabla was a swing and a miss.  We ordered toasted ravioli, which tasted as if suffered from freezer burn. A bowl of supposedly homemade soup tasted like Progresso Minestrone from a can.  I ordered chicken parmigiana, the chicken tasted old and dry and looked grey. To put the prior comments in perspective, I like airline (when they used to serve it) and hospital food, so it takes quite a bit for me not to like something. The pasta was tolerable and the bread was good. To our waitresses credit, she addressed our concerns."], ["Adam Y.", "I quite enjoyed my experience. The atmosphere, as others have stated, is casual and friendly. Their small drink selection consists of wine and beer, which is fine. They're not trying to attract a bar crowd. I will recommend that you try the Forst Sixtus; the only specialty beer on the menu. It's a darker beer, but very crisp and clean. One word best describes the food: hearty. They don't serve you a bread basket with olive oil. No, they bring out their marinara. My friend and I went with some basics for this visit. We started with the baked ravioli, which was well prepared and not dried out on at the edges. My buddy had the chicken parmesan and I went for their evening's special. I forget the name, but it was basically a chicken fettuccine with spinach, mushrooms and sun-dried tomatoes. Both dishes could stand to be a little less salty. Other than that, no complaints.I'm glad to have a decent Italian restaurant in the neighborhood. I will definitely go back to try their other offerings, especially the pizzas and lamb. I was bit too full to try their housemade cannoli, though I was tempted to get it anyway. I will stop by for lunch another time and try some of their espresso offerings. I'm always happy to see a restaurant using a traditional style machine."], ["Jessica C.", "This is truly a great find! The owner is actually from Italy and so everything tastes very authentic. I also love that the lunch prices are only $7.50 and that includes your drink with bread on the table. I live just down the street and it's very nice and so convenient. I like the service too."], ["Debbie C.", "I had the Chicken Marsala, which was unusually sweet; I could only eat a few bites.   My husband had the lasagna.  We had heard from friends that this was a good Italian restaurant so we were looking forward to a nice meal.  I wish I could say the food was great, but no.   The waiter was great and friendly."], ["Kimberly Y.", "Delicious Sunday lunch! We stopped in around 1:30 pm on a Sunday and were shown right to a table. For 2 adults and a 3yo we ordered the Bistec sandwich, a cup of Italian wedding soup and a kid's pizza with pepperoni, bacon and black olives. The Caesar salad side to our sandwich was yummy (uniformly chopped romaine) and bigger than we expected for a side salad. Bistec sandwich was piled with meat and the sautéed veggies still had a hint of crunch; no wimpy veggies! The kid's pizza is big! Maybe 8 inches? Mom and Dad were able to have a piece (Delicious!), 3yo had 2 pieces and we took the other half of the pizza home. Delicious food, generous portions. We will be back!"]], "Porta Via Italian Kitchen": [], "Bella Napoli Pizzeria": [["Sean R.", "Having recently relocated to Nashville from Chicago, we were lost without our favorite Neapolitan pizza from Spacca Napoli.  We knew our options were limited, so when we discovered Bella Napoli, we were relieved.  And then we read the reviews, saw 3.5 stars, and began to worry.  We saw a pattern in the negative reviews, and realized that they were from folks that obviously were unfamiliar with Neapolitan style pizza.Some can say, \"We've had pizza in Italy, and it wasn't like this\", but understand that this is Neapolitan style.  And pizza, just like quite a few other dishes differ from region to region in Italy.We found Bella Napoli, to hit the mark for authenticity.  From the charred crust, light and flavorful toppings, to a very hospitable owner, Paolo Tramontano.  If you never have the opportunity to travel to Napoli, this will give you an insight to the pizza there.  The crust, charred, which is common with a wood or coal oven.  It adds a depth of flavor.  Don't be thrown off and think it is burnt, it's just part of the process.  The oven burns at 800 - 1000 degrees, so the pizza takes 45 - 60 seconds, depending on how well the oven keeps the heat, it may take 90 seconds.  Please believe me, it's not burnt.  Certified pizzaioli make 300 pizza's before they are allowed to work the line and take pride in their craft.Size - it is meant for one person to easily consume.  Pretty simple explanation.It comes unsliced.  Typical, authentic.  Because of the crust, and the quick bake, it will come unsliced.  The pizza is wet, not from overloading with sauce and other ingredients, but from real tomato sauce and quality cheese, which will leech liquid.  You will want to eat this with a knife and fork,which is absolutely permitted, even in Naples.  The center will be the most wet.  Next to the crust, this is the most prized part of the pizza, also known as the tenderloin of the Neapolitan pizza.Minimal toppings - because Paolo and all other pizzaioli stick to tradition and not the overloaded American pizza.  This way there is a great balance of flavors from everything that is on the pizza and the delicious crust.Thank you Paolo for your delicious food and your hospitality.  You have customers for life."], ["Sid N.", "Bella Napoli is tucked deep inside Edgehill Village, making it a charming dining venue. The outdoor patio is a converted alley and somehow manages to give the place an old world patina. On occasion there's live music with a guitarist strumming Italian-American favorites. The wood fired pizza is delicious. There are other entrees on the menu but it's a pizzeria so I only ever get the pizza. They offer an equal number of regular and white pies which makes choosing something equally hard. I'm partial to the Parma, Quattro Formaggi, and Salsicca. The pizzas are larger than a personal but not large enough for two so a good rule of thumb is to order two pizzas for three people."], ["Julie L.", "My group at this restaurant on the recommendation of a waitress at another restaurant in downtown Nashville.  The location was interesting because it was in an up and coming neighborhood, which was neat to see.  We were seated outdoors in an alley that was very unique.  The food was pretty good, we had someone try the pizza, pasta, and an entree and all were delicious.  The pizza we were told prior to ordering is not sliced which we did think was odd.  We figured out why when we got the pizza.  The dough is not firm when cooked and the ingredients slide off.  But the pizza was still good.  The pastas were oven baked and the pork entree was flavorful with good sides.The reason for the 3 star review was the service by our waiter.  We were only drinking water and had to ask for refills several times before getting it.  He barely came by at all during our meal.  We asked for bread with the pasta meals and it came out halfway through the meal along with Parmesan and red pepper for the pizza which was almost gone.  I am not sure what the issue was but I would suggest focusing on customer service a little more."], ["Kimberly S.", "I love this place. I used to live on the street behind it and would walk over frequently for meals. The atmosphere here, especially when you can sit outside, is amazing. The outside is set off from the street and surrounded by warehouses with Christmas lights strung above. The service is also generally very good. I've had some incredible service and some just okay.The food is amazing. The pizza is perfectly chewy with fresh or imported from Italy ingredients. My favorite is the Salsiccia pizza, which is perfectly garlicky with broccolini and tasty slices of sausage. The Margarita pizza is a classic and done incredibly well. In addition, their pasta is perfect. I'm a huge snob about restaurants over-cooking their pasta. Every time I have ordered one here, it is perfectly al dente. The Penne Alla Vodka is loaded with pancetta and a perfectly zesty sauce. I highly recommend Bella Napoli for a date night. It's casual but still romantic.My one caveat is that it can get pretty pricy quickly. I wish they would lower the prices on the menu by about $1.00 each."], ["Nate H.", "Atmosphere- amazingFood- greatService- lackingDate night/first day- great place!Prices- HIGHBeen here several times.  It's hidden in a back alley of EdgeHill village area and has a great feel for the location.  Surrounded by small shops, vintage brick buildings, this open wood brick oven offers up GREAT fire grilled pizzas that you cannot find elsewhere in Nashville.  All the ingredients are fresh, the breads are handmade, and you can truly taste the difference of the Italian food!  The owner is consistently there, welcomes you at door, and all food is prepare with a visible kitchen that allows you to see you pie thrown into the open fire oven.Now the negative! Even thought the food is outstanding, issues seem to alway follow when I've been.  Service is greatly lacking.  Seems that there is not a high concern to service at any time, and the wait staff act as though they don't really want to be there.  With it being said that the food is GREAT, and most likely one of the best pizza doughs in Nashville, the PRICE follows with that!!!  Lunch specials are 11.95(however menu is not big)If you plan to go for a nice dinner expect to pay $15-$25 a person, that's not including their pricy wine list to boot!Overall I recommend going to try out the pizza, and fresh made pasta at least once!  They have a great patio area in the cobblestone alley, and it's great for fall/spring dinners.  Get the antipasto appetizer!"], ["Linda H.", "I'm not from Nashville, but have been by this pizzeria a lot.  LOL! My brother lives within walking distance and my 1 year old new LOVES the margherita pizza here.Overall, this place is pretty good.  Great service, good location, etc.My favorites are: capricossa and the sorrentino.Fresh pizza and high quality.Plus it always pleases my favorite little man (my nephew) so that's always worth high ratings in my book."], ["Hall W.", "I used to love this place back in day when I first moved back to Nashville. Don't get me wrong the pizza is still good... (though Desano and that place in the Germantown market is better) but the service has gotten sloppy.1. First off the servers still bust their butt so not a knock on them... but the system has gone out of whack(I can tell).However, the little things are driving me crazy... - they forget to slice the pizzas ALL the time..- they don't honor their specials (I have had 2 gift certificates rejected for made up reasons that aren't on the offer)- utensils aren't presented- not their fault, but parking is getting ever more insane... good luck finding a free or paid spotAt a certain point the #3 pizza place in Nashville (maybe #4 because Mushroom is almost just as good if not better) is going downhill."], ["Laura H.", "As a self proclaimed pizza addict, I'm a fan of Bella Napoli. Good sauce, excellent crust, and quality toppings. As a neighbor I am constantly fantasizing about their wood fired pizza because the aroma wafts over to my apartment sometimes. My most recent dine at Bella Napoli was impromptu because Taco Mammacita had a 45 minute wait. Luckily pizza and tacos are my main food groups so I was happy to trot next door to Bella's cute courtyard. My friends and I had some Yazoo at a great price, and shared bruschetta for an app. It was delicious-- heavy on the olive oil. The tomatoes were a bit pink, and I like them dark red and juicy. But hey, winter is barely over. For dinner I had the gnocchi. I spent more than I was looking to spend but it was worth every penny. A nice deep red sauce and cheesy goodness hugs the little potato filled pasta so well. So delicious! My friends really enjoyed their pizza and panini as well. The crust is fluffy and flavorful. Our server was very friendly and funny. My only gripe is that I wish they had gavadeels on the menu."], ["Megan K.", "Fabulous pizza in Edgehill.Lunch special for $11 was a huge portion--medium sized salad and huge pizza. I had a margherita pizza, which was really flavorful. Great service... love the divey atmosphere. Parking can be tricky--either in the paid lot across from the shopping center or along a street nearby.Great lunch spot!"], ["Carey James B.", "REAL pizza italiano! Amazing lasagna and other AUTHENTIC ITALIAN.This is THE ONLY real Italian Restaurunt with REAL Italians cooking and owning the place! YOU WILL ACTUALLY hear ITALIAN being spoken here!!! Just sit inside close to the kitchen. ;)Very nice date place!!!Sip a nice glass of vino and eat like kings!"], ["Vinit M.", "Ordered 2 Pizzas for take out. Opened at home and both were not cut and had so much salt that could probably go in 3 full meals.Bella Napoli has never been such a big disappointment! Even if this was the last order of the day! I was not expecting to cut the whole pizza myself and then not able to eat a piece of it because of the amount of salt they put in.Service is something that should be round the clock! The graph should not go down just because it is time to close and it's your last order! You lost a regular today!"], ["Sunrise G.", "My wife and I came up forth weekend and wanted to try \"Nashville's #1 rated pizza\" especially since they appeared authentic and had a wood fired pizza oven. The way their menu read we expected a treat. I ordered the lasagne and my wife ordered the Parma pizza. We ordered 2 double espressos which came out cold. Next our order arrived - her pizza cold and my lasagne lukewarm. My lasagne had practically no meat in it and I could not see 4 cheeses either as advertised. All noodles with what seemed to be canned sauce. I mean give me a piece of bread and side salad for $15 or at least an add on or something. Very unimpressed. Food not as expected and overpriced. I laugh at the Nashville patrons who voted this place as #1I laugh at myself for not walking out. For these reasons my wife and I had to chop you today Bella Napoli."], ["Erick R.", "Authentic, tasty, awesome. The best time to go is in Spring and Summer when it's warm out, because the dining is best outside. They've got a nice little wine selection and its perfect with their pizza. If you like bruschetta, it's awesome here. The best time to go is in the late afternoon before it gets too dark. I would recommend this place to anybody. P.S.Definitely get the pizza."], ["Amy G.", "My husband and I went here because the owners story and menu looked amazing.We also noticed a coupon on scoutmob that offered 50% off. One star off for espresso and pizza both coming out cold. Another star off for no salad or breadstick with lasagne. And finally one more deduction for them not claiming ownership of coupon. Overall food average and overpriced. I would have been more forgiving but we were the only patrons there so there was no excuse for cold food. Will not be back."], ["Abi P.", "Bella Napoli can do no wrong!  No matter what I have ordered, I am always beyond thrilled and stuffed with my meal.  My favorites are their daily special pizzas, the Sorrentino pizza and the Rigatoni con Salsiccia.  I love this restaurant, the food, the staff and the atmosphere- no matter if I want to have a romantic date or a casual meal, it always works perfectly."], ["Brittany F.", "The outside patio is one of the cutest in Nashville! It looks like you are in a quaint little alley with string lights hanging above your head!! The food is pretty great too! I ordered the margherita pizza and my husband got the rigatoni with sausage. I couldn't stop dipping my crust in his parmesan sauce!!! It was the perfect combo! My pizza was delicious, the cheese was fresh, the crust was fabulous! His rigatoni was delicious and had really great flavors! Our waiter was a really sweet man with a fun mustache that was attentive and helpful.The prices are a little higher than I usually like to pay for 2 meals but I should go during happy hour from now on!"], ["Douglas B.", "We had not dined at Bella Napoli in some time.  Alas, the experience was not a good one. The drinks were fine but overpriced.  The  Pizza capricciosa was BURNED on the bottom.  The meats used were oddly flavored (definitely not Italian baked ham) and the artichokes were hard and without taste; both did not complement the cheese and light sauce.  But it was the carbonized crust that spoiled the dinner.  We did not protest because we had a guest with us. The desserts (tiramisu and cheesecake) were good.  On the whole, ours was a disappointing experience.  We will NOT return to Bella Napoli."], ["Johnny T.", "Wow! What an unexpected surprise. While there's never a bad time to eat pizza, I must say that coming to BN in the summer time is a joy. Why? Because of the alleyway. The alleyway (like someone mentioned above) is reminiscent of a movie set what with the strewn lights, brick facade and strains of live music. It's also fantastically romantic so fellas, if you're looking to charm your lady with a night out... I'm just sayin'. So, when it's warm, come here and eat in the alley (I know it sounds odd; I promise, it's a winner of an idea).But even if it's not warm, come here and eat. You'll have a marvelous time (and I never use that word). Come hungry, ready to explore the menu and be open to a progression of flavors. I started off with a New Fashioned Cocktail -- a twist on the classic Old Fashioned. Not only was it well-made, I was surprised to know that I could find great cocktails at an unassuming Italian restaurant. To pair with it (and whet my appetite), I started with the caprese salad. It was the standard caprese but all the ingredients were fresh and the flavor popped. By dinner time, I'd decided on the penne alla vodka and a bottle of wine. I know, I know... what about the pizza? Well, it wasn't a pizza kind of night but judging from the pies brought out to other tables, you can't go wrong with the pizza selection. My pasta was nicely-cooked, perfectly tossed with sauce and fairly populated with pancetta and onion. If you've had this dish before, you'll love it here. Again, the presentation/dish wasn't anything new but I wasn't ordering 'anything new.' I was ordering a comfortable stand-by and that's what I received. I found the waiter's description of the malbec to be right on the nose. The bottle was incredibly drinkable, fruity with a bit of a nutty finish. It's a great wine. What wasn't so great was the mark up. A glass of the stuff is just about as much as a bottle is to buy at the store. A bottle at BN will run you, about, 3 times what you'd pay at a store. It's a good wine. It pairs well with the food. It's drinkable. But don't gouge the customer on the markup. That was the only sore point of the evening. The service was a bit bumpy but our waiter was so earnest and was trying to so hard, I couldn't hold the snafus against him. Effort makes a difference -- as does ambiance. Would I have been so taken with the meal/evening had we sat inside? I don't know. I do know that the inside belies the quality of the food/drink you could/would expect at BN. And, perception is reality in many cases so... there's that. I wouldn't tell you to plan your BN excursions based upon the availability of alley seating... but I also wouldn't say you would be upset at your choice to do so."], ["Chandler C.", "what else to say? It's got the best pizza in Nashville. The owner is super dope. You should go here... just don't bring your annoying sorority sisters."], ["Steven B.", "Good pizza especially the crust. The pasta on the other hand was awful. The penne with vodka sauce tasted like Chef Boyardee and the lasagna was literally six layers of noodles with nothing in between swimming in watery marinera. No thanks. No excuses for this garbage."], ["Sarah W.", "I stopped in at Bella Napoli on a whim - I was actually headed to Taco Mamacita. It was a Monday afternoon and I had the place to myself until half way through the meal. The staff were courteous and prompt and explained the menu and special options that day. I ordered the Quattro Cheese pizza - delicious. Be warned - they do not cut the pizza into slices for you! Not a big deal, it was fairly easy to cut through the delicious thin crust with my knife, and my server kindly warned me that she had just handed me one giant pizza without slices! Eagle Parking provides valet for $3 or you can park across the street in their lot, so parking is fairly easy. Nutshell:I love pizza and this is a great place for it, in the Edgehill areaJust across the street is Dulce Desserts - go there for a cupcake or cookie after your yummo pizza!"], ["Laura S.", "Tucked and hidden rather quaint location. Very quiet and soothing ambience. Really accomodating with serving food such splitting salad and pizza and providing spices and basil.  So recommended for a lunch date."], ["Ben C.", "Bella Napoli has pizza just like in Italy!  If you would like a great experience of a relaxed, Italian atmosphere, and great wood-fired pizza, Bella Napoli is the place in Nashville. I, for one, will certainly be back!"], ["Zoraida K.", "I have looked forward to making a short jaunt to Edgehill Village to visit not only this eatery but a dessert place close by, for which another review will be written.Let me preface this with saying that I have never been to Naples, but have been very close, all Italian areas north of there, and therefore may hold a higher, lets say, expectation, of what to expect in the way of authentic Napoli pizza.First of all I LOVE the outside eating space. I think the entire EV is very cute and cozy but the area that BNP has taken ownership of with picnic tables, Italian music and hanging lights are enough alone for a return visit. Molto Bella!Secondly, the inside actually transports you, rather seamlessly, with the lack of windows and Italian channel T.V., to a small Italian eatery in a village in Italy. So the atmosphere made up for what we found to be a lacking meal for our first visit.I have heard great things and was excited about trying the pizza. My husband opted for the Chicken Parmigiana which I was afraid wouldn't live up to his distant, both figuratively and literally, memories. The waiter was very attentive and the Ruffini Chianti was moderately priced but generously served. We ordered the Antipasti Platter as a starter and all of it was fair. We enjoyed the coupling of two slices of pizza bread with the meats, but could have used more. The bruschetta piece was small and crumpled on impact dropping much of its offering on to my plate below. My husband didn't care of the bologna, which is strange. I found it rather bland but pleasantly thinly sliced.I prefer my pizza unsliced and that is the way it came. It was not soggy at all as I have read in other reviews. In fact it was a bit dry. The tomato sauce was used sparingly and that is my favorite part! The pizza dough was cooked to perfection and therefore I will return.My husband actually left some of the chicken un-eaten, which is unheard of, so I knew without tasting it that it was run-of-the-mill at best. He chose to eat the penne it was served on without it. He said it was \"OK\", and he would definitely order something else next time. Be prepared to pay for parking and plan to sit outside which I think in the upcoming fall evenings will be lover-ly.Overall a slight let down on 1st try, but we will give it another."], ["Qi W.", "Bad pizza; the dough is so chewy that it tastes like gum. Service is not good either; it's like they don't care about your business at all."], ["Diana J.", "I paid $20 for a pizza with mushrooms and chopped deli meat. Needless to say, I won't be returning."], ["Chris M.", "A rare 5-star rating from me.  I have been here many times now and I can honestly say there is not a bad thing on the menu.  The calzones are my favorite, but even their simple spaghetti is absolutely fantastic.  Wine prices are reasonable and they have a great lunch special.  It's a fun atmosphere with great wait staff, and you can watch them prepare all the food.The restaurant is located down a tiny alleyway, all the more adding to its allure and ambiance.  Owned by a true Italian family, it's truly a family run business and they treat you as such.  The brother-in-law of the owner is a hoot, and always a pleasure to be served by.Can't wait to go back again!"], ["Lori P.", "Do NOT order the pizza. Really bad. Wings were great."], ["Taylor T.", "Bella Napoli is my favorite little hidden gem. Tucked in a cozy alleyway in Edgehill, they serve up the best pizza and authentic Italian food you can find in Nashville. I don't say that lightly. They also have the friendliest service you could ever ask for. If you eat here two or three times, they start to remember you and welcome you back. Forgetting that they don't have sweet tea, I ordered one and my waitress caught herself mid-sentence telling me that they only have unsweet. She returned with a sweet tea she literally made herself. Come for the food. Return for the service. Highly recommended."], ["David O.", "Bella Napoli is tucked almost invisibly behind Edgehill Village. I have been over here several times for other things and I never knew this was there.We stopped in as a party of 8 at lunch and had no difficulty being seated.Had the lunch special with the Sorrentino pizza. It was fantastic, and except for a few charred areas on the crust that tasted pretty bad was one of the best pizzas I've ever had.Working against choosing to come here is the pay parking.  I guess Cool-Kid-Ville has to make a little extra money so they converted a dirt lot into a dirt parking lot with narrow lanes. It's easily the worst part of the deal.I plan on bringing the better half back with me the next time I'm in the mood for some Pizza."], ["Bridget C.", "Just ok.  As previously stated, plan to pay for parking.  Salad was fresh & tasty, but pricey for a starter salad.  Pizza was ok.  I used crushed pepper and balsamic vinegar to add flavor.  My guy had the calamari and said it was definitely lacking.  The cocktail sauce tasted more like a pasta sauce.  Just fair on the flavor and a major minus on the pricing.  We won't be returning"], ["Debi M.", "Traveling from North Carolina to Oregon. We planned our trip to eat here on our way to Memphis because we saw on Delish that this was the best pizza in Tennessee. They did not disappoint. We had two kinds. Can't remember the names and both were really good. The broccolini one was delicious!  Yum. Wish I could eat here more often. Definitely the high light of a long car trip!"], ["Bridgette C.", "I love places where I can sit outside when the weather is nice, and the setting at Bella Napoli in Edgehill is just great for that.  It reminds me of movie scenes from old New York, brick buildings, lights strung between them, music playing...I adore the ambiance.  When its colder there's heat lamps going and when its warmer the buildings seem to funnel cool air down through the outdoor tables.  I frankly enjoy that.And the food is delicious.  I've had better Italian, and better pizza (I am from NY after all) but this place gives you a great meal at a good price and is a great place to hang out with friends or enjoy a mid week date night with your sweetie.  I LOVE the stuffed eggplant appetizer (I could make a meal out of that), their classic mixed greens salad and their margheraita pizza.  I've also tried a lot of their pastas, and to me the portion size is what does it: enough to fill you up without busting your gut.  Their penne alla vodka is my favorite although when I'm feeling gluttonous (which is often) I love to indulge in their rigatoni with Italian sausage or their gnocchi with eggplant.  This place provides great service and good food.  Sure you can find better places, fancier places, but for a little escape with a unique feel and look (and did I mention extremely reasonable wine bottle prices?!) this place is not a waste of money or time."], ["Rebecca M.", "I'm a little disappointed with Bella Napoli. Maybe it is not my style, but the pizza was watery and mushy. It definitely did not taste the best with all of that mush mixing flavors and the crust falls apart in a soggy mess. I did see a few plates of pasta pass by my table that looked delicious. I may return to try a different dish but I won't be ordering pizza again anytime soon. The outdoor seating is adorable though. Truly quaint and comfortable."], ["James B.", "The ingredients in pizza are basic: quality tomatoes, cheese, flour, yeast, herbs... and at Bella, the flavours of these basic ingredients have the limelight. Their pizza tastes (as far as I can tell) as though nothing has been added that should not be--like dough conditioners to hold the dough together, or silicone to keep the cheese from clumping.Additionally, their marinara sauce is a bit runnier than the uber-concentrated paste that often ends up on most pizza. Thicker sauce generally tastes sweeter as it contains more sugar per volume. Also, thicker sauce has less water, creating a less soggy crust. But, I prefer the Bella approach which is to use a relatively thinner sauce, and create a crust that is crispy, chewy, and YES, a little soggy all at the same time!Overall, the pizza reminds me of the pizza that I had in Naples, Italy 15 years ago. I don't know if I'll ever get to travel back over there, so I am thankful that a place like Bella is so close to home.I think most of the negative reviews on here ( those who complain of not enough flavor, and soggy ingredients) were probably expecting something similar to Mellow Mushroom or Papa Johns, or perhaps pizza with way too much salt added and processing chemicals.I have only one complaint about the pizza. It comes out burnt. This, I believe is intentional. It is a more authentic pizza experience, but I would prefer the bottom of the crust be golden brown instead of black. Not just because charred food is generally considered carcinogenic, but I also prefer the taste. But, in spite of the charred bottom, I come back to Bella Napoli a few times a year to get that authentic pizza experience."], ["Drew U.", "Up front - be prepared to pay for parking. No biggie - just be aware.There are a lot of positives here and good reasons to go here.  The ambiance is great.  It would be a nice place for a date or lunch with friends. Great little courtyard when weather is nice.For me though, it's all about the food hence my rating.  Other reviewers mentioned the \"soggy in the middle problem\".  This is the big issue here and in my opinion the only thing keeping this place from getting a bunch of 5 star reviews.  I can guarantee the pizza doesn't come out of that oven soggy.  It is very hot and gets dropped on a plate immediately.  That plate traps steam and when it gets to your table it is most definitely soggy in the middle.  This issue could be resolved.  In my opinion - this is NOT how pizza should be served (as one reviewer reported that their waiter had suggested).The toppings were good and the non-soggy part of the crust was very good.  I thought the prices were reasonable.  I thought the menu was specialized but had enough variety.If they address the soggy crust issue I would be a regular here; otherwise, I won't be back when I could just as easily go to Desanos on music row."], ["Paul K.", "I'll preface this with the wife liked it.  I ordered the Margherita pizza, a stuffed eggplant appetizer, and cheesecake.  We were there with 4 of our friends, so we got a pretty wide sample.Friend to my left ordered some sort of pizza with fresh mozz cheese, across ordered a stromboli of some sort, other didn't eat anything cept cheesecake, stromboli, and the wife ordered pizza of unknown properties.Wife likes hers, stromboli was a universal hit, friend with mozz pizza was complaining because it was pretty much water and cheese - entire thing was a soggy mess and she asked the waiter about it and was told that's how fresh mozz cheese cooks, she was not happy.My margherita pizza, I'll say the wife liked it and I would never order it again. We had a conversation about it and I would rather have microwave pizza than their margherita. The only taste to it seemed to be the burned wood  flavor of it (which was good, if there was any flavor for it to accentuate).The cheesecake seemed like it was out of a box for 10 weeks - kind of dry, but was ok.Liked the atmosphere, but would never order the marg pizza again. After lookiing at the mozzi pizza I would never order anything with their mozzarella as it was a totally liquid mess (cheesecloth, it'll let you drain your cheese and not have a pie that looks like a lake).Value for money was not there, left hungry after eating a whole pizza and cheesecake.  Wife has said she'll start a yelp account just to counter my review of the place, but seriously, this was slightly burnt crust (which was ok mind you), tomato sauce, and a little bit of cheese... when you picked up a slice all the cheese and sauce left the pizza.Maybe I'm a fan of American pizza too much, but when I want a pizza I want flavor, slices, and something to stop my hunger.  This came uncut / we used dullish steak knives to slice it and it was unspectacular.Liked the place, but I wouldn't go back for the veggie-edible food... will say the strombolis were a hit"], ["T R.", "Delicious pasta. Wonderful smells of Italian food throughout the restaurant. Not a fan of how they bunch people together so diners feel on top of one another."], ["Tracy F.", "We came to Bella Napoli after hearing only good things about the restaurant from both friends and other Yelp reviewers.  My boyfriend and I were excited to enjoy a delicious pizza dinner and a romantic evening together.  However, we were sorely disappointed with our experience from beginning to end.  We ordered the house salad, the fried calamari, and a Capricciosa pizza to share between the two of us.  The salad was delicious, but for nearly $7, the portion was extremely small.  The calamari was simply prepared, with no seasoning whatsoever, and served with a very bland tomato sauce.  Again, for the nearly $10 we paid, the portion left much to be desired.  I believe our biggest disappointment came from the pizza, the part of the meal we were most excited for.  It came to the table lukewarm and soggy, and the toppings were nothing special (though they were supposedly imported from Italy).  I took one bite of my pizza and stopped eating entirely--the soggy texture and puddle of water on the pizza pan were enough to suppress my appetite for the remainder of our dinner.  Despite the fact that I was sitting at the table, clearly unimpressed and disappointed with a huge piece of uneaten pizza on my plate, our waiter never asked if anything was wrong with the food or our dining experience.We're still looking for good pizza in Nashville, but we know that we will not be returning to Bella Napoli anytime soon."], ["Polly P.", "The service was great but the lasagna is the easily the worst I've ever had. Tasted identical to chef boyardee canned ravioli and had only SPECKS of meat between the noodles.  GARFIELD WOULD NOT APPROVE!"]], "Mirko Pasta": [], "MAFIAoZA'S": [["Liz K.", "A group of seven of us, my colleagues and I, came to Mafiaoza's last night for their 2-for-1 drink specials. We were looking to have some beers, hang out, and eat dinner, and I wasn't sure what to expect. Our wait for a table was estimated at 45 minutes (ending up being closer to 60-75 minutes) and so we ended up spending time in the bar area, which was packed - not surprising considering the deals they had going. By the way, when they say 2-for-1, it's literally that...NOT 1/2 price drinks. You order a beer, you get two. We were seated out on the patio, which was partially enclosed. I don't know if they move heat lamps out there ever, but they'll eventually need to or that space will be worthless. We ordered the garlic bread, fried ravioli, bruchetta, and chicken wing appetizers. I liked the ravioli but the garlic bread and bruchetta breads were weird - thick and block-like, like a cake, and dry. If I had really thought about the 2-for-1 deal, we would have ordered a bunch of slices of pizza, but instead we ordered four pizzas: a plain pepperoni (I think), the brass knuckles (buffalo chicken), the fedora (kalamata olives, mozzarella, and basil pesto), and the last request (veggies plus pepperoni, salami, and italian sausage, and jalapenos for an extra kick). The last request was my favorite by far. The veggies and meat were flavorful and the jalapenos gave it that extra boost. The fedora was bland except for the overwhelming salt from the olives - couldn't really even taste the basil pesto. I'm also not a fan of how thin the crust was...it was the kind of pizza and size of slice that you have to fold to be able to eat (unless you're going to use a knife and fork). Overall, we had a TON of food - no need to order four large pizzas for 7 people. The price wasn't horrible, but that was due to the 2-for-1 drink specials rather than the prices of the pizzas. Again, we had a ton of food, but it's not the kind of pizza I'd go for if I were ordering for myself, and the combos weren't that impressive, with the exception of the last request. Go once for the 2-for-1 and then try something else for dinner."], ["Dagan B.", "The pizza is better than average and the Alfredo was also. My complaint was the waitress wasn't very good at refilling drinks etc. Good thing I rate places on the food."], ["Aubrey W.", "Dan and I spent too much money eating out at boring places like Moe's and Panera, so we've resolved to cook more at home and instead indulge a few times a month at local eateries we haven't been to before.  Recently, we were planning to go try the burgers at  M.L. Rose, but it was jam-packed (and had a weird seat yourself policy) and had NO seats.  So we headed to 12 South for pizza at Mafiaoza's, since a friend at work recommended it to me.We started with the Fried Cheese Ravioli Sticks as an appetizer, which was delicious!  They looked like breadsticks at first, but they had the great chewiness of pasta and melted delicious cheese inside.  Let's just say I knew to pop a couple of Lactaids before this meal because I couldn't go to Mafiaoza's and not indulge in cheese.For our pizza, we selected The Fall Guy, which is a meatball and italian sausage pie.  We added some mushrooms too.  It did not disappoint!  For us, a good pizza has to have good dough.  Soft but chewy, with a good crust.  Then it has to have a good sauce and cheese to tie everything together.  This brick oven pizza met all the requirements, and the leftovers we took home didn't last 24 hours in the fridge.I would not hesitate to come back to Mafiaoza's for another pizza pie.  12 South is such a fun area to visit, so we'll be back for sure."], ["Alisha W.", "Our experience this last Tuesday was very frustrating.  Where is the southern hospitality that used to be in Nashville?  Early on Tuesday we went to celebrate my husband and with over 3/4 of the restaurant being empty I figured it would not be the biggest of deals to take two tables since we had 8 people (we ended up with 18).  However, the hostess would not seat us (3 people) until the whole party was here.  Yet,  there were other people sitting at large tables with more than 1/2 empty seats.  Luckily the waitress allowed us to scoot the tables together and we filled up within the first 15 minutes of getting there. The hostess then came back after we had been there for an hour and asked us to leave so she could turn over our table.  Really love the hospitality! Pizza is not as good as DeSanos and the 2/1 is not as good as DeSanos BYOB."], ["Taylor D.", "3/5. It was hard to give a decent review and not go full on negative but the pizza was truly fantastic and saved the review. We went Sunday evening and there was a good crowd, not busy but certainly not slow. Took 20mins to be seated with multiple open tables that just weren't cleaned yet. But we sat down and it took a good 10mins for our server to finally come see us. We all order, I got a coors light draft and it was part of their 2 for 1. And we all got waters and the water is definetly tap and all had like no ice at all same with the two people who got sodas, barely any ice. We wait like 8mins for our drinks to come, if not longer and my coors light was warm because the wait and because they take the mugs straight from the warm dishwasher and pour beer into. One of the people I was with got Stella and they brought the wrong beer so she had to wait another 5mins for him to bring two Stella's, in a bottle! Wth. The server brings her beer and she asks for a mug and at this point we knew what we wanted but he went to get the mug first and it literally no lie took about 15mins. The mug tasted like straight up dish soap. While she waited for the mug I noticed on my second beer there was some goop on it so I went to the bar to swap it out and that's where another problem laid. Three servers sitting waiting for drinks and a very slow inattentive bartender. Luckily a second bar tender saw me waiting and apologized and swapped out my beer for me. But we had to make a second trip to the bar because of her soapy mug. But finally after waiting a total of like 40mins we finally get our pizza. We ordered a buffalo chicken pizza and pepperoni pizza. And boy! The pizza made up for the absolute atrocious service. I would recommend this place for takeout but not sit down. Slow, bad service and warm beer. But great pizza."], ["Eric W.", "Very good hand made pizza. Lots of good draft selections. Always a great place to eat."], ["Adam B.", "We went on \"Customer Appreciation Day\" on Tuesday. That's 2 for 1 beer and 2 for 1 slices of pizza. The beer deal is great! It's not limited at all. It's all the beer they carry. Nothing like 4 glasses of stout for $11! The wife got two ciders for $6. The pizza was....eh. Its strange they make slices to order. It seems like they make a LOT of cheese slices, throw whatever you ask for on top, and blast it in the oven for a second or two. I ordered jalapenos on my pizza. They were fresh (which is great) but they weren't even remotely cooked on my slice. Come for the beer but consider ordering a whole pizza if you want something fresh."], ["Paige F.", "You can't go wrong with Mafioza's! Especially on a Tuesday night Buy one get one draft beers and pizza slices. I came last night and for two people with two beers and pizza slices each it was around 20 dollars.  The pizza is excellent and they have a large selection of beer. It gets very crowded on Tuesdays, so be prepared for a little bit of a wait.  Also, have your id ready when you enter, and they have a very strict dress code on Tuesdays.  No athletic wear, which is odd because it's not that fancy of a place."], ["Joe W.", "Nice covered outdoor seating. We had a big group and Im sure it was overwhelming. Had pizza, DUH. It was a nice thin crust and even better cold the next day, if you're into that sort of thing. They have a two for one beer night and a substantial drink menu.  Go with some friends and get a pizza and some drinks. Street parking is all around, but maybe not directly in front. Take an uber and have an extra drink."], ["FoodCritic 6.", "This place is so delicious! Great service also! Although I hate to parking. Very hard to find a spot to park."], ["Adam R.", "The wife and I have been many times and I've never had a bad slice here. Sure sometimes there may be a wait due to the crowd, but you'll still be fed. Good beer selections, good sides, great pizza. What more do you want? (Try some of their more unusual cheeses on your pie. You won't be disappointed!)"], ["Jason R.", "I should have known by the attitude of the hostess that this was going to be a bad experience.   I don't know what the deal is, but we went on a Sunday and there were very few patrons. Hostess rolled her eyes when I asked to be seated near the window. My wife asked if it was okay, the hostess copped and attitude and ignored her. Waiter was okay, but he seemed like he was just dullfully reciting his lines as opposed to engaging with us.They did have the Yazoo Gerst on tap! Yeah!For pizza we ordered the Margherita. As they claim to be a New York style pizza joint, I expected much better. Typically the Margherita has a tomato based sauce. This did not. I get it when restaurants try to put a new fling on an old recipe, but this was horrible. We asked for some sauce on the side which they brought out, but it was pretty nasty too. Neither of us finished our first slice and I called for the check. The waiter was suprised when we didn't want a box to take home the uneaten large pizza. We saw this place after eating at Burgur Up on Saturday night. It was very busy, I am guessing it is a great hang out place. But, I wouldn't call it New York style pizza. My impression is that they were trying to create a theme restaurant, but didn't have the recipe to back it up. We won't go back!"], ["Heidi C.", "The only reason Mafiaoza's doesn't get a 5-star review in my book is partially due to the slow service and kitchen staff.  We were recommended to try this and the pizza was spectacular.  Our waiter was extremely friendly, but a little slow.  My biggest issue was that I was facing the guys making our pizzas.  I get that this is a Hipster area, but the kitchen guys could work on their clean appearances."], ["Katie H.", "I really enjoy Nashville's pizzas scene, I found an article stating we were top ten in the country for pizza and decided to see which places were ranked. Mafiaozas not only was ranked for there pizza but as one of the top 5 must place restaurants to eat in Nashville. I've been here a few times and always had a good experience. Tonight's pizza unfortunately did not hit the spot and will turn me away for a bit. The center of my pizza had such a thin crust that it tasted chewy and near raw with how thing it was. I mentioned this to the waiter and although he attempted to find a solution I was already ready to go. Hopefully it'll be better next time!"], ["Bridget H.", "What I like:1. Not only my favorite pizza in Nashville, but my favorite pizza hands down (coming from someone who has lived in Chicago and spent significant time in NYC)! 2. Terrific Service- we hosted my bachelorette party here and our waiter was engaging and attentive- even treating us to stories about his own marriage and previous single life! 3. Very accommodating to big parties- the back party room was the perfect spot for 10+ girls as they kicked off a night on the town4.  The other (non-pizza) food is great too- try the garlic bread and apps for a yummy start! What I don't like:1. Nothing!  Note, though, that it does get very crowded especially on Tuesday night slice night! Overall verdict: A must visit!"], ["Kelly A.", "Super slow service. Pizza flavor is good but served cold both times we ordered :( bottom of pizza was burned too"], ["Lindsay B.", "They have THE filthiest sidewalk & parking lot on 12th South. The grass that sits in front is covered in cigarette butts. More than I have seen outside a downtown honky tonk. Maybe supply an ashtray for your drunk patrons, you have one located by the door, however it seems that it is not doing the job.  I have had pizza there once, and it certainly doesn't make up for the lack of respect they obviously have for their neighborhood and the environment. If you can't take care of what I DO see, what does it look like in your kitchen?!?It may belong to the city...but if this were my business I would certainly pay someone an extra 10 minutes a day to do a quick clean up before it opens."], ["Jeff H.", "Great night out with the family!  The Pick Five,  fried ravioli (starters),  and Spinachi (perhaps the best salad I've ever had),  followed by a large pizza (Informant) made for the perfect culinary delight!  We're newbies to Nashville but Mafiaozo's has skyrocketed to the top of our favorite pizza place."], ["Carissa O.", "Good pizza and fun atmosphere. Also tried the fried ravioli and it was good! It's not like earth shattering, life changing pizza but it's not dominos and it's fresh so who's complaining!! I've always had good service here too."], ["SueAnn S.", "Nothing I've ever had here wowed me. But it's good location and 2-4-1 deals have me and my friends coming back frequently. Their pizza is NYC style thin crust. Everything is a bit more expensive than it feels worth it. 2-4-1 makes it all tolerable. Pizza and beer Tuesday night and then just beer on Sundays."]], "Mama Mias": [["Brooklyn M.", "I have read lots of reviews of this place. People seem to complain about waiting. So let me start by saying that this is not a chain restaurant. This is an Italian restaurant that is small. Come here to relax and enjoy your meal and your company. Don't come here if you get impatient. My husband and I went here Saturday night around 6:00. There wasn't a wait for a table. It was so nice to have a leisurely dinner and just talk. They first brought some amazing garlic bread. It is wonderful. Next up was a salad. I got Italian dressing on mine. It tasted homemade and had a slightly more vinegar type taste to it. My husband had ranch dressing on his and loved it too. I played it safe and got spaghetti with meat sauce for my meal. My husband got chicken Parmesan. Again, a safe choice for a new place to try. His sauce had a slight sweet taste to it. There was just the right amount of cheese on it. My meat sauce was wonderful. There are small pieces of tomato in it. I will say there was quite a bit of green in it. I wish there had been less or it was smaller pieces. I know this is some spice, just not sure which one. I'm just not a green pieces person. I would have liked to add salt and pepper to both of our meals. I think that would have made them perfect, but they were still great as they were. The portions were very large and we took home leftovers.We shared a tiramisu for dessert. I could have eaten it all myself. It was amazing!!! I have had lots of tiramisu. We had the best ever at an authentic Italian restaurant in NYC. It was homemade. This was right up there with it. They don't drown it in sauce or powder. I can't say enough about that dessert. I will probably just stop in there sometime to have dessert and coffee. In conclusion, this place gets 5 stars from me. Again, it's not a rush in and rush out like a chain restaurant. You will wait between courses. There are only a couple of servers. But it's wonderful and worth the wait. The people are so nice. I enjoyed it. We will definitely be back and bring family.Edit: I forgot to add that this is a bring your own bottle of wine place. We will definitely bring a bottle to enjoy next time. I'm also uploading pictures of the bread, salad, and our meals."], ["Simon C.", "This place can be hit or miss, but I've had some of the most memorable meals here in all my time in Nashville. Part of the allure is how small and intimate the space it. With a wine shop next door it's pretty neat that you can bring in whatever you would like to have with diner. The food is really solid in terms of being true Italian food. Every now and then it's a bit off, but there aren't many other places in Nashville to get true Italian food. Worth checking out for sure, would recommend for a couple on date night or small family get together. Arrive early as seating seems to fill up quickly."], ["Yamille H.", "I was on a long road trip from Miami, Fl to Niagara Falls. I was very very hungry and needed a place to eat. Being with the vegan bf makes it hard to eat anywhere. So I start looking for Italian bc that's actually the easiest for the both of us to find something. We stumbled across this gem. It is in a weird location. It's like behind a gas station, but don't be put off by that. The place inside is great. The walls are filled with artwork and the mood lighting is very intimate. The staff was very friendly and attentive throughout our entire meal. I had the mozzarella sticks. I know it sounds pretty standard, but let me tell you: I was so happy that I ordered these. They were anything but basic. I can't put my finger on it, but there was something so delicious. There was something that made it taste like no other mozzarella stock I ever had. I think it may have been the blend of cheeses and the breading was different and very tasty. The free bread sticks are amazing. They are deliciously buttered and seasoned. The house sauce accompanied the bread. It was a delicious marinara like sauce. I ordered the chicken parmesan with spaghetti and the vegan bf ordered spaghetti with the house sauce and no cheese.The chicken parmesan was a big piece of chicken that was not dry at all. The crust and cheese that was on the chicken was very good. The cheese was perfectly melted and It all worked so well together. The pasta was perfectly done and the sauce was so good. I was happy that it was the same sauce that was served with the bread sticks. I couldn't finish it all. It was a large portion so I took some to the hotel. Luckily the hotel had a microwave... I had it for breakfast the next day. Don't judge me. Oh! Before I forget- talking with the staff I found out the chicken is organic. I told them they should put that on the menu since I think that's a great selling point. It made sense that it was organic though. I was full, but I didn't get the gross feeling of overeating and wanting to die. I just felt pleasantly plump.  The vegan said he liked his pasta alot and offered alot of flavor for such a simple dish. He was happy they adhered to his request of no cheese and that they were able to recite what ingredients were in his food to quell his nervousness of eating something he can't. Although, he almost broke for the bread sticks. Sadly, the breadsticks are lightly brushed with butter. He was eating them with his eyes! I didn't get dessert because I was so full, but the have a variety of of portions that all sounds delicious. I wish I had access to this place all the time. It would have become my go-to spot for dinner. The food didn't get me sick to my stomach which is always my fear in life since I tend to have tummy issues and I was on a road trip.This place was def a good choice. Easy to get in and get out of the parking lot and close to the major hwy we were driving."], ["Katie D.", "I usually don't write reviews after only visiting once, but I doubt I'll be back anytime soon since I don't live in Nashville!I just want to say that the food here was superb for the price! It's true, the service was a little slow. The restaurant wasn't very busy and yet we waited an unnecessary length of time to be seated. But it was totally worth it!To start, you can bring in your own wine, and there is a wine and spirit shop conveniently located next door. We ordered the appetizer sampler and it was very good. I was most excited for the mozzarella sticks (homemade!), but these ended up being the weakest link of the meal. They were mostly all bread with very little cheese. The meatballs on the other hand more than made up for it, as they were top notch! The bruschetta was some of the best I have had, even though this is what I was looking the least forward to! I believe there was even some prosciutto on those bad boys!I ordered the chicken mimmosa which was scrumptious! Too bad at this point I was already mostly full so didn't make it too far into my entree. This is never a bad problem to have though!This might not be the *best* Italian place ever, but for a middle tier option, it is the bees knees! I find that it is hard to find above average Italian food without going full-blown fine dining. At least this is the case in Cincinnati, where I live."], ["Liz C.", "Mom & pop home cooked Italian food. Menu is simple & all the dishes are really quite tasty. As appetizers we ordered mozzarella sticked that were huge & good. We also ordered a caprese salad, the tomatoes & the mozzarella was so fresh & it all flew off the plates. The garlic bread is large, buttery & hot. So good. With your entrees it includes a house salad. (No cesar salad unfortunately.) Also, I didn't care much for the house salad & their Italian dressing. My dinner made up for it though. I ordered the cheese tortellini calabresse. It was very good with the grilled mushrooms, onions, red peppers & sausages. The BF ordered chicken Marsala & while the chicken was good the Marsala sauce was too sweet for his taste.  For dessert we ordered the Tiramisu & it was really very very good. Why the 3 star review for such great food all around? Well, the service was crap & it took over an hour to get our food for a party of 8. Also, our waitress just dropped the check on our table before even asking if we want coffee or dessert. We had to tell her we weren't done & wanted dessert. It was also really weird how they brought out our food 2 or 1 at a time & it took a while until we all had our food. Not to mention that we all didn't get menus & it took a long time for her to take our order. Another annoying but about the crappy service is that one of the members of our party had a 3 year old & as soon swear river we asked for a high chair. It took them 15 minutes until we finally got the high chair & after asking a 2nd & 3rd time. Go for the really great home cooked Italian food but don't go in a hurry & have patience."], ["John T.", "I have been coming here ever since I found it 20yrs ago. I have never had a bad meal and the wait staff is great. I have read several reviews on here that I find suspicious. Our waiter was very attentive and spent just the right amount of time at our table and was very friendly. Our food was delicious as usual. I had the pesto pasta. The prices for what you get is excellent. 4 of us ate dinner for less than 60$. They do not serve alcohol but there is a sprits store next door and they only charge 5$ for a cork fee. Our waiter opened our wine and poured for us and when our wine glasses ran low he came back and asked if we wanted to be topped off."], ["Char D.", "Let me start by saying this has been one of my favorite places to eat in Nashville so it sucks that I'm having to 3 star them. :/BUT inconsistency kills this place. We want last night and I was totally let down. No specials, no lasagna, ran out of bread and didn't have anymore until our entrees came out which took forever. We drank our whole bottle of wine and we lost a member of our party all while waiting on our food. Service is meh.. Me and mama mias I think are in need of a long break."], ["Hart P.", "Small Italian restaurant that focuses on the food. We ate some pastas we had not seen since being in Italy. They were well prepared. If you want wine with dinner you can bring your own and they will uncork it. As much as I liked the bread, I found it to be too heavy with oil.The staff was attentive and the atmosphere was nice.We will come here again"], ["Ellen D.", "My boyfriend took me here last night and I wasn't really impressed. My boyfriend loves this restaurant and defended everything I said about it, but something's weren't really defendable. First off, it's really confusing because on the outside its super dingy and tiny and its next to a busy street and a gas station, so it's not the best location for this restaurant because it looks really nice on the inside. So as for the food, the main course wasn't as good as I was expecting for the price that it was. And as an appetizer my boyfriend ordered mussels, which weren't actually on the menu but they had them anyway. We didn't get our bread until the mussels came out and that was a bit of a wait. But when the mussels actually came out, they smelled like my dog, which was a little unsettling. They tasted fine though I guess. I think the worst part though was that when they brought out my water, there was a tiny dead bug in it. So that was pretty gross, I ended up taking my boyfriends water instead, then when they brought me a replacement water, there was like paper or something floating around in it. Sooo check your water before you drink it. One last thing, it was freezing cold in the restaurant. I mean that could happen at any other restaurant, but just have a sweater o hand just in case."], ["Nita R.", "First of all I must say that Mama Mia's USED to be my favorite Italian place in Nashville.   The past two times we have been there the food has been horrible!   The ambiance is nice, I love that it is a BYOB.  We used to go there for special occasions all the time.   Not anymore.   They must have a new chef.  I'm not sure what happened.   The problem with the dishes is the OIL.  I ordered the Pasta Fresca which is a simple pasta dish with tomatoes, garlic, and cheese; I would not be exaggerating in the least if I said there were 2 cups of olive oil in that dish.   My husband's dish was the same.   Everything was floating in grease - we couldn't eat it.    I am sad to have to to post a bad review but I hope they read this and rethink the way they are cooking the food!  It makes me sad because they used to be the BEST Italian restaurant in Nashville."], ["Ariel L.", "the most authentic italian food in town by far!!!!!!"], ["Cecil B.", "This place is great!!! Byob with a liquor store right next door to pick up some wine. Service is super friendly. Food was really tasty. Best Italian in Nashville. And it's never crowded."], ["Jonathan B.", "I was very disappointed with this place.Atmosphere:The parking lot is share with the side of a sketchy strip mall. Located between two gas stations with a sign that is easy to miss. Don't come in expecting it to be a classy place.Service:Service was fine - not fast or slow. Our waiter was dressed nicely but he was very casual in terms of attitude.Food:The food itself can be compared to Olive Garden. It literally tasted like they took out some frozen food - thawed and cooked it - and served it.Overall:Pass. Big ole Pass."], ["Jay G.", "This is one of the most bittersweet reviews I have written on Yelp. I have lived within a mile of Mama Mias for about five years now and never have once tried it until last night. I always heard good things from people throughout the community, but for some reason never stopped in to give them a chance. That is the bitter part of this review because I have been missing many years of wonderful Italian comfort food. Nonetheless, the sweet is the sweetest because my wife and I have a new favorite Italian restaurant. As we indulged in our meal we quickly realized we were experiencing something special. The food was perfectly executed. Not over salted, the right amount of cheese, and FRESH ingredients...this my friends are the keys to great Italian food. Do not be fooled by the other low ratings that were given for this restaurant...the will only deter you from the true definition of deliciousness. I understand everyone's pallet is different but realize that real Italian food is not \"Pizza Hut\". Fast food Italian is all preservatives, tons of salt and cheese, they do this to mask how bad the food is because cheese makes everything somewhat better. As for folks saying they were slow, that's incorrect. We were informed as soon as we were seated that all the food prepared is made from scratch so it takes a little longer. We were there 1 hour and five minutes with salads, two baskets of bread, mozzarella sticks for an app, our dinner courses, and finished a whole bottle of wine. Again, this is not fast food. This is a restaurant that produces quality, made from scratch food. I do not mind one taking a little extra time in preparing food in order to receive a quality product at the end. Trust me, do yourself a favor and try them out. I battled a while if I was going to write a review because I did not want anybody to know of this place, but it would not be a service to Mama Mias. Everyone should come and be loved at this place. Do something your future self will thank you for later...eat here."], ["Laila S.", "My friend and I have been stalking this place for awhile. we work fairly close by but they were closed for a few months, but we finally got in a few weeks ago. looks like they have remodeled according to my friend who had been there before. So whenevery i try a out a new Italian restaurant, I get a few certain items to judge.1. obiviously the tomato sauce is key, and Mama Mia's has a pretty decent one. Its not the best but in the top 3 of the Nashville restaurants i've tried.2. The bread with olive oil and herbs (and ideally balsamic vinegar too) theirs was fresh and hot, you could tell it was the same they use for the crust of the pizza, but thats ok, at least they presented it3. My favorite is the quattro formaggi - they do theirs right, with italian cheeses (and a lot of them) i had them stuffed into a calzoni and they added basil leaves as well, which made it that much more delicious!Overall a great little gem in Crieve Hall, good for date night or lunch."], ["Dan W.", "Two for the food, zero for service. I arrived a few minutes before noon, there was only a handful of people inside and two waitresses. My order for a meatball sandwich was taken relatively quickly. By twenty past twelve I was ready to ditch this place. The sandwich finally got to my table about five minutes later. Great sandwich done right, meatballs sliced in half and layered thru the Italian bread. The sauce was tangy, the mozzarella melted, and the sweet pepper I requested was cooked perfect.I had to be at the Nashville airport so I had to search out my waitress to get my check. Figures, she was in back yappin with the other one. Of course, the other one gets busy and disappears when I show up. This place has very good Italian food and has been here for 22 years, I can't say I'll return because of the service.Danno"], ["Melissa B.", "I am so sad to have to leave a bad review for this restaurant. I have heard great things about it, but, experienced the opposite tonight. My father owns restaurants and has taught me the importance of supporting family owned businesses but tonight this one puts family owned businesses to shame.I liked the intimate atmosphere. It is dimly lit and is great for a nice date night. After waiting for a while after placing our order, we received our salad (iceberg lettuce, a slice of tomato, carrots) and breadsticks (breadsticks were pretty good!). At this point, we were underwhelmed but still anticipating an amazing meal.And when I say anticipating...we anticipated a great meal for 25 minutes before we actually received our food. I ordered the Ravioli (can't remember the name but had a cream sauce with chicken and mushrooms) and my husband ordered the chicken marsala. When I received my meal, it was luke warm - the cheese that was supposed to be melted on top was hard...I typically do not send food back but I could not handle the fact that it had clearly been sitting out so I graciously sent it back to be heated up, recooked-whatever. When I received it back (within 3 minutes) it was obvious that it had just been microwaved to a molten lava temperature causing the chicken's texture to literally resemble plastic. I had about 3 bites - I could not handle it (I am the LEAST picky person in the world - if I won't eat something, you know it's bad). My husband's chicken marsala was soup. The sauce was runny and flavorless. He had about 3 bites. The server asked us if we wanted to go boxes and we declined. She paid no attention to the fact that we were clearly unsatisfied. As I said, my father owns restaurants, I understand there are mistakes and no one is perfect. But, the thing that bothered me was that we were not taken care of by any means. No manager came out to apologize for the 25 minute delay in our food - let alone apologize that mine came out nearly cold. This is the attention to detail patrons go to family owned businesses for. Our bill was about $45 for 5 bites of terrible food and a sad feeling that this family owned business would treat their patrons this way."], ["Melissa B.", "Don't be fooled by the exterior. When you walk inside you are transported to a candlelit and intimate little Italian nook. It is simple yet romantic. The prices are extremely reasonable and its BYOB. They do charge a small corking fee. The servers have always been very nice and helpful when it comes to suggesting delicious menu items. I know a lot of people on here have mentioned slow service however that has never been a problem for me. These dishes are cooked to order though so that can slow it down a little more! I gave them 4 out of 5 stars because of their menu changes. I actually like their old menu much better. I have had a couple of dishes on the new menu that I didn't love. Their classics like their lasagna and manicotti are great. The seafood dishes I've had I didn't love. I noticed this time they've added some lighter pasta dishes that I look forward to trying. Their salads are always delicious as is their bread basket. This is definitely one of my favorite places in Nashville!"], ["Andy B.", "I would have given this place 5 stars because the meal was really good, we both had their chicken Marsala, the dish I judge every Italian restaurant by, and it was great, but I think they had one waitress for the whole restaurant. I never saw another one.  Granted it was Tuesday, but this poor girl brought us wine glasses, $5 cork fee which rocks, and my glass was dirty. She didnt remember to bring me a clean one til mid meal, but I don't blame her. She did everything else fantastically. Took our order without writing it down. Great food, good bread, nice meal, but if you are looking for one of those places where they have a guy in the corner with a pitcher scanning the room for half empty water glasses, this ain't it."], ["Melissa F.", "This place is adorable and a great date night spot. The food and service were great. From the location and outside wouldn't even know this was a gem in the rough! Plus it's BYOB!"]], "Amerigo": [], "Trattoria Il Mulino": [["Mariam A.", "Our brunch at Trattoria II Mulino was amazing last Sunday!  Our party of four was seated immediately on the spacious outdoor patio.  We ordered cocktails; they were all fantastic.  I ordered the lemon cucumber margarita, which was refreshing and well proportioned.  The waiter brought out beignets with a lemon curd butter that were out of the world.  I ordered the savory crepe special - scallops, shrimp, and crab in a creamy garlic pesto.  The portions were large, much to my surprise, and the flavors were incredible.   We were greeted with table side bread service, all of which are fresh and made in house.  It was a great experience and we will be back."], ["Lance B.", "Really excellent Calamari and Octopus. Don't get the Octopus if you don't like olives though. The dish is served with a really good sauce but plenty of olives in it. Great crispy pizza. Got the sausage with broccoli one. Did not have tomato sauce though, which should have been specified. Deserts were pretty good too.I don't drink, but apparently the wine list is extensive (so says my friend) The wines are in a really cool glass case when you walk in. Waiters were attentive and got all the orders right. The patio is awesome, with great people watching too.I'd definitely reccomend this place for italian in Nashville. There's not a lot of choices in town, and this is the best I've had."], ["Debianne P.", "We celebrated my birthday dinner and had a wonderful time.  The service (James) was amazing - very knowledgeable about the menu and the specific ingredients in each dish.  He made excellent suggestions and we enjoyed each one of his choices.  The food is made fresh from scratch and the portions are huge so be prepared to take some with you to enjoy the next day.  Excellent atmosphere and terrific staff.  If you do not want to eat there before an event, plan to stop in for one of their excellent desserts.  They also have an amazing wine list for those who are connoisseurs.  Highly recommend."], ["Lila W.", "Service is awesome here!   Food is awesome, but the service was better!  Jacob and derrick at the bar were the best l"], ["Terrie C.", "Wonder venue, great ambiance.  Food was absolutely wonderful and service impeccable!  Here in business and having dinner solo.  Perfect for that or for groups, as several of those around also appear to be enjoying."], ["Nick B.", "I'll start by saying I was incredibly excited to hear Nashville was getting this restaurant as the Las Vegas location was phenomenal. Unfortunately, they're light years apart. Service was poor. They were too slow to clean the table. We had empty drink glasses sitting in front of us for an hour. We both ordered specialty cocktails- The New Old Fashioned. It was not good. Had a strong lemon flavor that was kind of bitter and not becoming of an Old Fashioned. Stuck with wine the rest of the evening. I began my meal with the ricotta meatballs, which were fine. Nothing mindblowing but well portioned and tender. Girlfriend began with the \"special\" chicken cream soup, which was the most flavorful thing either of us had all night. On to entrees. I had the porcini ravioli. I remember having this exact dish three years ago in Las Vegas. It was one of the richest, most flavorful pasta dishes I've ever had. I was so excited to learn it was on the Nashville menu. Unfortunately, it lacked any finesse and all I could taste was greasy butter coating my throat. My girlfriend's entree was where things really went bad though. She had the capellini with Pecorino-Romano, pepper and pistachio. It  tasted like an obscenely overcooked wad of noodles sitting in the starchy broth in which it was boiled. I think she got about three bites deep.She finished with the lemon tiramisu which was actually pretty good. With other Italian options in the city like Moto and Cafe Nonna, this joint ain't long for the Nashville world."], ["Carolyn M.", "Good food.  Great atmosphere. Average service. Overpriced.  And they were out of Pinot Grigio on Saturday night.  How does that happen when a restaurant is brand new?"], ["Bridget C.", "The environment  was nice, but the food was sup par.  We ordered chicken parm to share, there was no side dish. The menu did not say a la cart. We ordered dessert to go, chocolate cake & cheese cake , we both took one bite & threw it away.  I would not recommend this restaurant,"], ["Deborah V.", "My friend and I had dinner here on July 19th.   We were excited as this restaurant had been highly recommended by the concierge at The Hermitage.  I had the beet salad, tomato basil soup and grilled octopus.  My friend has a fish entry.  The beet salad was more arugula and a very sad wilted arugula at that.  It was bland with very little flavor.  The beets were an afterthought ~ small slivers around the perimeter of the plate.  The tomato basil soup was also bland ~ like a tomato smoothie.  Both seafood dishes were overdone.  My friend's dish was served very hot, with the poor fish scaled underneath a heavy sauce.  Good news ~ the gelato and sorbetto were delicious!  But sadly, the main event was poorly executed.  The staff seemed sincere but frazzled that evening.  We had two servers and the female server who was a newer staff member seemed overwhelmed."], ["Cathy S.", "Trattoria Il Mulino is a  lovely restaurant that serves great food, but be aware, the \"Waitress Nazi\" our table encountered was condescending and assaultive. When asked about the house wine, a five minute lecture on vino followed, with the house Pinot Noir described as \"dirt\" and the house Merlot was described as \"fruitful.\" The problem? Starting off an evening of \"fine\" dining feeling ignorant and scolded doesn't lend to the ambience of the restaurant. Now I admit readily, I am not a sommelier. But I also sheepishly admit that I have sipped a glass of wine...or two. I enjoy a fruity Merlot and I love my \"dirty, dirty\" Pinot Noir. So a tongue lashing in front of a table of eight was more than uncalled for. To round out the picture, my friend also got a scolding for asking about the menu. No lecture. But a scolding she \"did got.\" As for the menu, the food at Trattoria Il Mulino was nice. The pizza's are plentiful, as are the bowls of pasta. The calamari was beautiful, the sausage pizza was delicious and the rigatoni was perfection. We didn't linger for dessert. The food was too ample. My best advice for dining at Trattoria Il Mulino? Spending over fifty dollars a person for a humiliating tongue lashing by the \"Waitress Nazi\", even for food that is great, just isn't worth it. So if you are planning to dine at Trattoria Il Mulino in the future, refer to the review of Trip Advisor's \"NashvilleGal2011z' and ask for server Jason. I know, if we return, he will have our business."], ["Petie D.", "Hope you do better, great location."], ["Suan R.", "Wow. Hard to find a good Italian restaurant here. This exceeds hopes. Great food. Knowledgeable server! Great ambience. Can't ask for more."], ["Gabrielle M.", "I can honestly tell you that the service from the wait staff and management is absolutely awesome! My group and I were running a little late due to traffic and they were so kind to allow us to push back our reservation to save our table for us! I was in town attending a conference for work and happened to be traveling with a coworker of mine that has certain food allergies beyond the typical gluten allergy. Our waiters (Clayton & Derek, I believe) were so wonderful to check with the chef for certain plates and make adjustments as needed. The atmosphere was very nice and intimate. Everything we ordered from the calamari to the spaghettini with the spicy crab and the limoncello tiramisu were absolutely heavenly! I would suggest reserving a table ahead of time since it's right off from the busy street of Broadway and across from the Bridgestone Arena. We had a great experience and will definitely be back during future trips!!"], ["Jessica V.", "So fantastic! I stopped in with my brother to have cocktails at the bar and the experience was so great that we returned the next night for dinner. The menu is extensive and interesting for an Italian restaurant. We ordered 2 appetizers and 2 different dinner specials along with drinks and dessert. We arrived a bit before the standard dinner rush, so the chef prepared some special starters for our table that were't on the menu, simply to try - they were great! They serve serve small garlic breadsticks before dinner, which were tasty. Our meals were exceptional, especially the seafood. My only compliant is that the pizza was a bit salty and greasy for my liking (traditional Italian pizza never has oil over the top), but it was still good and definitely prepared with fresh ingredients and real mozzarella. We ate it all, so I really can't complain. The dessert and Italian coffee was the best part - so fantastic!"], ["Thomas M.", "Food was excellent as was service.  The sports bar atmosphere is distracting for a fine dining restaurant!!!!"], ["Gary G.", "Had dinner for four last night , dinner was very good, pasta was freshly made and helpings were large, the drinks were superb and high quality , service was fast and attentive to our needs, highly recommended"], ["Aimee K.", "My family and I went to the Trattoria Il Mulino this week and let me just say...amazing!We had the fried calamari to start which didn't last long because we gobbled it so quickly-yummy!My son had the meatball sub. It's a big sandwich with 3 meatballs and he said that it tasted better than anything similar he'd ever had by far! I got the gnocchi and I couldn't believe how wonderfully it was made...it was like my grandmother used to make (I'm italian so I know what good italian is) plus since it was so filling, I took some home-which was still awesome later! My husband had the veal piccata and was simply blown away...he's had my grandmother's cooking before we were married years ago and I just about slapped him when he said it was just as good if not better than hers.As full as we were, we stuffed in the limoncello tiramisu and by good were we glad we did.Props to the chef and kitchen staff for competing with my tongue for Italian food that I grew up on and was made sure to know how to be a huge critic about.The atmosphere alone was incredible. With a large restaurant you normally don't get the feeling of privacy we experienced, and the attitude of the hosts and staff made us feel so welcome. Both the extensive wine list and display were very impressive, and we were greatly pleased with our cabernet and merlot. The servers were attentive, offered helpful suggestions and just made our time wonderful.So...If you haven't gone yet, definitely do make a trip! We made reservations and are probably a good idea for such a nice place like this. Bring your appetite so you can enjoy all the good food too. I know you'll leave happy and wanting to return. I know we will!"], ["Kathy W.", "My friend and I had a fantastic evening. Our waiter,Seth was extremely attentive and very helpful. The food was wonderful and portions very large. The sommelier recommended Roero Arneis wine which was fantastic (and will be added to my personal wine cellar).  The manager was very helpful and stopped by several times to ask about our meal and service and walked us out of the restaurant. I would highly recommend this restaurant."]], "Italia Pizza & Pasta": [], "Moto Cucina + Enoteca": [["Bill H.", "Hard to believe others rate this restaurant so highly. Had a group of 4 people and 2 of the 4 pasta dishes were over cooked. Had wagyu ragu (rigatoni was soft & mushy and had to be sent back), black pasta (pasta was generally overcooked but edible), stroganoff (noodles were ok), and another pasta dish with a meat sauce that wasn't supposed to be spicy, but was.  The manager apologized and said the chef agreed about the overcooked rigatoni.  Ended up comping my meal and offering free dessert. Got tiramisu and chocolate mousse cake. Tiramisu was some of best we've had, and chocolate mousse was good too.  Wait staff was good and fairly helpful, but disappeared except for delivering check after my meal was sent back."], ["brice b.", "Nice atmosphere and very good service. The menu is very impressive and creates the anticipation of an authentic Italian meal but unfortunately that where it stops. This place is about the same as most places in middle America trying to pretend to be something they are not. The food at Moto is incredibly salty and every dish I had was covered in garlic to a point you could not even identify the food you were supposed to be enjoying. It's a sad but true realism that few Italian cooks outside of large cities in the US have the skills and courage to just cook good food with simple ingredients. Great Italian food is so pure to the ingredients and simplicity of the dish and unfortunately most restauranteurs completely miss the mark with bad renditions of simple foods.  I really wish more people would travel outside the U.S. because they would likely learn that food can be amazing and not just filling."], ["Mandy C.", "I'm lovin it! Having just returned from Florence, I was craving some authentic Italian cuisine and had wanted to check this place out for awhile.  It was a great choice and I'd like to return at a point when my budget will allow (don't get me wrong- the value is on point here).1. Professional and great service 2. Blueberry lasagna has intricate flavors. The mushrooms are amazing!  I would suggest having a bite of someone's.3. Black spaghetti w/ lobster and peppers was out of this world! Be prepared for spice! And I'm for real, this dish shook it. This is what I would order as an entree next time.4. Nice wine selection (they even have a limoncello martini).5. Prosciutto crostino I loved every bit of it!  Their menu is wonderful.  The cuisine really brought me back to Italian cooking with the freshest of ingredients.Grazie!"], ["Nicki R.", "This has become one of my favorite restaurants in town! The atmosphere is hip but warm and the service has always been top notch. We have been with large groups, with our children and for date nights and I can honestly say that Moto is great for all three! They have a spectacular wine list and their menu is fantastic!My favorite dishes include:The prosciutto crostino The Wagyu Beef & buffalo mozzarella meatball (with spaghetti)The Black Peppar TagliatelleThe Wagyu FiletTiramisu"], ["Evan W.", "- \"I'm in love with the MOTO\" -Happened to find this gem through its proximity to whiskey kitchen and saint anejo. (Same block)After reading through the menu the Braised Lamb shank caught my eye!The bartender was professional , kind, and attentive.The shank was tender (no knife needed), the wine sauce was incredible / flavorful,and the cuscus was a nice addition.The atmosphere was a little fancier than I had expected but I did not feel out of place.Great spot for a date or to grab drinks after work. I will be back!"], ["Alicia M.", "Wow....amazing.Pros:Wagyu 6 Oz - if you've never tried this before and you love steak....try it. It's amazing.Roasted potatoes - some sort of cheese and truffle oil...delicious! Brussel sprouts - so good...insane.Riesling by the glass - perfect with my meal. I can't drink red wines.New peach sorbet, meringue, peach cream dessert - ridiculously good!!!Server: Travis  - the BEST!  Knowledgeable about the menu but also smart enough to confirm. I have a lot of allergies so I appreciated this!Cons:I just ate too much....my fault not theirs!"], ["Brien W.", "Had a great meal  on fathers day, third time dining here and it just keeps getting better. Had a few great appetizers, pizza, and 2 meatballs (pork and waygu) both delicious. Split 3 entrees among 4, waygu steak, veal chop and gnocci. with sides of Brussels sprouts and white cannelloni beans. They were able to portion it out in the kitchen so very civilized. Reminds me of a new age Palm w better food."], ["Paige F.", "This place is great. The inside of this restaurant is beautiful. I have been here once for dinner and once just for drinks at the bar.  Both times, the service was great.  The staff is very friendly from the hosts to the bartenders to the servers.  The Sangria and Bellini are delicious. I came here with friends, and everyone enjoyed their meals.  I had the gnocchi, and it was outstanding."], ["Chris L.", "WtfOnly the bread was good!4 cheese pizza smelled like feet.Black spaghetti smelled like vomit.I kid you not!"], ["Paul D.", "My fiancé and I went to Moto on a blind first date over a year ago and returned last night to celebrate one last time before our wedding next weekend. Managers Matt Hosman and Tristan Snyder too incredible care of us.. as did our server, DeLorean. We shared the calamari, black spaghetti and the duroc porchetta- all was super tasty and made for really fun, memorable dinner. The staff worked as a team and took great care of us.. made sure it was a very special evening. THANK YOU!!!!"], ["Melissa B.", "We had reservations on a Saturday night and we were seated immediately. The servers were phenomenal! They know the menu inside and out and are great at helping you make decisions based on what you like. Our glasses never went below 3/4 full and they paced our meal out perfectly! They were completely on point! The food was equally as good! The garganelli and blueberry lasagna are delicious and the polenta fries are out of this world. It was such a great experience! We will definitely be back."], ["Megan K.", "Elaborate menu, great for the adventurous foodie.A little pricey, considering it's pasta... I had the black pepper tagliatelle, which was really good. Very trendy vibe, but decent service. I enjoyed it, but am not racing to go back."], ["Margaret F.", "Reservations really are recommended - my friend and I visited on a Tuesday night without a reservation, and had to eat at the bar (which wasn't really a hardship, just a bit noisy and space constrained).There is a good variety of wines by the glass. It was too dark for me to read the wine list, but a huge chalkboard above the bar helped me make a selection!My friend ordered the black spaghetti; I had the spinach fettuccine. We split an order of brussels sprouts. We were served some spongy white bread while our dinner was prepared. My friend reported that the black spaghetti was delicious - particularly after she tipped her plate to drain off a full quarter cup of oil(!). The fettuccine was also very tasty, if a little \"melted\" texture-wise. The brussels sprouts were very salty.Service was friendly, and since we were sitting at the bar, all we had to do was flag down the bartender if we needed something.I felt the prices were reasonable. The dinner described above, plus 3 glasses of wine, came to a total of $55. The non-pasta entrees were priced higher, but looked very good.I will go back to Moto, but next time I'll make a reservation...I think that, armed with this first-time experience (and reading other reviews), I can turn this into a 4- or 5-star experience."], ["Bridget H.", "What I liked:1. Gnocchi with apple was very light, unexpected and delicious!  I would return for this disk.2. Open bar seating for walk-ins made it possible to eat dinner during prime time and a sold out restaurant3. The bartender was very attentive and provided great service, made us feel like valued guestWhat I didn't like:1.  Overly trendy vibe, definitely a see and be seen crowd2. The pork meatball wasn't my favorite - a little too greasy and lacked flavor3. Asparagus with egg- usually one of my favorites, but the asparagus was a little too soggy for my tasteOverall Verdict: Worth trying, but not high on my list as a local, feels like it's trying a little too hard and not the best, authentic Italian.  I would say it's a good option for grabbing a quick bite at the bar with a glass of wine after work- try the gnocchi!  If you're looking for amazing pasta, would say to try Rolf and Daughters"], ["Lisette M.", "Visiting for work and came to try the black spaghetti,  amazing,  order it,  trust me it was delicious.  I will be back next time in in town."], ["l k.", "The in-laws took us out for a belated birthday dinner and it was great...can't wait to go back and sample some more of their menu.  We had the wagyu beef meatballs to start--totally delish. Based on all the positive Yelp reviews/the waiter's recommendation I had to try the blueberry lasagna and it was pretty good/interesting. The brussels sprouts were really good. Someone in our party ordered the wagyu steak and we all agreed it was the absolute best steak we'd ever had--perfection. A solid experience from start to finish -- we'll be back."], ["Tina H.", "Excellent meal and service!!  We had carpaccio, roasted lamb, and prawns, as well as the chocolate mousse cake.  All of our food and wine was amazing!  Our server also gave us great tips on where else to go off the beaten path of Broadway.  I will definitely be back when I am in town next."], ["Lauren W.", "Last night I was invited to a special dinner at Moto Cucina and Enoteca, the newest venture from the folks over at M. Street First off I have to say that their execute chef Andy Hayes is top notch. Hhe trained at one of my all time favorite restaurants, Gramercy Tavern in New York. M. Street snapped up a good one!The inside of Moto is simply beautiful. Everything has clean lines, warm tones and soft lighting. They paid very close attention to every detail, including the inlaid patterns on the bar. They even have a rock bed open fireplace and a glass wine cellar. I sat at a booth and the booth seats were very comfortable, possibly the most comfortable booth I've ever sat in.To start off, the kitchen sent out four appetizers for all of us to sample. The first one out was duck fat olives. These were served warm with whole garlic cloves and orange zest. They were delicious, but anything covered in duck fat is delicious. I loved the temperature of the olives- just barely warm and very nice on the tongue.Next up was the pork cheek terrine with crispy pig ears. When we asked how this was made Chef Andy told us it was made with the whole head of the pig, and not just any pig, but a pig from Porter Road Butcher. It's good to know Moto gets their pigs whole from my favorite local butcher shop. This gets at least +10 awesome points. The terrine was creamy and spread easily on the crustini. I only wish they had more pig ears added for crunch; pig ears are always such a treat.Next up was the deep fried Apalachicola oysters with peperonata and preserved fennel. The topping reminded me of a lightly spiced chow-chow and added a really nice vinegar flavor to the fried oyster. Even someone at my table who said they don't enjoy oysters loved these!The last appetizer was the raw winter salad featuring shaved beets. I'm always skeptical of raw salads considering I've had a fair few that were disappointing, but this dish was simply divine. The vegetables were sliced so thin that they almost melted in your mouth. Add to that simple seasoning and blue cheese and you have yourself a winning raw salad. We were served two different pizzas: The porchetta and kale pesto with mozzarella, and the mushroom and black truffles with fontina. The mushroom pizza had a woodsy flavor that was enhanced by the sweetness of the shaved truffles. My favorite was the kale pesto slice, even though it was a tad bit too oily for me.First up was the gnocchi with crispy salsify and green apple in fonduta. This sauce was rich and paired well with the fresh crisp apple. The gnocchi themselves were light and pillowy and had a bouncy mouth texture. My favorite part was the crispy salsify, something I never tasted prepared in that fashion before.The next pasta was the black spaghetti with lobster and calabrian chilies. The squid ink pasta was thick and al dente with that sea flavor that makes black pasta so enjoyable. The lobster flavor was mild but the chilies added a nice kick.Chef Andy Hayes was nice enough to bring out a plate of their nightly pasta special.  The special was a sea urchin and scallop spaghetti in a light lemon cream sauce. This was far and away my favorite pasta dish. The sea urchin on top was so beautiful it brought tears of joy to my eyes and made this my favorite version of urchin that wasn't sushi-style!They brought out the main entree of chicken saltimbocca with sides of brussels sprouts and roasted potatoes. Unfortunately I found the chicken the most un-interesting dish of the evening. Compared to everything else it was just kind of \"meh.\" It was well-cooked, don't get me wrong, but it didn't blow my socks off (mind you I don't normally order chicken at restaurants because on my personal hierarchy of meats, it's on the bottom).The side dishes were so good that they totally overshadowed the chicken. The brussels sprouts were served crispy with panchetta and apple agrodolce. If you dine at Moto you must order the brussels sprouts, YOU MUST. The potatoes were nicely roasted with sun chokes, black truffle and some taleggio cheese. There was just a small amount of cheese, but it was so nice that I wish that they'd smothered the potatoes in it. We had two desserts. Gluttony, Ahoy! First was a Meyer lemon bundino (custard) with pistachio biscotti and a semolina shortbread. The custard was very light and fluffy.  The final dessert was the Moto take on chocolate tiramisu. It was made with amaretto gelee, chocolate cake and mascarpone mousse and a cookie crumble. T'll fully admit that I was spoiled at Moto. We had tons of amazing food, gracious and prompt service and our fill of red wine. I was very impressed with all of the food and how well-executed the event was. ** While I was provided this dinner gratis, all the opinions are honest and my own.**"], ["Ashley W.", "By far the best restaurant I ate at while visiting Nashville. From the time I walked in, the friendly staff was very accommodating. But the food...I'm still dreaming about it. Let's start with the focaccia bread. I don't think I could get it in my mouth fast enough. It was the right bit of salty and savory. We ordered the calamari and Waygu Beef meatball to start. I had never eaten Waygu beef before but I never want to not eat it again. Just phenomenal. I ordered the gnocchi and it was quite honestly the best I ever had. One of the girls I was with originally ordered the manicotti but our waitress told us it would take longer than expected. So she ordered something else. Well when the manicotti was finished, Chef Luke himself brought it out and apologized. We were blown away! Overall, it was an amazing experience and we left in a food coma. Loved everything from the atmosphere, to the wait staff, to Chef Luke, and to, of course, the incredible food. Go here, now!"], ["Becky Y.", "Moto is now on our \"go to\" list! We had a delightful evening of excellence - both food and service. Our party of 4 shared lots of plates and I loved getting to try so many new flavors. Inventive cocktails are becoming standard for the Nashville restaurant scene and ours did not disappoint. The appetizer that really stood out for us was the grilled artichokes - flavorful, tender but not mushy. The wagyu beef meatball finished a close second. The bread is amazing and I strongly suggest the olive oil flight to accompany it. Two pastas are worth mentioning: spinach fettuccine with lamb and the black spaghetti. Both were perfectly cooked and full of interesting and satisfying flavors. Surprisingly reasonably priced in the ever-competitive Gulch and smack dab in the middle of the insanity that befits M Street row, Moto shines as a cut above."]], "Five Points Pizza": [], "Demos' Restaurant": [["Jeff P.", "When we walked in we noticed a thick crowd. That didn't stop the bartender from serving us our drinks quickly as we waited a few minutes for a table. The restaurant seemed clean tidy and in order, the staff was friendly and welcoming.  Our server suggested that we order a Greek side salad which was really good. All the ingredients are fresh and the dressing was tasty my wife even got anchovies which she was surprised that she loved! We ordered a loaded baked potato with white cream sauce and chicken it was DIVINE. Also Lasagna which was very good.  Our check was very reasonable and we enjoyed the well versed staff. I feel comfortable recommending anyone in the area to check them out!"], ["Aa A.", "Carry out is simply amazing here. Big pans of food which is perfect for entertaining or taking a meal to a friend. It's a pre holiday tradition. Just wish there was one in cool springs!! Hint........"], ["Kat H.", "Went here past wkend for lunch with some girlfriends from Chicago, ordered the nachos to start with, and I don't know whose kid is in the back cause seriously looked like a 7 year old just grabbed cheap quality tortilla chips, chili beans, chicken, American cheese threw it in the microwave for 15 seconds and topped with sour cream. It was so gross, now that I am writing this review wish we took a pic of how sad it was but at the time didn't think it was picture worthy. I ordered the chicken Santa fe with zucchini and side of salad... the chicken and zucchini were ok, nothing amazing, was quite bland but edible so hey there's that, the 7 year old chef can cook chicken so props to u. My other friends ordered the pepper steak and the other ordered the chicken fettuccine, they both had similar reactions. The only thing that had flavor was the free bread. The star is simply for our waitress who was attentive to our table. Basically don't recommend at all, no flavor, no quality, save your money."], ["Jim H.", "When Jen told me we were going to Nashville TN for my birthday,  this was first choice.   Excellent food and outstanding service.   We both had steaks and they were excellent.   Cheese toast as an appetizers and was outstanding.   Been here 4 or 5 times always and excellent experience."], ["Nathan P.", "I have been visiting Demo's almost every time I come to Nashville for the past 11 years. I travel frequently for work, and am here a couple times a year at least. I'm usually dining alone, and usually because of my work schedule I am stopping in during non-peak times, between 2-5 pm for a late lunch/early dinner before running off to the airport. I read some other reviews here and was surprised to see how many people didn't like it. Maybe they aren't ordering what I do. But I've always found the service fabulous for a casual restaurant. There's a guy named Sully who's a waiter here who is one of the best I've ever had. Everyone is friendly, and my food always comes out super-fast. Here's what I order:Top sirloin (pick your size) - and yes they can manage to cool it medium+!Skip the salad, get the soup. Protip: put a couple forks full of the park cheese in your soul and stir it up. I also have them add the fresh pepper.  Then also use it to dip your bread in.  And that break, ahh, wonderful!Then get it with a spaghetti as a side. I actually always order a second side of a different flavor, because I have a big appetite. Another pro-tip: they will add mushrooms to the Brown Butter Garlic sauce for free!That's pretty much all I always order.  My service is always great and very prompt, and my steak is always perfectly seared and cooked.  And the price is so good I feel like I'm stealing."], ["Jean K.", "Oh, sweet Brown Butter Garlic Sauce. Get over here. You alone are worth 5 shining stars but the fast, friendly service that brought you to me gets 5 stars, too. And, the sample plate of bread with 5 sauces for newbies? Well, that gets 5 stars. But, wait. The tiny bill for such a delicious meal served up with some real southern hospitality deserves another 5 stars. Unbeatable value. Sweet Brown Butter Garlic Sauce, I think I love you."], ["Hope D.", "If I wanted to eat diarrhea, I'd go to Taco Bell.This place has the largest menu of shit I've ever seen. So many options of culinary excrement to choose from. Seriously, the food is extremely bland. It was like everything I ordered tasted exactly the same...which is bad.Stays in business because back in the day there were very few options to choose from, now old people crowd the place because it's \"tradition\" for them, and tourists go here because they don't know any better."], ["Crystal O.", "We ate dinner here while on our vacation and it was fantastic. I eat at the restaurant each time that I visit downtown Nashville Tn. They have a huge menu and the prices are great. They have great chicken and rice soup and my favorite entree is the seafood alfredo. Our waiter suggested the Resses dessert and it was great! I was recommend that everyone try this restaurant while visiting downtown Nashville."], ["Brett H.", "So I was really interested in this place due to their spaghetti sampler with their different sauces. I'm a big fan of sauces. The ones I had were ok. The one with the blacken chicken was great. The brown butter was meh and the meat sauce was also meh. The girl behind the bar was a bit cooky for me."], ["Will H.", "Pretty good for cheap eats. I ordered the steak and it was very well seasoned and cooked to perfection.  The atmosphere leaves a lot to be desired, however the wait staff made extra efforts to be friendly and provide goos service.  I did however notice a lot of young kids standing around trying to look busy, but weren't.  I server was fairly new to the restaurant business and it showed, but she still gets an A for effort.I would definatley go here again the next time I'm in Nashville."], ["Kenyatta W.", "Four stars because our Server , Austin was fantastic. He actually made the evening delightful.  Some people have a knack for customer service, and putting people at ease, and also being funny; without being over-the-top. Austin has that gift.As for the food it was average bordering on good. The atmosphere was nice, warm intimate and I could tell that people really enjoyed being there. The rib eye was tasty, well seasoned, very nice portion. My lasagna was okay not bad not good and I probably wouldn't order it again. The rolls were a light and fluffy and had a very nice flavor. I also had the chicken rice soup; it was nice light and not to filling. I wouldn't necessarily make a special trip back unless I wanted to enjoy the company of Austin.Give it a try. It's an experience. And the prices and portions are a phenomenal value."], ["Mike R.", "Price wasn't a factor when we entered, but it made up for the 12\" hair on my steak, steak was cooked well and the pasta was fine. A pitiful wine selection, and out of three or four of them. Service was adequate and friendly. Would not return, not bad, just nothing memorable."], ["Holly G.", "My boyfriend and I had some friends in town over the weekend, and they wanted to hit up Broadway (naturally) so we decided to come to Demos before. I had heard a mixed bag of things about this place beforehand, so I went in fairly optimistic. It was around 7:00 on a Friday night, so it was fairly busy and we had to wait about 20-25 minutes before a table was ready. Not terrible.I wanted to give this place a better review, but 2 stars means \"meh\" and that's kind of how I felt about the whole thing. The one thing that was above average was the service. Our server was excellent, super nice, checked in just the right amount of times, seemed knowledgeable. Overall, no complaints there.The drink I got from the bar (something with cranberry and vodka) was pretty good, but it's kinda hard to mess that up. The bread they bring out beforehand is actually pretty good. Definitely high on the butter scale, but hey, butter makes everything better. At least Paula Deen thinks so.I opted to go with the Bacon Wrapped Filet (not filet mignon of course) with grilled zucchini and added grilled mushrooms and onions to the steak. The salad they bring out before the meal is basically the bagged stuff you buy at the store. Hmm.Let me say that this place does not have a shortage of butter. Everything with my entree was soaked in it. Listen, I love butter as much as the next person. But, I kinda don't want a heart attack before I turn 30. If I do ever come back, that's definitely something I will mention beforehand... The steak was slightly underdone (I got medium rare) but nothing crazy, and not enough for me to send it back.This place is just meh. The food is just alright, but the prices are really good. Between my boyfriend and I, we spent about $40 before tip. And that was with my $9 cocktail and a $4 beer. So $27 for both of our meals. Not bad at all. Just wish the quality was a little bit better for the price."], ["Kathy J.", "Read the reviews and decided this was the place for us.  (We were planning to hit Broad Street after dinner, hence something a little heavier than usual into the tummies!).Our experience was wonderful.  We sat at the bar and had the best service from Leanne and Lexi that we have had in years.Food and drinks were great.My husband had the pork chop special, loved it!  I had the two topping spaghetti, wonderful.  Small, but good salads come with the meal.   Did I mention the bread, warm, fresh, excellent.Now that we have extended our visit to Nashville, we will definitely be returning."], ["Eric W.", "Fantastic for large groups.  They accommodated 18 of us in just 15 minutes without the call ahead RSVP.  Great value and portion sizes.  Disappointed in the steaks - the filet cuts were cooked to order, but the KC strips and Ribeyes were cooked to medium/medium well  and ordered as Medium Rare.  Recommend go for the pasta and amazing garlic bread."], ["Edith K.", "After hearing many reviews about how \"amazing\" this place was we decided to try it out tonight.... let's just say, we were far from impressed.The one good thing was that we were seated as soon as we walked in the door, we somehow beat the crowd. Although, it did take a bit before our order was actually taken. I ordered the lasagna, my husband got the Cajun chicken sandwich, my daughter ordered the all you can eat soup of the children's menu. I was highly disappointed with the lasagna. It didn't seem fresh, the mozzarella wasn't even \"melty\", it tasted very much like day old lasagna that had just been sitting there. Very, very bland. I make MUCH better lasagna at home. My husband stated his chicken sandwich was dry, not to mention the half a bar of butter they placed on his, not very hot, baked potato. The one person to walk away, happy with their meal, was my little girl. She totally dug the baked chicken soup.We do not plan on going back, and I probably won't suggest it to anyone else. I don't know if we went on an \"off\" night or what, but we were disappointed. Not too sure what all the hype's about...."], ["angela l.", "Chicken salad was kind of over- killed. Chicken rice soup was pretty good. Great Service kind of made up for the disappointment in food though."], ["Kendall B.", "I really wanted to like this place because the people there are so nice but I just didn't.  The prices are great and so are the rolls. Meatball app is very good as well. We had blackened chicken pasta and lasagna.  The pasta just didn't taste good and the lasagna was stone cold. I suspect the lasagna had been microwaved. Skip this place for sure."], ["Danny N.", "Giving Demos' four starts for two reasons.  If you are downtown they get you in and out quickly even if it's super crowded.  Secondly the food is pretty cheap with meals being around $10.  The food is good.  The food is about a 7/10, but based on the price and location it's a good choice."], ["Shawn P.", "Nothing fancy - a delicious 12 oz sirloin at a reasonable price. Spaghetti on the side is a surprising touch. Eschewed a table to sit at the bar - service was fantastic. Total cost - $20."]]}