{"Fattoush Cafe": [["Autumn M.", "I love this place! Food and service is awesome!! I go and get sandwiches there, & I usually get a dessert. If I've never tried the dessert, Mr. Fattoush will usually give me the dessert dish complimentary. I have recommended this place to all my coworkers and friends and will continue to do so. I look forward to my lunch everyday when I work across the street from this eatery. :)"], ["Hui C.", "I used to love coming here in high school for the $5 beef/chicken gyro pockets with fries, which were a great deal and super delicious. But coming back here as a vegetarian was disappointing, to say the least. The falafel sandwich had four falafel balls in if - generous, lots of salad in there as well, but it was under filled for the pita they put it in. Something about the normal tzatziki sauce was terribly bitter and sour and off putting as well, so I couldn't finish it and had to separate the pita from the falafel. I'm not sure if this is a onetime issue or if it's a general issue with their normal tzatziki - I've never had sauce that was bitter/sour before. I only paid $5, which made it less disappointing, but I wish I had been able to have some semblance of a lunch."], ["Pat S.", "Good place for Greek fast food!! Had Greek salad with chicken. Good flavored and enough for two meals. Will definitely go back if I'm in Nashville."], ["Tim S.", "I just like saying \"Fattoush\" - although I pronounce it \"fat tush\" because I'm a jerk.  Killer food here!  The interior is nicer than the pictures make it look.  Serious crowd of fans around lunch so get there no later than 11:30.The chicken is absolutely fantastic, the gyro meat is very flavorful but not too far a leap from normal gyro meat.  Rice had good flavor but was too spongy and wet and the pitas tasted average and were from a plastic bag.  I'm anxious to go back and try the shwarma and potatoes and other dishes, I feel like, sides notwithstanding, I grabbed the \"normal\" stuff and didn't get to the secret awesomeness.  Oh yeah he has a spicy version of the tzatziki sauce; what was I saying about tzatziki needing to have a bit of a kick?"], ["Whitney L.", "I had the beef gryo. They had very fast service!"], ["Sean J.", "Very tasty food, and good service and prices. We typically get gyro and fries with some baklava to go. If you're in the mood for some fast and good Greek food, this is a good choice."], ["Anna G.", "This place is awesome and definitely deserves more love than it's getting here on Yelp. I've been several times and while it IS kinda dive-y and a bit understaffed/slow, bottom line is the food is really good, the portions are huge (and very reasonably priced) and the service is friendly. It's the only place I know of in Nashville that even has chicken shawarma which is a big deal in and of itself. (Not to say there aren't other options, but I've yet to find any and trust me, I've looked.) I learned a long time ago to not judge restaurants by their exteriors/trimmings; sometimes the best meals come from the places you'd least expect."], ["Sheena T.", "The food here is really amazing, but be prepared to wait. My BF turned me onto the chicken hummus plate, and it's spectacular. The hummus is SO smooth and has a great flavor, and they add a good amount of toppings as well. I'd definitely recommend getting the chicken because the flavor is incredible. This is definitely a no frills place, besides a menu on the wall and counter, there's nothing else besides tables inside. But that's not super important to me because the food is very reasonably priced and tastes great. BUT the services is painfully slow. We came in during a lunch rush and waited for over 20 minutes for our food, but even coming in at night its slow. Part of this is because it is made to order for the most part, but during the lunch rush could you please hire someone to help you? The owner gave me a free drink for waiting, but I was unable to savor my food since I had to scarf it down in the car. I noticed some people had called in orders and that helped somewhat on wait time. Great place, try the hummus!"], ["Chris F.", "I got the Greek Salad with beef on top. The salad was huge! The meat was delicious and the portion of it was massive. The veggies were fresh and the dressing was on point. Very reasonable price too. I'll be back ASAP."], ["Gregory S.", "Do not order delivery from this restaurant! It took over 2 hours for them to deliver. 4 items were missing from my order. The delivery person and I had 4 conversations about how to get to my apartment, yet I still had to meet him in the street. After everything the restaurant wouldn't answer the phone. The food was also mediocre at best."], ["Katie S.", "The gyros here are absolutely delicious! No wonder this place is packed. If you go during lunch on a weekday, expect a wait. The only negative is the uncomfortable parking, but the food is totally worth it."], ["A B.", "Authentic, delicious Mediterranean cuisine. The atmosphere is humble and the crew are true to the delicacy of cooking the colorful menu- couldn't rave enough!"], ["Debbie P.", "The Food is great, very fresh & lots of it! Enjoy several choices of dishes today! Great Family Restaurant & convenient location!"], ["Anna Y.", "Tasty and inexpensive. The ingredients are good quality, and when you order they make it for you (cook - to - order) , which is great, and also this is why the wait might be longer than average, especially during lunch. They might use the help of another person on site during lunch/rush hour. I think it's a good deal for money, and healthy."], ["Bridget O.", "Get there early or there will be a wait. There is a reason for this. The Food is great, the prices are awesome and the portion size is huge. Never disappointed."], ["Corey W.", "So I didn't actually eat at the Restaurant itself but rather the stand they had set up at the Earth Day festival. I like Mediterranean fare or whatever passes for it in Nashville. I really couldn't comment on the authenticity of what they serve but I love love love Gyros and theirs were up to par. No memorable but I would not mind going back for lunch sometime. One of my Coworkers has brought lunch back from here a couple of times and the portions always seem large. More than enough to satisfy someone for a weekday lunch with some leftover.Prices seemed a but high for what you get but I'm wondering if that is because it was event/Fair food?All and all, swing by and give it a try, you won't be blown away but you'll enjoy it."], ["Darlene O.", "This is the reason why I eat Mediterranean/Greek food. I love their taboulleh and I always get a chicken gyro sandwich with hummus, taboulleh and ketchup. Sounds strange but it tastes really REALLY good! The chicken is juicy and I believe they use dark meat which makes it taste better. I love their fries too! Their fries aren't the shoe-string golden yellow fries like McDonald's or wedge cut like at a steakhouse. They are reddish orange medium sized fries (think Arby's but not curly). It is well seasoned and comes made to order so you get them hot. They do get packed especially during the lunch hour but it is worth it. They also have really good falafel. I tried it for the first time here and I really liked it. Well seasoned and all the herbs and spices gave the falafel an overall rich taste."], ["Vanessa T.", "Loved how clean and precise the food was.   Good portions  for your dollar. Chicken is amazing with the special spicy sauce."], ["Marcus H.", "Average food. But the wait is awful. Had 4 people in front of me and it took 30 mins to get my food!"], ["Lila T.", "Don't confuse this place with the one down the street next to Subway. This place is right on the intersection with 18th, across from Krystal. Great food. I get the Beef Gyro combo - pita sandwich with seasoned fries or the Beef Gyro salad. They also do Chicken Gyros. May not be the fastest but there are worse. It is my pleasure to give my business where the Owner is there everyday and prepares the food himself with appreciation to his customers. Nothing fancy but good food and large TV. Usually it's CNN but today it was the World Cup!"], ["Benjamin H.", "Great food.  The wait can be a bit tricky, but Fattoush has some of the best falafel in Nashville."], ["Sarah B.", "My office is quite literally three doors down from this place, so I have popped in for a Greek Meat Salad or hummus plate several times over the years.  Been known to have a quick meeting there, too, as you can usually score a table for four and hear yourselves unless you are there at straight up noon.The Meat Salad is quite delicious, and absolutely uber-generous.  I've never seen anyone eat the whole thing for lunch - and it stores quite nicely in the office frig for dinner.The owners are quite nice and speak fairly good English, the food overall is typical fast Greek... if you like lamb shaved off a skewer, you're good.Some of my co-workers claim Fattoush is too greasy, and they opt for the very generically named Greek place just down Charlotte from here... so generic, I totally can't think of the name.  But it's the one that shares the parking lot with Subway.I personally have never ventured the ten doors down for that one when I'm happy with my right turn up three doors from Fattoush.And better still, this is yet another example of being able to support the independent small business owners of Middle Tennessee."], ["Jim C.", "Very casual place nothing fancy but if you want great Greek Food and super service this is your place! Prices are fantastic portions are huge and the owner is friendliest guy you will ever meet.The Combo plate is awesome! A must go to if you like Greek Food! I travel on business often and try Greek Food all over the country and this place is probably top when it comes to the food quality. Been to fancier places that had less quality food. LOVE THIS PLACE!!!"], ["Peter K.", "The food here is pretty standard Middle Eastern/Mediterranean, nothing mind blowing, but nothing horrible.  It gets fairly packed during lunch with the hospital and downtown crowd.  $5 gets you a loaded beef/lamb gyro packed in a pita, with an added touch of tabouli that you don't see in most gyros.  Overall, the food isn't terribly impressive, but I would be willing to try again and get some different items to see if they are better."], ["Marcia M.", "I figured now that I live on this side of the river, I'd support a neighborhood eatery so I popped into Fattoush for my constant hummus fix. The parking lot is small and shared with a Subway and adjacent to a busy intersection so it's a bit of a nightmare. However, at 5pm on a Friday this place was not busy at all. I was the only customer. The guy working behind the counter was a bit abrasive but was efficient in making my falafel sandwich. I skipped the fries and opted for a side of hummus and some pita bread instead. Throw in a 20 ounce bottle of Diet Coke and you have a little combo meal for $7.50 including tax. Not too shabby!The sandwich was flavorful and filling! The hummus was okay but nothing extraordinary or perhaps I am just a bit bent out of shape because he literally gave me 4 little triangles of pita for a large styrofoam container of hummus?I will likely come by here again because it's so close to my new pad but it would only be out of convenience to pacify a raging hummus craving..."], ["deb p.", "Worst experience ever.Food was awful.The staff seemed horribly disorganized.We waited 15 min for a chicken sandwich.We will never go again."], ["Simon K.", "So i understand that gyro meat is the second cousin hot dog, so I can't be too critical about the ingredients.  However, gyro meat does not have to be related to \"dry and burnt.\"  So in that regard, the quality is poor.I will have to agree about the rude service.  I only visited the place because I found a coupon for it.  BAD IDEA.  As soon as the word \"coupon\" was mentioned, it was then they revealed their bi-polar personality.  There's a simple solution to most conflicts.  In this case, he should have just turn down the coupon, or better yet... don't make a coupon.  If your food is good then I'm happy to pay full price.  The owner doesn't take coupons, but he made an \"exception\" for me.  However, he charged me \"tip.\"  And some how that math equaled up to a price 30 cents more than if I just paid full price... thanks????  The food was mediocre and the service was poor.  Lesson learned:  Beware of Coupons."], ["Tifanny E.", "Id give this a 3.5. It was super fresh. The portions were HUGE. The owner was friendly and I could tell he loved doing what he was doing. Quite happy with this place. It was fresh at it's best especially if you want a lot of food quick and on the cheap side. I'd reccomment this to anyone looking for a decent lunch that won't disappoint. I had the sampler so I got to try a little bit of everything."], ["Jessica M.", "We stopped by on a late Saturday afternoon for some lunch. It wasn't too crowded but there were a few people waiting. We walked up and ordered our food and took a seat. I've read previous reviews and knew I was going to have to wait so I brought something to study while I was waiting. About 20 minutes later he called us up there saying our food was ready. My boyfriend got the vegetarian plate and I got the falafel pocket. I liked the fact that my pocket had tabouli in it instead of on the side. The pita bread was a undercooked and very chewy. It was hard for both of us to tear into it. Im glad I gave it a shot, but probably won't be back unless Im desperate."], ["Edwin W.", "The ambience (cheesy palace theme and open view into an ugly kitchen area) is bad, the location (19th and Charlotte) is in mid-Charlotte grimness, but the food shined when I went there for a late lunch on a Saturday. The place was empty, so I got all of my food made fresh. Yes, it took a while, but good food sometimes does.I stayed to the middle eastern basics: Hummus: was creamy, garlicky and tangy. It tasted fresh and alive compared to some bland pastes that I have had from stores and lesser joints.Baba Ghannoush: bright flavors of the roasted eggplant, a bit tart, really good.Grape leaves: made on site the owner said (most just take them out of a can), not too chewy, good vegetarian dolmas.Falafel - made fresh with good spices and flavors, hot out of the oil as they should be. Take the extra time and get him to make them fresh.Kibbe: not as exciting - ground lamb fried in a wheat crust kind of like falafel.So: stick to the vegetarian basics and you will be happy.I didn't try any of the shawarma/gyro style plates, and they were missing some good middle eastern staples, like foul and lebneh. The pita were uninspired, more steamed than baked, so this place doesn't get five stars."], ["Tressa P.", "Okay...I get the complaints about this place. The service is a bit slow~ I noticed they've added a bookshelf with books near the door a la doctor's office, I guess to give you something to do while you wait?Sure, the parking lot feels a bit dodgy....But I just can't help but like this little place, (there aren't many falafel options between downtown and East Nash) and always enjoy the food. I agree with Claire B. about the tabouli though~not as good as might be expected, but I like mine lemony with lots of parsley and I hardly ever find what I'm looking for.Because it's usually just the owner doing all the cooking at Fattoush, the fact that he's really friendly helps me overlook the sometimes interminable wait time. I include a photo of the recently redone floor because they did such a beautiful job."], ["Shayne H.", "Our group at work has food catered in, regularly.  Our favorites include; beef shawerma, combo gyros & falafel meat salad.My man & I  visited the restaurant this summer and their AC wasn't working...yikes!Our food was good, though.  And the man behind the counter gave us a free dessert.  I picked an item that looked like a chess square.  Sorry, I don't remember the name of it, but it tasted like...imagine if a chess square and cornbread had a baby."], ["Patrick R.", "I didn't exactly get the full meal experience at Fattoush...I just want to make that perfectly clear.  However, I certainly didn't catch very good vibes from the place.  It seemed a bit greasy, understaffed, and slow.  My buddy and I were in the area, and he was jonesing for a cup of coffee.  Considering the fact that this place is called Fattoush \"Cafe,\" I figured it would at least be possible that they sold coffee...I mean, right?  Well they don't, and the guy suggested I try the Krystal across the street if I really wanted a cup of joe.Anyhow, as long as I was there I figured I'd sample the hummus.  I love hummus.  It was pretty sub-par, however, and the place itself just rubbed me the wrong way.  I'd say that I'll update my review once I go and check out a full entree, but honestly I'd just rather not go back.  It didn't strike me as a place you'd want to frequent."], ["Chad R.", "This is one of my favorite places to eat lunch.  I have only been there for lunch on weekends but understand that the lunch crowd on weekdays can be very large.  When I go, I never have a hard time finding a place to park.  The employees have always been warm and friendly and helpful.  They really work hard to make your meal the best it can be so they take a little time getting it right. The wait is worth it though. The prices are reasonable as well.  The food has always been delicious.  The place does not have the type of atmosphere where you want to take friends and family for an evening meal but for lunch it is a great place to go if you like Greek and Middle Eastern food."], ["Antoineka S.", "RUDE!!! If you want to spend your money at a place where the employees don't listen to your order and rudely ask you to have a seat and argue with you about your order, go here... If not please bypass this place!"], ["Steve C.", "Excellent food quality. The hummus, baba ghannouj, gyro meat, chicken shawarma are all fantastic. Also, the tahini sauce is spicy and delicious. The only problems are that (especially at lunchtime on a weekday) it will take a while to get your food. It's Chipotle-style assembly line setup, and they only have two people working the line. There's no real rhyme or reason to how they operate, and this can lead to standing in line for a good 8-10 minutes to get your food. Another drawback is that everything is served on styrofoam plates- I shouldn't have to explain how awful styrofoam is for the environment. Honestly they just need more staff and a better, more organized assembly line system for the lunch rush. And they need to start using real plates.On the positive side- if the line gets too long, the owner is very nice and usually gives you your drink for free, and he's also good about remembering returning customers. The main overarching truth about this place is that the food is damn good, and that's what keeps me coming back."], ["Claire B.", "I really like Fattoush, but there is a scary factor in parking here. I've been accosted every time I go here by people begging for money in the parking lot, and it's not the harmless begging either, but the type where you think you're going to get mugged. The last time I was here, I asked some other patrons to walk me back to my car because I was scared, and I really don't scare easily.However, the food is good, but I usually get takeout because the atmosphere of the place isn't that great. The owner is really nice though, and always remembers me, even though I don't go in that often. He always makes conversation and gives me samples of Baklava. I often pick up a large order of baba ghanush to serve at a party, because the large order is giant and really very good. I don't like their tabouli as much though. The sandwiches are really good and the falafel is homemade and everything is very cheap, which is probably good for the area of town it's in."], ["Shana K.", "Skip it. I had a craving for falafel after a trip to the Farmer's Market on Monday afternoon. I was stunned at what they were charging for \"plates\". $5.00 for  4 undercooked falafel (although it took forever!! maybe they turned off the oil heat!??) , one sad microwaved pita, a smidge of tabouli salad that had seen better days and tzitziki sauce that kinda frightened me. The building itself has a BIG ick factor...bad vibes all around."], ["David R.", "Darn good and plenty for the money"], ["Samma A.", "The toilet is better than Zanies but the roof was leaking by our table when we ate there (We didn't get wet). The server was polite and brought good salad that was small serving for the price. Typical mediterrean food like falafel, gyro, you get the idea."]], "Shish Kabob": [], "Chicago Style Gyros": [["Patrick R.", "I am a Greek food junkie, and this little place is pretty satisfactory as far as a good local place to get hummus and falafel goes.  I'm relatively certain Chicago Style used to be a Captain D's or a Long John Silver's (hence the pirate-style sabers on the doors), but the authenticity remains.Chicago Style Gyros certainly isn't the classiest of joints, but the dining area is comfy and the staff is friendly and hilarious.  It's cheap, and the combos are delicious.  Frequent customers seem to get preferential treatment, so if you go enough you're likely to get exceptionally hearty portions and other freebies.  The carryout containers seem to hold larger portions, and you're certainly not missing any ambiance by hitting the drive through, so I recommend doing so.Somewhat ironically, the gyros are actually one of their poorest items.  I don't typically mind them messy, but they tend to be pretty weakly constructed.  The boys don't skimp on the sauce, however, and the falafel and combo plate are up to par.  They're open relatively late (10:00 PM I believe, but I'll check on that), so I'd recommend Chicago Style Gyros as a good joint to swing by and pick up a late dinner.  And be on the lookout for the Red Greek--that guy is awesome."], ["Laurie S.", "I LOVE Greek food (almost as much as I love Indian food) and Chicago Style makes me love it even more!  We have never eaten inside, I usually just grab food through the drive-thru and they have never failed to serve me some amazing gyros!  At first I would get the gyro combo but now I mainly go for the plate because I get rice and a small salad and it's 2 meals worth in one box.  The guys that work there are so nice and even my 3 year old asks for the chicken rice and pitas.  Now, if only I could remember how to pronounce 'gyro'."], ["Megan M.", "Things I like about this place:  Drive thru Greek food-how can you complain about that?  Convenient location.  Good variety, prices, and portions.  I seriously ate the rice from my last combo here for three days, there was so much of it.  Their gyros are good and filling.  Other stuff I've had here hits the spot but tastes just average in my opinion.  I LOVE hummus and theirs just doesn't do it for me and their tahini sauce has an odd almost mayo-ish flavor.  I think I need to try more of their menu based on the many great reviews this place has had."], ["Brant C.", "Oh hello there, Nashville. You are my new friend and my new home. We must get to know one another better. On my first evening in Music City, my new roommates suggested we hit up their favorite greek joint, a tradition of sorts whenever they have Nashville newbies in town. I've enjoyed the food of the Greeks in many cities across this great country. I've got Mediterranean fare in my blood. Suffice to say, I was intrigued. I'm happy to say, I was not disappointed.This isn't a place you're going to 'wow' a first date (so, don't), but it could become a favorite place to grab a bite or carry out after the tenth. Honestly, if she still likes you by then, you're probably past the point where choosing a bad restaurant could cause catastrophic failure anyways. It does indeed look like it used to be a fast food joint, both inside and out. That's ok, most of my favorite restaurants rely on their food, not the glitz and glamour of the building. (After all, it's what's on the inside that counts, right?)I opted for the Gyro Salad. Im not a \"salad guy\" per se, however I had just been on the road for the past couple weeks stuffing my gut with every processed meat, cheese, and saturated fat various southeastern drive-through towns could offer up, so I wanted something a little lighter. The servings were substantial with several strips of seasoned lamb laid out across a leafy salad bed alongside their significant other, the requiste gyro flat bread. Tzatziki sauce worked its way into every bite, tying together the tasty, inexpensive experience. Good food and new friends in a new place always make for a memorable occasion. The people working the joint recognized my roommate, even making an effort to say hello and goodbye. Familiar faces get familiar smiles and that's a bonus worthy of my fourth star. I'll be back to give the falafel a go. It's close proximity to my 'hood all but ensures I'll add my face to the list of familiar regulars."], ["Dana F.", "Easily the best chicken plate I've ever had at a gyro place, and believe me I've done my research. Fresh, flavorful and every part of the dish was great, not just the chicken. Even the salad was tasty. Definitely a place to seek out amongst all the myriad of choices on Gallatin Road."], ["Greg S.", "I love this place.  There are 4 locations that I know of.  But this one is the best out of the 3 I've eaten at.  I love it because they load the pocket up!!!  instead of a taco style.  Its a giant pocket gyro!!  Excellent staff at this spot.  Gyros are great, falafel is excellent!!  love everything ive ever eaten here!! I will be back for more!!  Plus if your on the go.  They do have a drive thru! Prices are great!"], ["Anna A.", "This is my go to place for Greek. I can't say that it is the best I have had but for convenience and consistency, it rocks my world basically. For one thing, they have a drive through (must be an hold over from Long john silvers) which makes my lazy ass happy. In addition, the portions are plentiful, the prices great and it the food actually taste pretty darn good. I always mean to get a gyro but I end up with one of the combo plates. They like the one with the gyro meat which comes with a salad, yellow rice, and fresh pita."], ["Josh F.", "Always consistently good food, sometimes too much food :) out of the three I've been to, this one is by far the best. There is another on Dickerson rd, , and I will not go back to that one."], ["Dante' T.", "I LOVE this place! This is my go-to whenever I am in a hurry and do not have time to cook. I pull up to the drive-thru window and they confirm my usual order (2 Gyros plates with sauce on the side) without my prompt. I guess that I am busy and in a hurry more often than I realized... :-) If you are in a mood for inexpensive, yummy Greek food, you should give them a try."], ["Nash B.", "one of the main dudes who works at this particular location is just not nice.  the food is fine.  but he needs to improve his attitude.  (kurdish & not nice...usually that doesn't go together.  kurds are unusually friendly)"], ["B C.", "This place was...decent!  Good!  We were pleasantly surprised when our friends turned us onto this place as it looks kind of divey from the outside but the food inside was really good!  Everything we ordered - lamb gyro plate, tabbouleh, falafel sandwich and gyro sandwich - was good.  We would definitely go back again, which is not to be said of most of the restaurants in Nashville.  Sorrrrry!"], ["Peter M.", "You probably won't confuse this place with an actual Chicago gyro place, but it is still pretty tastey.  Gyro plates are a good deal and come with salad; generous, flavorful strips of lamb; bread; and yellow rice.  You can ask for extra cucumber sauce and they will not charge you or call you a fatty.  Also good are their stuffed grape leaves and hummus.  Don't be afraid of the Gallatin location; its a favorite dining spot for cops, so no one will mess with you here.  Staff are friendly and actually Greek (I think)."]], "Rolf and Daughters": [["Megan K.", "Loved our experience at Rolf & Daughters. It took us much longer to make the reservation, but I'm glad we finally did. The experience is definitely worth the hype.I went with the squid ink canestri--a dish I heard a ton about from friends who had visited before I did. Great flavor--a little bit of an ocean-y taste to it, but overall delicious. I had a fantastic drink that I can't remember the name of, naturally... it was a vibrant green and boasted flavors of lime and jalapeno, among other things. Amazing.Service was okay, considering it was a Friday night. Super busy. Tucked in Germantown, street parking. I'm excited to return!"], ["melba b.", "We went there last night around at 6:00 with a early reservation.  Loved the atmosphere and decor. We told our waiter it was out first visit and did he have any recommendations or specials to which he replied\" everything is on the menu\". The menu is a little hard to read and confusing. I had the squid and my husband had rigatoni( recommend that they serve bread with their pasta vs a separate order. Food was really good. Our server never came back to ask how the food was and seemed really not into serving or too cool."], ["Kyla K.", "We ate at RAD on a Saturday night while in Nashville for the weekend. The restaurant had a great atmosphere and was decorated beautifully. We were a group of 6 and they originally tried to give us a 4 top table with two seats tucked in either side in the corner, err.. We ended up moving to the family/communal table which was much better.Our server seemed a little stuck up and didn't seem to be that interested in chatting with us or giving details about the dishes. The small plates we had were all absolutely amazing!! Then came out the pasta dishes which had a massively heavy hand of salt in each of them.. It was rather off putting.. Then the meat- the lamb was so delicious but the portion size was extremely small for the price tag.. The chicken was a good portion size and the flavored were ok.Overall the atmosphere of the place and the small plates were the best part of the meal and the pasta and service was disappointing."], ["Madison T.", "One of the best meals I have ever had!"], ["Dene L.", "If you like fresh, organic whole food, from local farmers, this is it. This is always my first choice if we go out to eat. I actually don't like to eat out much as the quality of the biodynamic organic food I get every week at the farmer's market is far better than what I will find in a restaurant in Nashville. I would rather eat at home... but the occasional splurge is well worth it at R + D.These guys actually buy from my farmers as I see them every Saturday morning buying from the same farmers I am. They don't even hardly promote that the food they choose to buy IS organic. For this, they should be applauded. It gives me hope that America isn't completely going Monsanto and Sysco.I've had all the appetizers and salads and they are all amazing. The beef tartare is very good as is the chicken and the octopus pasta.Bravo for doing it right."], ["Leland G.", "I've been before. Multiple times. Food is always great. It takes chances. It's artisan. The service is usually great.  It's a 4 star place.Tonight was unfortunately an exception :(We sat at bar and had drinks and apps. Moved to table. Sat with empty drinks for 10 minutes - thankfully we had a great group of friends but the lack of service was difficult to ignore.During the delay, I decided to go inside and \"find\" our server, who was very casually standing, at the server/POS station with the other servers, making jokes/laughing/doing nothing...I asked for a drink order and was told to \"wait a minute.\"  UGHEventually - 2 pretentious servers later - we got our second round. And food. The food was WONDERFUL, as usual.  Although IMHO the squid/octopus in the pasta was overdone, and there was far too much salt in (probably) the pasta water...because adding pancetta/seafood to a dish which has already been heavily salted, was a bit too much for 3/4 of us. Just saying :/Finally...I used to serve, I used to run a kitchen; it's just a total bummer when such a place doesn't have the service to keep up!  TIP: when food hits the table, servers--- CHECK BACK WITH YOUR TABLE(S) within \"two bites or two minutes\" of the food arriving. I will go back. I will expect better next time!!!  Especially for a $300 dinner."], ["Paul M.", "This restaurant is hands down one of the best i've ever been to. The smoked trout & the pork verde pasta are amazing. I recommend this restaurant to anyone who is in or going to Nashville."], ["Monica L.", "I thought I was a crusty cynical foodie... and then I had dinner here. It has been a long time since I have been utterly delighted with every aspect of a meal. What a joy to be completely surprised by a first bite/sip.Springfield cocktail: Broker's gin, Pimm's, lemon, orange shrub, cucumber, good people IPALight, refreshing, slightly sweet, herbaceous, fruity, and so well balanced you'd think there wasn't any alcohol in there (oh, but there was). The IPA lends a flowery/hoppy note, the Pimm's adds that herbal quality, and I thought I didn't even like gin!App: Chicken liver pate, currant mostarda, baby brassicas, toastThey should package that currant mustarda. I'd put that sh*t on everything! (Like on a panini with goat cheese or something.)Entree: Squid ink campanelle, FL squid, shrimp, nduja, basil, sourdough breadcrumbsThe squid/shrimp/nduja sausage is completely broken down and there are no discernible chunks - yet the taste permeates the entire dish. The sauce had a slight heat (spice) background, probably from the nduja. The sourdough breadcrumbs added that textural element that you usually don't get in a pasta dish.Dessert: Fresh farmers cheese flan with beet caramel and sorghum crispHad that soft, slight-crumbly texture of a super fresh farmers cheese but in that jiggly flan structure. Beet caramel - where have you been all of my life?? Adds an earthy element that steers the flan dish away from the usual sickeningly-sweetness. The sorghum crisp had the texture of a thinner fortune cookie (words of my bartender!) and adds a nice bitterness that, again, helps to ground the dessert.Side note: If you are a small party, it may be easier to get seats at the bar rather than wait for a table."], ["Pire T.", "I loved every aspect of my visit here. The food is phenomenal. There are so many unique options to choose from and it all tastes delicious. We had a couple of their pasta dishes: the squid ink and lemon pasta. Both were incredible. We also had dessert. A lovely date cake with an ball of whipped topping. Again, everything is unusual but in the best possible way. If you visit, be sure to grab a couple of their signature cocktails. They're expertly crafted and beautifully presented. Aside from the delicious food, the atmosphere of this place is rustic southern with delicate hanging lights, communal tables (but also private tables and bar seating), hanging plants, and trendy decor. The staff is also extremely friendly and attentive. This is certainly one of my absolute favorite places in Nashville. I'll come back here time and time again."], ["Thao n.", "A gem in Nashville, excellent food! Had the broccoli and it might be the best broccoli dish I've ever had. The heritage pork was magnificent! Tender, tasty, and served with fresh peaches. And of course the squid ink pasta was excellent. Ordered the chocolate panna cotta dessert- flavors were good but on the drier side and a bit too much chocolate cake and almost no panna cotta. Good wine list. Mainly communal tables. Beautiful place but a bit loud."], ["Erick N.", "Fantastic restaurant; so happy to have finished my Nashville road trip on such a high note before the long journey back to Chicago. Had multiple chefs recommend Rolf & Daughters as one of Nashville's best venues and in my experience chefs tend to proffer excellent recommendations; when they praise a restaurant it is best to listen. As our shuttle dropped us off outside we were immediately impressed by the charming exterior of Rolf & Daughters. Walking in the interior was equally beautiful. As we arrived well before our reservation we opted to sit at the bar for a pre dinner cocktail, but were happy the hostess offered to squeeze us in early if we wanted (they had just opened, but we noticed that they rather quickly had a full house; impressive for a Sunday evening).  We ended up finding the bar seating comfortable and the bartenders quite personable so moments later we informed the hostess we would like to eat up to the bar and were accommodated. Of note much of the dining room area has communal tables and seating was somewhat close together, so this also factored into our decision to sit at the bar. For some reason we enjoy the liveliness of bar seating, but when in a dining room have a preference for a more intimate ambiance. The menu at Rolf & Daughters is wonderful. Approximately sixteen savory items arranged from lighter dishes to heavier proteins and a separate section for pastas. Ingredients are fresh, high quality and most of what you are served is made from scratch in house. There is a nice balance of vegetable centric dishes, seafoods and meats. So much on the menu sounded tempting that it was tough to narrow our choices down. The bartender was very helpful answering our questions, making some recommendations and advising on what quantity of food to order (and was spot on with his assistance - as well as did a nice job coursing out what we ordered in a sensible manner). We ended up sharing five savories and of these four were fantastic and one (the octopus) still quite good but just not as stellar. The crostini with broccoli, pistachio and generous portion of shaved pecorino cheese sounds simple but wow, the freshness of the ingredients really shined and there was so much flavor. The sweet potato with nduja, green onion, yogurt and lime had such harmony among the various textures and flavors and also was a huge hit. The dry aged tartare was among the better tartare preparations I have enjoyed and the squid ink pasta with seafood and crunchy sour dough croutons was an instant favorite. The food was nicely presented but not at all fussy. One of those meals where you just really enjoy every single bite and the food leaves behind such a pleasant aftertaste. The only negative food wise was dessert; the individual ingredients sounded awesome - caramel, popcorn, lime curd and ginger (all flavors I love) but the curd was poorly executed (way too sweet and no tartness), the ginger was non-detectable and the caramel had an odd aftertaste that clashed with the lime; the popcorn provided a little much needed textural component but quickly became soggy. My wife made the smart decision of ordering a second crostini for dessert and I was envious but she made quick work of it, feverishly fending off my attempts to snatch a bite with her fork and a menacing stare down. Cocktails were on par quality wise with the savories. We really enjoyed the playful names (i.e. Here Today Saigon Amaro and Pearway to Heaven). For one round of drinks the bartender was adept at making us some nice off-menu cocktails based on a description of what we were seeking.Despite the poor dessert this was an otherwise outstanding meal. Loved the vibe (upscale yet casual), loved the decor, loved the staff (and Rolf & Daughters attracted friendly patrons as well), loved the drinks and loved the savories. We also were pleasantly surprised by the bill; for the high quality and rather generous portions this was quite a bargain! Definitely will be making a return visit next time we are in town and quite possibly will squeeze in two meals since there is just no way possible to consume all the highly appealing dishes on the menu in a single visit, though it might be fun to try!"], ["Sarah E.", "I would have loved to give this restaurant 5 stars, don't get me wrong. The service was great, the atmosphere was super cool, presentation of every dish was beautiful, and the cocktails, wine, small plates and entrees were on point and very very delicious. But... when we got to dessert, it was disappointing. I didn't think you could mess up dessert this much, but apparently you can.We ordered the lime curd dessert. Sounds bright and rich, right? It was a mess, literally. The photo explains it all. WTF? I order dessert every time I eat out, and this felt like we were getting punk'd. Ashton? Where are you?I'll go back here, but I probably won't order dessert."], ["Mirnova C.", "The food was delicious. The sweet potato was to die for. Definitely get the broccoli and the cauliflower dishes. All the pasta dishes were tasty. Definitely go if you're in Nashville. The only reason it us a 4 not a five is the service was okay not excellent."], ["Peter S.", "Great food. The choices were great and everything really sizzled on the palate. We had the romesco, which was really good. It really had a lot of flavored going on. We also had the squid ink pasta, which was the best dish of the night. You really have to try this. We had the rigatoni which could easily be skipped, it was just okay but this is high standards. Lastly we had the trout and it was fantastic. The only downer was that the server was not really on the same planet. Multiple times in had to remind her what we ordered. She delivered the dessert menu and asked what we would like and we were still waiting for the trout. Good thing the food is amazing."], ["Nandini M.", "Quite possibly the best pasta I have ever eaten in my life and I eat a lot of pasta.  You have to reserve at least a month and a half in advance but it is so worth it.  The space is small and industrial but very warm and bright.  We were seated in a corner and I loved that I could observe and people watch in the packed restaurant around me.  The restaurant was pointed out to us on a tour earlier in the day and by a cabbie the day before, so Nashvellites (?) are clearly very proud of this place and they have every reason to be.  We split a great bottle of rosé and a bunch of apps but my pasta entree blew me away.  I seriously savored every bite.  Everyone at my table loved their food too and to our amazement the bill didn't make any of us cringe.  Affordable fine dining is the best!  Very friendly for different dietary restrictions and super pleasant staff."], ["Lydia B.", "RAD is a Top notch upscale casual whisky bar with great food. Every bite of food was delicious. We shared the sour dough bread with seaweed butter. Um, what is seaweed butter and how can I get more of it? It was airy and uniquely yummy. We also had the Swiss chard and ricotta cassoncini, lardo. They were bite size canapés that were confusing looking but tasted good. I went over board on chicken and was pretty happy with myself. I adored the ample portion of creamy chicken liver with currant mustard, red cress and toast. My excellent server boasted about the pastured chicken  with preserved lemon and garlic confit. so I went for it! I will say it was in my top 5 best chicken dishes from a restaurant. I loved the super chicken flavor with fresh herbs of tarragon and flat parsley accents. Chicken was served with no sided and it was so good. Just all juicy flattened chicken. My dinner partner tried the heritage pork sauerkraut gala apple with spaetzle. Sadly he was pretty stingy with sharing. The plate offered a few cuts of pork and the sauerkraut spaetzle. I tried a few bites when he was not looking and enjoyed my bites. The others at the table had the Garganelli verde heritage pork ragout, and sarvecchio (their favorite) I tasted it and boy are they on to something... It boasts Gooey, yummy bites of comfort food with style. We also shared a bowl of the squid ink Campanella, fl squid,shrimp, nduja (what ever that is?), basil, breadcrumbs... It was dramatic and also comforting. It did not photograph well but it tasted great. We also shared all three of the deserts and ordered secret desert cocktails. The lime curd, Carmel corn and ginger was odd looking but omg was it a delicious blend of treats for the mouth. We liked the beet and farmer cheese flan but it was not a highlight. The last desert was also unique and yummy but again the lime curd with popcorn took the prize. I was \"forced\" to get a desert cocktail called \"Don't meletti me down\" which was a mixture of Graham's port, meletti, smith & cross rum, Saigon cinnamon and while egg... Talk about a rich glass of yummy booze. I enjoyed a great meal at Rolf And Daughters for sure. It was a warm casual jeans feel too. Obviously I look forward to going back."], ["Caroline K.", "Fresh off the airplane and in need of a drink, my friend and I headed straight to Rolf and Daughters. We arrived around 7pm and the place was packed. Our other friend still hadn't arrived, which turned out to be a good thing since the quoted time for a table was close to 2 hours. Silly me for going to one of the hottest restaurants in Nashville on a Friday night without a reservation. We headed over to the bar to imbibe while we waited, and luckily 2 seats opened up at the end of the bar. The bar itself it quite big, but was very crowded, especially since most people ended up eating there rather than just drinking. My friend got (multiple) Silence of the Lambruscos, while I started with the vey delicious Cynarnold Schwarzenegger and worked my way up to a few R.A.D. Old Fashioneds. The cocktails were great and very strong. They caught up with me later in the night. We were starving so we ordered the sourdough bread with seaweed butter and the chicken liver pate. Chicken liver is one of the few things I still have trouble enjoying, despite how much I try to like it. My friend was more than happy to devour it on her own, while I happily ate what seemed like a half-loaf of sourdough. The seaweed butter and chunks of sea salt to sprinkle on top were amazing. Who doesn't like a good piece of bread?Finally our friend arrived, and our table awaited! A lot of the tables are long, wooden communal benches, and we were seated comfortably at the end of one. All of the food sounded amazing, but our friend had eaten not that long ago and after my practical meal of bread, we didn't need that much food. We shared the Garganelli verde, Rigatoni with lamb sausage, and something else that I am ashamed to admit I forget. Too many cocktails! The food was impressive and we definitely were fighting over the last bite of that rigatoni. Overall, Rolf and Daughters lived up to the hype. It is the kind of restaurant you wish was in your neighborhood, but at the same time don't actually want near you because you will spend all your time and money there. I hope to be back!"], ["Deralyn G.", "This place has incredible food and drinks. My sister and I ate at the bar. Ruben looked after us and made some recommendations, so glad he did!  We probably wouldn't have ordered the squid ink bucatini (pasta) on our own, and it was delectable.  We had the broccoli appetizer, which was anything but boring. IDK what they did to that broccoli, but it was wonderful.  The butter bean crostini was top-notch. My mouth is watering just thinking about that meal.  Get yourselves over there if you can. You won't regret it."], ["Chris K.", "This is one of my favorite spots in Nashville. Fantastic atmosphere, great bar, and awesome menu of plates that are perfect for family style dining. I've been about four times now, and the menu changes a bit every few weeks (some staples are always available). The chicken pate crostini and grilled squid are a must, as is the homemade sourdough with seaweed butter."], ["Mike W.", "This is an outstanding restaurant.  You are seated family style so you naturally look at your neighbors food and ask about what they are eating.  You can get not only the waiters advice but also the advice of your fellow diners.  We ended up having two of our offerings based on the oohs and ahs of table mates.  Three of us shared an order of the heirloom tomatoes, the brook trout, garganelli with pork ragu, and two orders of the bread with seaweed butter.  They were all excellent.  The wine list was a curiosity.  They had half a dozen wines all priced at $46 from places like Slovenia and Croatia.  We had the Rojac, the Slovenian wine, which would have been great in Istra for $3 but not worth importing to great restaurant like this one.Our total bill for 3 was $126 plus tip."]], "Kalamata's Belmont": [], "Taziki's Mediterranean Cafe": [], "Mediterranean Cuisine": [["Jason N.", "Great food and at lightening fast speed!  I had the falafel platter and my wife had the veggie platter, we had a small side of baba ganough.  We had barely sat down and the baba ganough was delivered!  Very delicious and creamy!  Both of our meals we delicious!  And we had food left over. Great little restaurant in a sweet little setting."], ["Jonny W.", "Best Mediterranean food in Nashville! Fresh produce, kind staff, clean, nice view. Their salads are great and the gyro is on fleek!"], ["Gary M.", "Basically, this restaurant is another miss for my quest to get good, affordable gyros and felafel. Mediterranean Cuisine sits in a small strip mall in northwest Brentwood. It has counter service and the atmosphere is pretty quiet, clean and ordered. The menu is more on the Greek end of the Mediterranean-Middle East spectrum. Service was fast and here is the bottom line.Gyro: Reasonable pita bread, meat with some fresh vegetables. They include some grilled peppers and onions along with olives. Nothing special.Hummus: Good consistency but not very flavorful. Very heavily salted and lemoned.Felafel: Main disappointment. These were obviously cooked well ahead of time and reheated. As a result, they were dry and tough.I cannot recommend this restaurant, even for a quick lunch bite, given the limited items we tried."], ["Cindy R.", "Best food ever! My husband and I love this place. The owners are always there. Not a long wait. Good price for a lot of food."], ["Jeff C.", "I met two colleagues here for lunch on a Wednesday at noon.  It wasn't busy at first, but before long there was a long line, and I know why.The first thing I noticed was the young guy delivering food and busing tables.  He had a genuine smile on his face every time I saw him.  When he delivered our food, he saw that we had prayed together and said, \"God Bless you\".  After lunch, I wanted a coffee and didn't want to stand in line behind 10 people, so I slipped him a few bucks and he happily brought a cup around.  Imagine that at most pre-order style places.Enough about the service.  The food was awesome.  I consider myself a connoisseur on food in general and Mediterranean in particular.  The humus was fantastic-and I am someone who has seen it made from scratch and eaten it fresh.  The pita bread was great.  The shawarma I had was fabulous, and my two companions consumed their chicken gyro platters so quickly I can only assume they were equally as pleased.  The portion sizes are adequate for most gluttons, and the tables are set with flatware, napkins and menus, so you can grab a seat and figure out your order before getting in line.  Three of us ordered platters, drinks and had a large plate of hummus for $37, so it's a good value.  If I had known beforehand my colleague was paying, I might have eaten even more.  Give this place a try."], ["Salman S.", "It is very rare to find a place that has maintained its standard in the quality department. Have been here a number of times and it just always tastes the same, like it did the first time.You cannot go wrong with any of their platters or just go for it all and get a mixed platter. The gyro is great and mouth watering. Prices are reasonable and the food hits the spot.The staff is courteous and will go the extra mile to make sure the food is to ur liking."], ["Laura H.", "Mediterranean Cuisine always serves delicious, fresh Mediterranean food. Recognized by dieticians and nutrition experts as the most healthy and balanced diet, it is nice to have a place offering a variety of wonderful, healthy options in Maryland Farms. I love their platters that come with lamb (or your choice of meat), the BEST rice and fresh Greek salad. On this particular visit, I had the Greek entree-sized salad along with baba ganough and pita. The Greek salad consists of lettuce, diced cucumbers, tomatoes, feta cheese, olives and sliced banana peppers with a Greek vinaigrette dressing. While I liked the baba ganough (first time trying it here), I will likely stick to their hummus in the future. Mediterranean Cuisine is wonderful for catering business lunches in the Brentwood area. Last fall, I had a team meeting and used them. I have a couple people on my team from the Mediterranean region, and they thought the food was authentic and delicious. They are also very reasonably priced, with lunches ranging from $5-$9 a person and offer plenty of vegetarian options. So forget that bland, boxed sandwich lunch for your meeting and go for variety! They are typically very busy during lunch, but don't leave if you see a long line waiting to order. The line moves very quickly, and there is usually plenty of seating inside and outside with tables turning over frequently.Also, for my order this week, I used the Eat24 Yelp app for the first time. I dug it! Very easy to place my order and pay for it, knowing I had a tight timeline between meetings and needed to be able to just run over and pick up my order without spending time in line. I'll be using this app more in the future!"], ["Leah L.", "That food was so damn good that it's not even right. I got the Mad Special Platter. It was beyond delicious. Maybe I was just hungry, not sure..but I thoroughly enjoyed my food. And I had enough to split in half and save the rest for lunch tomorrow."], ["R Z.", "These guys are the best.  I usually come in during off-hours (after lunch, before dinner) and my order is handled quickly and professionally every time.  We love coming to this place because this is the best Mediterranean Food in the Southeast.  We have tried a ton of places and everything else pales in comparison.  Keep up the good work!  It's delicious!"], ["Shaun B.", "Visited this place for lunch today, I've worked in the area for two years and have somehow never noticed it. Its a little joint in a strip mall of various restaurants and such. You walk in and order at the counter, we were able to walk right up and place our order. I ordered the Gyro platter, it came out promptly, including Lamb, rice, Tabbouleh, Hummus and pita bread. The Tabbouleh was very good, definitely the highlight of the meal. The hummus was pretty good as well, I've definitely had better but as a compliment to a meal I can't complain. The gyro meat itself was pretty uninspiring, it was good, but it kind of had the feel that it had been sitting in a warmer for a little while. The rice was your typical Gyro restaurant rice, nothing more nothing less. The Tzatziki was good, they kind of spice it up a little here, and I always like my gyro's drowning in it.Overall, I was pleased with the meal, the service was great, the employees were smiling, and the restaurant was clean. The food wasn't anything mind blowing, but definitely good enough for a return trip next time I'm in the mood for some Mediterranean fare. Although I'd hope to find a better option in the area, I've tried several places in Brentwood, but they're all about the same as far as quality and price.I would suggest giving it a shot if you're looking for a place like this in the area."], ["Kris T.", "Food was good. Fast service great hummus. Didn't get a five star because sauce for gyro platter and environment were not to the best level."], ["Dan A.", "Yum!Some of the best Mediterranean food we have had in a good while.  The gyro platter & lamb kabobs were killer and the falafel & grape leaves as appetizers were spot on. The place was clean and the food was fast & fresh.As we were looking at the menu,  another customer commented that it's all good and you can't go wrong with anything...from what we have tried this tine, it looks like he was right."], ["Danny N.", "I was looking for a Mediterranean place for lunch in the Brentwood area and looked for a good online recommendation.  We got there at 11:15 right before the lunch crowd.  It did get crowded which helps to ensure good food for a place with an average outside appearance.  I got the combo plate.  The chicken was better than most competitors. The portion was perfect as it was big but not too big."], ["Adam V.", "Good spot for Mediterranean food!  The food is excellent and there is plenty of it.My wife and I tried this spot because of a recommendation I received from a client.  He is from Jordan and said that it's his favorite restaurant.  I told him about Blue Fig as well (my favorite Mediterranean spot).  We really enjoyed everything.  They have a small beer selection and plenty of items on the menu.  We had the Mediterranean platter.  It had lamb and chicken as well as hummus, baba ganoush, rice, and falafel.  After eating most of it, we were completely stuffed.  It's a dinner for two that is in the $15 range.The service was great and everyone was very friendly.  I'm not sure that I would have found the place if I had not been looking for it.  However, I'm glad that we made the trip from Franklin.Mediterranean Cuisine is a great spot in the Brentwood area if you want to have a gyro or some of the other delicious foods from that region.  They would also make an excellent lunch spot because they are super quick."], ["Lyrad V.", "My husband's client who is from Jordan recommended this place, so we decided to check it out. First off, I'd never known about it otherwise because it's tucked away on a back road in the Maryland Farms area. Since I don't work in this area I hadn't heard about it.My husband and I met up with another friend here on a Saturday before 6 p.m. and the place wasn't busy at all. Most everything in this business park area is calmer on the weekends.The food was excellent. I was excited to see baba ghanoush on the menu, since a lot of Greek restaurants in this area do not serve it. They also serve chicken shawarma which you don't see regularly on Greek menus aw well. My husband and I decided to split the mediterranean platter for $14.99, which was served on two plates and pretty much a sample of everything on the menu! And it all was delicious. The meats were succulent and tender and came out nice and hot. It was plenty of food for two people!The staff was friendly as well. We will definitely be coming back."], ["Sam H.", "Not very busy on a Thursday night at 7 but very good.  I had the gyro platter and a falafel appetizer.  Humus is excellent as is the lamb. Very large portions, too."], ["Rachael Anne E.", "My favorite Greek place! Lots of delicious food at a low cost. The Greek Platter for lunch is $8.99 (after tax) and it's plenty of lamb, rice, hummus, pita and salad. I get tabbouleh instead of the Greek Salad. They take AMEX."], ["Joann J.", "Excellent. Everything we are was excellent. Pastichio and lamb kabob platter. The baklava was amazing...order 2, they're small!"], ["Anna J.", "I love this place, best Mediterranean food in town! Portions are huge and flavorful.  I always ask for peppers and onions added to my entrees. The mixed platter is delicious, you get a little bit of everything.  Salads here are great also.  The service is quick. The place is clean and inviting.  You can go sit on their patio and watch or feed the geese (give them your leftover pita bread, they give you plenty!)."], ["Dan Z.", "Trusted my fellow Yelpers on this one!  The best baba ganough I've ever had!  I always try to order lamb, and again very good!  The size of everything was huge, too much to eat in one sitting and I'm a big boy!!!"]], "Athens Family Restaurant": [["Rick B.", "I've been to the Athens a few times over the last 8 years, and I have to say they do a better than average job on just about everything. If you like Greek food, it's tough to do better anywhere in Nashville. My personal favorite is the avgolemono soup. On a cold day, I will drive out of my way to get that hot cup of joy. Love the salads, love the lamburger.They could do with a remodel. I don't think they've done a thing to the place the whole time I've been going there. But the staff has never been anything less than lovely.I take issue with some of the negative reviews on here. Most of them seem to come from folks who ordered not-Greek food at a clearly Greek restaurant. OK, fair enough to say those items probably shouldn't be on the menu if they can't be done well. But the other side of that coin is how self-absorbed do you have to be when you go to a Chinese restaurant and feel the World of Yelp absolutely needs to know your kid complained about the hamburger on the kids' menu, you know what I mean? There's the option to just say nothing, you know."], ["Autumn F.", "It shouldn't surprise me that I don't really agree with Guy Fieri. Athens is good, not great. Maybe we ordered poorly; we didn't choose entrees that would be considered classic Greek dishes. My beau ordered a breakfast scramble and I chose a grilled shrimp dish (which was the best thing brought to the table, IMO). The service was what really dropped Athens from four stars, down to three. We never we brought refills, which is always a turnoff to me. TL;DR: Stick to the Greek dishes, sip your beverages."], ["Craig R.", "In the past this place was really good.  It was one of me favorite dinner spots.  Even the late night food was always good.  Recently it seems to have slid downhill.  My last couple off visits were average at best.  They covered everything from the salad to the sandwiches with the same oregano seasoning so the entire dinner tasted like oregano.  Sad to see the place go this way."], ["Dae R.", "My two favorite dishes here are the Mousaka and the Kotopita! I've never had a bad meal here, and I like the fact that it's a small place to eat. Sometimes the service can be lackadaisical, but thankfully the food makes up for that. Breakfast is an all day affair, which is great because I never eat breakfast at breakfast time. The parking is adequate, but getting in and out the lot can sometimes be a pain due to traffic."], ["chelsea k.", "I eat here literally 3 times a week! The staff is wonderful and attentive. And the food!!!! The food is so amazing! No wonder they were on the food network! Yummmmmmmmm!Crab Benedict is a must try"], ["Lloyd C.", "This was one of the best burgers I ever had as for the lamb burger because it is the only one I ever had.This lamb burger was good tasting.  They bring you the lamb burger on a bed of fries and a pickle  on the plate, it makes your mouth water by the time it hits the table.I have to say this is the best lamb burger I ever had because I haven't eaten one nor tasted one before now.  This was an amazing lamb burger with the lean lamb meat, the feta cheese sprinkled all over the Lamb burger and inside the bun, on the fries and on the plate even, made it all look good and great presentation.   The restaurant was clean and the waitress and hostess were very nice, I really had a great time and it was a pretty good atmosphere in the restaurant."], ["Matt D.", "The diner type feel on the inside makes you feel as though the people working there just know how to produce quality dishes.  The service was very personable and I immediately felt taken care of.I have done both breakfast and lunch here and both were worth coming back for.  Breakfast has been an omelette or skillet and both left me satisfied with the wonderful blend of flavors.  Just classics done really well.  For lunch, the lamb burger is something I would absolutely recommend if you enjoy lamb.  Also, the chicken souvlaki platter was so authentic.  The Tzatziki sauce was delicious, but did lack a little kick.  Growing up in a Greek household, I was searching for a place that I could enjoy traditional and authentic cuisine and this place did not disappoint."], ["Tamara Y.", "I have no idea how this place came to be rated so highly. I found it to be completely unimpressive, and overpriced for what you receive.I ordered the Greek salad with chicken. The salad itself is $8.50, with a $4 add on for chicken.  The base salad consisted of an oblong dinner plate full of lettuce, with ONE SLICE of tomato, 5 black olives, 4 pepperoncini, 4 small chunks of cucumber,  some feta and two small triangles of pita bread. At least the chicken seemed to represent a decent value. And, to their credit, the Greek dressing was housemade and divine. But not worth $12.50."], ["Tim S.", "As a guy whose wife actually finds garlic breath to be irresistibly sexy, I take Greek food very seriously.  Having visited there several times as a teenager, I have fond memories of the friendly people, amazing food, crazy parties, and avoiding the tap water like ebola.This restaurant appears to be converted from a fast food establishment to a diner-style place with an Aegean nautical theme.  I had the beef souvlaki with the regular sides and some spanakorizo and topped it off with baklava.  Aside from a bit of gristle in the souvlaki and the lack of kick in the tzatziki everything was quite good.As Greek restaurants go in the Nashville area, this is as authentic as I've seen. They aren't playing around, the chef knows his stuff, and that puts them head and shoulders above the goofy gyro/kebab joints that infest this town.  How all the burgers and fries and shit snuck their way onto the menu is beyond me, I'd love to see a full board of Greek-only dishes if they're all the same quality of the souvlaki.The restaurant itself could really use some updating, but it's on par with the other businesses on that street so they don't stand out as unkempt, the interior just doesn't quite match the quality of the food itself.Don't let the three stars fool you, it was A-OK and I will be coming back to try the other Greek dishes for sure."], ["Billy F.", "Stopped in without realizing this place was \"famous\" (d, d, and d). Everything was really great. The combo app was full of flavor. I'm a hummus guy, but all 4 were good. We did the combo lunch specials- spanakopita, moussaka and the meatball and each were outstanding with rich flavor. Very generous portions and great pita (our 3 yo devoured them). Fries were unimpressive, but everything else was great."], ["Pete W.", "I'm obsessed with Thai and Indian, but Greek food is my thing! There is no cuisine I enjoy more, and I've even traveled to Greece to dine on this incredible food in the motherland.Athens Restaurant has the best Greek food I've tasted in Nashville, but I'm worried by some of the negative reviews that this restaurant may be terribly inconsistent!Personally, I've only had great experiences here; succulent lamb dishes, grape leaves from heaven, baklava that melts in your mouth. I even saw local Greek personality Demetria Kalodimos eating there; I recognized her and she recognized me. Her presence gives the restaurant a little extra clout in my book.I love the big city hours, staying open into the AM hours and round the clock on Saturdays.I will continue to come back to Athens and hope I don't have one of the negative experiences a few others have had."], ["Allie W.", "They serve breakfast all day and are open 24 hours Saturday nights! They have great American breakfast as well a delicious Mediterranean lunch and dinner food. The gyros were great, but the French toast is fantastic! Feels very much like a diner as opposed to a Greek restaurant, but all of the food is delicious! Can get quite crowded on the weekends"], ["Carter B.", "It had been several years since I'd been to Athens on Franklin Road. I wanted to take a grandson for Sunday lunch so thought of it and am glad I did. It looked brighter and cleaner than I remembered and the restrooms had been upgraded which is always a good sign.I chowed down on breakfast and the lad had a lambburger. We both enjoyed our meals - food was hot, service quick, refills on tea and water kept coming. What's not to like?Many years ago this nice, clean, and cute place was a Mrs. Winner's chicken joint which I frequented occasionally for lunch. The chicken was great, but the floors were so greasy that you had to walk cautiously lest you slip and fall and the restrooms were for emergency use only. I marvel at how attractive and sparking clean the place is now. No booze, but good food. I will be back."], ["Chris H.", "Athens was a very disappointing experience for me today.  It was my first time there and the assumption of quality was present.  I assumed they were going to make good food but once I started taking a bite that wasn't the truth.  I ordered the NYC Reuben Sandwich and it tasted nothing like a proper Reuben.  It pretty much tasted like nothing.  There was absolutely no flavor.  There was only the feeling of eating a food that applied itself to no more than filling my stomach with the illusion of flavor and culture.  The meat in the sandwich had no taste as if it was some premade frozen meat bought from Costco.Athens did not live up to its reputation."], ["Joanne C.", "I try to give this place a try during lunch since it was so famous. Suzukaki, the beef meatball, was known from the food network so I decided to order that. It was not good at all... First of all, it was cold and very dry. I honestly don't understand how this dish got on food network. I will not return."], ["Anna S.", "I really, really, really wanted to like this place. I want to support and promote small, family-owned businesses. But unfortunately, Athens just fell short of my expectations, and my other experiences with excellent mom-and-pop Greek/Mediterranean food. I was actually trying to find a barbecue restaurant in the area, but I drove too far. I saw the sign in Athen's window, and was intrigued that they had been on Food Network's Diners, Drive-ins and Dives. I was warmly greeted upon my entrance, and quickly seated. The atmosphere is very plain and simple, and I was happy to see that the prices reflected that it is not fine dining. The menu looks pretty good and straightforward. I was starving, so I ordered a meat-stuffed grapeleaf as an appetizer, and Moussaka with Greek salad.I wolfed down the grapeleaf, and greatly enjoyed it. Tender leaves wrapped around a nice ground meat and rice stuffing; I wish the lemon sauce had been a little bit more tangy but still, it was a very satisfying appetizer. Unfortunately, I thought the salad was just awful. It was just plain chopped lettuce, some cucumber and feta cheese crumbles. Very devoid of any flavor or interesting texture. It definitely could have  used a nice, garlicky or acidic bite, maybe some raw onion and more tomato, some saltiness from black olives... just some extra oomph. I did not like the mayonnaise-like Greek dressing that came with it. Instead, I had to liberally use the vinegar and salt and pepper. The moussaka was okay as well, I liked the ground beef filling, however I wish there would have been more of it - my portion was mostly the Bechamel layer, and tomato sauce (both sauces, especially the tomato, could have used more salt and overall flavor).Overall, not a bad experience, and the prices are very reasonable, especially with the generous portions."], ["Ann N.", "Love this place! We go to eat there once a week. Love their weekend hours. My favorite dish is the Special Lamb Chop that served until 10pm. I have tried other \"Food Network Feature\" entrees as well, and love all of them. Caramel Cheesecake is also really good for dessert. Fast and friendly staff. Will be a loyal customer there!"], ["Miranda P.", "So I will say everyone is extremely nice here. Unfortunately everything besides the hummus was pretty... Well not that good. It took us over 55 minutes to get our food five out of the seven orders came out wrong. Granted they did fix over half of the orders and make them right, but it still is unfortunate to have all the food get messed up and have to wait so long :/"], ["Jacqueline C.", "Really great greek food! I understand this place is famous for being on TV, but their food is definitely very good and keeps me coming back. The atmosphere is definitely nothing special - the inside and outside is definitely not aesthetically pleasing, but at least the food speaks for itself. Prices are decent, nothing to complain about I guess. I did find it a turn off that I was able to smell the bathroom & cleaner smell from my table, hence the four stars. If they did a remodel of the place, it would be 5 stars for sure."], ["Kayla W.", "Excellent greek food! This restaurant definitely puts all the effort into the food, so don't pay any attention to the look of it, no quick judgements until you taste everything. Trust me, you won't be disappointed!"], ["Dale A.", "Average at best.  Good service but food very uninteresting. Hard to be authentic when the gyros meat comes out of a package instead of off a spit."], ["Carey James B.", "Hidden gem!! This place is perfect. Delicious food, breakfast all day, and open super late. Love it!Great lamb and very unique burgers too!"], ["Jacoby D.", "My boyfriend and I got takeout gyro sandwiches this weekend, and it was just mediocre. The French fries were quite tasty, but I wouldn't return for the sandwich. It was fresh, but just a little bland for my liking. It was also pretty expensive for the food we received. Despite all this, I would likely return to try their breakfast."], ["Peter T.", "This place is definitely a family restaurant, neighborhood customers,  and  out of towners..Clean, good staff, good service, good menu.I came for Greek food, lamb being the main interest, disappointed with the selection of lamb.We had sampler with pita bread, it's was five star,  definitely Greek flavors.They we had Greek fried shimp...good...but the creamy potatoes won the show.Then we had the nightly special , lamb shank, the only true chioce for lamb here...other than ground.It was served with rice and mixed vegetables, now this part was excellent. Yet the lamb was plain, no rosemary,  garlic or lemon flavors,  just roasted...I don't believe it was even salted or peppered.Dessert was rice pudding, excellent.This place has gotten higher ratings, lots of people have been here, I was disappointed only because of the lamb, perhaps the beef or chicken is to die for?I'll be back. .."], ["Marc G.", "First time I've ever left a Greek restaurant still hungry.  Food was delicious but small sad portions - somewhere a Greek grandma is turning over in her grave.I guess on the bright side, I didn't over eat...Keep riding that Guy Fiere wave while I head home to boil a hotdog."], ["Atlanta j.", "Popped in cause I saw it on Triple D.   Not a real Greek Restaurant.  They try, I guess but if your expecting classic Greek then this isnt it.  Need more Lemon in everything especially the Avgolemono Soup.   Chicken rice soup with carrots.  Nothing Greek here...just move along. I had the combo ( Pasticho, Zuzukakia and a Dolmades)  with a side of Spanokorizo. While they were all tasty nothing was set apart from the rest.   Better Egg Lemon sauce for the Dolmades, a Better tomato sauce for the Zuzu and Pasticho would have been appreciated.  More zip, more zing, freshness is needed.   The Spanokorizo was cold and need something bright.   I would also have added some small salad or lemon potato to the plate to round it out."], ["Anna M.", "For an appetizer we had the htipiti and it was incredible. I got the moussaka and Greek salad which was beyond amazing! I can't stop thinking about how it was so yummy! This is a must eat place. The only problem is that they don't have any alcohol! I think the place would be perfection if it had at least wine and beer! Definitely a place I'll be eating again!"], ["Kelly Ann W.", "Growing up eating in Greek owned Diners in NJ....I was excited to try Athens.  The ambiance is fine- even has a cute patio. The staff is friendly attentive and polite. Food came out relatively quickly. Quality of food.....not so swell.  I ordered the Ruben in which we had to pay extra for the fries. Good thing I did- it's about all I ate.  The corned beef was rubbery and weird. Didn't taste like corned beef AT ALL.  Excited they served it on rye but you'd never know it because they butter and cheese fry the bread a'la Texas toast. Yuck! I'm pretty sure they used pump cheese as there was all sorts of drippy sauce that was yellowish. I did notice some spicy mustard, though the menu said thousand island. Over all- I didn't even eat half. Hubby took one bite and was like.....no.He ordered a gyro. It's a Greek place right? We will stick with the local gyro place. One thick slice of meat...clearly not freshly cut off the rotisserie. It was easy to tell it was frozen and thrown on the grill. Which brings me to my biggest complaint....both sandwiches tasted the way an electrical fire smells.   I don't know if they feel compelled to add liquid smoke because it's the south, or if their grill is just dirty....but it wasn't good.Thank goodness we liked the fries. They are over cooked so they are super crispy. Hubs would have been happier had they not sprinkled them with Feta cheese, but that is easily remedied. The breakfasts looked good, so maybe we'll give it a second chance."], ["Danny N.", "I visited with the gf for dinner.  She ordered the gyro platter.  The meat looked a little different than I normally see.  It looked more like a thick lunch meat than the normal gyro meat I am used to.  It tasted fine but wasn't superior to any others.  I ordered the dinner sampler which changes.  It was a grape leaf filled with meat and rice, lasagna, and a meatball.  The lasagna was quite good.  The meatball was average.  The grape lead meat was good.  Overall a decent experience."], ["Ryan S.", "Service was very subpar.  2 servers per 6-8 tables total that were in there and they couldn't even handle that.  Don't plan on ordering the $12 Sampler platter either; you get 1/2 of one piece of flatbread and if you ask for more, it's an additional $3.  When I went to tab out I gave the server cash and she didn't even bring me change, expecting after all of the above, she would get a 30% tip, which is the amount of change I would have received.  I laughed about it with my friends and didn't even mention it to her, because it probably would have taken her 10+ minutes to get back to me with my correct change and my ride was waiting.  Stay classy, Athens... Food was good though, I will say that!"], ["Laurie E.", "Finally made it to Athens ! My husband ate the lamb burger I had to take a bit succulent juice lamb meat cooked just right . Hard to get lamb meat just right but they nailed it . It also had some pretty amazing Swiss which I hate Swiss but theirs is good . I had a nice small Greek salad  great homemade dressing! Service was good even though it was busy."], ["Noah N.", "I went with a group of 6. Everything was amazing, but the lamb burger was the best. I had the Bifteka souvlaki which was great. A little spicy, but the right kind of spice. This place is a must!"], ["Steve E.", "One of the best places I have ever been to The appetizers on absolute delight the gyro make me feel like I'm back in newborn and the lamb burger changed the way that I look on burgers . The service is high quality and I never have an empty glass I will be going again"], ["Jason E.", "Ordered the Bacon Lamb Burger and it was OMG!!! Sorry for the 13 year old girl response, especially coming from a 43 year old man but this burger was so good. I had ordered the double and it was so big and juicy, it was falling apart on the bun. They had a side of fries topped with feta cheese. Now not being a big fries guy, these were awesome too. Highly recommend."], ["Marty C.", "This place is fantastic! We have been here several times and the experience has always been a great one. The gyros are wonderful and the fries with feta are delicious. This time I went with the kotopita which was great and my wife had the suzukakia which are baked meatballs. Just make sure you leave room for dessert because their baklava is out of this world!"], ["Matt M.", "My girlfriend and I stopped at a friends Nashville and went out to get a bite to eat. We heard of Athens being on Diners Drive ins and Dives and check it out. We orderer the Spanakopita for an ap. It had great flavor for warm spinach thanks to the feta and filo dough!For dinner I ordered the DD&D featured double patty lamb burger wrapped in bacon. Topped with feta cheese on a big oven roasted bun, this monster of a burger was worth every bite! My girlfriend ordered the Suzukakia, also featured on DD&D's. The beef had a crispy taste complimented with a zesty tomato sauce. They were served with pita chips to add done crunch if desired. It wont standout at you if you were passing thru but the small town diner like atmosphere and amazing food is surely something not to pass up on if youre in the area! Id reccomend Athen's family  restaurant to anybody in search of a great place for a decent price. The menu so big you'll have to come back again!"], ["Kimmy E.", "So, I was on vacation in Nashville looking for a late night place to eat and Athens came up in my search. I was in shock how good the food was. I didn't expect anything other than mediocre for a diner. Get the hummus! Probably one of the best I've ever have."], ["David E.", "My wife & I were in Nashville last Fall and wanted to try out one of the restaurants I had seen on \"Triple D\" (\"Diners, Drive-ins, and Dives\"). As it turned out, the Athens Family Restaurant was very near the Bed and Breakfast (The Timothy Demonbreun House) at which we were staying. WOW, what great food! Although I had seen the dishes on the Triple D episode, the food was as good or better than Guy had described. In fact, we saw several more dishes on the menu that we wanted to try. Unfortunately, you can only eat so much on one visit. That's right, we will simply have to go back again on our next visit to Nashville. If you're going to - or through - Nashville, treat yourself to some great food."], ["Hakan D.", "The worst Greek food I ever had in my life. I had gyro and lamb patties at different occasions. My wife had pastichio They were all bad. The gyros here looked like processed meat. The texture was like salamis which was too dry and over seasoned to cover the meat taste. Pastichio was not fresh either. The pasta was over cooked and the bechemel sauce was too heavy. This place was overrated and too expensive for what it was. I wouldn't recommend it to anyone."], ["Jonathan W.", "I went there for breakfast, and in hindsight I think lunch would have been a better idea. The food was good, but at $14 for breakfast and coffee it was a little overpriced. However, the service was great and the food was well-prepared -- I will be visiting again for some Greek food for lunch!"], ["Melissa F.", "The htipiti appetizer is a must have. I've had some entrées that were wonderful but others not so much. I think it depends on the cook.  Friendly staff but they're often too busy."], ["Allison N.", "This place doesn't look like it'd be awesome from the outside, but trust me, it's worth the stop.I've been several times for breakfast, lunch and dinner and the food has been outstanding at all times. The gyros here are awesome and the omelets are on point. The appetizers? All good. Something I loved about this place was that they were open 24 hours on certain days of the week which was good when a craving struck. They can get really busy on the weekends, but the line moves fast. They also do to-go which is pretty speedy."], ["Elise K.", "We found this place a few years ago on a visit to Nashville, and now it's one of the many things we look forward to when we head to ol' Music City. All of the Greek favorites are here. Lamb? Incredible! Tzatziki? Perfection! Dolmades? Superb! Don't leave without trying Creamy Dina's Potatoes. We've had creamy Greek-style potatoes at other restaurants, and none can even begin to compare to those from Athens Family Restaurant. Love, love, love!"], ["Harrison P.", "I really wanted to love this place although whenever I received my traditional gyro, there was hardly any meat on it and what was there was tough, so I showed it to my server who looked surprised that I was showing it to him. He asked what he could to to make me feel better about my meal and I said well since the lamb was so sparse and tough, may I please have the same item with chicken. He said yes of course and then brought me back a gyro with quite a bit of tough chicken yet hardly any lettuce, tomato and yogurt sauce. So again I had tough meat and, this time, a very dry gyro. And the side that was still available was green beans which were not cooked very well, so they were tough to eat. I didn't say much else because they seemed like they didn't really want to be bothered and just haven't been back since. I'm so disappointed because I was hoping to find a 24 hour restaurant in Nashville I could count on."], ["Cristina D.", "The best lamb burger in the world!! you will not regret your visit! The service we had was amazing even though it was late at night.Traditional Avgolemono Soup Cup had such an exquisite flavor ans was so smooth. We also tried the NYC Style Reuben the taste was delicious! The bread was crunchy and the meet was so tender and juicy. After this wonderful meal we tried the cheesecake they offer, hands down the best one we have ever had it was so creamy and felt just made."], ["Timika S.", "I enjoyed my first breakfast experience.  I had the breakfast special.  It was simple, quick, and cheap.  I had a bacon and cheese omelet, home fries, and wheat toast.  The waiter was nice and frendly.  I will be back."], ["Cory P.", "Good food. Our cook can make good breakfast food. Hash browns were pressed perfectly. Omelet just a tad runny but again perfectly fully cooked. French toast perfect. Only irritation is our waiter disappeared. I guess a smoke break is more important then a tip. The pretty blond and the older shorter guy is the ones that seem to understand serving"], ["Sarah N.", "I found this place by accident but decided to try it because of the sign - Featured on Diners, Drive-Ins, and Dives of the Food Network. It's a small homey restaurant with none of the extra frills.One of the owners, Mohammed,  was great! He seated me himself and even checked on me a few times to make sure everything was okay.I had a Greek Pork dish that I can't spell but will DEFINITELY return to have again. The baklava was light and fluffy but not too sweet.****** I've been in Nashville for about 3 weeks trying random restaurants and this is BY FAR the best place yet.I highly recommend visiting - the food is great and the prices are VERY reasonable.Their open all night on Friday and Saturday plus they serve breakfast all day long. Take a short trip down the road for some great food and make sure to say hi to Mohammed."], ["Raul I.", "After seeing this place on Diners, Drive-Ins and Dives, we decided to take the detour and stop in this place.We were seated quickly, the waitress was SUPER friendly and very nice.  I ordered the Big Boy Breakfast (scrambled eggs with diced bacon, sausage, in house smoked ham, served with 2 pancakes, mini steak and homefries), and it definitely made this big boy happy.  The steak was really good, perfectly cooked and the seasoned home fries were a nice touch.  My partner had the Gladiator Feast which consisted of scrambled eggs with olive oil, chicken souvlaki, feta cheese, pita bread, tomatoes, tzatziki, hummus, and 1/2 bougatsa).  I had to dig into this plate a few times, everything tasted fresh, not too heavy and I loved the combination of flavors.  It reminded me of a typical Turkish breakfast, with the Athen's Family flare (more Greek obviously---mediterranean).  We shared the bougatsa which is a Greek breakfast pastry consisting of semolina custard and cheese filling between layers of phyllo along with a hint of cinammon.  VERY very good.I posted pictures of all three breakfast items, check them out and if you are from Nashville or driving anywhere nearby, this is place you cannot just pass by."], ["Donald C.", "Ate there at 3 pm on 1 Jan 15. It was busy and despite that was reasonably quiet and calm. Every table was occupied ( counted 17 tables).There was a 5 minute wait until our table became available. You could tell the place was efficiently run. The wait staff was attentive and polite.Ordered a cup of soup to start, chicken and rice with an egg/lemon base. Excellent, thick in texture. Didn't dribble from the spoon,it was so thick. Let me tell you, if my Mama made this soup I would have acted sick every day!My wife ordered the vegetarian spinach in a filo dough meal. She described it as excellent. She let me taste it and I agreed. I'm a big guy, and I usually take up her slack (uneaten portion). She gave me no slack today.I ordered the gyros platter. The gyros was like a lunch meat which was sliced and cooked. Tasted good, but after living in Chicago I'm used to gyros being cut from a large hunk of meat on a rotating spit by a big hairy guy with a BIG knife which made you not want to argue with him. Not to my taste as it wasn't crunchy enough. My meal was well prepared, just not to my taste. I ate all of it nonetheless. The tzatziki sauce was good. The rice dish which came with it was excellent. It was spinach with tomatoes and the fat rice the Greeks are known for. I could have eaten 2 bowls of it.Final verdict, a well run restaurant with excellent food and polite, efficient staff. If you are from Chicago, stay away from the Gyros. Just don't stay away from this restaurant. I give it 4 stars and will upgrade it to 5 if it is just as good next time."], ["Alex P.", "Breakfast food is served at all hours and its actually really good.  They're open 24 hours straight from Thursday morning to sunday night.  Basically, Mondays, Tuesday, and Wednesdays are just regular hours... its pretty sweet!  Definitely my late night hotspot from now on!"], ["Brent E.", "I've driven by this place often and finally decided to stop in today for lunch to try it for the first time. I tried the gyro sandwich with fries. The fries were awesome: very crispy and topped with herbed feta. The gyro not so much. I work at Vandy and frequent Mediterranean Cuisine on 21st often for lunch. I prefer their gyro for about the same price (a soda and gyro and side set you back about $10 at both places). Serive was very pleasant, attentive but unobtrusive. There were a lot if things on the menu that sounded great, so I'll likely come bak and try something else."], ["Amanda R.", "The food was fine, but I don't think it was anything to write home about. However, the rice pudding was some of the best I've ever tasted and made it well worth the trip."], ["Afkham N.", "Haven't been here in six months and I'm even more impressed than the first visit. I ordered the Crab-cakes Egg Benedict with fries which was EXCELLENT! Following that was the custom Western Omelet with hashbrowns and I added cheese and mushrooms to the hash Brown. The hash browns were an epic fail, just bland. But everything else was. On point and just friggin' delicious! It's 3:26 a.m Saturday night and this is a post-drinking review but of sound mind."], ["Nathan S.", "Food was pretty good.  I came in because I had seen it on an episode of Diners drive in and dives.  It's a Greek place, as if you didn't know, that has some wonderful offerings.  I however, being a breakfast lover, opted for a unadventurous breakfast item.  What was I thinking?  Everyone at the table raved about their food while I sat enjoying, mind you, my pancakes...I will be back.I will have at the very least, a gyro!"], ["Summer K.", "Athens was in walking distance from our condo on a recent Nashville trip, so we found ourselves here a couple of mornings for an easy breakfast.  We were seated immediately both times, with the service being a bit slower the second visit (a weekday, later in the morning).  The breakfast was fine, nothing to write home about, but nothing to complain about, either.  I had the Athena Skillet (with bacon, ham, green pepper, onion, and cheddar) both times, while my Mr. Summer had eggs + breakfasts.  The skillet was good.  My biggest issue is probably the toast.  I hate being served dry, cold toast.  You can't butter cold toast."], ["Joe C.", "Have been here probably a dozen times and have never had a bad experience. My personal favorites are the gyro and chicken platters and the suzukakia. Suzukakia covered in tomato sauce on a bed of rice pilaf, oh my! I want it right now. Oh wait, I can have it now because they're open 'til 10pm on weeknights. Now let's talk about brunch. They have an amazing breakfast and brunch service, from pancakes and French toast to Greek Omelets and a beautiful skillet hash. And I think it's worth mentioning that they have really good coffee. Enjoy 3 meals a day at Athens."], ["Mark H.", "This place has good food and service very friendly.  Been in a couple diners for a quick dinner and have not been disappointed.  Will try to make a breakfast run soon!"], ["Sean S.", "This is my wife's favorite Sunday breakfast spot; she loves the omelets. Personally, I think the prices are a bit high, especially with the recent price increases across the whole menu. A couple omelets and two coffees is going to set you back $30 with a tip, that's more than Marche!Overall: Great staff, fast service, and lots of choices. However, a bit pricey for a casual breakfast."], ["Taylor O.", "This place is rad. Not only is the food excellent, but it's open 24 hours and you can stumble in with a case of beer at 3 AM, throw it on the table, crack one open, and nobody minds. Haha but seriously, the lamb burger is great, the moussaka is great, and all the breakfast meals. Give it a try."]], "Cizars Mediterranean Grill": [["Tim Q.", "Cizars is a no frills sandwich shop with terrific Gyros. All topping are fresh and sandwiches made  to order by staff that are particularly fast and courteous. Gyro topped with tabouleh is perhaps the best I've had. I'll surely be visiting this East Nashville gem again very soon."], ["Sir Funky P.", "Came back to make my review a full 5 stars. Let me first just start with...the food is delicious.  Nothing fancy, just consistent and extremely tasty grub. The gyro meat is always nicely charred, the fries are spicy and prepared to order, the tabouli salad is fresh and adds a light flavor to each bite, the pita is nicely griddled and they let you add whatever you like to each plate. Most importantly,  the customer service is grade A. I'll tell a quick story: I called and tried to order delivery after they had already stopped.  They told me, \"it will be no problem, we'll make one last run.\" When they came I gave them a $50 bill and they said they couldn't make change...and rather than taking a credit card number or even telling me \"pay us next time you come in\" he said...\"this one is on us, we value you as a customer and hope to see you soon.\"Amazing people, amazing food...one of my favorite hole in the wall joints in Nash."], ["Kimberly S.", "This place is an amazing value. I ordered the Pomegranate Chicken Plate, which came with a generous serving of chicken, rice, pita, and salad for about $6.50. The chicken was SO flavorful, but it was a little gristly. My husband ordered the Combo Plate (gyro meat + chicken). The gyro meat was DELISH. I would definitely order this next time. The salad and rice were nothing to write home about. I think the best bet would be the gyro sandwich for $2.99, WHICH IS AN INSANE DEAL. We also tried the stuffed grape leaves (good but not the best I have ever had) and the spicy fries (surprisingly tasty and I'm not a fry fan!). It did take a little while to get our food. I would recommend calling ahead and picking up to avoid the wait."], ["Samantha W.", "This place is great. It's inexpensive and full of flavor. I love the chicken salad or combination salad."], ["Joe M.", "I love the owner. That said, I went a few times. It's fine though pretty dry and dependent on oil for flavor.  Certainly had way better, even in quick stops. It's still cheap and ok if you're in a rush"], ["Chloe S.", "This is the best Greek food I've had in a long time! I had the falafel plate and it was hot and fresh. It came with pita bread and a small salad. Very reasonably price with fast service. I can't say enough how much I love this place and can't wait to come back to Nashville!!"], ["Kristin Marie S.", "I had seen the ads on the East Nashville FB group. I had heard good things from friends. We were told they deliver. I could no longer put off trying out Cizars! The delivery was what sealed it. We ordered a falafel gyro and a gyro/chicken combo plate. The plate was awesome! I liked the falafel gyro, it was fine, but I now know that the gyro is where it's at! We will definitely order again and I will definitely get a gyro. I'll also be adding a side of hummus. They really know how to make a great hummus! If you haven't tried Cizars, you absolutely need to go. Heck, just order delivery and enjoy from your couch!!"], ["Marian C.", "FINALLY made it in and we were not disappointed. Got the pomegranate chicken plate at such a reasonable price! Boyfriend got the combo meat/lamb gyro and chicken plate. Both were so delicious and everyone was so nice! Cannot wait to try more off the menu!"], ["Carol W.", "We read about this place on Yelp and have been wanting to try it. We were not disappointed. All of the food was freshly prepared, and delicious! Hubby had the gyro plate, I had the falafel plate, and we both had baklava. We were also offered a Kurdish dish to try (Quhtilks) and it was also amazing!  The service was excellent, very friendly - family owned and operated using old family recipes. We will be back!"], ["Danielle L.", "Awesome people working there, super friendly- The food was HOT(fresh) and DELICIOUS-I ordered the \"Combo Plate\" chicken & gyro, salad, pita and rice!! w/ a drink for (6.49+tax) The atmosphere was modern, clean and laid back. I will be back-"], ["Michael B.", "Cizar's is real handy for us and is a good take out option.  The menu has a few typos and the photo's are a little misleading (stock images) but everything is put together by hand and the falafel is nicely seasoned with fresh herbs.  There is a mediterranean tri-fecta right there on Gallatin Road but Cizar's wins!"], ["Queen B.", "I plan to work my way down the menu.Delicious, reasonable, fresh food.Nice owners and managers.Like everyone else.. I appreciate the fact that they keep it reasonable and delicious.I tried the grilled chicken sandwich with all the trimmings and tzatziki sauce.Next I plan to try the gyro meat with tzatziki sauce and then the philly cheesesteak..or the other way around.. maybe the philly cheesesteak and then the gyro..so many choices...  and I know every one of them will be good."], ["Amie A.", "I cannot say enough great things about Cizars!Their food is incredible and they have the service to match! I've used their delivery several times and it has never taken over 20-30 minutes to get my food...and I'm about a 10 minute drive from their location.I'm not even going to start on the Baklava..."], ["Brian B.", "This has taken over as my go-to Gyro spot in East Nashville. I love the char on the gyro meat, and the tabbouleh salad is outstanding. On top of the food, their customer service is great. Everyone that works there is so friendly and will accommodate your order (more tabbouleh, please!)."], ["Marie O.", "Oh yes, this place is the best AND fresh! I ordered the gyro sandwich, delicious, seasoned fries, crispy delicious, and fountain Pepsi, carbonated deliciousness! Friends got the gyro plate and felt pretty much the same as I did my gyro.Stop in Cizars and get some great mediterranean grub. It's so good!"], ["Chris W.", "Tried Cizar's for the first time tonight. We had heard great things about their new delivery, so decided to give it a whirl. We were ordering late, around 8:15, so I asked if they were still delivering -- they said no, but deliberated and decided graciously to deliver us food anyway.I had the gyro plate and my wife had the falafel plate. Tons of food, and delivery was super fast (though I am right down the street). Super friendly and accommodating. Will definitely be ordering from them again."], ["Ebony R.", "Normally, I don't write reviews,  but I felt the need to write one today. I came into this establishment based on the yelp reviews. Upon entering, I noticed I was the only patron in the building. Was not greeted by the lady behind the counter,  instead I received an uninviting stare; no smile, not even a hello. The woman then proceeded to the back to do whatever she was doing. I didn't even try the food because I was disgusted by the lack of customer service.  Note to the management: greet each customer who comes into your establishment; you will lose potential customers."], ["Benjamin O.", "Not only are the guys making the food hot as can.be but the food is rockin' great as well :-) :-)"], ["Marisa V.", "Came here based on yelp reviews.   My husband wasn't sure about it but after we were done eating he was happy we went.   Yes.  It's a hole in the wall kind of place but it's clean and the food is fantastic.   I had the pomegranate chicken plate, he had gyros with fries.  I'd go back next time in area.  And the people were friendly too!!"], ["Jennifer B.", "This place is amazing! They are a family owned business that takes so much pride in their food. I tried this place out two days ago  and I'm back again. Such wonderful food for a affordable price! Can't wait to go back and try the chicken fajita plate! Moe and Saab are two thumbs up!"]], "Anatolia Turkish Restaurant": [], "Blu Fig": [["John M.", "Great place. Terrific salmon wrap. It's a meal not a snack. Fresh and tasty food. Price is right and service is friendly."], ["Miena B.", "I drive by this place a lot and decided today I would try it. Pros- I ordered the Mezza w/ falafel, which is supposed to be a sampler platter. The hummus was very good, and so was the tabouli. Both tasted very fresh, as well as the feta cheese and black olives. The staff was friendly.Cons- I got my order to go, and didn't check the container before I left. The platter was supposed to come with pita bread to eat the hummus with, I didn't get any. And instead of kalamata olives, I was given black olives. Also, the music was a little too loud. Made it hard to hear the staff as he was making recommendations, and so probably not a place I would sit down to eat with someone and hang out.I still think this place has potential. I'll go back to try some of the other menu items. Hopefully I'll get whats described on the menu next time."], ["Sarah Jane M.", "Just tried Blu Fig for the first time. Very impressive - the falafel is made in house as are many of the specialties & the hummus is to die for! The owners are also very nice & Blu Fig is locally owned which is always a plus in my book. I'll be back and recommend it as one of the few healthy AND tasty places to eat in Nashville. A+"], ["Jenny A.", "I LOVE Blu Fig!!! It is the CROWN JEWEL of my neighborhood! This is my go-to place when I want to have something healthy, fresh & tasty and guilt free! My favorite is their sampler platter that includes stuffed grape leaves, hummus & pita. Love their tabouleh and yummy salads! They make everything fresh on the premises except for the baklava, I believe. The baklava is TO DIE FOR...very fresh, tender and NEVER chewy! They cut each piece in fourths so you can eat a fourth and take the rest to go. I've been a total fan since the first time I went. The owners and staff are super-friendly and service oriented. Their take out is just as great as eating in, too!"], ["Pilar A.", "I love the smoothies and the hummus!!! I go there every Tuesday and Thursday for the delicious smoothies. Owner is super nice and staff is great too!"], ["Collin K.", "Wasn't referring to sandwiches ... Was referring to gyro play with  beef rice lettuce and pita bread ...."], ["Susan D.", "Staff is super nice and genuinely care about their customers. I've had their Plato's delight (amazing), Lentil bisque (very good but I like my soups with more of a chunky fill then blended but still tasty), delicious and light falafels with yummy Laban sauce and their marinated chicken is so tender and flavorful! I've had several smoothies and they're all good as well as their bubble teas. I highly recommend trying this place if you're anywhere near it. Always fresh and reasonably priced"], ["K T.", "The menu is limited. But the food is fresh and taste great."], ["Bradley S.", "**EDIT** 7/12I've since been and for sure have changed my opinion. Again, as I said below, I think I caught them on a bad day. 3rd time was a charm for me. IF I get a hankering for some good greek / med food... I'll check it out.Oh and to the reply from the vendor, no my first review wasn't a joke. My opinions still stand from my initial visit, HOWEVER since I went back i even tried Bubble Tea, for that alone... I'm a HUUUUUUUUUUUUUGE fan.Short and not sweet ... avoid this place. Maybe I just got them on a bad day... but suffice to say nothing was good. Sauce sucked, lettuce brown, long wait , expensive, and just dry and tasteless. Gyros should be savory and moist! sorry I won't be visiting again."], ["Daniel M.", "The food was excellent and the staff where very friendly and welcoming. My only complaint is the lack of seating, it was very crowded the day I was there, but it is a small place and I gather they do a lot of takeout."], ["Kevin S.", "Nothing special pricey."], ["Paige P.", "Great food and service. Everything is fresh, and the falafel is amazing! We will definitely be regulars here."], ["Kate S.", "Really enjoyed my dinner last night here. Great service, and the food came out quickly. I ordered the duo plate which I was informed was a lot of food - and it was! No disappointment in freshness or quality at all. I think it was 8.99 for this item, which was just fine with me. The fruit tea is apparently really good according to my friend, so if that is your thing try it. I tried one of the smoothies with peanut butter in it and it was excellent. (Can't remember the name - sorry!) Not sure why one reviewer said it was not made from real fruit; I watched them make it. Maybe they changed that since? Regardless, I was very pleased and will be returning soon. The place was super clean and the bathroom is decorated very nicely and has honey and fig scented soap which I found amusing.Afterthought worth mentioning: The seasoning on the fresh potato chips was ahhhhmazing too."], ["Andre P.", "This place is a hidden gem. Food is delicious and their homemade fruit teas are second to none. Atmosphere is kind of lame but highly recommend grabbing some for take out."], ["M. J. D.", "Blu Fig - Short name, short menu.When I think of Mediterranean food, I think of Falafel, Moosaka, and Baba Gahannouj.  Foods that are as much fun to say as they are to eat.Blu Fig however, misses on all of those.They started in the right direction, with an appetizer menu that contains Dolma, Tabouli, and Hummus, but once you get past the appetizers, you get 4 options - gyro, grilled chicken, salmon, or shrimp.  The first 3 can be served in a pita, all 4 are available as a salad or on a bed of rice.So I was disappointed.  I didn't get to order something funny, like shawarma or matbucha.  The Blu Fig didn't even have Figs on the menu.  If I opened MJ's house of pasta, you can bet I would serve pasta.Then the food came.It started with a smoothie.  It was very good.  Fresh fruit, yogurt, and locally produced honey.  If this place was next to a gym, I could burn off 400 calories and put them right back on all within an hour.Then my gyro came.  It was good.  The meat wasn't greasy, but fat equals flavor, so the meat was a little sad.  Healthy, but bland.  The laban & tahini sauce made up for it though, so they hit their mark.  Where they excelled was with their basmati rice.  Very tasty, despite the fact that they jazzed it up with a bag of mixed frozen vegetables.  Almost floral tasting.I really want to support local eateries, especially ethnic ones.  But the Blu Fig dumbed down their menu too much.  They don't even have \"Gyro\" on the menu, they call it a Yee-Ro.  As if to say; \"Hey you redneck hick, this is how it's pronounced.\"  Well you Mediterranean Bluneck, Salmon isn't native to the Mediterranean, and that's a quarter of your menu.Tip:  Be ready for takeout.  Despite the size of the establishment, there are only 4 tables here.  Three of them are 4-tops, and one only seats 2.  Also be aware, that it runs kind of pricey, a lunch for 2 (one plate, one pita wrap, a side of tabouli(so I could order something funny), a diet coke, and a smoothie) ran us $28 not counting tip.  2 1/2 stars, rounded up to 3 because of the rice."], ["J C.", "We tried this place tonight. If you like Mediterranean food, it's okay but not spectacular. I had a gyro plate, which included some tasty pita bread. My husband had a grilled chicken plate, and he said it was so-so. The rice was flavorful, the meat wasn't greasy, and the salad was filled with a variety of flavors.While I waited, I was offered a sample of their fruit tea. Good stuff. They also carry baklava and cheesecake if you're interested in dessert. I'd like to try one of their smoothies since they offer a variety of flavors. Customer service was friendly and attentive, which is a major plus.Overall, it deserves 3.5 stars, but since Yelp doesn't offer that, I have to settle for 3."], ["Becky S.", "Awesome food. Everything was so fresh and flavorful! We can't wait to go back!"], ["Chris F.", "Had an amazing salmon salad and mezza platter! The service was excellent and the food was delicious."], ["doug d.", "This place gets an extra star for being able to get Med. food in this location.The Lentil soup is wonderful, Falafal is great too. I also enjoyed my smoothie very much.The salmon is really good, over their rice. The appetizer plate was ok, and gyro just ok for me.Salad and tabouli were good.I think if you live in, or pass by this area, it is definitely worth a stop."], ["Jim S.", "the best gyro I have ever had... my wife had the chicken pocket , the staff are very helpful and never seem to stop smiling ."]], "Cafe Rakka": [["Ramon B.", "In town for business from Salem Oregon. Great hole in the wall! Lamb Yakney was so flavorful! I ordered it spicy and it had a nice kick to it. Started off with Jalapeño Hummus. Had a roasted Jalapeño right in the middle of it. Best hummus I've had. The pomegranate Tea is exceptional. Every item I had was full of flavor and was prepared with fresh ingredients. I wish I had room for dessert. 2 thumbs up!!"], ["Joley B.", "This is possibly my favorite restaurant ever.  I wish it wasn't 14 hours away!While on a road trip from New York to Oklahoma, my friend and I were looking for great food.  We tend to enjoy Mediterranean food, and the menu looked fabulous so this was where we decided to go while in Nashville.Cafe Rakka was fairly easy to find even on a rainy December night.  We arrived around 6pm on a Saturday night after Christmas.  It was busy, but there were still a few places left to sit.When you go in, you can sit first, but you'll have to order at the counter.  We decided on a hummus bar to start and got it with olives and extra pita.  It was delicious.  Homemade hummus is the best!  I loved the flavor and texture.  The olives were good, though I wasn't a fan of the darker ones.  For my main dish I ordered the Lamb Briyani.  An expensive dish, it was plentiful.  There was a good amount of lamb, naan, and rice.  The salad with dressing was delicious.  It was spicy, but not overly.  You could taste each of the flavors distinctly.I ordered a sweet Mediterranean Tea, and it was quite possibly the best tea I've had. Ever.  I could taste clove and a number of other spices that made for a perfect chai.The atmosphere is relaxed and cozy.  It was the perfect place for a rainy evening, and I enjoyed every bit of the experience.  I wish I lived closer because I would go back in a heartbeat.  And maybe I would even see some famous people who are reported to frequent this establishment regularly!!"], ["heather k.", "Ok. So Hendersonville is a drive for most in the Nashville area, but this place is worth it. It's a small little restaurant with great food, amazing sweet tea and service that makes you happy to eat out and tip."], ["Cat S.", "The cafe is cozy and the food is authentic and delicious! Hummus was freshly made, falafel and veggies were so good. Staff was friendly and attentive. Lunch time was busy but we were seated quickly."], ["Ben F.", "Look, the prices are too high. The hummus especially is just priced way above what it should be. But I haven't found anywhere in Nashville or the surrounding area that puts so much flavor into their Mediterranean food. Falafel, fresh and delicious. Chicken dishes, spicy and wonderful. Rice perfectly cooked with a ton of saffron steamed into it. They use the spicy smoked paprika. They use the real seasonings, and they use them boldly. The salad dressing/sauce options have real flavor. The sweet tea had been spiked with cloves or allspice or something nice, which gave it a \"chai\" flavor that justified the $3 cost. House water has cucumber peel steeping in it. I would eat here all the time if the prices were lower in the evening. I don't remember them being so high before a certain Guy came to town and brought them a bunch of well-deserved attention. There is a real lack of real food in Hendersonville/Madison/Goodlettsville, so it's nice to see them still in business. I guess I'm torn."], ["DC G.", "Outstanding food, plus the chef is a gem of person.  Puts a lot of heart into his cooking.  A truly authentic Lebanese/Syrian experience!"], ["Jen B.", "everything is good all the time, everytime!!! PERIOD. You really can't order anything bad here. The falafel sandwich for lunch amazing.... The Syrian muhammara is supper yummy if you don't also order their amazing hummus! Salads are always fresh and BIG! House cucumber water very satisfying. Keep going until you've tried everything!! It's all good!!"], ["Jamie G.", "The best food I've ever eaten, hands down!!  We saw this on DDD, with Guy Fieri and decided to give it a try. Other than hummus, I'd never eaten Mediterranean food, so I asked the waitress to suggest something. She recommended Yakhney Chicken with Basmati rice and a Mediterranean salad with Taztziki. It was scrumptious!  As an appetizer, we had Spicy Cilantro Hummus--the best I've ever tasted!!"], ["Wafaa S.", "The best Mediterranean food in the Nashville area. I had shawarma but like another reviewer said \" made with love\" a lot of love. The food was fresh. It tasted like the ingredients were picked from a garden right there and then- the water was refreshing and the pomegranate ice tea was the hit- the place is very small yet cosy. Will definitely go back if I am back in TN-"], ["Josh M.", "The food is very good, but it's over priced for Hendersonville.  Especially when you don't have a server, but order your food from a counter.  It's a small and cozy atmosphere.  We never regret going and eating the food, but we do regret having to pay down Nashville prices in our own back yard."], ["Ken C.", "Normally one of our favorite restaurants. Food has always been outstanding, however, this time not so good. This occurred today, 7/31/15, 5pm. The service was not worth paying for. It took 15 minutes, while we stood at the counter waiting for one of the 3 young men to ask if they could help, then they got the order wrong once when the food was served, then I had to go in from the patio to get water 15 minutes after meal was served. We asked for water when the meal was served and we were almost finished before deciding to get ourselves. Really poor service, needs improvements and likely lost a customer. We hope this changes. We will not return until change occurs."], ["Sid N.", "Dinner and service were top notch as always. Decided to have dessert too. THE RICE PUDDING! OMG THE RICE PUDDING! Cardamom, rose, pistachio and something else I can't identify. It's absolutely delicious."], ["Judy H.", "I eat here at least once a week. Today I'm having Chicken in the Sajj, rice, salad and homage pita. Excellent!"], ["Megha M.", "Best Mediterranean Food ever !! My husband and I discovered this place about a year ago when we were in the hendersonville area . We got the chicken on the sajj , based on the yelp reviews and yes it was as amazing as fellow yelpers had said it would be ! We also got some hummus and falafel and loved those too ! we also got some rice pudding, again based on yelp reviews and it was just as good ! Thank you yelp for helping me find this gem !! My husband's office is 5 minutes away from cafe rakka and he often gets take outs for dinner (when he's not already had this for lunch that is). He often takes suppliers to this place for lunch and they love it too ! I'd have to say the chicken and hummus are my favorites. My husband loves their lahm-ajeen , the lamb burger ! Do yourself a favor and try this place, you will not be disppointed."], ["Kenney M.", "The best middle eastern food in the Nashville area. I would highly recommend the lamb Korma and the Hummus is incredible"], ["Nacho L.", "Had the chichen Tika and it was very good.  Humus was better than any I've had. Prices are a little high but you can taste the quality. I'll be back next time I'm in town."], ["Victoria G.", "If you are happening through Hendersonville, you probably don't expect to find the best Mediterranean cuisine ever but here it is.  Don't miss the hummus appetizer. Everything on the menu is basically fantastic otherwise! We are regulars!"], ["Dan Z.", "Guy Fieri, Ricky Scaggs, and The Oakridge Boys couldn't be wrong could they?  Nope!!!!  The lamb burger was outstanding!!!  WOW!!!  Not the cheapest place, but excellent!!!  I will be back!!!!"], ["Mazy E.", "Theres not one complaint for this place! I was craving for some good Mediterranean food and this is the place. The pita breads were all warm. The sweet Mediterranean tea is a must.  They are even very kid friendly.  They gave my son free cookies...can't pronounce or spell the name of it...but because he accidentally dropped a decoration and looked sad. The service was an A+ and because We were new to the place they were very patient and had good recommendations to try. This is a must try!!!"], ["Michelle Y.", "Was visiting Hendersonville, TN for a wedding and wanted to scope out the local food. Found Cafe Rakka on Yelp and had a great experience. Had dinner with 2 friends and ordered a bunch of items to share. Order at the front counter, grab a table outside, and enjoy the fresh air while you sip on homemade ice tea, munch on pitas with hummus and babaganouj and falafel, and finish with dessert (baklava!). Portions are large but we obviously killed all of it (everyone else had to-go containers except for us).The service was stellar. Our waitress was really friendly and quick.Thumbs up!"]], "Aladdin's Hookah Lounge and Bar": [["Jamee C.", "I haven't had food here but their hookahs are excellent and their drinks are delicious. It's not fancy but they go around changing coals and have many options, such as ice hoses, mixed flavors and many many more. Waitresses are sweet and attentive."], ["Jessica N.", "At first I was skeptical because I was not familiar with hookah. But now I love this place! Great environment to bring work, watch games, hangout with friends and eat! You have to get the Aladdin fries!! Best part is the service!"], ["BK S.", "Stopped through Nashville on a road trip and ran across this place. It didn't look like much walking in but the hookah was fantastic! And the food was great! I got the ice hookah hose with the fruit top! By far the smoothest I've ever had and I smoke a lot of hookah! Moral to the story - never judge a book by its cover, or a restaurant for that matter!"], ["Juvonda D.", "This place is great!!! It has a neighborhood bar feel. The bartenders are excellent and know you, your drink, and your hookah by name!! Excellent service! Great food. Please try it...you will not be disappointed!"], ["Kandi L.", "I love this place, especially the cheese sticks! Hookah, atmosphere, sports games on the TV's, nice vibe and great place to meet/mingle with different people!"], ["David R.", "This place to me is a small dive bar that has hookah.I was able to get a table in the corner. This place is small.The service was good, the server attending the tables walked around to see if anyone needed anything every few minutes. I did not eat here, I just came drinks and hookah. The hookah service was great, by that I mean guys would walk around every few minutes and refresh the charcoals. This is the first place I've visited that does that!There was a lovely belly dancer here the night I visited; she was great!"], ["Hak Z.", "I have been in a lot of hookah lounges and Aladdins is the #1 lounge I have been in. The environment is laid back the food is really good but most of all the service is exceptional!! The owners make me feel like I am part of the family.  If you want to go to a lounge with great food, amazing service, and good hookah go to Aladdin!! You will not be disappointed."], ["Michelle P.", "This is great place to hang out and be seen but not seen. There are a lot of different flavors of hookah and I enjoy the music and live shows. The drinks are moderately priced. I've only noshed on others food so In not sure if it's great or not. Good place to go late night for a little fun."], ["Rachel B.", "The owners and management of Aladdin's are rude  a$$holes that don't care about their customers at all. Wouldn't recommend sticking around until the lights go up either, it's disgustingly dirty in there. It actually makes a lot of sense that they don't care about customers or cleanliness because the lounge is UNDOUBTEDLY a cover up for some super shady business dealings."], ["Laila S.", "first off, we didn't eat here, but we did drink and smoke... a lot. The flavors were so cool, you get to mix and match and you found out quickly which ones you enjoy the most. (Mine was a combo of orange and vanilla for an Orange Julius flavor) it was the weekend, so they had a belly dancer, who was pretty good and did a great job of embarrassing some of our male friends. Over all a great time, but you have to be open to a lot of smoke and like to people watch and be entertained."], ["Brian W.", "KM hookahs, fruit bowls, ice hoses and a good selection of shisha. And they serve alcohol. The ambience is average. But for hookah, this is probably the best in town."], ["Jennifer P.", "Despite the decor reminding me of an upscale strip club, I really really love Aladdin's! Not only do they have some tasty hookah (Abra Kadabra being my favorite), but they also have some great drink specials, WiFi, a belly dancer (on the weekends), delicious Turkish coffee, select alcohol infused hookah and some mind blowing gyro cheese fries. YES... I said GYRO cheese fries!I find Aladdin's to be superior to other hookah joints in the area. So, whether you are a hookah lover or new to the scene, stumble in sometime after a show at Exit/In and give it a try. You won't be disappointed!"], ["Leia A.", "I'm so happy we came upon this place randomly. They have a happy hour 3-8pm everyday:  Half off all beers, $3-$4 glasses of wine & $8 hookah! Their hookah on non-happy hour is $13. They have a wide selection of shisha flavors and even options of an ice chamber or smoking from a fruit bowl (extra charge). They do have a food menu, but I didn't try anything from it. But the plates I saw coming from the kitchen look pretty good. Overall, a really chill place to come and relax with friends. It was definitely an enjoyable experience."], ["Nick B.", "This is a really great hookah bar.  Not the best, but great.  The flavor selection has something for everybody.  I recommend the raspberry melon.  It's very tasty and smooth.  This is also the only hookah spot in Nashville I've been to that has a full service bar with plenty of beer and liquor.  They also have an excellent belly dancer that dances at midnight every weekend.The only complaint I have about this place is the atmosphere.  It can seem more like a sports bar than a hookah lounge, especially on crowded nights.  All they play on TV is sports, sports, and more sports.  If you like sports, that's great, but if you want to watch sports, why wouldn't you go to a real sports bar?  If I want to smoke hookah, I'd rather be watching Israeli music videos or something to match the theme.To end on a good note, happy hour is great.  It's every weeknight from 3:00-8:00 pm.  $8 hookahs and $2 drafts.  It's clearly the best value hookah in Nashville.  If they got rid of the whole \"rowdy sports bar\" vibe, it would be perfect.El fin."], ["Kaitlynn S.", "Coco Nara coals. Ice chambers. KM hookahs. As someone who prefers to smoke at home because hookah bars tend to cut corners, I was shocked by the options and quality Aladdin's had to offer and at an extremely reasonable price. This is hands down the best place for hookah I've been to outside of my home, and my boyfriend, a certifiable expert, agreed. We got guava mixed with mint in a pineapple bowl with an ice chamber hose. The blend was great, and the coals were replaced by a pro, so it never got harsh or ashy. It also burned for over an hour and a half -- awesome! We just got hummus to eat, and for $5 it was tasty and a good snack. I will definitely remember Aladdin's even after I leave Nashville."], ["Kelly B.", "Great selection (we had raspberry) and drink specials, WiFi, comfortable seating, and attentive staff: coals continually supplied."], ["Rudi P.", "I'm not a Hookah smoker. In fact, before last night I had never been to a Hookah bar. I like new experiences, so when someone suggested Hookah as something different, I said \"Why the heck not!\"Aladdin's was pretty cool. It was clean and the customer service was great. Even though it was crowded, someone was always checking on us to make sure that we were ok. I wasn't really hungry, so I didn't order a meal there. I had a chance to sample the Aladdin fries with lamb meat and they were delicious. The drinks were on point as well. What I enjoyed best about Aladdin's was the atmosphere.  The music and belly dancing were a nice way to enhance the experience. I really liked the crowd as well. I don't know if it was because it was a Saturday night or what, but there was a great mix of people there. It was extremely diverse & that was cool :-)"], ["AngieLeah S.", "A true hookah lover would know the best hookah is done at home (raises hand- this is me lol) But sometimes you want to go out and hookah for the \"experience\" with friends ya know. Aladdins is the go to place.A real hookah person lover would know Nashville is limited on great hookah options and this one is by far the best, cleanest,and has great food. Every time I have went which is the nigh crawler hours 9pm-3am. Its been a alot of people, but of course you have to be 21 to enter so I have yet to be there with college clowns. Its always been mellow.Sat. is great the belly dancer comes out and does her thing its fun to watch.The hookahs are made great,they do not forget about you either, as long as you are there and they are open you will get coals continually brought out. The drinks are good the best is hookah water very strong lol if that's your thing (raises hand...-thats me)I love Aladdins and put it up against the tiny pool of hookah places in Nashville. The decor is a bit cheesy and may need refreshing but hey I'm not going there for decor, and the music can be loud but I'm paying for the experience and its themed modern middle eastern stuff i guess, I dig it. I have yet to here any American music, like rap or pop.A kool place to be with friends, good eats,smokes,and drinks you cant go wrong."], ["Andrea R.", "Great little place. Hit it up around 10pm on a Friday night and got a table within five minutes. The staff couldn't be more accommodating to first time hookah bar visitors. Large selection, great Middle Eastern themed music (I didn't find it loud and I am really sensitive but who knows, maybe on different nights it's loud.) Clean, with comfortable seating and the other guests were nice, sharing their selections and everything. Will be back!"], ["Antoineka S.", "Cool hangout, wings are great and the hookah is even better! The music is loud and not really my style, but the belly dancer was cool. My main complaint is that friends meeting us later arrived around the time the belly dancer was due to perform and couldn't sit in the only available seats I guess they would be \"in the way\" of the dancer. Understandable, but no other seating was given or suggested. My guests left (along with more money for the business)."]], "King Solomon's Gyros": [["Corie K.", "No frills - great Greek chicken salad- awesome service. Also I noticed they had a really great food inspector score- so glad to have yelp reviews to convince me to give this a try. Don't let the lack if curb appeal fool you- the good was fresh, tasted great and the people were super friendly."], ["Wes D.", "King Soloman is my jam. Simple as that. They always prepare your food upon arrival, so you'll wait a bit. I like to call ahead to place my order. By the time I get there, my meal is ready to go. Can't emphasize how cool and friendly these people are. They're genuinely excited to whip you up some fantastic gyros. My favorite is a gyro/chicken combo salad with grilled onions, mushrooms, and cucumber sauce. Pita bread included! Considering the freshness, cool staff, and solid prices, King Soloman is the best takeout option in East Nashville."], ["Sarah M.", "I love these guys! Best gyros in east Nashville, super fresh and great flavor. The portions are big and they always remember me and thank me for coming back. If you have a large order, it is smart to call ahead."], ["Mark W.", "Dirt cheap and delicious with friendly customer device. You can get just the gyro for 3.99 which is enough food for lunch if your not too hungry, or for 6.99 you can get a whole plate of food including a salad, yellow rice and the fixings for a gyro. If you just want so.e good food this is a great place to stop"], ["Kate W.", "As everyone else said on yelp, the service is great! They are family owned. We were new to neighborhood and very welcoming to us! Gyros are great! I ordered seasoned fries which were really good. Oh! order the cucumber sauce with your gyro! But my favorite thing was the milkshake! I got their butter pecan! Oh my word so good! Great service, really good cheap food! Can't be best!"], ["Ozro D.", "I'll be honest, gyros start to blend together after a while for me. It's rare that any one place serves a gyro that blows me away, and only occasionally do I get one I don't enjoy. Most gyros tend to be - at the very least - enjoyable, and I haven't found much variety in the preparation.That said, the gyros at King Solomon's ARE really good. And the fries (both regular and seasoned) are fantastic. The menu has a lot of options, but I see no reason to stray from the basic gyro combo. I've heard good things about the gyro sub as well.As odd as it sounds, the main reason to come here is the SERVICE. That's right - a small drive through with $6 gyro combos has standout service! The guys inside are incredibly nice, and eager to help out with refills or anything else you might need while dining outside. And the food comes out quick.Fast, helpful service; cheap; good food... what more could you want from a restaurant???"], ["Angela P.", "Food is delish but the customer service is what keeps me coming back. Love these guys!"], ["Mandi G.", "My boyfriend and I stopped by on our way out of town, and I'm so glad we stopped here! We both got a gyro, and they were really great, especially for being so cheap. The best part though was that the employees were super friendly and nice. Also, the tzatziki sauce was the bomb. Thanks!"], ["Davis M.", "Affordable, great food, and super personable service. The owner is usually working himself, and frequently offers free samples of new foods he's working on... It's always good."], ["Jackson S.", "I kept seeing this place every time I went to Kroger and my girlfriend and a friend decided to try it on a whim one day. SO GOOD. Fast (for made to order food), delicious, great portions and AFFORDABLE."], ["Greg B.", "Staff is courteous and genuine about how much they appreciate your business.You must order the 'Gyro Fries', unreal experience. Fries (seasoned or reg), gyro meat, white sauce and a little hot sauce... it'll knock your socks off."], ["Amy C.", "Good, Yes.  Best Gyro in Nashville (as voted in the Nashville Scene), I would personally have to say no.  Now, I'm not saying I would never come back, just that I didn't leave having an, \"OMG this is the best gyro I have ever eaten\" experience (which is usually what it takes for me to give a 4-5 star rating). On the upside...the food was cooked to order and came out piping hot and extremely fresh. So for fast/cheap eats in East Nashville, I would say to give it a shot. Happy Eating!"], ["Esther L.", "King Solomon is top notch. The value for the food is hard to match, as the prices are low, and the food is delicious. This is a smart alternative to the plethora of chain fast food restaurants on Gallatin.Favorite dishes include the chicken hummus sandwich, combo dinner plate, and Greek salad. The yellow rice is perfect comfort food, and no order is complete without tzatziki. Given the heat as of late, as well as the less than stellar view from the picnic tables, I've opted for carryout to enjoy at home. However, it's nice to have the option to sit in front and gobble falafel when the craving strikes. I don't have experience with the drive-thru, but that seems pretty streamlined.If you're looking for inexpensive and satisfying food while painting your house, hosting a yard sale, rushing home from work, or getting messy in the garden, consider King Solomon. Fast food prices, slow food flavors. Many happy returns."], ["Chuck B.", "Solid gyros and related. Super awesome service. Drive thru is handy or hang on the deck. Can't go wrong at Solly's!"], ["Adam C.", "Seem to find myself going through the drive-thru weekly. I usually get the combo plate. It's a heap of Greek chicken and gyro meat with rice, salad, sauce and toasted pita. It all rings in at around $6. It's hard to beat especially with as much food as you get. Friendly and fast service makes this place my go to, safe bet, dining option these days."], ["Kyla A.", "First, let me say that I didn't realize there weren't any photos of this business or I would have taken some. I'll get on that next time because I will DEFINITELY be back soon.I have spent so long on the search for a great felafel in Nashville and have been disappointed at every turn. When I read the review of King Solomon in the Best of Nashville issue of the Scene I decided to give the place a shot, despite my hesitancy of its location (East Nash Gallatin-adjacent Greek is always friendly, but rarely tasty) and super orange exterior. I am so glad I did!The felafel sandwich was a great deal at just $3.99 and was enormous and overflowing with deliciousness. Their tzatziki had a tangy kick that perfectly complemented the crispy outside, soft and flavorful inside, felafels. It was big enough to split for 2 with a side, but I ate the whole damn thing. It was just too delicious to say no.They make everything fresh, so it's worth the wait (which is still not super long, btw). My wait was made even more pleasant by the extremely friendly man at the window Bijon (I spelled it phonetically, but I'm sure it's wrong, sorry). He passed the time with jokes and conversation. I've never felt the urge to describe a drive-thru as \"welcoming\" before, but that's just what it was."], ["Gary E.", "The place looks scary from the outward appearance. The food is OUTSTANDING and very reasonably priced. Excellent Greek food!!"], ["Jennifer P.", "Pretty decent spot if you are looking for a quick gyro. I got their gyro salad and it was tasty, a little onion heavy, but tasty. I can't say this is my favorite spot for a gyro in Nashville, but it is a good one. All of their food is fresh and full of flavor. Their hummus is off the chain too.You really can't go wrong at King Solomon's!"], ["Steve R.", "WOW!  I have lived in East Nashville for two years and have driven past Solomon's hundreds of times.  I decided to look it up on Urbanspoon and it had great reviews so I gave it a shot.  I will definitely go back.  I was really impressed with my gyro plate and the hummus was made minutes before i got there...Yummy!!!Give this place a try!"], ["Russell M.", "Always great. Service, food, and quality. They are always about customer service. Glad they have Yelp sticker in there window so I can give them a review. Tonight spicy chicken sandwich and grape leaves. Try this place."], ["Con S.", "Gyros are gyros, but the service is top notch.  They are quick and attentive, and all sorts of friendly. The salads are great too."], ["Brad M.", "I really enjoy this place. It is a drive through only, so no seating. The mix gyro (chicken and lamb) is excellent as is the spicy chicken sandwich, which is actually chicken, wing sauce, jalapenos and ranch dressing on a pita. It's spicy, hot and delicious.  Fries and shakes are also good. It can be a little slow, because they don't prepare your food until you order it. But, it's definitely worth the wait."], ["Sean A.", "Really good Gyro.  I'm not sure what makes a Gyro good, but I would know a bad one if I had it and this wasn't bad at all.  It could have used more sauce, but that could probably be said about every Gyro ever. The fries were pretty good too.  I got their \"hot wings\" too.  The wings were super crispy... I would say cooked to perfection, but not hot (as in spicy) at all.  That said, I haven't found any other good wing places around so I've gotten in the habit of getting wings plain or without sauce, and adding my own sauce when I get home.  To that end, the well cooked wings here are great.The staff was super friendly.  One guy took my order and another brought the food out, and both of them said \"I appreciate your business.\"  While I was waiting, an old guy with gray hair and a mustache (King Solomon?) went out the back and got something from his car, and he stopped and waved to me.I'm not sure why it took me so long to eat there, but I'd needed to get beyond my usual staple of take-out joints: 5 Points Pizza, Calypso, Far East, etc.  I'm pretty sure I'll be back here soon.And for what it's worth, their health/code score is 96."], ["Luke K.", "I'm a loyal King Solomon's customer but had not previously had their gyro fries.  Mindblowing.  That's all I can really say.  If they weren't already five stars, the gyro fries get them there.  Brilliant, filling, delicious.  Good with the spicy fries or the regular although I recommend the spicy fries."], ["Nichole J.", "My favorite \"fast food\"in Nashville. For a little over $5 you can get a huge falafel sandwich, drink, and side of rice or seasoned fries. That's (well, usually) enough for 2 meals for me.Did I mention the service? After just 2 or 3 visits, the employees all recognize me, and sometimes they even throw in a few extra falafels. Delicious food for the same price you would pay at the Burger King next door, and you're also supporting a local business."], ["E W.", "Great little takeout place. Love the gyro fries!  People were very friendly. I admit, it's not a place I would've stopped at on my own. I read the reviews on Yelp and decided to give it a try. I'm glad I did!  Tasty food, large portions and a great value!  Try it, you'll be glad you did!"], ["Ann W.", "Great takeout. Your basic gyros with a very friendly and helpful guy at the window. He asked if I had been there before and if I'd been satisfied with my food. Made sure we had everything we needed. Spicy fries were good, too."], ["Geoff T.", "I heard about King Solomon when Nashville Scene awarded them the Best Gyro in Nashville. Naturally, I had to give them a shot.You would not randomly stumble across King Solomon. It's in a drive-thru/walk-up only building on Gallatin Road. Honestly, my personal restaurant bias would have normally kept me driving right on past a joint like this.However, the food was surprisingly good. It was also surprisingly inexpensive. For $5.99, I bought the combination platter that came with both gyro meat and chicken on a bed of yellow right with a tasty little salad mixed in. I chose the cucumber sauce, which they poured over the top of the meat in the perfect portion size. I even felt like what I ate was reasonably healthy as well, for fast food at least.I ate lunch at noon. It's not almost 6pm, and I am still full. Value, people.Normally when I buy this type of lunch, the lettuce is the stale out-of -a-bag variety, the meat is a little dry, and I feel like I have to douse everything in the tzaziki sauce to make it palatable. I was pleasantly surprised to find the meat fresh (and very tasty), while the salad was actual romaine lettuce glazed with a good vinaigrette-type dressing and fresh chopped parsley. There were slices of fresh onion, black olives and banana peppers thrown in as well. If they had only thrown in some feta, it would have been perfection.Don't be tempted to feel dubious about the neighborhood or the exterior of the building. The family staff was friendly, the food was good and the price was very aggressive. Not a bad lunch for a cheap guy like me..."], ["Sean H.", "I'm a little mad at myself for not trying this place sooner. I've liven in East Nashville for a year and a half and have driven passed her countless times and never stopped, ever with a recommendation from a friend. Well it's AMAZING! The best Gyro I've had in Nashville, super friendly staff, great food, this place is a must!"], ["Suq M.", "I love this place!  I go here with my partner so often the family (King, Queen, Princes and Princesses) know us!  I even got to say hi to one of the King's grandchildren a few weeks ago--an adorable little Greek baby.  The family the runs this place is super sweet, and so gracious. But about the food...I've heard its the best Greek in Nashville.  I can't say I'd disagree. For a drive-thru restaurant it's ALWAYS fresh, flavorful, and delicious. I personally like their salads. $6 gets you a huge, fresh salad covered in meat and cucumber sauce, with a warm, delicious pita on the side. Their spicy fries are crispy crunchy, their gyros are also delish. However, hands down, their baklava is to die for.  Definitely the best I've ever had. The best part is, it's cheap!  Scary cheap. Like, you can eat here for less than the neighboring Burger King, and not feel terrible about yourself afterward.  I usually call ahead since it's about a five minute drive from my house, and the food is ready when I get there.  King Soloman's is an awesome place for fast, delicious, cheap food, and you're supporting a lovely family!"], ["Chris S.", "Went there today and got a falafel sandwich combo, probably the best i've had in town.  Their falafel are lighter in color than any I've seen and seasoned well, very tasty.  I think mine had like 6 pieces in it, frickin huge, and they gave me tons of fries-the spicy kind similar to the ones at Fat Moe's.  The guy working was super nice too, so I'll definitely be back.  Recommended for sure."], ["Rachel S.", "I almost do not want to review this place for fear of Nashville's best kept drive up secret being let out, however as a foodie it is my duty to tell you about the amazing gyros this nice Iranian family serves. First off you pull up to a window or wait for a server to come to your car to order. AWESOME. Secondly the food is amazingly cheap. $3.99 for a good sized gyro or falafel. Thirdly these people could not be nicer. I had an incredibly interesting conversation with the owner's wife, an Iranian family, who is as interesting as the food is amazing.I've been to Israel and Jordan, let me tell you this is straight out of the Middle East. The gyro is the closest I have come to a one I had in Israel. Full of flavor and they do not skim on the meat or fillings. Fries are crispy and delicious. Falafel is not dry and spiced to perfection. I love this place and you should love it too. Stop by for a fast meal, when you are starving, or have the late night munchies."], ["Snug M.", "Great food and even better service! Workers always have a great attitude. Gyro fries and Gyro plate are amaze balls!"], ["Mike K.", "I \"moved on up\" to the east side months ago and was hesitant to check this place out based on the exterior. Bad choice! I don't know Solomon from Adam but he is definitely the local gyro king."], ["Jason K.", "I was passing through Nashville and decided to grab some greek. I went to King Solomon's for a Gyro and it was absolutely delicious! Great food, great service and I would totally go back there again! The only problem is there is only a small bit of outside seating for eating so if it is cold it might be better to get it to go."], ["Angie L.", "If you haven't tried this place, do it ... now.  It's amazing.  Family owned.  From scratch food and just the best ever.  And, the people are so, so nice.  Love."], ["Randa T.", "I found this place through Yelp and read good reviews. i got a yummy gyro combo and will definitely go back again.  The guys working there are brothers and seem dedicated to offer wonderful food & customer service.  This cute little drive through is a awesome... Also great prices!  The menu offers homemade baklava for even more temptation to stop by ;)"], ["Paul C.", "Best Gyros in Nashville.  Perfectly seasoned chicken and tastiest ingredients."], ["Hillary Y.", "After reading positive reviews on Yelp and Urbanspoon, we decided to give this little drive in delight a try. I ordered the chicken plate served with cucumber dressing and rice alongside a healthy portion of rice. The chicken was well seasoned and cooked, tender and flavorful. The salad was fresh and crisp, though I'd have preferred whole kalamata olives over the canned black olive slices. The pita bread was hot and fresh.  I'll request a bit more dressing on the salad next time, and I could barely manage to eat all of my rice, but overall a fair price for a hot Greek meal that satisfied my craving. Service was friendly and quick, too, another plus! I'll be back."], ["Janet S.", "For the love of god we stuffed our faces with food and drink today.  Yummy meat and super fresh salad and  a portion of fries, pablo can be downright hog like!.  Delish apart from the white saucy stuff on the meat, lets say hold the white and add the hot sauce.  Yum and by the way the server was hot hot and cool (marcia can I say that). Nice cheap eats in the hood, snaps again elle!  Greek ? methinks not."]], "Sam's Kabab Gyro": [["Dave L.", "These guys are awesome! The food is great and they're super friendly all the time. Sometimes I go in there and get food even when I'm not hungry because the guys who work there are hilarious. They always greet you with a smile and a joke. The food is fresh, delicious and filling. Really fair prices too - you get a jam packed gyro with delicious lamb and fresh ingredients for $5. When a Big Mac is $4 and is a piece of shit how can you go wrong with Sam's gyros? I HIGHLY recommend this place if you're in town and you want some quick, fresh, delicious, protein packed food with a little bit of humor to brighten your day. Two thumbs for sure."], ["Ashby F.", "Very good and inexpensive. Priced similarly to the fast food joints around here, but the food is much fresher. The Grilled Chicken Salad is a large portion and very tasty...Gyro is good as well."], ["Joanne B.", "This place seriously has the best rice!!!!!! Such great service, the staff is always so nice! I always get the chicken platter, I don't care for lamb meat but if it's any close to the chicken it must be great!!"], ["Emily R.", "Had an awesome (and cheap) falafel here. They packed the pita tight and used hummus to seal everything together, so it was easy to eat - not too messy. It really hit the spot after walking around Cheekwood. Employees are very friendly and like to make you laugh."], ["Cameron C.", "This place is a hidden gem in Bellevue! If you love authentic Greek food, do yourself a favor and come here. I always get the gyro platter and I'm never disappointed. It's a ton of food (way too much for me to finish on my own) and it tastes wonderful. Everyone is super friendly and there's a really good chance that you'll be told that your food is on special that day for $100 (just go with it, it's a running joke). I always leave there laughing and glad I decided to go in. Love, love, love this place!"], ["Alexander M.", "Yum! Yum! Yummmm! This place was fanatic! I'm visiting my cousin in the Nashville/Bellevue area and I was craving a Gyro sand which! Low and behold after hopping on yelp I was able to spot this location that's less than 2 miles away! The reviews were good and the pictures seemed to look quite tasty as well! For literally just about $7 you can get a very fulfilling Gyro sandwich meal!"], ["Laura C.", "I'm a huge fan of this place! My go to is the gyro platter which has always been delicious. Great prices, great quality and everyone that works there is super friendly!"], ["Bree B.", "Best hummus around hands down!!!  Love the friendly staff.  They always make me smile!"], ["Kerri J.", "I can't express just how much I enjoy the variety of delicious flavor that is contained in a gyro platter with tabbouleh. I have to stop myself from eating here everyday. I wish I could talk about other things but I feel like I have found perfection in this dish. The sauce they put on the top.... I could drink it. It seems like ranch but it can't be that simple. The dining area is simple. The staff is very friendly."], ["Tabitha W.", "Funny, friendly, tasty, and the price is great!"], ["Andy B.", "Well, I went in here to get a gyro, but I have this thing about cheesesteaks, and if I see a cheesesteak on a menu I'm going to order it.  I always watch people make cheesesteaks if I can because it's a passion of mine, and where did they go first?  The freezer.  To pull out a frozen block of meet.  That's a big strike one, and it kinda went downhill from there.  I was hoping to find a new, cheaper option to Jersey Mikes double meat Big Kahuna ($14), but this one just wasn't very good, and for all the reasons that I noticed while they cooked it.  They get a pass because you come here for gyros."], ["Paul B.", "The best. Sam is hilarious, and runs a tight ship - every time I have been there, it has been consistently high quality.   I love the gyros,and the falafel is great, too. Try the cucumber sauce instead of the ranch dressing for a really authentic experience!"], ["Katie M.", "My husband and I love gyro salads and have been trying a bunch of different places in Nashville to find our \"go-to\" place.  Luckily for us we stumbled upon Sam's and have never looked back.  I think we end up getting take out from here at least 4-5 times a month.  The gyro meat is some of the more flavorful meat in town.  Also - the white sauce is perfectly tangy.  However, one of the best things about this place is the people behind the counter.  They are so happy and can be quite the pranksters.  They also recognize my husband and I as regular customers and have started to learn our order.  The service is wonderful and the food is perfect.  Can't recommend this place enough, especially if you are in the Bellevue area."], ["Nikki B.", "Soooo good and they aren't stingy with their ingredients. They will pack that gyro FULL. Both the chicken and the lamb are great and their vegetable options are very fresh."], ["Tyler U.", "Great gyros at a great price.  Pita and hummus are very good too. Have been here several times since moving to the area recently. Has become my go to place."], ["Amber B.", "Flavorful food. Friendly service. You can't go wrong ordering here! The chicken plate was delicious. Gyro meat was tasty. Excellent little place! Salad was crispy with a wonderful sauce that accentuated instead of drowned the flavors. They were out of one item and went out of their way to make a substitute that was delish! Come eat here. You won't be sorry. Wish I lived closer."], ["Chad R.", "Great place. We had to place multiple orders for a work event and they were super accommodating and helpful on everything. Orders were correct, nothing was out of order. Great job guys!"], ["Sue W.", "Still love this place. Consistently great. Always fresh and delicious. Friendly and affordable."], ["Paige L.", "Delicious! Very hospitable staff. Stopped in for lunch while in town for work, and I felt like a regular - the owner is super friendly. Ordered the chicken salad with everything, and it was wonderful. Not a lot of options, but very well seasoned meats and fresh veggies paired with great prices and the best pita bread I've ever had made for a great experience. I'll be back if I get the chance!"], ["Deepak B.", "Love this place. When I fly into Nashville airport every week I am starving. This place in my way and I just order random things on the menu. The service is nice, food is plenty and flavorful, and prices are reasonable. There is a sit down place across the street (will not name) I wouldn't recommend. SAMs is one my favorite go to places in Nashville."], ["Jams X.", "foodgasm. HUGE portions at a great price. did I mention that the food is amazing?"], ["Charlie S.", "Really good deal.  They are pretty cheap and portions are huge.  Quality of food is good but not great."], ["Seth N.", "My salad was very good. I will go back!"], ["Tanya S.", "I heart this local gem. I always get the gyro platter. It's a tad salty for me, since I don't generally do salt. But the flavors are yum. I have been about 6 times and I have yet to be disappointed.  The meat is juicy!  The young man who is always there is friendly and accommodating. Hope you enjoy it as much as I do."], ["Wayne H.", "It's not the greatest place for Mediterranean cuisine, but it is reasonably priced, filling, and the only original restaurant in Bellevue.  The combo platter is an inexpensive $8 for a choice of meat, shaved beef or grilled chicken- and three other side items, which include Greek salad, tabbouleh salad, hummus, grape leaves, pita bread and felafels, as well as pita bread. The tabbouleh is clearly home-made and it is absolutely delicious, with a nice dominance of parsley and mint as opposed to bulgur.  The hummus is quite peanut-buttery and seems homemade, but lacks some of the lightness that I associate with the dip, while the felafels are at times quite hard to bite down on. As I am disinclined to eat beef, it also bothers me when the water comes with pieces of beef strips stuck on like remoras. Still its cheap, and for the people in Bellevue it gives me a bit more choice than the usual line of fast foods.  For some reason every time I visited the television was on with some CNN broadcast involving some issue in the Middle East: first the start of the Arab Spring, then the Libyan War, then bin Laden's death, then fighting in Yemen.  Very strange."], ["Corey F.", "I've yet to have a bad experience here. The $4.99 Lunch Gyro special is hard to beat. The food is tasty, authentic and plentiful."], ["Stephanie W.", "It is rare that you run across a small business where the price is as delicious as the food and the customer service is outstanding. My husband and I eat here often. We love the fact that we get a meal for two for under $15. I simply love their pita gyro (said=hero) sandwiches and the babaganoush is unbelievable. Recently, they redecorated and the space. They added a large screen TV, new booths, wall color and cozy lighting. When my husband can't join me, I can watch the news. The owner is almost always working. He is such a warm and friendly person. We enjoy seeing him when we dine. He delivers personal service, every time. Did I mention the chicken? You simply can't make this kind of food at home for the prices you pay at Sam's Kebab. I highly recommend this place!"], ["S G.", "Found this place on yelp, having never noticed it before.  This guy is serious about his gyros and hummus. Both were massive and delicious.  My only real criticism is that the iced tea was not fresh brewed.  Otherwise everything was great. Don't expect a fancy dining room.  Clean but simple."], ["Lucy L.", "unbelievable little hole in the wall with great and authentic Mediterranean food! Portions are large (almost too much) and the staff is friendly and helpful. Also very affordable and close to home so we frequent this place and always have a good experience."], ["Shana K.", "Last night I was driving home when the falafel craving hit and here I was in Bellevue with no hummus fix in sight, right? Wrong! Tucked in the same strip mall as Lemongrass, TJ Maxx, CVS, I see the tiny neon sign \"Sam's Kabob Gyro\" and another one that says \"OPEN\". Well, the place was empty but the cashier/waitress/owner's daughter? assured us they usually have busy evenings as well as lunches, since they have the mediterranean market cornered in this area. I ordered the falafel plate and my fella got the stuffed grape leaves. First off the falafel were HUGE. Perfectly cooked and tasty. The plate came with good taboulli salad, hummus, rice and tzitziki sauce. I'm not sure how many grape leaves came with the order (maybe 5 or 6) because they disappeared very quickly. There was more than enough food to share and nothing on the menu is priced higher than $6.87. We'll definitely go back. Good eats!"], ["Rj S.", "It's shocking and very hard to believe that some  hole in the wall business(Owned by a very Kind Coptic Egyptian family) here in the Tennessee makes best Gyros, better than those in California!! This place seriously has the best Gyros I've ever eaten in my life, no joke! Blows Daphne's and these other Greek knock offs out  the water! What is southern California doing wrong?!  Thats the capital of Ethnic foods for goodness sakes, we should have the best gyros!  Truly, these Gyros are just out of this world; fresh, flavorful and quality! I may add that these Gyros are nothing like a typical gyro, these Gyros come in a pita pocket formation. Whats also cool about this place, you get to chose what you want in your gyro, just like  how you can customize your burrito at chiptole. They have a whole variety of goods you can put into your pita pocket like tabblueh, feta,Tzatziki , lettuce, tomato and much more! You can also substitute chicken if you don't like a gyro meat.  Whats also good here is their natural cut fries! They always cut fresh, cooked to order and top with seasoned salt. It taste so  amazingly good with the Gyro.  Two others things worth mentioning are their falafel and Souvlaki(kebab)! The Souvlaki  is always  juicy, flavorful, served with rice pilaf and a Greek salad .Their falafel, simple but darn good and fried to perfection. . I must say I'm truly blown away by how good the food is here. It's Hard to find a place that makes good  Greek food and this place has surpassed many in my book.  Come here if you're looking to try the best Gyro in your life."], ["Quentin M.", "Sam's is a hidden gem in Bellevue. This is exactly what you want a gyro place to be. It is nothing over the top. The lamb is excellent. The portions are perfect. And my girlfriend and I agree that they are our favorite french fries in Nashville. If you're lucky, Sam himself will be behind the counter but all of the staff are very good."], ["Andrea F.", "I had heard that Sam's was really good, so I decided to take my Dad last week. It was phenomenal. The food was delicious, the service was great, everyone was friendly, and it was packed. I'll definitely recommend this restaurant to all my friends, and in fact, I'll stop by there on the way home tonight. I hope Bellevue keeps this restaurant around for a good long while."]], "House of Gyros": [], "Kalamata's": [], "Istanbul Restaurant": [["Amy K.", "I've been going to Istanbul for years, and every time I leave completely happy with my experience. The food is delicious, plentiful, and flavorful (and a great bargain!). Between the toasted pita and creamy hummus, all the delicious soups (though I'm partial to the spicy yogurt), and chicken, gyro, and doner, the owner Mehmet always knocks it out of the park. And surprisingly, he has what is probably the best burger in Nashville. And his baklava? Flaky, sweet, and delicious.Along with the great food comes great, attentive service. My cup of hot tea is always filled, and I always get a nice chat with Mehmet or his sweet wife. Located conveniently off of 440, Istanbul is a true gem that you don't want to miss."], ["Casey S.", "Came here on a whim.Got the sampler appetizer which had olives, tabbouleh, falafel (If I remember correctly), hummus, and some cucumber/yogurt dip. All very tasty! I got the Kofta plate, which was very tasty. You get a HUGE mound of rice to go with it. The food was really good, so I definitely recommend it. Atmosphere was lacking; it's a little dive-y if you ask me. Parking lot was TINY--only a few spots. Not sure if they have parking in back or not.The only complaint I have is that we ordered 2 Turkish coffees along with the rest of our order, and they weren't ready until after we were already finished our whole meal. We mentioned it to the waitress after we got our appetizers and then when we still didn't have them, we assumed she just forgot and gave up on it. Not sure why they took so long to make. Especially since there were only two other people there, and they'd been there for a while before us. They were tasty though! I didn't know that Turkish coffee left a lot of sludge in the bottom of the cup, so I had a rude surprise at the end, but my boyfriend said that's normal."], ["T J.", "Finally tried this place due to all the positive reviews, and unfortunately our experience was poor and we are unlikely to want to return. This place needs to up its game to earn all the glowing reviews here - which are a bit astonishing after trying it myself.Ordered the following plates: one falafel, one combo hummus/baba ganoush, one gyro meal, one combo with gyro and chicken. Hummus was average at best, we can easily make better at home. Baba ganoush was inedible, a strange smooth consistency and odd color. After first taste we left it untouched, and didn't finish the hummus. Falafel was average and not particularly flavorful. The main courses were dried out, not fresh at all, and as we were hungry we forced ourselves to eat through it with a hefty covering of hot sauce (which was tasty). Tabouleh was a let down, and cucumber salad made for the tastiest bites of the meal (it was cut fresh!)I've had Turkish food in Turkey, and London, and elsewhere, and getting it right just isn't that difficult. Grill the meat fresh!! Same goes for all other dishes as well."], ["Clara Sue B.", "I've been meaning to stop by Istanbul restaurant for quite sometime and finally had the pleasure today! I had Turkish hot tea, spicy yogurt soup, and the Mediterranean  salad with gyro meat and cucumber sauce(1/2 order was definitely large enough). It was great! There was barely a soul in there, but I went around 1:30. The main guy behind the counter was so sweet and friendly. Best thing was it was all under 10$! I recommend!"], ["Praveen P.", "BEST BURGER in Nashville !  Not expected, but it is what it is..Great service as wellBurgers at Pharmacy, Burger up, Melrose are not even close"], ["Samantha B.", "Love this place. Whenever I'm craving Greek food in Nashville I come here. They have great hummus and gyros."], ["Ray D.", "Average food and average service. I would eat there again, but I wouldn't go out of my way to do so. House of Kabob is a couple of miles away and much better food."], ["Leigh M.", "Absolutely delicious!I tried this place because my first choice restaurant for lunch was closed. Pulled out my Yelp app and saw a place called Istanbul was close and figured it seems worth trying.I'm so very glad I did!I'm honestly shocked that they weren't busier. Besides me and a couple coworkers who came to lunch with me, there were maybe 3 other occupied tables in the middle of what should have been the lunch rush. Don't let this fool you into thinking this place isn't great though.I ordered the greek salad with doner meat on it, and it was fantastic. The salad itself was picture perfect; everything was arranged so nicely I almost hated to disturb it. Piles of veggies, piles of feta cheese, and a pile of freshly grilled doner meat in the center. The greens were fresh and crisp, the meat was tender and delicious, and the olives & feta were quite olivey and fetaey, respectively. At first I thought it was a tad pricey for a salad, but it was well worth it. They absolutely did not skimp on the ingredients, and the portion is as large as it is delicious. Unless you're practically starving, you can plan on bringing some home with you.I also had their white bean soup, served with some sliced pita bread. The soup was absolutely fantastic with the perfect level of spicyness. I definitely intend on visiting this place regularly.Oh, be sure to park around the back; the few spaces in front are a pain to pull out of, and the funeral home next to the restaurant has quite a few \"We'll tow you if you park here\" signs."], ["Thomas Z.", "This place is great !  Delicious, freshly prepared food with with friendly service.  I've been to this place four times in the past six months, and have always thoroughly enjoyed my meals.  They usually have a freshly made juice from several green vegetables. Extremely healthy !"], ["Caroline H.", "Loved this place. I came with a group of 6 last weekend for a friend's birthday lunch. We arrived at 1pm on a Saturday and the place was completely empty. (There's parking around back, FYI!) But by the time we left at 3pm, the place was packed! Odd timing of meals, I guess? We started with some hummus and baba ganoush which were both tasty (and we got refills of pita!) Then a round of soup for everyone. I got to try all 3 soups. The white bean was tomato based and tasty, but the least popular at our table (Mildly spicy). The lentil wasn't spicy at all and creamy and delicious. The yogurt soup was super spicy in a totally delicious way and was a hit at our table. Next, most of us ordered a combo platter of some sort (some with shish, some with gyro, some falafel, etc). Everything on my plate was awesome. I was a little disappointed that they didn't have doner available (wanted to try it due to the super reviews on here!) but it was still marinating. Bummer! (Next time)Our waitress was really sweet and attentive and brought us wine glasses for the champagne we brought to toast the b-day boy. Then she brought us some baklava with candles and started up the birthday song! It was really fun and we all felt really well cared for. I'm not sure if she hooked us up with a deal or what, but I paid for myself and the birthday boy and with tax and tip it came out to around 35 bucks (for 4 courses!) AWESOME. I felt like family here and it was a delicious, filling, and fun (and not expensive!) experience."], ["Jill L.", "The owner was extremely kind to my 2 year old son. That means a lot because I know 2 year olds can be annoying and messy!It's not the most, erm, swanky of atmospheres but whatever. It's cheap, the portions are plentiful and the service is great!!! I love it!"], ["Michelle B.", "One star for the owner being a nice lady. The other star is for the food being fresh. That's about all. The flavors are bland for Turkish food. Too much tahini in the eggplant and hummus made them taste bitter.  The pita is rubbery. The meat-- very dry. Clean space. Bare decor.Cleaning the floor while eating is not only unsanitary but bad for my allergy."], ["Boston B.", "Good dinner/lunch type food. Dinner for 2 big plate of rice (lots of rice) and meat coast $22.99 I think is good price."], ["Jen R.", "Good food. Ordered the house sampler, sampler appetizer, lentil soup, & white bean soup.  There was nothing i disliked.  Felt like eating at someone's home which was a very welcoming atmosphere. I thought it was a reliable family owned restaurant"], ["John S.", "I don't get why this place is not far more busy - they have great food, a friendly staff, and it's cheap. I've been here a couple times, and it is always tasty and cheap. This time I just came for a to-go order, 2 gyros. They were actually very custom, so to speak, since I wanted only certain things on each one and not othersm and some extras. I had one with just the meat, the lettuce, and cucumbers. And the other, mine, had the standard, minus tomatoes, plus feta, parsley, and a few other things. And sauce on the side for both.I had no problems at all, it was done quickly, and each gyro is only 5 bucks, normal price. It's also kind of huge for a gyro sandwich - it was very filling and if I'd gotten a side it would have been far too much food. The meat itself was flavorful and not dry at all, while the vegetables tasted fresh, the lettuce and onions crunchy as I like them.Overall, delicious and it makes me want to come back here more often. Small FYI, they don't take Amex."], ["Joe S.", "I have eaten here a few times and I have NEVER been disappointed. The chicken kabobs are my fave."], ["Hanna H.", "My husband and I love Istanbul! We get there about every three months or so and it's always been a great experience. We normally go on Saturdays at odd times so it's never been crowded. The hubs is a standard gyro guy and he says they are great! I sometimes get falafel sandwiches or Greek salads. Both of which are satisfying. I will say the Greek salad is one of the best I've ever had (close second to Euro Grille, which I'm not sure still exists).During our most recent visit, the waitress brought us samples of two soups to try and they were delicious! The hummus is fantastic and we always get an appetizer to share. Our son loves it! We may or may not always get baklava either to go or to eat in. I mean, why wouldn't you?! It's honey heaven!The atmosphere is very welcoming and friendly and it feels like you are just hanging out in a friend's living room. All this talk about it makes me want to go again now!"], ["Katya W.", "Absolutely yummy!! The owners treat you like family! The food is amazing! My husband and I had the gyro sandwiches, they were huge and yummy. We also had the lentil soup it was so creamy and earthy! They make their yogurt from scratch, yummy!! Also, their deserts are amazing!!"], ["Kevin M.", "For my first visit, a solid and delicious meal.  Starting with the white bean soup and Turkish tea, both of which were very good, the stage was properly set.  The Doner plate was excellent. Finding authentic Doner is a rarity and this offering is one of the best I've ever had.  Succulently tender and juicy, while being subtly spiced in a way that defies the detail of ingredients, but culminates in a unique symphony of flavor.   Looking forward to many return visits."], ["Rod O.", "Fantastic Doner! !! !!!!  The Owner told us this is the only Doner in Tennessee!  Real Doner is a rarity, this one is Excellent, Superb Flavor!  By the only Doner he may mean not only is he shaving the Meat loaf from a Vertical cooking rotisserie, after slicing thin stripes he takes the meat to the grill and sautes it with Olive Oil!  The Owner told us that is the real Turkish way to prepare this Incredible Meat!!!   All the Meats were enjoyable:  The Doner, Beef, and Gyro were my favorites!  The Chicken, Shrimp and Kofta were good, seasoned nicely... My next visit I will get the Doner Platter!!!!My Girlfriends Father who probably did not want to eat here was impressed with the Burger (said it was the best one he had eaten in quite a while) I tasted the Burger, it was good and wait until you see the photo, we guessed it was Half a Pound of Meat (I took a Photo)!I Love Turkish Tea, this one was Cinnamon and was Very Nice!Turkish Coffee, this one was GREAT!!!  Cardamom makes the difference! We got all three soups:  Lentil, White Bean and Yogurt.  The Yogurt was the spiciest dish of the meal.  All three had good flavor! The Desserts were good!  Better than the \"Greek\" versions!  I'm used to a Baklava with Pistachios, less syrup and maybe some Clove, still this was a good one!The Tabbouleh was good and the Baba Ganoush was Very Good!Our Server was great!  She and the Owner made us feel at home!"], ["Rania K.", "I have no idea where these stars and positive comments are coming from. The parking is so old and small, the inside is old and not clean, the bathrooms are too primitive, and the FOOD was very greasy and not fresh. The chicken was old, the soup was too salty. The fries were absolutely not fresh and fried with very old oil that made the fries look nearly light brown. The worst choice ever"], ["Dafna R.", "The food was good, but not great. The spices were a little off, but overall a good meal."], ["Sarah K.", "Favorite Turkish place in Nashville! I always get the Frank's Special (gyro, tabbuleh, and rice in a pita) and a side of lentil soup. The soup is spicy and delicious! I can eat the soup and half the pita and save the leftovers for lunch the next day. Delicious, healthy, and affordable. The hummus is really good too, but maybe that's just the drizzle of olive oil on top talking! :) Never have had a bad meal there."], ["Meghan P.", "Love this place! The food is food and authentic, especially the gyro plates and the baklava. Not the prettiest restaurant, but so worth it!"], ["Daniel S.", "It was good but not great. Food was fresh and the service was pretty good. The decor leaves a little something to be desired but worth trying."], ["Geoffrey K.", "Can you have a bad meal here? I doubt it. Consistently delicious and straight up home cooking. They make you feel like family because that's who's cooking your food and taking care of you. I have been several times and was always happy. Something as simple as the chicken platter was cooked to perfection and a highlight. Do yourself a favor and visit soon. You'll be part of the family too."], ["Jonny W.", "Wow! So good and best service ever. They Definitely have Turkish hospitality. The combos are a good deal, and if you go you have to top the meal off with baklava and Turkish coffee!"], ["Tara S.", "I really wanted to like this place. I had read all the reviews and they have an almost perfect star rating. We were able to sample some of their food at the InterNASHional Food Crawl and I must say their chicken and gyro meat were excellent. I was so excited to go back! So the next week we went back and ordered the doner and my husband had a gyro plate. Both tasted decent but, to be honest, the meat didn't taste anything like the ones we sampled. It was mediocre. The ranch tasted like Hidden Valley and they boast that it's homemade. The cucumber sauce was the worst I've ever had. Maybe it's because I'm used to true tatziki? Also there were only 2 tables besides us in the restaurant and the wait time to get our food was crazy. We waited a good 25-30 minutes after we ordered to get our food. That, along with having to back up into traffic because of their parking situation, leaves me not really wanting to go back."], ["Bud M.", "Love this place.  Love the soup, especially the Lentil soup.  I go there for lunch and I always get the Barry Special, well most of the time.  I'll get the hamburger on occasion.  The gyros are great!  Love the fries!  One of the best hamburgers anywhere.   Go by for lunch or dinner you won't be disappointed."], ["Paul K.", "Huh... that place was good.  I mean really good.  I have not attempted the BYOB yet, although I did bring some wine, just was not up for it when I went.  The hummus was great, the pita was very good, the rice was kind of waxy - not the greatest rice ever.  The falafel - not sure if it was perfect, but it was extremely good.I was well stuffed when I left this place, value was there, I think the rice will improve.Service was a bit slow, but nothing to complain about/"], ["Mark S.", "Another great visit to Istanbul Cafe. Mehmet has upgraded the interior a little - new chairs and the ceiling is nicer. He said he will be working on the floor next. It would be hard to upgrade the food - one of the best values in Nashville. I did the Gary Special which comes with a gyros sandwich, choice of either a cup of soup or fries and a soda for $6.99. The gyros meat was sliced fresh, not pulled out of a pan. The lettuce was a fresh green leaf not garbage iceberg, the tomato slice was fresh and the tzatziki was tzatziki not ranch. Again the lentil soup was killer - my father had the white bean and surprisingly it was red in color and not bland white bean soup. I got a can of the Turkish coffee to go.Try this place out folks, you'll be glad you did. The owner Mehmet is one of the most humble men I've met."], ["Lori C.", "Love this place! First time in and our dinner was fabulous! The pistachio baklava is especially good!!"], ["Kim Y.", "I'm a skewered greek/turkish meat fiend and this is tied with my favorite place to grab some in Nashville. My other favorite is Anatolia, but seeing as how I can walk to Istanbul from my house and its about $2 cheaper overall, this place edges Anatolia out unless I also want to shop at Target. Don't be scu-red of the slightly run down interior, I prefer to think of it as 'homey' seeing as how they also let you bring in your own beer and wine, like an old friend just stopping in for some lovingly prepared meat on a rotating spit. The service is similar, not bad - just really laid back, but prompt. I've been a time or two when dinner took what seemed like an eternity, but we were the only couple in the restaurant and I think he was cooking up fresh batches of goodness. I'd rather wait then receive lunch leftovers, ya hear me?I generally go with a classic platter. Honestly the rice is ho hum and I wish they gave you a touch more tabouleh or salad to mix around on your plate for crunchy texture, but the meat - oh the meat shines! Compliment it with spicy tea and soft pita bread with tangy hummus.The greek dressing(s) they offer are also extremely good, but I wish they offered a few more zippy sauces in addition to the sad Louisiana hot sauce on the table. (I'm not insulting La. hot sauce, it has its place in the world, I just want a few more authentic hot sauces)Overall a very solid greek/turkish/middle eastern place to score some dinner on a budget or a fun place to take a group outing since its very roomy, rarely busy and is BYOB!"], ["R P.", "Excellent Med. food.  Service was excellent.  Great baklava, not too sweet."], ["Jan S.", "The place is not very clean. The service was average for there only being 2 tables. The food was average at best. Ordered baklava and powdered sugar cookies. Both stale. Very disappointed. The user star ratings would lead you to believe this place was superb. Two stars is generous."], ["Bobby B.", "Cheap? CheckGood? CheckHole in the wall? CheckAmazingly sweet woman running it? CheckThis place made our entire trip.We adored her and I really adored my lamb shank and rice dish. Really great stuff.Good felafels too."], ["Cara M.", "Wow!! This is some AMAZING food!!  The other reviews are definitely accurate about the burger--huge and delicious, according to my husband. I had the chicken plate which was delish!  I loved eating real, homemade tabouli! Mm!!  All meals come with soup (lentil was pretty good) and pita bread. I will say the one downfall was the pita bread and cucumber sauce. The pita tasted like something I would buy at Walmart and not the typical bread. The cucumber sauce had a mayonnaise taste. Not my fav, but the other food definitely makes up for it.  Since this was our first visit here, we decided to try the baklava and Turkish wedding cookie for dessert, since they were made fresh the same day.  They definitely didn't disappoint!  If you're up for an adventure and homemade food with awesome customer service where the owner/chef will actually check on the tables periodically you HAVE to try this place!"], ["Frank C.", "THE BEST PLACE TO EAT ON NOLENSVILLE PK..... I've been going here for 6 years. Lunch, dinner, takeout & even catering. If you want great Turkish( Mediterranean) food and lots of it for a good price then this is your place. Istanbul Cafe is a true family ran business. There is only 2 people you will see that cook here, Memet or his son Yusif. While the wait staff may vary from time to time, you'll be treated like family. Parking is tricky. There is 5-6 tight spots out front, or you can park around back. If you're not sure if you like Turkish food and want to play it safe, then get the 1 pound cheeseburger. Its seasoned and cooked perfectly with very lean beef. I think its priced around $7.00 w/ fries. A coworker killed off 2 of these in 8 minutes 25 seconds on a dare. No small feat. Let me know if you can beat that and wanna throw the gauntlet down. The grilled chicken tenders platter, approx $7.35 w/ (basmatti rice, tabouli & cucumber salad) is my \"go to meal\". The 4 big chicken tenders are marinated for no less than 24 hrs in a variety of seasonings and then cooked on the flat top to the point that they just cut easily with a fork. Their gyro is really the best I've ever had. You gotta try the Tarhana soup. Its a yogurt based soup, but not the kind of yogurt you're thinking of. It has a \"Hot & Sour\" type of taste that's more addictive than most forms of opiates.  Get the \"donner\" plate or sandwich. Specially seasoned strips of beef that is considered a predecessor to gyro. Make sure you get it with the cucumber sauce, it just goes better with it. Speaking of sauce... what Memet calls \"ranch\" is more like Tzatziki & Ranch combined with a more yogurty base and sour taste. Its always homemade and you will wanna drink it as a beverage. The Mediterranean Salad (romaine, onion, feta, tomatoes,kalamatta olives, tabouli & cucumber) with chicken or gyro for $8.25 is gynourmous. The lamb shank falls right off the bone and fills the plate full of  \"the best rice ever\" with its juices. Most regular plates can be shared by 2, but you really wont want to.  Split one of the big \"specials/ combos\" with a friend and have a variety of all the meats they offer and then some left over.Consistency is always there. Its the definitive \"MOM & POP\" place for easy going Turkish food. itanbulrest.com try a \"Franky Special\" w/ chicken, gyro or donner."], ["Steven K.", "Yes, the neighborhood is a bit sketchy, the restaurant interior is dim, but the food is fantastic."], ["Elizabeth S.", "Pretty amazing Mediterranean food -- best Turkish food since visiting Turkey. Tried this based on the Yelp reviews and was not misled. Authentic baba, hummus, and tabbouleh in the appetizer platter; had that along with crispy lamb in the gyro. Lovely spicy bean soup too. Turkish coffee was great but surprised it was already sweetened. Really kind and genuine staff, even though it was one woman's first day. Started talking with the owner -- great guy -- and he offered us complimentary baklava. He was smart -- we'll definitely be back for that, such a pure taste of honey! Have to try the walnut, pistachio, etc. Will definitely be back!"], ["John S.", "My wife and I have been eating at the Istanbul Restaurant since it opened. We have probably eaten there thirty or forty times. We have eaten just about everything on the menu. We ate there again to night, and nothing has changed since we started eating there. The dishes are still freshly prepared. The service is prompt and courteous. All reasonably priced!!!"], ["Meagan M.", "Best Turkish food in Nashville. So cheap for what you get, too. Tabbouleh is amazing, as are the lamb Kuzy and yogurt soup."], ["Colleen E.", "Either we visited on an off day or we ordered the wrong dish, but our experience was less than impressive. The chicken was dry and the baklava was *extremely* sweet and soggy. We were the ONLY diners on a Sunday at lunch, and the restaurant was freezing. I'm hoping it was just an off day, but I'd have to be convinced to try it again."], ["Eli C.", "My favorite Greek restaurant in Nashville. The owner is super nice, too. Best Greek salad in town."], ["Tina S.", "This place is fantastic!  I went there for the first time last night, and I already want to go back.  I had the stuffed eggplant, and it may be the best thing I've ever eaten. The spices are amazing! The service was great too. They're going to start serving varieties of fresh juice, and I sampled one made with guava juice, kale, carrots, spinach and apples, and it was delicious.  I can't say enough about this place."], ["Dalton Q.", "I went to Istanbul Restaurant during lunch today and found the food and pricing to be great. I got a small cup of lentil soup which was like finely ground lentils and it was wonderful. I also got the shrimp pita, the portion was small and it was appropriate for the small price I paid. The flavor was nice and the tea was very different. I also had some of the beef kabob and it was great. The person who brought me said it was explained to him that the tea was a blend of spices of some kind. I brought some home for my wife who is picky about tea and she loved it. The decor is not very interesting, but the people were quiet but friendly. The servers visited our table many times and never let our drink run out. Overall I had a great experience for eating lunch. I can tell they care about the food and is different from our usual diet. The bathroom was run down but clean and I think a clean bathroom tells a lot about what you can expect with other things. You aren't going to find a better price for the food and it is good."], ["Lindsay W.", "Came here on a whim one night and was not disappointed.  The gyro plate was delicious and the portion sizes are HUGE.  I originally came in because I wanted some baklava.  Ended up taking it home with me uneaten because I overindulged on hummus and gyro meat.  Oh well... at least I knew when to cut myself off.   The baklava the next morning was perfect.  I want to keep little triangles of their baklava in my pocket to snack on."], ["Eric E.", "The Tarhana soup was on point! It had a nice kick to it, and the rack of lamb I got, kuzy, the meat just fell off the bone. Food is delicious, and prices are fair. 4 stars because service is inconsistent."], ["Trey-Jen M.", "really good food, thoroughly enjoyed it. hole in the wall feel which is fine by me. baclava was a bit on the pricey side though..."], ["P P.", "I came here because of a Scoutmob deal and, as a Turk, I was very pleased. The lentil soup was almost as good as my mother's. The pita bread was fresh and delicious. I had the Doner platter and was pleased. The Chicken Shish, which my friend ordered, was excellent. The chicken was juicy and not overcooked. Both platters came on a generous portion of flavorful saffron rice. The staff was friendly and attentive without being smothering. The exterior is nothing to brag about and the ambiance is divey and comfortable, but this place is about the food not the decor. The prices are very reasonable."], ["Rachel S.", "Mmmm was the food at Istanbul Cafe good today.  I can sense this is a totally dependable restaurant that serves authentic homemade food that should please your soul if you dig Mediterranean food.  We tasted two soups, the white bean and yogurt soups.  The white bean soup was tomato based and harbored some very fresh beans that I would be shocked to find out that were once canned.  The yogurt soup was thin, and had a very strong yet not placeable flavor.  It was good, but the white bean was the winner.We had a gyro sandwich and a Mediterranean salad with falafel and gyro meat.  Oh, the gyro meat was SO tasty.  The falafel was fried well and exhibited extremely aromatic and pungent Mediterranean flavors.  The salad was really fresh and other than lettuce included tabouleh salad (not enough tabouleh in this salad for me, it was awfully heavy on the parsley), feta cheese, and Kalamata olives.  And the dressing was tzatziki.They've got a small selection of desserts which looked great too, including, of course, baklava.  Prices are cheap to moderate.  This area is a mecca for small family-run ethnic restaurants, and Istanbul is totally worth a stop."], ["Joey K.", "You know those sitcoms where there's that cute foreigner who despite not quite saying the words right you can't help but love 'em?Well my waitress obviously learned english as a second language and was a little difficult to understand but I got it eventually.  I couldn't help but smile at that.I ordered a Kopof plate with the taboulleh salad.  It also comes with a soup, don't know what it's called.  The food is fabulous and spicy.  The rice really stood out, its tender with a subtle taste.Despite this being in a rough section I think this is a real hole-in-the-wall gem!"], ["Bret D.", "Get the cucumber sauce; it is much better than ranch; great gyro.  This is my favorite Mediterranean food in town.  The atmosphere has a lot to be desired but they are making efforts to upgrade.  I come here for the food which is very good and a great value."], ["Antony H.", "First of all, this place is a dive, but it smells absolutely great. So basically, I knew this was going to be awesome. It's the \"Nolensville Road Effect\". When the place is as ugly as the food smells incredible, my mouth starts to water.Ordered the Shish Kifta. It was perfectly seasoned and cooked, and did not have the gamey \"Overcooked Burger\" texture and taste that so many other Nashville Mediterranean places have. It was delicious, and complimented my rice and salad well.Be very careful with the Hummus because it is very addictive. The hummus is so delicious you have to take care to not stuff yourself with pita bread before your meal. It's fantastic. Also take care to not load up on the falafel which is superb. Heck, the appetizers are as good as the meal, and you need to save room, because the portion sizes are big enough to feed Zangief from Street Fighter II. Oh yeah, the Yogurt Soup. My lord the Yogurt Soup. I would walk 4 miles through broken glass barefoot up a gigantic mountain while it rains freezing lemon juice just to have another bowl.  Okay, I'm overexaggerating. But not by much, bro. Not by much.Finally, I wish I could magically teleport this restaurant back home with me to Austin. Texas has woefully bad Mediterranean food and this restaurant located on Guadeloupe would make bank. Every time I go to Nashville, I hit at least one Mediterranean place. And when I only have time for one, this one is IT."], ["Simon K.", "I really enjoy places that you can take at face value.  It's a family-run business that enjoys serving good food.  That's all anyone should expect from a restaurant.  The cook in the back was so proud of the lamb that he cooked.  He told me \"I cooked it for 4 hours.\"  How could I not appreciate that?  When's the last time you had a meal that took that much time to make?  Btw, the lamb was delicious.  It's slow cooked, soft, and tender.  The chicken wasn't as spectacular, but that was probably b/c I was expecting it to be like a middle-eastern kabob.  It was cover in spices, cooked well, and overall tasty.  By far, the chicken platter is the best deal on the menu.  $8 for 4 large chicken tenders; it was enough meat to make 2 chicken sandwiches.  It's a strong 4 stars; really hearty meal, priced well, and genuine service.  For Nashvillians, they need to try something new.  At the least, it's a good experience of a different culture.  I'll be coming back."], ["David B.", "Very good food and service.  Like that they have an open kitchen."], ["Amanda M.", "I have three words to sum up my experience at Istanbul: WOULD GO BACK.Since my first visit, I have told no less than five friends about our experience... not to mention the delicious food!Don't skip the hummus! (I probably ate my weight in pitas.) And I highly recommend the Gyro Platter. It's huge, so you might want to go ahead and get a to-go box ready.Also, if they don't randomly bring you the white bean soup (they did to us!), order it. It's delicious.As if the food wasn't enough... the service is outstanding....AND (like you need yet another reason to visit), it's BYOB. We rolled up with three bottles of Two Buck Chuck and they were happy to bring us wine glasses and a bottle opener.We declined the opener, however, because we'd brought an entire corkscrew set ourselves. We're classy like that."], ["The Yelp-inator W.", "OK - its on Nolensville Rd...not where I usually hang out...but a friend raved about this place so we went.The atmosphere was - nothing special.Service was good. - very nice pleasant server - our food came out in a reasonable amount of time.Here my take on what we tired.Gyros - excellent - really nice sized - great ingredients - tastyCucumber salad - excellent -Basmati rice - really goodKofta - fairturkish tea (I've had better)Humus - fairFlafals - pretty good - but not a good value IMHOWe tried all of the desserts:  Here's my opinion:The Seker Pare, Revane, and Kurabiyei - were all fairly good - The Baklava it is really good - this is the real deal - my mom did not like it and she has been making this for years - perhaps she was jealous?  Everyone else loved it!If I had a friend who I knew was going there I would tell them to get a gyro and maybe a piece of baklava."], ["Jeremy M.", "After getting hooked on Doners in Germany and Falafel in Iraq, I figured that I should try some Turkish food in Nashville.  First off my waitress was very friendly and attentive without smothering me.  I ordered the falafel and a doner sandwich and they both tasted excellent.  The falafel was seasoned perfectly and was served with a delicious cucumber yogurt sauce.  The doner was different than any that I have had before.  As opposed to the shaved lamb/beef combo it was more like a chopped version.  Still very tasty but a little on the salty side in my opinion.  I would definitely come back for the falafel but I would probably try something different for my main dish.  Overall it was a great experience."], ["Deryk L.", "after reading great reviews i decided to give this joint a try!  the food was very good, i went with a gyro sandwich and the bean soup--both were awesome.  the restaurant is definitely run down though.  i would be a little nervous to inspect the back of the house, if you know what i mean!SOOO, yeah, the food was good though!  enjoy!"]], "Epice": [["Blake T.", "I have only eaten here one time, but it was without a doubt one of the best meals I've ever had in Nashville.  My wife and I started with the Epice Sfeeha which is a flatbread with cheese and a cured beef that was unique and extremely flavorful.  My entree was a steak kabob that was served perfectly medium rare and was one of the most tender and well seasoned steaks I've ever eaten.  My wife got the pistachio encrusted rack of lamb which I would highly recommend.  The pistachio is one of my favorite snacks and flavors, and having that rich, nutty crust encase juicy lamb is a winning combo.  Dessert was their pots de creme which was a creamy and satisfying way to end the meal.  Five stars! I can't wait to go back."], ["Albert A.", "Great food all around. Outside seating is nice. Servers were extremely kind and helpful as we had 2 kids. Highly recommend if you're looking for a change of pace from the common southern food restaurants in Nashville."], ["Hillary P.", "If this review is just based on the food, I would be giving it three stars, sadly the service was atrocious. The host at the front of the restaurant had a ridiculous attitude and refused to accommodate us when I asked if my friend could sit with us for 10 minutes, even though the restaurant was half empty and continued to get less busy as we were there. I understand that they do things a certain way, but his haughty dismissal was beyond rude. Our server was fine, but definitely had an attitude as well, and kept standing over our table, silently, until we stopped eating and asked what she needed. The hummus and spicy fish entree we're very tasty, but the salads and bustan were not worth the price. I won't be going back."], ["Abi T.", "I was excited to try Epice last Friday night as I'd heard good things and Lebanese cuisine it not something we get a lot of opportunity to eat in Nashvile. We strolled in around 8:30 without reservations and it was quite busy. The host (owner?) went off to see if he could find a table for two as I made a snarky comment to my date who notoriously avoids planning like the plague. Before I could finish my reprimand, we were seated and he was vindicated. Oh, well. He'll learn someday. The ambiance was lively and cozy, with understated decor. There's no art on the walls, but cool architectural details in the wall textures, sculptural ceiling, and wood window lattice provide a cohesive feel. It totally works.The service wasn't memorable, but in a good way. I don't recall wanting for water refills or plate clearing at any point. I appreciated the little cracker snack with herbed oil for dipping when we sat down. The food had great flavor and servings were substantial. We started with Adas Be-silik (lentil and kale soup, with an unexpected lemony flavor) and Labneh (fresh and light, herbed cheese dip). Small peasant chopped salads came next, light and lovely without any sweet or creamy annoyances. I had the Hummos Beyrouti, which was really delicious, but just not what I wanted once I saw it. It was basically hummus with ground beef and pine nuts and I suddenly remembered I'd had hummus at lunch. Oops! This hummus was way better than store bought, though! My guy had Kafta and LOVED it. He had ordered it before, but now declared it his favorite dish in Nashville at the moment. It came with roasted potaoes and veggies, all with lovely spices. For dessert we shared the lemony cheese tart. I can't remember the name of because our server only spoke it to me, but a quick google search makes with think it was Halawet al Jibn and it was really great. Tangy and not too sweet, perfect with a cup of strong coffee. By this point we'd finished the bottle of Vino Verde and they don't serve liquor, so we meandered down the street for a nightcap.  Overall a great experience at Epice. I will be back to try more dishes and the atmosphere at lunch."], ["Ali S.", "Dropped by here with a few colleagues for lunch.  I was very impressed with the food here.  I got the beef shawarma sandwich which came with potatoes and a salad.  It had a great combination of spices and presentation.  It tasted great plus it was made healthy.  Overall it was a great place to drop by for lunch."], ["Leah W.", "Food is amazing.  Service is incredible.  Maher (the owner) is one of the nicest people I have met since moving to Nashville and ensures each guest feels welcomed and enjoys their experience."], ["Anna J.", "The food was on point, delicious, aggressively seasoned. I had the lamb tenderloin (off the grill) and it was so tasty. Lamb was cooked perfectly. The grilled vegetables were great, but the potato stack was the best! The peasant salad was excellent, although a little bit bitter, but I don't mind it. Everything was decently priced, but still a bit more pricey than I expected. Service was excellent as well, quick and friendly. I definitely would go back to try something else, especially some apps and desert!"], ["Caitlin C.", "Excellent. I'm pretty confident in stating that this is pretty darn authentic. I'm not some kind of middle eastern food expert but I do have several family friends from Israel and Lebanon and this is the food I pretty much grew up on in Los Angeles when I was over at their houses. I like to hop in Epice for a to-go lunch ordered from the bar. I've also had several of their appetizers and samplings from friends plates, when I've actually dined in. I've only been in for lunch and I can't wait to get in for dinner! I loved the atmosphere and they have done a spectacular job with the minimalistic sheik interior. I would recommend calling ahead about reservations and I think this place might be better suited for parties of 2-6. If you're there on a day when the owner is in, you're sure to get a fabulous story about Lebanon and some good recommendations. The warm potato side, which comes with many dishes, is pretty freakin spectacular, especially when you've grown tired of soggy old french fries at every other restaurant in Nashville. I think we, as a city, are incredibly lucky to have such an establishment open up. I hope it paves the road for other similar places. Between you and me, the whole \"new southern\", \"refined southern\", \"reinvented southern\" has become tedious and boring. I'm not saying we shouldn't celebrate those things, or stop sourcing locally, but sheesh do something different! And Epice is definitely different. I think Nashville is ready for these different places, our minds are open and you should come on down and experience something new at Epice!"], ["Anna Y.", "This is an outstanding place. I don't even know where to begin! - Food (they follow the authentic recipes to the letter, won't swap for cheaper ingredients (like pine nuts) and actually a Lebanese friend recommended this place, she is saying she hasn't eaten anything that authentic since she left home. Decent amount of food (not fashionably tiny servings where you feel like you need to order 2-3 courses to make yourself full, and I don't eat a lot). - Prices are really, really reasonable for this type of place and for what you get (and for 12 South, okay). Fantastic price / quality ratio- Atmosphere and design - lovely- Music - can make it or break it. Epice is the formerGreat, great, great place. One of my favorite restaurants in Nashville."], ["Vicki P.", "Dinner here with my husband after a long day. Found the atmosphere very calm and inviting. We both enjoyed our soups and entrees of lamp tenderloin and the sea bass. Hope to visit here again. Our waiter was kind and accommodating."], ["Cari J.", "Sometimes, you're rewarded for trying something new. This restaurant is an example of just such an occasion. I could not be more pleased with my experience at Epice. I made a reservation for 2 at 7 PM, and when I arrived at 6:50, I was taken directly to my seat. The decor was minimal, but perfect for the concept. Since I had to drive home, I didn't have any wine, but the selection was decent. We started with hummus. It was the best hummus I've ever eaten, and considering that hummus is practically a food group for me, that's high praise. My friend ordered the special, Chilean sea bass en papillote, and was VERY pleased. I've never seen her eat more than half her food, and she cleaned her plate. I ordered the kafta (some spell it \"kofta\" or \"kofte\"), seasoned ground beef patties with a stack of perfectly seasoned and cooked potatoes and grilled slices of carrot, squash, and zucchini. It was all perfectly cooked with just enough spice to be interesting, but little enough that you could taste the flavors of the meat and vegetables. I couldn't finish my giant portion, and look forward to having it for lunch tomorrow!We shared dessert, katayef, which was DELICIOUS. There was a crepe-like fried pocket filled with a soft, mild cheese and topped with a strawberry and fig sauce, and a spicy/sweet crushed walnut (think baklava) -filled pocket with a FANTASTIC kiwi sauce. There was also a dollop of the most perfect homemade lemon curd. It was a truly excellent ending to a great meal. Last note---the service was OUTSTANDING. Our waitress was very knowledgable, took the time to list ingredients and describe dishes, and had the most impeccable sense of timing. She might be a mind-reader. Overall, EXCELLENT experience. I've been to many Nashville restaurants, and had many great meals, but this one was particularly good. I recommend it highly!"], ["Amy C.", "WOW!  I am so glad I picked up the April edition of Nashville Lifestyles magazine!  This issue was all about my favorite subject, FOOD - specifically the 25 BEST DISHES in Nashville.  Epice was featured under \"Best Entrees\", so of course I had to give them a shot for myself.My husband and I went for lunch on a Tuesday afternoon and we promptly greeted and taken to a table w/in their BEAUTIFUL restaurant.  This is my kind of place...simplistic modern would be the best description.  You can tell that the focus is on the food here and that's just the way I like it!Being first timers,  our waiter was very kind to go over the menu with us and help us make our selections.  I went with the cobia fish sandwich and my husband went with the Swawarma wrap.  Each entree came with a small Peasant Salad and side of Cilantro Roasted potatoes...AMAZING.  The flavors were so fresh, light and surprising!  I was immediately transported to the Mediterranean!  Everything here just WORKS...from the atmosphere to the cuisine!  I can't wait to come back for more...this is the type of food I could eat EVERYDAY!   So glad we have this gem here in Nashville!!"], ["Melissa L.", "Great spot for lunch in Nashville (probably good for dinner too)! We had the hummus and fatayer to start.  I had the batinjan for my main - eggplant with ground sirloin.  The mango nectar to drink was yummy. Overall, authentic Lebanese cuisine in a relaxed atmosphere."], ["Rivka E.", "I have been a fan of Epice virtually since it opened. My most recent experience will keep me from ever returning. Over a week ago, I dined there for lunch with 6 colleagues. It was a special celebratory meal and as the guest of honor, I had selected Epice. Shortly after being seated, I uncrossed my legs and experienced a sharp pain by my right knee. I looked and saw a deep cut (gash really) to my leg over 1/2 an inch long and about 2 mm deep. I looked under the table and found a bolt attaching the table top that had a very sharp burr sticking out. This was extremely sharp and was not something tiny; it was easy to see and to feel. We flagged down our waitress and asked for a first aid kit while I held my flesh together so it would not bleed all over. She was apologetic when I showed her the cut. She did not take me up on my offer to show her/have her feel the burr upon which I was injured. She got the kit and appeared to tell other restaurant personnel about the incident. About 5 minutes later she came back with supplies. She waited while I clumsily administered first aid to my bleeding leg. Eventually, a person who appeared to be the manager (he never identified himself) came over. He was completely blasé and disinterested in the whole thing; he also declined to feel or view the burr. He stated that a number of their tables had had such issues and they had them filed down but must have missed this one. He then said he had sent someone to get a box of Band-Aids. Apparently that was sufficient in his mind, because he drifted off - only to be seen 5-10 minutes later when he presented me with the box of Band-Aids. For him, the incident was resolved. For me, not so much. I had the pleasure of continuing to dine AT THE SAME TABLE for the rest of the meal!!! I did so sitting diagonally so I would not slice open my other leg. No one seemed to notice/care that they left us sitting at a table with a very sharp piece of metal sticking out. I am not the type of person to cause a scene or be rude, so I was overly nice about the whole thing and I suspect that led them to believe they could be so lackadaisical about the incident.The food was delivered and looked amazing. Well, for everyone except one of my colleagues, who had a hair in her plate. As her hair has a very stark ombre dye to it, it was quite obvious it was not her hair. She said nothing about it initially, but we noticed her face and asked what was wrong. We called the waitress over and she immediately apologized and said they would get her another meal. She also said they would comp this person's meal. My colleague then sat for almost 10 minutes with no food, watching us eat, while she waited for her fresh, hairless, meal. Once that was delivered, we were all happy and very much enjoyed the meal. Only two of the other women in my group had ever eaten at Epice before and the rest were all totally blown away by the food.  We then ordered four desserts to split between us. Again, the food was great. It was the management's handling of the running of the restaurant that was appalling. We requested the bill and when it arrived, we discovered that they had not comped the dish with the hair, nor my meal (although they never said they would comp my meal, just the one with the hair). Our entire party of seven women was stunned. I certainly was not looking for any grand gesture on their part, but this was not a minor scratch. This was a slice deep enough that it wouldn't stay closed without multiple steri strips. Because we were there for a celebration, we did not make a scene and continued to be wholly gracious. After returning to work, we realized my injury should be looked at by a doctor in case I needed stitches or a tetanus shot. It was properly irrigated, cleaned and glued shut by a doctor. Meanwhile, my boss (who paid for the meal) called Epice to speak to the owner. Immediately apologetic, he indicated he wanted to contact me. When she emailed my contact information to Epice's email, it bounced back. Three nights ago she hand delivered my contact information to him. She explained who she was and gave him the envelope. He simply took it, set it down and returned to a group of his staff. He did not apologize to her in person, act as if he cared about what had happened, or assure her that he had done anything in response to the incident. As of this moment, almost 3 days later and over a week since I was injured, I have not heard from him. I am truly appalled by this new low in customer service. Due to how this was (not) handled, Epice has lost my business and that of the other women with whom I dined. Had I been a squeaky wheel or raised a big stink, I am sure they would have bent over backwards to appease me. That is not how customer service should work.There are too many delicious restaurants in Nashville to waste your time and money going to one where a gracious customer is considered insignificant at best, and a nuisance at worst!"], ["Zoey N.", "Awesome food and atmosphere! Will definitely come back! Their vegetarian Bustan is so good! I heard the mango tea is good too, will def try next time."], ["Diana S.", "Epice is aptly named, for the food at this Lebanese bistro is simple fare elevated by the seasonings of the marinades, rubs and sauces.When a friend and I went for lunch, we started with the Al-Raheb, an eggplant spread which was bright, lemony and light, and served with pita triangles and long, thin, crisps laden with herbs and spices. We were told that the soups are vegetarian (no meat or poultry broths used) and often are or can be made vegan. An example of the \"can be made\" was the delicious roasted red pepper soup, which is a thick puree of red peppers cooked with garlic and potatoes (I think). Veggie has a dollop of yogurt on top; vegan does not. I had a grilled fish sandwich (cobia) that was absolutely spectacular! It had a heavy spice rub on it that was simply killer and kept the fish moist during the cooking. It was drizzled with tarator, or a cucumber yogurt sauce that played perfectly against the sharp spices. it was served with cilantro roasted shoestring potatoes. My friend ordered the Epice salad, greens with goat cheese, toasted almonds and fig vinaigrette. It was delicious. The dessert we order was also delicious, in spite of - or more likely because of - its simplicity. Katayef is two thick buttery crepes, one filled with sweet cheese and the other with walnuts, with berries and a fig along side. As my friend said, \"these are so stinkin' good!\"Dinner on another night began with Labneh. or mountain cheese served with mint and garlic and pickled stuffed peppers. The first was a bit of a disappointment, as the soft cheese didn't have much flavor, even with the mint and garlic. The pickled peppers were fantastic, but the portion (2 small peppers) was a bit on the stingy side. Entrees were Tawook, or a marinated chicken skewer served with the cilantro roasted potatoes, and Batinjan, a sort of casserole of roasted eggplant served with a large square of vermicelli rice. The chicken was tender and flavorful from the marinade. I wasn't a huge fan of the eggplant dish and I love eggplant - I just felt that the flavors were kind of muddled in it.The design of the exterior and interior are very attractive, and almost post-modern. The inside is all either smooth concrete or painted to look like it, with a curved stone wall housing the grill. The only wall decor is a series of flat dishes with a pile of spice on each one high behind the bar. They are subtly lit to highlight them even more.The wine selection is small but each one we tried was very good and complimented what we were eating.The only two downsides to Epice that I see are parking and reservations. There are 3, parking spaces in the Green Pea Salon lot next door (until 6pm when the entire lot is available) and there are some spaces in White's Mercantile lot on the other side.Reservations: make 'em, especially for the weekend. We went once on a Friday afternoon at 4pm for a late lunch and early wine. There was one other table there, and they still asked if we had reservations and told us it would be best if we sat at the bar. ??  A few weeks prior, we went on a Saturday night around 8:40, and half the tables were open, but we were still asked if we had a reservation and when we said no, they said \"let me see what I can do\" and walked back onto the floor. FYI the tables never filled the rest of that night, and by the time we finished our 3 course lunch there were two or three tables max seated.For everyone who has mentioned signage, they do have it now."], ["Leah N.", "I recently moved to Nashville from Austin, Texas and my time in ATX made me a bit of a spoiled foodie. This is the best lunch I have had in town so far. Healthy, flavorful and filling. Reasonably priced, nice atmosphere, and attentive waitstaff. I had the lentil soup (tangy and lemony!), chicken pita with salad and cilantro potatoes. Total YUMMERS! Highly recommend."], ["Tracy F.", "YUM. YUM. YUM.  One of the newest additions to the 12 South neighborhood is also one of my new favorite restaurants in Nashville.  Epice was the perfect place to go for dinner with my friend and her parents tonight - the food was fresh, interesting, different (in a really great way) and absolutely delicious.We began our meal with two appetizers suggested to us by our waitress: Fatayer, a trio of stuffed pies, and another pickled egglant dish I can't remember the name of.  They were both very good, though the pies were all delicious and the most memorable of the two.  For dinner, I chose the Batinjan, an incredible roasted eggplant dish stuffed with ground beef, vegetables and pine nuts and served with rice and grilled vegetables.  The eggplant was melt-in-your-mouth tender and bursting with flavor and juicy ground beef.  The rice was perfectly seasoned with cumin and butter and served as a wonderful compliment to the eggplant.  My friend's mom ordered the Sayadeya, a spicy fish dish, which was also tender and delicious.  Our server was adorable, the prices were very reasonable for the amount and quality of food served, and the atmosphere was elegant yet casual.  I'll be back whenever the craving for Lebanese food strikes!"], ["Lauren W.", "The decor of Epice is very clean and open. There's lots of off-white marble and honey colored wood. It's very chic without trying too hard. I love the open bar and prep area as well as the rock wall in the kitchen pass-through. The building is located across the street from Burger Up, but because it lacks a sign it can be easily missed. As soon as we were seated our waiter brought us some pita bread and oil for dipping. You can tell that the pita was freshly fried and spiced. The herb oil was very nice but I had a hard time putting it on my pita. I think I needed a small spoon or something, but since I didn't have one it lead to aggressive dipping.I have to say that our server was one of the funniest I've ever had. He was knowledgeable about the menu, polite, and at the same time had a wicked sense of humor that kept me giggling. Before we even got our appetizer Epice gave us another free snack. It was a very light salad that was tossed with the perfect amount of dressing. The lettuce was fresh and I especially enjoyed the cabbage and radish that were mixed in. For our appetizer we ordered the kibbeh which is ground beef in a wheat crust. They were charming little balls of meat with a very interesting texture- kind of chewy on first bite, but much like seasoned ground meat in the center. I absolutely loved the sauce that was served with it, which I believe was seasoned yogurt and cucumber. For my main dish I ordered the Batinjan which contained roasted eggplant and ground beef. I wasn't the biggest fan of this dish, mostly because I found the eggplant and meat combination just a tad too mushy for my liking. The stewed eggplant had the strangest consistency to me, but I know that this is a personal thing. I can say that it was seasoned perfectly and had very good overall flavor. My favorite part of the dish was the big slice of fried eggplant. It was like the best potato chip I ever had and I wanted many more of them! Also, the rice was fabulous and the yogurt sauce that I loved made another appearance in this dish. When I mixed the sauce with the eggplant and meat I liked it much better.Since it was girls night out we had to order to desserts. Fist up was the Roz be-haleeb which is rice pudding with orange blossom infusion served with cinnamon-sugar pita. This might be my favorite dish of the night, mostly because rice pudding is a nostalgic favorite of mine. It had a light floral flavor and the pudding was thick and rich. I would highly recommend ending your meal with this.Our second and final dessert was Katayef, or crepes. One was filled with a sweet mild cheese and the other was filled with sweetened walnuts. I loved the walnut crepe because of its crunchy nutty texture inside a soft pillow of pancake. An added bonus for me was the fig served with the crepes. Figs are my favorite!We really enjoyed our dinner at Epice. Although the prices are higher than any other middle eastern restaurant I've seen, I would say that the quality of the food and decor make the prices seem reasonable. We enjoyed our food and the service we received. Epice is another reason to brave the parking nightmare that is 12 South!"], ["Katie I.", "Epice is definitely an elevated Kalamata's- exactly what Nashville needs more of. The build out is gorgeous- modern and clean. Looks like a place that would be in LA or Tel Aviv.Showed up at 12:30 on a Tuesday and most all tables were full, but wasn't that busy. Our server was nice, but already in the weeds. Took awhile to get drinks and then they bring a glass of water for my 4 year old. Note: did not get the kid friendly vibe- so leave the rugrats at home.My friend and I shared the hummus and the fatayer- an assortment of \"pies\" each filled with cheese, spinach and a meat one. The meat one was the best. The cucumber sauce it came with was delicious!The hummus had a smokey taste and was delicious. Better than Kalamata's- more like a doctored up version. It only came with two pieces of soft pita and a crunchier flatbread- definitely not enough bread to mop up the chickpea goodness. We both had the shwarma. The meat was tender and juicy and thinly sliced. It had a pickle relish of onions inside, as well, really kicking the dish up a notch. Super tasty! The potatoes on the side were seriously off the chain. I don't even like or ever eat potatoes. They were amazing! The low point was the peasant salad that also came with the shawarma. I was very shocked and surprised on how awful it was. The dressing was super tangy, and not in a good way. The lettuce was a field mix that was not very fresh tasting. Now their sister restaurant Kalamata's has the best salad dressing. How in the world do they not duplicate that here, or elevate that even. Salad was an abomination and hopefully they will tweek it as they work out the growing pains. While service was slow, everyone was friendly. Parking is sparse. You can park next door at white mercantile (the old gas station) or the 3 spots they have to the left. I was told you can park at green pea salon at night. Like any 12 south establishment, parking is a sport. All in all, this is a great new addition to the neighborhood and a cuisine that Nashville is lacking in. Will return- without kids!*second pic is of fatayer- not hummus. I don't see an edit button :)"], ["Karli W.", "The service was fantastic. The food was incredible. And the ambience is so cool! The owner came to our table to make sure we were enjoying our meal and offered some wine pairings. After a brief description of what kind of wine I drink, he brought me a glass that was just to my liking. We ordered the Al Raheb to start which was sooo yummy and a perfect size to start off our meal. My boyfriend got the lamb shank which was delicious. Their hummus is authentic and fresh. Perfect for a date night or a night out without friends. Overall, LOVED IT."], ["Stephanie S.", "Simply delicious! I had the pistachio crusted lamb and red Lebanese wine! Yummy! Excellent service AND we met the owner Maher who was the coolest! If I lived in Nashville, this would be my favorite restaurant!"], ["Claudia A.", "Yummy! Thanks to yelp \"nearby\" option we found this quaint restaurant. It's tiny and hard to find if you are driving at 15 mile per hour speed (it's really tiny) but omg it's delicious. The hummus is great, the lentil soup is MAGNIficent and the chicken kabobs are good too (according to my fiancée). So if you want some good Mediterranean food, this is the place to go!"], ["Rose L.", "All I can say Maher Fawaz is \"Well done sir, well done!\" The girls and I (7 of us) had such an amazing dinner tonight at the new Lebanese Bistro on 12 South appropriately named Epice (French for \"Spice\"). Maher (the owner) stopped at our table a couple times to see how everything was. I am a serious and sometimes picky foodie. I can honestly say in my 20 years in Nashville and out of the 1000's of restaurants I have tried here and around the world - this is my favorite, by far. We tried several apps and three of the desserts - all perfect. I don't know why, but I got really excited when I discovered the pomegranate seeds on top of my Al-Raheb (roasted eggplant purée) appetizer. My entree Sayadeya (spiced barramundi with caramelized onions) - this was absolutely AMAZING. My first experience with barramundi was lack-luster and I was hesitant. I am now a huge fan.At most upscale restaurants, I usually leave disappointed because I almost never feel like I get what I paid for - most don't live up to my expectations. But Epice is worth every penny I spent and then some. Not one single regret - except I wish I could have eaten/tried more. I can't wait for my return trip... We were blown away by the food and the service was phenomenal. Katie was our main server, but others stopped by to fill drinks, clear plates - team work at its best."], ["Rhonda M.", "Beautiful and relaxing location with super fresh food.  I had the epice salad with salmon which was amazing.  Get a spot on the open air patio!"], ["Chris C.", "Not bad. A little pricey for what you get."], ["Kim U.", "Overall: tasty but overpriced. Still giving it 4 stars because it was tasty. Pros:*Unique selection of dishes*Nicely prepared food*Solid but small wine selection *Great desserts*Good vegetarian selections*Parking available at neighboring businesses after certain hours (a huge plus for 12 South)Cons:*Avoid doing takeout from here - the food does not travel well*Building materials and design makes it incredibly loud when it gets crowded*Staff aren't very friendly or welcoming (waitstaff were great, staff at front & manager types were not)*If you don't like the main flavors/spices they use, they're in everything - for this type of cuisine, I was surprised at how one note the spices were Good for vegetarians? Yes, but only if they vary their menu periodically. Good for kids? I would not take my 4yo here. Can you get in on a Friday night without reservations? Probably not. We scored a table by showing up early. General comments: We made the mistake of trying Epice first as take out. What a disaster - I would have rated it one star based on that experience. We decided to give it another try in-person this time and the experience was completely different. On this visit, we split two appetizers, each had a salad, and split a vegetarian entree. Very tasty, and left enough room for tasty desserts."], ["Chris B.", "Great Mediterranean food, elegant but causal and the service is outstanding. Worth eating here easily. Great for lunch or dinner. Nice twist on very traditional dishes that make them even better. If you want light fair or full meal they have something for you."], ["Adam L.", "First experience with Lebanese food. Everything was excellent. Stuffed Pies app, ground sirloin hummus and spicy fish. Loved it."], ["tyler l.", "I'm in town on business and figured, what better thing to do in Nashville than go for Lebanese food. I know, it sounds off, but think about it... The locals eat southern food all the time and its great, but I'm sure they like to switch it up.Immediately the atmosphere (inside and out, whether you can tell the difference on a warm night as it is an open concept) transplants you to a foreign place, perhaps Lebanon? I don't know, I've never been there... But from photos I've seen I'd say \"sure\". Kudos to the designer. I sat at the bar which is a large slab of Carrara Marble that made me feel at home in homage to DC. I tend to have more fun at bars rather than the tables, and this bar directly opens you up to the interaction with the whole team. From the hour I was there I got to witness what looked to be a charismatic, passionate, and knowledgable group of workers. The workers clearly care about the food, the facility, and each other. I had to refer to what I ordered as a sand castle, and it took me a little while to start to deconstruct the work of art because well, like most decent people I don't like to kick peoples sand castles over. Lamb shanks leaning on thick asparagus stems towering over a mound of a meaty tabbouleh, with little buttery cripsy garlicy potatoes slivers (I cannot call them fries or frittes because they're in a class of their own). I've had a lot of rack of lamb, but this is at the top of the list. The lamb is Cooked medium, juicy, tender, and topped a crunchy pecan crust. I finished my meal of with a chocolate mousse accompanied by what I could only describe as a rich persons version of a cookie crisp cookie (yes like the children's cereal but if Napoleon had a personal chef design one), garnished with fresh raspberries and a few mint leaves to clean your palette. The dessert was prepared by the gentleman who looked to be running the place. I'm done typing and I'd like to go to sleep now :D"], ["Jihye S.", "I visited Nashville for about 6 days. Among the restaurants recommended by my local friends, this one was my favorite. I walked in after their busy lunch hour (2:25) for a take out, and the server was one of the friendliest (yet not over the top) and most professional ones ever. I ordered hummus and a fish special (Sayadeya), and it was impeccably prepared. Really fresh and simple, perfectly cooked and seasoned food, which I find hard to get at some of the high end restaurants. And hummus was the best I have ever had-I know everybody has different standard and preference, but I like mine very smooth, nutty, and not too sour. The only disappointment was the pita bread that came with the hummus..it was a bit tough and dry. (The other flatbread was good, though)I wish I had more days to spend here so I could have tried their dinner. Oh, and the interior is clean, simple and modern without being stuffy or pretentious."], ["Jon C.", "EPICE is the closest thing to authentic Mediterranean in Nashville. Owned by the same family as Kalamatas (another Nashville favorite) this place won't disappoint. The food is incredibly fresh, staff friendly, and the atmosphere takes you out of the city and transports you to New York or San Fran!"], ["Jeremy E.", "I had a top ten meal in Nashville here. Run to this place if you like Lebanese food. If you haven't tried Lebanese food but like Mediterranean/North African flavors, you will love it. They serve tapas and entrees. The hummus is a must try as is the kibbeh. For entrees, their spicy fish is outstanding, as are their two lamb dishes. The lamb rack is pistachio encrusted and is cooked to perfection. The other lamb dish is pressure cooked and the meat is falling off of the bone. Interior is modern and clean and the service has been outstanding for all 3 visits."], ["David G.", "I called about 2 hours ahead on a Friday for reservations, but they were booked.  However, patio seating is FCFS - we got there a quarter to 7, and got an outside table. We were greeted by the owner and he visited us several more times during our meal.  Lively fellow!  I ordered the Sayadeya - a grilled fish entree, and my wife ordered Tawook, a marinated chicken brochette.  We loved them both. I recommend you substitute the Epice salad for the peasant salad - if you order an entree.  The fig vinaigrette dressing and goat cheese are lovely together. Both entrees were well seasoned and beautifully presented. Our server made good recommendations - especially on the wine. We ordered a reasonably priced red and finished it there with desert - the chocolate mousse - made by the owners wife (we were told).  Delicious. Lovely ambiance. Good value for the price. We'll be back, soon, to try the roasted lamb shank. It sounds fantastic!"], ["Michael C.", "Was taken here for the first time on my birthday for lunch; it was fantastic! The decor is amazing; more reminiscent of New York or San Francisco than any other place I'd been to in Nashville.  I had quite a hard time choosing between the selections on the menu; so many sounded amazing. Our server was so helpful, going into great detail about the 3 items I was having such a dilemma about. I finally chose the spiced fish (with caramelized onions and rice)... what a great choice!  This was absolutely  the best fish dish I've had in Nashville. My friend had the Shawarma (sirloin with pickles and onion relish) and raved about it.  We ended up splitting a desert: the yellow cake with orange blossom syrup. I can't rave about this place enough; it was amazing. I look forward to returning and trying more of the dishes.(Side note: we didn't have reservations, and got there fairly early, but it filled up quick - I would suppose reservations are recommended at nights, especially so on a weekend)."], ["Patrick P.", "Loved the pickled eggplant, humus and the mountain cheese appetizers. Lentil pilaf for main course was great. The sliced vegetables were very flavorful. Mousse for dessert, yummy and just right. Will come back."], ["Konrad U.", "Great place and delicious food. Worth checking out if you're into lebanese food"], ["Stacy T.", "So delicious! Went here for lunch and had a very flavorful meal. The Tawook was delicious and served with a salad and potatoes. Tons of food for a $10 lunch. I'd highly recommend checking this place out if you're looking for something a little different for lunch."], ["Meg S.", "Maybe I just ordered the wrong dish because my meal was unremarkable and disappointing. I ordered the Hummos Beyrouti. I left a good portion of it, claiming fullness. When I make or order hummos, I expect it will be bright with lemon, a little acidic from good olive oil, a little garlicky, and have that distinctive sesame taste from tahini, but what I got was bland and flavorless. I tasted no garlic, no lemon, no tahini, no olive oil. I've had better grocery store hummos. The sirloin was greasy, (maybe olive oil used to top the hummos? I don't know. It didn't taste like olive oil.) bland, and flavorless. I wonder if they use any seasoning and herbs/spices at all when preparing the food. The pine nuts were not adequately toasted, if they were toasted at all, which meant that they had an acrid flavor rather than that rich, nutty, unique pine nut flavor we all know and love. The only thing I appreciated about the hummos was the texture. It was very smooth. They clearly took the time to husk the chickpeas. A good thing.  The regular pita that came with the meal was fine. There was some pita that appeared to be fried and was a little greasy, with a daub of za'atar, which again, I expect to be more flavorful, but it was not. I don't know how one manages makes a bland za'atar, which should, at a minimum, be redolent of oregano, thyme, savory, basil thyme (yes, that is a thing) and toasted sesame seeds. Two of my best friends operate a spice business and they make their own za'atar. Maybe, based on that, I'm expecting too much, but I don't think so. The only thing about my meal that I truly enjoyed were the pickles, radish and cucumber, that garnished the plate. They were excellent. Why? because they had FLAVOR! I grew up in suburban Detroit, land of excellent Middle Eastern food, so perhaps I am spoiled, because what I ate today at Epice did not impress me as being any better than the food at Kalamatas, with which I have the same flavor issues and is why I will not patronize that place. Other than the bland and uninspired dish that I had, I have no other complaint. The space is beautiful. It is spare, but in a warm and comfortable way which may seem contradictory, but it isn't. It's quite lovely, almost Wrightian (as in Frank Lloyd) in its design, making use of natural materials and horizontal lines in a pleasing way. The owner was manning the door and he was a gracious and welcoming host. Our server, and the service he provided, was excellent. So, given all the raves, it's quite possible that I just ordered the wrong thing. I am willing to give the food another chance to see if that was the case."], ["Carolyn M.", "We came without a reservation, which was a bold move at a new, popular spot in a trendy stretch of town. Some might even call it stupid. The host was unbelievably accommodating in shifting things around to fit us in. Once seating, our server was equally eager to please. The tabouli is awesome - heavy on the parsley, light on the bulgar. Roasted eggplant is also tasty. I had chicken skewers - perfectly cooked meat and peppers with great flavor. Not a huge fan of the side of potatoes. The spicy fish is fantastic. One star down for the atmosphere - it's very pretty, but all that stone makes it L-O-U-D."]]}