{"El Jaliciense Mexican Restaurant": [["Krystal T.", "A hidden Nashville gem. Seriously, this place may not look like much from the outside, but this is probably as authentic Mexican as you can get in this portion of Nashville. As small as their parking lot is, it is overflowing every night with die-hard fans who are willing to wait in line to pick up their take-out orders or wait for a table. The chile relleno is the best I've had in Nashville, and the spice level is more what I'm used to back home in the Southwest. One small downside: El Jaliciense does not have a liquor license, so sadly no margaritas :("], ["Johnny T.", "I should have left it at one visit. I should have gotten in and gotten out, enjoyed my food and kept it moving. I shouldn't have allowed myself to hope for a Mexican restaurant to put in my rotation. I was let down. My times at EJ started strong but it's all in how you finish.Let me begin by saying that I've never eaten here. All my EJ experiences have been to-go. As a to-go restaurant, things make sense. You walk to the to-go counter, open the menu, order, wait, pay, leave. It's pretty basic. At least, it was on my initial visits. I liked the fact that the restaurant didn't try too hard (famous last words). The TV was blaring. Children were running around. Organized chaos was all about. Expected. I ordered a chicken burrito and a strawberry paleta and kept it moving. I was happy with the price, taste and amount of food I received. Much like the praise found elsewhere on this page, I was a fan.And, then I came back.Just like previous times, I parked in the parking lot (deep enough to enable you to back out and not wind up on Gallatin; this is a good thing), walked in, stepped to the 'order here' area, ordered, waited, watched rambunctious children, ignored the blaring TV... and waited... and waited. Wait. Isn't this where I pay and leave? What's going on? As I sat and waited, I noticed three other parties pay and leave, two of which ordered after I did. I asked if everything was alright. I was told it was. The woman behind the register left. She was replaced by an older woman. I waited some more. A bag of food came out from the kitchen. I asked if it was mine. I was told it was not. Two other parties came in, ordered, waited, received food and left. By this time, I am over it. I am not waiting for my food. I am waiting to see how long this will take. The older woman leaves from behind the register. She is replaced by the previous woman. Again, I ask about my food. She leaves (to go to the kitchen?), comes back and tells me that the now cold bag of food that had been sitting by the register is mine.Incorrect.It's yours because I'm not paying for cold food, questionable service and ignored questions. It's too bad. We could have had it aaallllll. Ea-ting bur-it-too-oh-oos... Never again. The hunt continues..."], ["C K.", "Best Mexican restaurant I know in Nashville.  Go shove tacos in your face."], ["Claudette M.", "We're back again. Probably for the tenth time. Get a taco assortment. Highly recommend. The place is unassuming from the outside but pretty cozy inside.  Will come back soon!"], ["John M.", "Great real old school Mexican food. Terrible service. Make sure you ask for extra napkins........there seems to be an allotment."], ["Josh H.", "When I'm craving authentic Mexican food in East Nashville, this is definitely where I'm heading.The meal begins with complimentary chips and a trio of salsas (or duo, depending on the day): a standard but good tomato, a smoked chile and roasted tomatillo, and a punch-packing creamy jalapeño purée, served in a squeeze bottle.On the thick/chunky end of the spectrum, the guacamole is also wonderful. It's very simple but perfectly executed with lots of lime juice and just enough salt, tomato, raw onion, and cilantro.I ordered a Coke and was pleased to receive a half liter bottle of Mexican Coke. Their michelada is refreshing, served over ice in a glass stein, mostly beer with a splash of their tomato/lime/spice mixture.For food, I look no further than the tacos, which were authentically presented on two small corn tortillas and topped with cilantro, onion, and lime. The asada, chorizo, and birria (envision Mexican pot roast) are my favorite meats. The chorizo is some of the best I've ever had. The birria is incredibly tender and packed with unexpected flavors - I detected hints of star anise and clove. Also available were chicken, pastor, and for the more adventurous, tripa and lengua. Be aware that the pastor is a little on the dry/crispy side, but that's intentional and traditional. At $1.50 per taco, this place is hard to beat.They get a 4 instead of a 5 because of inconsistency and slow service. Their tacos are a little inconsistent, ranging from pretty good to the best I've ever had. When they take the time to get their chorizo a little crust on their chorizo and toast their tortillas on the plancha, they can't be beat. But sometimes they skip these details. Service is usually a little slow, and I've come to expect this. Even so, I'm rarely in there for longer than 30 minutes. A tasty, cheap, and quick option on the east side."], ["Bob R.", "Wow.  I can appreciate a hole in the wall place.  Rave reviews brought me here and I cannot for the life of me figure out why.Guac and salsa apps, super tasty.  I was excited for my entree of chilies rellenos.  Man was I disappointed and literally nauseated.  Let's just start with the simple.  Rice and beans.  Flavorless, overcooked gloop. Maybe useful for repairing the bricks on my house.  Tortillas: definitely nuked and a strange sour flavor.  No bueno.  On to the main dish.  Wow.  Chilies were bitter.  Deep fried and then somehow turned into a soft mush by a nondescript soup poured overtop .  (See photo). What am I missing that brings these 5 star reviews in?  Nunca mas."], ["Oscar Y.", "Everything about this meal was OK (except maybe the rice, except maybe the salsa, and the beans are plain).   I get the feeling that  'plain'  is the operating formula.I asked for a recommendation from the seafood page, and the server suggested the Parita because you get shrimp AND fish.    And yes, you do.  There are shrimp, and there is fish, and there is lettuce, and there is rice, and there are beans.The beans help everything else get a bit more saucy.   The lettuce is good if you pour the tomato sauce, I mean salsa on it.   The rice at first seems like an invading fuzz creature from another planet - - but if you soak it with the green creamy salsa in the squeeze bottle, all of a sudden you want to eat it.The shrimps were actually really plump, and roasty satisfying.  The fish was a bit harder to decipher the character.OK - - there was lettuce and beans and rice and shrimp and fish - - and an intriguing creamy green salsa, and a bit less intriguing red one.Food should not be this hard to try to savor - - and when you leave, you shouldn't be having a hard time figuring out whether you enjoyed your meal or not."], ["Sam P.", "I came here recently with a friend who frequents this place. We didn't try anything crazy off the menu, but we got a bunch of tacos for $1.50/ea (they are on the smaller side but for the price you can't beat it. They also double up on the tortillas so the tacos won't fall apart on you). I got a shrimp and fish taco, both tasted VERY authentic from the zest of the shrimp & fish to the taste/texture of the tortillas. Chips and salsa were ok, nothing special. Next time I'll try the guacamole. The restaurant is a tiny spot just off Gallatin in a somewhat sketchy looking plaza. I went at night and was very careful in the parking lot. I'm sure during the day it's fine. I took a star off just for the location.For authentic-tasting Mexican food in East Nash, this is where I'd go."], ["John C.", "Beans were Luke warmBurrito was a little dryTaco was okProbably won't be backThe group that gave this place four or five stars must get their Mexican food from Taco Bell"], ["Kimberly S.", "This is my new favorite place. The food is incredibly tasty without being the heavy Mexican that you so often find. My husband and I like to start with the guac, which is delicious and incredibly fresh. My go to order is the Camarones a la Plancha, which includes shrimp sauteed with onions and jalepenos, rice and beans, and corn tortillas on the side. It's pretty spicy, which is good because it makes me eat more slowly. Seriously, the only problem with this place is that I want to eat EVERYTHING so adding a lot of spice at least makes me stop and reassess.Highly recommended."], ["thomas h.", "Easily the best Mexican food in East Nashville.  Super authentic and delicious.  It's kind of a hole in the wall compared to some of the bigger budget places but that just mean locals only."], ["Chris A.", "Hands down the best Mexican in the city. With the exception to the taco places off Nolensville Rd. Try the light green sauce. Its really good! everything is good here. I got the mar y tierra. very good. Keep this place secret."], ["Christina D.", "Authentic Mexican ! The food is super affordable/ cheap, can't beat that in east hipster Nashville. I enjoyed their fish and shrimp tacos, guacamole, and a beer for under 12! They only sell bottled beer, which I'm totally fine with. I had first tried their food at a friends house who had their ceviche, It was amazing!  The perfect place to grab some delicious cheap Mexican."], ["Cher Y.", "Wow what a gem in terms of food and authenticity!Thanks to fellow Yelpers I stumbled on this place.  Food is great ! fresh, tasty and affordable! Friendly service. they also have a freezer full of Mexican flavored Popsicles to fight off the summer heat.Ambiance: hole in the wall divey place that feels like a lot of restaurants in developing countries. This one does have a charming cultural decor and has the World Cup broad casting on two tvs.cons:  hopefully this was just a 1 time thing but bathrooms were clogged up...I will def be back sampling more of their menu!"], ["Hiroko O.", "This place serves authentic Mexican foods. I ordered torta de carne asada, and my kids tacos de carne asada.  They were good although the meat could have a little more taste. They have selections of Mexican soda. I am not a coke drinker but I have been told the taste of Mexican coke is much better than US version. My favorite sodas, by the way, would be Lift (apple soda) and Fresca."], ["Queen B.", "What a great bunch of people who work here and run this place.Last night, 12 of my friends joined me for an evening of taco's, fajitas, burritos, guacamole, ceviche, quesadillas, beer, chips and salsa!The beer kept flowing with no one having to hunt down staff...chips were kept on the table, as was a variety of salsas.Everyone was happy, staff kept up with my gang..Everything came out of the kitchen hot and freshly made.The street tacos have gone up 25 cents..  Parking was a little tough. Our 14th guest couldn't find a parking spot and left..So it was just the 13 of us.Everyone was pleased. Everyone ate all their meal.One person ordered another meal for her late night job..All in all, we were all happy, satiated and full.My party said they would return.Easy in, easy out."], ["Jason E.", "Awesome guacamole. Salsa is great too. Chips nice and warm. Monster taco is a good deal... Big and and tasty. I would recommend the chorizo. Very quick service as expected at a traditional Mexican place. I will definitely be back to try more."], ["Zeb M.", "This is a perfect backup place for East Nashvillians when Mas Tacos is closed when you want authentic Mexican. Las Maracas just down the street does not compare! And they're cheaper than Rosepepper. I ordered their chicken tacos, which were quite delicious, and ordered the guacamole as an appetizer. Both were fantastic! I'll definitely be coming back."], ["Ben M.", "Love the ceviche here, it can be super spicy. Only issue I have with the place is the salsa, it is really bad, other people seem to like it though, I dunno."]], "Saint Anejo": [], "Tacos Y Mariscos Lopez": [["Peter K.", "Lopez has a total of 6 other locations that I've counted in the greater Nashville area.  They must be doing something right.  The tacos here are called \"authenticos\" for good reason.  It's what you would find on any street in any city in Mexico.  The al pastor and the carnita's really shine at Lopez.  Add a touch of the red or green sauce and you're set.  Their version of lingua (tongue) is very mild and tender, don't be afraid to try it.  Imagine the texture of corned beef on a taco.  The addition of the caramelized onions really sets this place apart from so many of the other stands in Nashville.Be sure to get order an in-house made agua de pina."], ["Ethan O.", "I go to Lopez #2 at least once a week. Usually twice. The coal-smoked half chicken is amazing. I recently switched to the chorizo burrito and it is amazing as well. It's a great hole in the wall dive with a great price and delicious food."], ["Bret D.", "Mission style burritos and pollo al carbon.  The half chicken cooked over coals on the barbecue is incredible.  It is unlike any other chicken you will find."], ["Lauren S.", "Overall: One of those places I only go to if I have people who speak Spanish with me. Good, greasy and cheap Mexican food.Food/Drinks: If you have driven down Murfreesboro Rd (or Nolensville) you have seen the plethora of little Mexican joints with Spanish writing all over the outside. This is one of those places that feels less like you're going to get food poisoning from it. You can't go wrong with the carnitas and the quesadillas are enormous. Good options also include the old stand-by of a giant bag of chips & queso dip. (a large is enough to feed a small army, or a couple people in a newsroom haha.) Cost: I can't remember the exact price, but I doubt I have ever spent more than $8 for lunch (and that may be on the high side.)"], ["Cass L.", "Lopez is simply amazing food.  I keep spreading the word and every new person loves it too!The food is inexpensive and delicious.  The half chicken is a lot of food for $7 with sides, and it is barbequed to perfection.  The burritos are large and stuffed with just about any meat you want.  I recommend getting the 'spicy' similar versions where there is an option.  The red and green sauces that I have seen no where else are both very spicy but add even more with the meal.I also tried the horchata to drink and it is great too!"], ["Janet S.", "$6.00 for half a chuckie, smoked and cut up, small portion of rice and beans and a huge charred pepper, salsa and tortillas, excellent value, throw all that on a corner window seat for a view of the murfreesboro road and pablo eating his deep fried fish and you have a nice romantic Saturday lunch.  Nice service in a bright clean environment.  Will try the ceviche taco next time if I can resist the smell of the chuckie wafting in from the smoker."], ["Jamie D.", "This place doesn't look like much, inside or out, but they literally have the best tacos I've ever had. They have just about every meat you can think of but I prefer the chorizo. It is cooked until the edges are nice and crispy and it has just enough spice to it without burning your mouth. The green and red sauces are very spicy and I don't use them but I'm told their exceptional. The tacos are authentic so don't expect cheese and lettuce and all that like you get at Taco Bell. This is a warm, soft corn tortilla with your choice of meat, grilled onions, chopped white onions, cilantro, radishes, and lime if you want it. They are phenomenal and a MUST try at only $1.29 each. :)"], ["Brock H.", "REAL Mexican food! I tried this spot on a whim and I was happily surprised. As soon as I stepped out of the car the only thing I could smell was bbq chickens from the grill outside. I ordered the half chicken with rice and beans for $7.80 and was very pleased with my choice. The service was great as well, I will be returning."], ["Dusty K.", "I came here specifically based on their rating. 4.5 stars on Yelp is hard to achieve so I was expecting some killer little tacos. The tacos are little, cute maybe, but definitely not 5 star tacos. Yeah they come with onion, cilantro, and lime but my positives stop there.It's a decent Mexican spot in an area of Nashville I had never been. I passed a few Mexican places along Murfreesboro road so I hoped the one I was about to visit stood out from the rest. I went with 4 tacos; steak, chorizo, pork, and spicy pork along with a side of guacamole. The guac was a poor attempt as this is something I make at home almost weekly. It's such an easy thing to prepare which is why I was so disappointed. The tacos were mediocre as most tasted the same and the chorizo wasn't nearly spicy enough. Even the red sauce in the squeeze bottles didn't have any heat to it. I left wanting more.Yes my dinner only cost $7 but that doesn't mean I'm lowering my expectations. A few tweaks here and there and this place would be a solid 4 stars."], ["Matt L.", "So I went and got some tacos at the place, and they were decent.  I got in, and even though the place looked like a fast food place from the outside, it functioned more like a mexican place with a waitress once inside.She took my order, and got me my food with reasonable speed, and when I got back to work, the tacos are tasty, but small.  I didn't think they worth $1 apiece, but that's just me.  Perhaps I'll go back and try the burrito at some point, but I was just a little disappointed with the tacos."], ["Angelina T.", "Great taqueria! Went with some work folks from lunch. I was excited to see agua de horchata on the menu, it reminded me of Mexico. Of course I ordered it and it tastes just like Mexico, not the greatest but good enough to satisfy my craving. The waitress was very attentive and our orders came out fast. The menu had all of the traditional Tex-mex options: tacos, burritos, tortas (sandwiches), quesadillas, fajitas, etc. I ordered the fajitas de pollo (chicken fajitas) with a side of guac. It came with avocados, rice, beans, sour cream. The meat came with the traditional green peppers, onions and a lime slice. I mixed everything together, minus the peppers and onions. Tasted great!Pretty darn good food and a great price."], ["Remy O.", "Excellent trips tacos and pollo asado.  Large glasses of aguas and you get the most bang for your buck!!!  As for the helpers who commented about the greasiness or that you might end up with food poisoning?!?  Go to taco bell, because you clearly don't know tacos or comfort food..."], ["Joseph R.", "The reason I am truly disappointed is due to the fact that there was a hair on the very top of my wifes taco. She was trying this authentic style for the very first time, so it was a BAD imression. I had two beef tacos and a spicey pork taco. They were all three very tasty. They re-made my wifes food but she was already turned off so she couldn't eat it. They charged us for her food anyway. I've been there before and have enjoyed it, but due to this I can NEVER return."], ["Nathanael R.", "A friend at work introduced me to this place and it is a good thing too, otherwise I would be missing out!  These tacos are excellent AUTHENTIC tacos!  They also have some of the best quesadillas I've had.  Portions are just right, 5 tacos for 5 dollars and I feel like I have over-eaten, and the ingredients are very high quality."], ["jerry a.", "My favorite place for Mexican food (especially seafood) when I'm in the area.  They have an excellent selection of  Mexican refrescos and of course the Coke made with sugar instead of that other crap.  THEY ALSO HAVE VEG OPTIONS! They used to not have sweet tea but recently started carrying it.  I had the spice pork tacos and a seafood mix tostado with tea for under $10.   The tacos are 99cents and are a bit smaller than most Americanized versions you are probably used to so order 1 or 2 more than you think you can eat.  The spicy pork was delicious, well flavored and with enough meat and other toppings to make them adequate, they will come on corn tortillas so if you want other, specify!  I have had several of they seafood tostados and they are freakin huge!  You actually get another bare tostado to move some of the toppings onto and you'll need it.  Service is great and even when packed usually don't have to wait long for my food."], ["Eric B.", "so, then. i reviewed this place some time ago, i just had the info wrong:yelp.com/biz/taco-lopez-…on to my review:all right, nashville...if you didn't know by now, the taco stands you see on the side of the road are (for the most part) INCREDIBLE. i can understand if you're reluctant to try them, as they really aren't too terribly inviting. this particular joint would be a perfect \"first timer's\" place to check out street meat tacos. they've cleaned up this spot quite a bit. i remember stopping here many nights after 3am in anything but sober condition. back then, it was just a motorized stand/cart/truck like the others. they now have seating and a card machine. woooo!anyway, for lunch, you can get a half chicken, a gang of rice, a gang of beans, homemade tortillas, and a couple of times, fresh cut fries(??) for SIX DOLLARS! this is a criminal amount of food for next to nothing. and it's sooooo good. as far as the tacos go, i'm an al pastor man, and the al pastor here is second only to san luis. the horchata here is a little heavy (i'm not really much of a fan, anyway), and they charge you for each can of soda you get.anways, you get the deal. great food, great prices, and they speak english for the non-spanish-speaking -types. check it out asap!eric baaaaand the update:just an update...the great nashville taco price war of 2009 has reached tacos lopez. they are NINETY NINE CENTS EVERY DAY!! i just decimated an order for the first time in a while and they were a mite better than i remember. show this and all taqueria lopez locations some love, nashville. the best tacos around for real.eric b"], ["Carri H.", "Happened upon this little place quite by accident, on a cross-country trek in the middle of a TN ice storm!  Road rage opined that we diverge from the highway.  The weather was so bad that most establishments were taking a snow day, but this warm and inviting place turned out to be just what we were looking for.  We had good service and great food, despite the initial stares.  I suppose they really were not expecting a couple of harried yankee lezbos to show up for lunch, so I do not blame them.  I had a torta de barbacoa: scrumptious fresh grilled torta bun filled with melt-in-your-mouth marinated bbq pork, avocado, tomato, lettuce, and salsa!  Co-road warrior had the roasted half-chicken (with rice and beans) and it was even better.  it was the perfect amount of salty and roast-y with a nice hint of herby and mild spicy.  I wanted to sit there eating it all day.  Both came with a nice radish slaw.  The ambiance was typical, napkin-dispensers-on-every-table casual.  I'm almost glad our trip took an extra 4 hours because this place was worth it!  They also have a fun selection of sodas in glass bottles- some are imported and might even be made with real cane sugar!"], ["shaun p.", "Tacos sucked booo...they had cucumbers all over them when did mexicans start using them blah!"], ["Benjamin H.", "This place has fairly good food, quick service, and a friendly staff."]], "Bakersfield Nashville": [["Sherry Y.", "I came here with a friend on a busy Saturday afternoon, and we were seated almost immediately. The service was prompt and friendly, coming with ample suggestions for drinks. I went with the Bakersfield Margarita with salt and shared the queso with a friend. The margarita was quite lovely, the perfect amount of lime balanced with the smoothness of their tequila. Though I did get a massive headache afterwards, this does tell me they don't skimp on the buzz. The queso was pretty decent, though it is a bit different than the fare typically offered in quesos in the southwest. This particular appetizer is quite chunky with an ooziness that is quite delectable. I'm not quite sure it's the best combination with the margarita I got, quite a bit more oily than the two of us bargained for.Ambience was cool, with a nouveux-industrial feeling: open ceiling, concrete, and wood block bars with warm lighting. It has a great corner location and felt quite welcoming. Pretty dim, considering the mood lighting, but fitting for the atmosphere."], ["Hattie J.", "First off, order the queso. I promise you won't regret it. It is pure cheesy goodness. Top it off with some chorizo and pickled jalapeños, and it is perfection.The tacos are pretty good. Small, so I'd suggest getting at least three. I had the fish, short rib, and Pollo rojo. All were good, but none of them blew my socks off. Both my friends ordered the pork belly taco, and they were singing praises about it, so I definitely regret not ordering that one!Make sure you get some sangria to wash the tacos down with. It's good stuff! It has little pieces of apple in it that are heavenly to eat!The location is downtown, so be prepared to deal with parking, though they do have an option for valet! The interior of the restaurant is very modern and dimly lit. It's also very loud in there, so be prepared to speak up!"], ["Bob B.", "I know...Bakersfield does not sound like a Mexican restaurant, but it is and is a good one. Had the queso with chorizo made with real cheese, not velvetta. It's just awesome. So get yourself some. Then had the pork belly taco and i know you're going to love that too, so just order it. Yes, listen to me. HahaOver all great vibe, good modern Mexican  food. Now quit bothering me, kid. Good day"], ["Caroline V.", "Excellent salad (Johnny) -- chopped, fresh, nice balance of dressing-to-greens. Husband enjoyed his short rib torta, which he said came on some of the best torta bread. I was also impressed by the housemade corn tortillas on my son's cheese quesadilla.  The margarita was just all right for $8 - not super potent or flavorful, and the guacamole was remarkably garlicky. Server Giuseppe was very friendly and patient with our three year-old, who enjoyed the blaring country music and the old Westerns on the TV over the bar. Would return for sure and stick to beer!"], ["Felicia L.", "Being from LA, tacos weren't my first choice for dinner when I was visiting Nashville. Also the restaurant name \"Bakersfield\" was kind of questionable, only because Bakersfield to LA people is a nearby LA city that no one wants to go to. However, my weird assumptions were just weird - the tacos here were pretty good!Fancy tacos, fancy nachos, fancy cocktails. The restaurant itself was pretty cool too. Everything was good, from the food to the service. The nachos were different.. not served with your regular nacho cheese but some sort of heavenly cheese concoction with a different texture... almost like hummus but not? Also, I must have had 3 tacos (forgot which, but I usually stick with beef) all which were packed with flavor.. very good! The cucumber cocktail I had was refreshing.This restaurant is smack dab in the middle of downtown Nashville, near \"NashVegas\". Valet parking is free as well. Would I come again? Yes!"], ["Magda C.", "Awesome!  Such a nice spacious location. Those tacos are to die for.  I also like tortas and their perfect guacamole. I am a huge fan of Cincinnati's location and was soooo happy to see thr familiar sign in Nashville.  Food is great,  service friendly, Margaritas never disappoint,  beer in their small santa glass shoe remind me of Xmas all year long. Real gem in this area full of tourist traps.LOVE LOVE LOVE!!!!"], ["Jan B.", "This is a perfect spot to grab lunch in Nashville.  The menu is small but hits it on the head. The taco offerings are maybe a selection of 8?  About $4 each and they are small enough that you would get 3-4 per person.  Great bar scene, very cool but not hip vibe.  I loved that they also had charging plugs under the bar top for the patrons.  Great tequila and bourbon selections as well.  Staff is very efficient and friendly."], ["Laura C.", "Hello, Nashville. I like eating there! On the way to a concert at the Ryman, we went to this place with friends. Holy cow. I usually don't like queso (to me, that stuff is mostly a mindless distraction from real food), but the Bakersfield queso is amazing. IT'S MADE OF REAL CHEESE. Topped with their pickled jalapenos? Yes! I had two tacos. One Hongos and one fish taco. So good. My companions had tacos and a torta. It was all delicious. I had a cocktail: Red Headed Stranger. So good! Not too sweet. Crowded but not unmanageable. Very good energy. Nice that the windows could be open during the summer."], ["Bleep S.", "Delicious street style tacos.  I sat at the bar at lunch time and it was fun.  Those tacos came out of the kitchen fast!  Tried mole and short rib tacos....yum."], ["Karen M.", "This place is ok if you do not have high expectations. Do not order pitchers of Margaritas because they are obviously very diluted. You will receive a better drink if it is made to order. The guacamole is very good. The queso is good but very thick. The tacos are ok but I do not like corn tortillas. The way they serve the tacos is weird...all on a community tray where they try to disperse them according to order. Very confusing. And if you want a fork and knife, you will have to ask for it. Coming from Texas, I am a hard sell and Bakerfield's misses the mark in my opinion."], ["Kimberly S.", "I've been here twice now and don't quite get the appeal. This past time, my husband and I went before a concert and were on a time schedule. After doing a happy hour at Etch, we stumbled over here for a light dinner. We both had margaritas, which were maybe the worst margs we've ever had. As soon as I got to the concert, I had to physically sit down and drink multiple bottles of water because the sugar/sour mix made me feel so sick. I do not recommend the regular margarita here.The queso is really quite good. It's a different texture than most Mexican quesos, and you can tell that they use real cheese. Add the pickled jalapenos for an extra $1-- it really helps make the dish!The tacos are not my favorite. Between my two visits, I've tried five of them and haven't been impressed with any. I do not get the rave reviews on these. Also, the place is LOUD. The first time we went with another couple. Our conversation was stilted because we were shouting and still couldn't hear each other so it's not a great place to go to catch up. It's an alright option when on Broadway, but I would not go out of my way to return."], ["Matt D.", "Great feel and atmosphere for lunch.  The waitress and Manager were very personable and attentive.  Had the chips and guacamole which were delicious.  The chicken chorizo tostada had a great little spice and overall great flavor.  The Cochinita Pibil was also fresh and full of flavor, not the mention that they make their own tacos in house.  Returned with my friend on the weekend for dinner and unfortunately they didn't have the valet up and running (no pun intended).  Also, it was much louder around dinner than when I was dining for lunch.  We ordered both the queso and the guacamole which was a great choice.  The queso was gloriously thick and flavorful.  Next time, I would add chorizo to add some depth to the flavor.  I ordered the Pollo Rojo, Cochinita Pibil, and Bistec tacos and all three were full of flavor.  While the tortillas are on the smaller side, they certainly load them up for you."], ["Katie I.", "Second time here and another good experience. Love the vibe here and the sliding doors opened and fans give the feeling of being outside, but with a nice breeze. House margarita is delicious and not bad at $8. El jimador blanco, triple sec, agave nectar, fresh lemon/lime. The sangria looks equally delicious and I plan on trying that next time. Great guacamole and I love their red salsa. Has a nice smoky flavor. Didn't care for the green salsa. They have a limited menu of mainly tacos and a few Tortas and Tostadas. I really liked the chicken chorizo tostado. Fish tacos and short rib are also solid. Added bonus, their complimentary valet is shared with etch, so no paying exorbitant parking prices. Thumbs up here."], ["Michelle C.", "Bakersfield was conveniently located right near our hotel for my bachelorette party weekend in Nashville. On Saturday afternoon, we had nine hungry girls and no reservations, which made Bakersfield the perfect option since they take walk-ins only. We didn't have to wait long for a table large enough to fit our group to open up, but we did have to wait until our whole party was there to even put our name in for a table. In the meantime, the hostess kept pushing these standing-only tables on us, but we held out because we weren't interested in standing while eating a full meal.  Once our name was in, we migrated to the nearby bar to get drinks. The hostess was on us every ten seconds to move out of the way, which we gladly did, once we received our drinks. It was a little weird and made ordering kind of awkward since we knew this woman just wanted us to get out of the way. But how else would we have ordered drinks? Seated at the table, things ran much smoother. Our server was awesome and made some great recommendations. The queso and guac were both delicious and came out seconds after we ordered them. The tacos were also great and I found two to be more than enough after the chip bonanza. Also, the margaritas were on point. Prices are very reasonable, and our server was willing to split our checks without a second thought. I'd definitely hit this place up again though I'd be wary of where I stood to order a cocktail."], ["Casey H.", "After the Indie Ville TV Awards, we were hungry and wanted to try a new place. We came across Bakersfield Nashville and gave it a shot. Parking is pretty ridiculous in that area because of the construction that's currently going on. There was mention of valet but it was nowhere to be found. We found a lot about 2 blocks away and paid $9 for 2 hours (min). The place was pretty empty at 630PM on a Sunday so we were seated quickly. We ordered chip/salsa, 3 tacos (short rib, fish and pastor) and a Milanesa torta. Chips were fresh and the green salsa was good - it was green and reminded me of a tomatillo sauce. The tacos were really good... nice balance. I didn't care for the Milanesa torta; it's not bad. I just don't like battered stuff. I would have given the place a 5 star if parking was more convenient."], ["Tracy B.", "This place was just as good as the other reviewers had led me to believe. It was a recommendation from a friend and I'm glad I listened. The inside was beautiful-- it was like a rustic but yet modern feel. And had a very \"cool\" vibe. We started with margaritas which I loved. Half of our group got the spicy margs which I'm not a fan of but they loved them. I liked how they were easy to drink but not too sweet.And the food was so good. We got guacamole, queso, and queso with chorizo. All three were super tasty. I  picky about queso because I don't like when it congeals because restaurants try to be too fancy, but this was perfect.We all split two salads and then had two tacos each.The salads were great-- I can't even remember what they were because that wasn't the highlight of the meal...And then we all got different types of tacos and by that point, I was barely hungry anymore, but they were really good. I got the pollo rojo and the short rib and even though I didn't really taste the cheese in either one because of the other flavors, they were both great.I'd definitely go back."], ["Brian B.", "Flavourful tacos, but all were a little dry.  I enjoyed the taste of the pastor tacos, but again wish they had been a little more moist.The waitress told us the guac was really good when we sat down, which I thought may have just been a way to sell it, but it actually was pretty fantastic--and deceptively large."], ["T C.", "Probably the cheapest grub your going to find in the area that tastes great! Few notes to keep in mind... 1. Service is fabulous!   2. Make a reservation, waiting area has little seating however bar is right there which is handy....  3. Music is very loud so if you want a nice pleasant conversation this is not the place...lol.   Who needs to talk when your eating anyway....4. Short rib sandwich, short rib tacos.... OMG. Need I say more... 5. Local brews... Yowza. That's all!  6. If you are looking for more than tacos and chips/salsa you will not be impressed however the choices that are on the menu are all great... Suck it up and get a taco.... Queso is yum too.  Did I mention service was great and food was very inexpensive."], ["Sheena T.", "Man, I was really impressed with Bakersfield!! I came here for dinner and drinks with friends and really enjoyed it! We started out with chips and salsa and queso. I didn't love the queso....I feel that queso indicates liquid form cheese. This was more melted cheese. It was ok, but not quite what I was expecting. The taste was fine, but nothing special. I wouldn't order it again. The salsa was good, pitcher of margaritas was excellent and quite large too! Our whole table ordered tacos and they were really good. All of us had our favorites, but overall they were really tasty. The server told us the different heat levels on each of the tacos, and my favorite was the spiciest one. I believe it was the Cochinta Pibil. Mmm. So good. Service was great, food was solid, and my only other complaint was the noise level was super high. But that is pretty hard for them to control. Overall I will definitely be back for more delicious food and margaritas from Bakersfield!"], ["Liz B.", "What a wonderful time we had at Bakerfield. We had a party of 11 on a Sunday afternoon, the staff accommodated and were  great. To start the Margarita's have fresh squeezed lime juice and are terrific. The queso is a must along with the guacamole! I ordered the Fish Taco and the Mole Taco, both were super fresh and delicious. I'm a lover of fish tacos so I would definitely go back for those! Decor and atmosphere was a pleasure as well."]], "Chuy's": [["Jarrame B.", "Love it!! Good staff. Great fresh made tortillas. Fresh chunky salsa!! Nothing to suggest this go around. The food definitely makes typical Mexican joints seem bland. Fellows, beware!! There is a H&M next door. So, if you are with the wife and/or daughters you will spend some money. Go ahead lol!! Back to the restaurant. The food is well priced!! Check it out!!"], ["Shannon M.", "The place is very clean! It was my bf very first time here and he loved how the place looks already. He is a huge fan of mexican food so when I told him about this place he was very excited! The chips and and salsa were AMAZING!!! The beef for my fajitas were the best I've ever had! My BF loved his burrito he ordered. He was so shocked at how big they came. We couldn't even eat all our food. I highly recommend this place for mexican food lovers!!! They also have a daily deal special every day!"], ["Jason M.", "What a good tex-mex place. First the portions are large so come hungry. We were able to sample all there sauces and they were all good. I gave them 4 stars because for a chain they are above average, the waiters were excellent and they make there own tortillas. So big plus there. I had the Elvis memorial combo on the first eating and it was huge and very flavorful. The chicken is real chicken, the ground sirloin is real sirloin and the corn tortillas, the blue corn tortillas and the flour tortillas where perfection, cooked to just enough charring to where they weren't doughy but weren't dried out either. The sauces were fresh tasting with a great balance of heat. Ask to try the creamy jalapeño ranch and dip your chips in it. Delicious!!! Price is $9 and up."], ["Elliott W.", "Chuy's still is my favorite teximexichain. The Opry Mills location has delivered on the promise to keep me happy twice with perfectly tender and delicious steak fajitas. And the added bonus is showing up during happy hour for free queso and pulled pork on the thunderbird bar, which we made copious use of. By the time dinner came out, we'd already had a full meal of pork nachos!Chuy's at Opry Mills servers their salsa a little chunkier than other locations that I've visited. I don't know which way is the Chuy's standard, but I'm not complaining. Its great both ways.Always a value. Always satisfied."], ["Joe K.", "This place is great, my girlfriend and I get there about twice a month and split the fajitas for 1!, yes I said 1! It's more than enough, and with the extra money we save by not ordering for two we get more margaritas which are delicious and priced well, waitstaff has been tremendous every time too!"], ["Tony W.", "Came here on Cinco De Mayo with a large group, at lunch, and still have nothing but good things to say. They had a free nacho bar, they offer several salsa's to compliment the free chips they give you when you walk in. The food was not only hot and fresh, but also delicious. I had a combo meal and would have probably cleaned my entire plate if we didn't run out of time. I usually prefer not to eat at chain restaurants when I travel, but we don't have these back home. If we did, i'd be a regular."], ["Millah J.", "The wait was very long...they could be better organized. We finally found a table in the bar area and the service (Shea) was excellent! Shea was attentive and friendly. We were celebrating my birthday and they surprised me with sopapillas - which were delicious!! PLUS I was serenaded with a birthday song by \"T\" who has a phenomenal voice. Needless to say, I had a wonderful time! I tried the Comida Deluxe Combo (#1) for the first time - my usual is chicken flautas or the chuychanga - and I'm glad I did! I just wish my stomach had more room to fit it all!! If you're on the fence about going, GO! Just don't go on a Saturday night. And be sure to ask for the creamy jalapeño dip - you're welcome (trust me, you'll thank me)!"], ["Christopher V.", "You can never go wrong with Chuy's. Best Tex-Mex around that's for sure. Service was great, making sure they always kept my glass and chips full. They sell funny T-Shirts as well."], ["Armand K.", "Far exceeded expectations.Was staying at the Gaylord Opryland Hotel and after dining at Cascades, supposedly their best restaurant onsite, knew we had to venture out for dinner. Chuy's was not only recommended by some of the Opryland staffers, but also was the top rated place within walking distance on Yelp. 3.5 stars didn't sound terrible, but going to Tex_mex in Tennessee seemed a little odd. Nonetheless we checked out Opry Hills Mall and two-stepped our way into Chuy's.4PM-7PM every weekday is their Happy Hour. Beyond a few drink specials, including their signature Margarita's and the Texas Martini (a Margarita served in a shaker bottle with a Martini glass garnished with jalapeño stuffed olives and a wedge of lime), the happy hour also includes unlimited house made tortilla chips, queso (nacho cheese sauce), seasoned beef, and their new creamy jalapeño sauce. After ordering drinks and loading up our nachos, we we're already pretty satisfied, and opted to share the waiter-recommended chicken fajitas. Served on a hot skillet with all the toppings you'd imagine (including guac) they were incredible. Not only was the chicken perfectly cooked, but the home made tortillas make a huge difference in overall taste.The ambiance is a step up from other casual restaurants in the same price range. Unlike an Applebees, Chili's, etc, most of the art inside Chuy's is handmade like the food. We skipped on dessert, but overall had an incredible experience. I know a big part of our satisfaction, was due to the gentleman who was serving us. When we ran out of fajita tortillas he even brought us a few extra for the last few pieces of chicken we had. I'm looking forward to my trip to Austin so I can visit the original.Pro-tips:-Go during 4PM-7PM Weekday Happy Hour-Try the Texas Martini-Portions are large"], ["Jason K.", "Pretty much what you'd expect from a Mexican chain restaurant at a mall. The guac was pretty plain and uninspired...but they fry their tortilla chips fresh...they arrived impossibly thin, hot and crisp. Enchiladas were pretty mediocre as were the sides. However, service was very friendly...our waitress brough my wife an order of sopapillas on the house for her birthday (they were ok). You could do much worse at the mall."], ["Richard S.", "This place is great. It's always busy always loud and aways taste great. I love the creamy jalapeno dip. Appetizer sampler is even better. Awesome!"], ["Mike R.", "After getting robbed by Opryland for low quality food at stratospheric prices, we just had to eat at Opry Mills. Yelp led me to Chuy's and once I saw green chile dishes on the menu, I was in.This is the first place I've seen outside New Mexico with green chile anything, and they had Hatch chile, too. Reasonable prices + big portions = strong value. My son had soft tacos, which were a bit spicy for him (fine to me), and I had the \"Southwestern\" which is \"a New Mexican tradition. Homemade blue corn tortillas stacked with freshly-roasted, hand-pulled chicken, cheese & Green Chile sauce, topped with a fried egg\"; I really enjoyed it.The ceiling of the room we were in was covered in wheel covers/hubcaps; the rest of the place was similarly adorned. Our server, Ashley, was very nice and efficient.I intended to return but could not talk my unadventurous peers into ditching Romano's (chain) for Chuy's. Their loss.Recommended."], ["Rebekah T.", "After heading back to the hotel, we stopped into Chuy's for one last cocktail on our last night. Still early enough to try one more spot in the neighborhood.We sat at the bar and ordered a couple Margaritas, mine with a Cornita stuffed in it. Ridiculous and somewhat delicious in a overindulging way. *wink*Service was okay, but my guy was a little put off by the way they started closing down the area while we were still there. It wasn't closing time, but obvious that employees were getting ready to go. That was our cue to leave too."], ["Josh R.", "Awesome Tex-Mex food! I love the Shiner Bock marinated fajita beef. The creamy jalapeño dip is awesome too! This place is crowded at lunch time, so there is usually a wait, but it's worth it."], ["Rob C.", "The in house soft tortillas are terrible. The service is very poor. My wife got the enchiladas and liked them. But the tacos are terrible."], ["Sandra F.", "Wow! I love the creamy jalapeño sauce!  The waitress called it liquid crack... She's right.  I need to detox now.  Love the quirky atmosphere and the food is great. Witless be a five star if margaritas were better. Our waitress, Kalisa, was awesome!"], ["Libby B.", "This is one of my favorite places to come on a nice day. I've happily spent many an afternoon here enjoying margaritas and conversation.Speaking of margaritas, they have a couple new ones which are fantastic. The newest flavors are blackberry and watermelon, and both are amazing. You really can't have just one either! Their sangria is also top notch, and just as addicting.I've always had good service here. The waiters are good about checking on you and making sure your chip basket is full, your drinks don't run out, and that you get that 3rd order (no shame) of jalapeño ranch straight away.The food is pretty tasty, I have had their enchiladas and their tortilla soup on several occasions. Honestly I feel like they have some of the better Mexican food in town - too many places in Nashville seem have too watered down salsa and lackluster tacos."], ["Carol M.", "Simply, one of the better choices of restaurants at the Opry Mills Mall.  I would much rather eat here than at the food court or Fridays.  In my opinion, it's a little over priced for tex-mex.  The cheese dip is really good and the tortilla soup was okay.  I believe the tortilla soup was considered a signature dish but I didn't really notice anything  signature about it.  The atmosphere is a little funky and upbeat.  I can see where this would be a great place to bring the kiddos!"], ["Katie M.", "I go just for the Jalapeño dip! It is amazing! The food is average, definetly not authentic. The atmosphere is fun for a family. Very noisy! Perfect place to bring someone you don't really want verbally interact with! That annoying coworker for example. Y'all go out for a drink after work and really hoped they were not going to join the group. Well...problem solved!We prefer the one at Opry Mills Mall, consistent with great customer service.  Wait staff is always attentive even with a two hour wait!"], ["Mehgan H.", "Chuy's...not real Mexican food.Of course, you know that when heading into the restaurant but you still expect your traditional Mexican food.I have tried out this place a few times and the only thing that I have liked is the cheese dip and the Coronita (corona beer in a margarita) drinks.All of the entree meals fell very short of what I hoped for. There wasn't any intense flavor or any \"mmm\" factor - it was just food.If you are looking for a place to eat Mexican food...I would not recommend going here."]], "Baja Burrito": [["Kim M.", "When you're from the SF Bay Area and need a burrito fix, this is the place!!  Burritos are big enough, not all the way like home, but close, and everything is fresh n tasty. Tampico pork rocks!!"], ["Mitch T.", "Daaaang Chipotle... I hate to admit this but you've been knocked off the top in favor of Baja Burrito. As a \"Burrito Extremist\" (thank you gf) I have always honored chipotle as the top dog, which is impressive to say the least for a chain! Recommended this place by my Airbnb hosts, I was skeptical even as they told me they once felt the same way I did. I knew I had to give it a try.THEY WERE RIGHT!!Extremely nice, hipster staff in a hipster little shop. 2 burrito size options to go with about anything you could think to throw on a burrito. Quick and easy, they get you your food fast and still smokin' hot to the touch. If you ever get a chance to visit Nashville, trust the taste buds of a seasoned burrito expert from the home that is king to burritos. Chipotle, you've met your match!"], ["Patrick B.", "My meal was made directly before me;It's delicious scent subtly implored me;I'd give it five star applause;But in the South there are laws;No perfect scores without sweet tea"], ["Bonnie H.", "First time here..I had the fish taco and chips. .The taco was very good..fish was tasty..The chips were marginal at best..The sauces very good. It's a busy place. .tight parking..tables are community sytle."], ["Kevin H.", "Ultra popular and busy. I had the chipotle chicken salad and it was good, but nothing unusually good. Less spice than I wanted. Solid choice, and local chicken - so I will try it again."], ["Danny N.", "Baja Burrito isn't bad and I have never had a negative experience.  I'm a huge fan of eating local and keeping from the chains, but Baja Burrito isn't as good.  Three things the Qdoba's Chilotle's of the world do better.  First the tortilla tastes more firm and store bought.  Secondly their meat tastes on the quality level of Moe's.  Lastly their rice isn't as good as the two places I mentioned.  I'll go if other people are going that I'm with, but I would prefer a true mexican burrito or Chipotle (obviously different) but no reason I'd prefer to go here."], ["Jacoby D.", "Awesome burritos! The set-up reminds me of a Chipotle where you go through the line and add your toppings to your food. I felt the prices were fair for the quality of food. Definitely a restaurant that can get busy on the weekends. Beware of limited parking options.I will recommend and come back again!"], ["Darrell P.", "Outstanding restaurant. Custom made food while you watch, and pick which ingredients to include in your dish.This is very reminiscent of Freebirds in Texas or Izzo's in Louisiana."], ["Matt S.", "Honestly, best fish tacos in Nashville. Ranked. Look it up. Ok I made up the ranked part but seriously they're amazing."], ["Chris M.", "This place is doing it right!  I get a basket of fish tacos every time -- fills me up, is delicious, and only costs $7 with tax.  What more good I ask for?  They have an awesome patio, friendly staff, and fun decor and atmosphere.  Also there is an overflow parking lot across the street so there is always a place to park even during the lunch hour."], ["Existential Y.", "Every now and then, my mustache (which is very German and possesses a life of its own) develops a strong craving to be doused in salsa and chicken of the highest caliber. Fortunately for my fearsome handlebars, Baja Burrito exists. Baja combines delicious food with a relaxing, artistic atmosphere that forces the consumer to confront the fact that we are all Being-Towards-Burrito."], ["Chris S.", "Love their fish tacos and if you are a tea person get their fruit tea.  It is some of the best in Nashville!"], ["Meagan F.", "Way better than Chipotle and completely unexpected. Like what Freebirds is to an Austonian!"], ["Tara S.", "Very good food but they're usually so busy that they're rushing your order and quality lacks. Every time I've been they've run out of guacamole. Their peach tea is delicious! Other than that, anything you order will be good. I've actually stopped eating at Chipotle because compared to Baja they lack so much flavor. Parking is very tight if you try to park in the front lot but they have ALL KINDS of parking in the back. It's quite laughable actually. They must have at least 5 different lots out there. Poor Sam & Zoe's has about 4 spaces while Baja gets the rest.Bottom line : awesome food but just wish they'd slow down the pace just a teeny bit. Depending on who's working it really does affect the quality."], ["Terri W.", "The burritos were tasty, big, and reasonably priced. The filling was like warm and that was s bummer. We will go back if we're in the area again."], ["Ali S.", "One of my favorite taco places.  My second favorite to be exact after Mas Tacos.  But the great thing about this place it that no matter how busy they get they still manage to get the line moving quickly.  They have an awesome salmon and beef brisket tacos that I highly recommend."], ["Jim D.", "If you are a local you've probably already been to Baja burrito. In fact, from the looks of it you're probably here now. Why do I give this little burrito place a perfect rating? Three words; cheap, fast and tasty.. and fresh... four words. Oh, and friendly. So five words.  Let's start with cheap. The most expensive thing you can order is $6.99 (the steak salad). A basket of 3 6\" tacos will set you back $6.29 for the chicken. Fast is next, when you walk up and the line is hanging out the door and every table is full you think, \"this will take forever!\" Nope they move that line right along. Tasty kind of speaks for itself.  You pick the toppings so if it's no good you have nobody to blame but you. Seriously the meats are all very good. Fresh, all of the toppings are really good looking. No beige lettuce or wilted tomatoes. Lastly they are really great to the customers considering how busy they stay.They have a great patio for outdoor seating but they don't have a full bar. Only beer. A plus for me is that they even filter the water. So many places around town it tastes like they pump the water right out of the Cumberland or a chemical plant.If you are looking for a great little place for a burrito and like me want to keep your business local (I'm looking at you Chipotle) give Baja a try."], ["Barbara S.", "Love the burritos... And fish taco. Would recommend to anyone but parking can be a problem."], ["Wendy T.", "FOOD: I would have rated this authentic eatery 5 stars if it wasn't for the food safety violations I noted during my 15 minute wait to order. The food handlers were chewing gum as they were prepping food and several had jewelry on...which in my world is a no no. Besides those minor observations I loved the burritos, they were absolutely delicious....I like the variety of tortillas, and salsas! The carne asada was well seasoned...it brought memories of KING TACO...its that yummy!Ambiance: We took our order to go, but it looks like a lively place to dine. Apparently it is always packed with patrons. I loved the decor and energy, it felt like Baja!Customer Service: Excellent, although there was a wait to place an order, my burrito was promptly prepared. I appreciated that they provided boxes for our large order. Again, it was my first time at Baja Burrito besides the gum chewing as they prepared my food, I was impressed. Will visit again."], ["Natt A.", "I came here with my girlfriend and a few friends after ESCAPING from the nearby Nashville Escape Game. We were famished and came during lunch time.The place was busy, but the service was great and friendly. They answered questions and made excellent recommendations even with the moving line. They are locally owned and get most of their products locally as well. The place is kept cleaned and is a casually, trendy place to enjoy some tasty food!As for the food, I ordered the Torta Brisket - Tortas are usually the hispanic sandwiches but so much tastier! The brisket was very tender, juicy, and just melted in my mouth with each bite. Of course eating a torta can become a bit messy, but every bite was bursting with flavors! I even scooped up the drippings because I enjoyed it that much! The pineapple salsa was sweet and goes well with their hot salsa from the salsa bar. My girlfriend got a taco salad with Seitan -- imitation meat made from wheat. It was fresh, fabulous, and very reasonable in terms of quantity and price. The rest of my party enjoyed their food and the vibrant atmosphere of baja burrito. It's definitely a fun place to come with friends and I highly recommend it for our types of individuals.We will be back!"], ["Drew S.", "A wise man once said, \"GET IN MAH BELLLLLY!!!!\"I find myself mentally screaming that to whatever comes from this place. If you've never been and are genuinely reading this place's reviews to decide, just go. Now.When I graduated from college, I asked my parents to take me here. Yeah, really. Gah-lee! So good every time!!! I get knocked up a food baby every time too!"], ["Charity K.", "I ate here for the first time last week. It was absolutely delicious and I will be going back ."], ["El E.", "Some friends help me discover Baja Burrito.  Now we stop there at least once a week.  The ingedients taste very fresh.  I typically get the same order every time and mix it up with the salsas.  This is a great value for lunch.  Make sure to get there earlier.  The lunch rush has a line out of the door."], ["Jamie M.", "Taste-wise, baja was a little too similar to chipotle for my liking. I don't mind chipotle but I expected more from baja than a national chain taste. I went with the regular chicken burrito, the burrito was huge and filling but nothing special. I did enjoy the atmosphere more than chipotle though. They have more options than Chipotle, i.e. blackened salmon and chipotle chicken. Baja is good but nothing special, I wouldn't go out of your way to go here."], ["Ridge D.", "Great food, busy busy busy place. I like this place but I am going to avoid it during peak hours. There is a long (fast moving) line and not much seating. As for to-go, i have seen them mess up some of the plates. You might want to go to for a burrito or something else that packs easily if you want to take it with you. All together, they have very good food and many options."], ["Kelly F.", "We have lived in the neighborhood for over a year and just recently tried Baja Burrito for the first time. We have craved it every day since. I got a chicken burrito and my boyfriend got chicken tacos and we were both floored by how delicious, filling, and high quality our meals were- for SO cheap! On top of our meals, he got the fruit tea and I got a beer (making it an even more perfect after-work dinner stop) and our check was less than $20. You just can't beat that."], ["Dagan B.", "It wasnt bad but it wasnt great, Do the people that write these reviews eat anywhere decent ? Its a huge burrito but the chips u can get better ones at the grocery store, The fish taco tasted like it came from captian d's but a little better, Overall its decent but nothing special.EDIT: REVIEW WAS A 3.... TILL 2 OF THE 3 PEOPLE WHO ATE WITH US GOT SICK DONT GET THE CHICKEN IN RED SAUCE OR THE JALEPENO GREEN SAUCE IT WAS ONE OR THE OTHER."], ["Irvuss Z.", "Gtfo. The granddaddy of gNashville (and cloned franchise) taco shops with the best fish tacos, period.  Healthier fish taco salad still a winner. Fresh salsa bar, cheese dip, and never greasy (after 10 visits so far)  chips with nothing but positive attitude from the staff make this the one place to eat solo or bring your visitors. Kid friendly and fair price kid meal a good deal, too."], ["Chuck J.", "There are so many Mexican Restaurants out there and very few stand out.Thankfully this is one eatery that does.  It is amazing and always full and busy for a reason.  It is definitely a gem of Berry Hill.Keep up the good work."], ["Abraham M.", "This was where I had my first burrito! They serve the burritos at a good price and nice size portions. The only downside is the parking is limited. The food is consistently tasty time after time."], ["Chelsea L.", "Best burrito In town!!  Will not go anywhere else for a fast cheap good meal!! Also the fruit tea is the best"], ["Sloane E.", "AMAZING! This local Nashville hot spot has quick and unbelievable tex-mex! The painted vintage VW bug outside adds a bit of fun and lightheartedness to the atmosphere. I waited nearly 15 mins in line but man it was well worth the wait! I would absolutely recommend Baja to all those, local and visiting Nashville."], ["Nashville T.", "I couldn't get past the dirty tables and floors.  It seems that this place is one step up from a food truck.  I can take cheap food now and then but the place has to be clean.Would not return...ever.  Yucky."], ["Troll H.", "Simply put, this place does it right. $1 more than fast food and you get actual food that is cooked. Can't beat it folks."], ["Allison N.", "Oh how I love you, Baja Burrito!Baja Burrito is a gem in Nashville. Everything is awesome and tasty, especially their shredded chicken. It's usually not on the main menu, but below it. But get it, it's really good. The prices here are great, because it's not really too expensive but you get a TON of food. I usually opted for the taco salad. Everything -- and I mean everything -- about the meal is fresh and delicious.Their salsas are where Baja Burrito really shines. They've got a wide variety of salsas: spicy, tangy, sweet. There's even pineapple salsa. Great taco place, and it's usually always busy. Don't be scared of the line though -- Baja Burrito is 100% worth the wait."], ["Allie O.", "While this place was super delicious, I didn't really appreciate the customer service! For instance, when I was ordering my vegetarian burrito the guy making my burrito didn't offer me mushrooms or the seitan which I really wanted had I known they had it. The guy helping my husband offered him the whole nine yards, and I found out after we checked out everything they had. I also felt very rushed, so that never feels good. So I feel like my experience might have been a four or five star if I had been treated equally."], ["Corey G.", "I really like what Baja Burrito does.  Build you own Burritos and Tacos at a much more affordable price than Chipotle and Quoba.  They have an awesome Pineapple Salsa to compliment any of their food and a great selection of sauces to add to your meal.  I recommend their steak, its extremely favorable and tender and in my mind the way to go!  Seating can be tricky as they have a ton of business and a limited amount of seats.  They do have plenty of parking available in adjacent lots to the building if you can't find parking in their main lot.  There is a burrito place like this back where I went to school with the same menu and pricing so I was blown away to get such a product at same price in Nashville."], ["Michael K.", "My wife said\"the best fish tacos!\" Great atmosphere, great variety! Recommend by jars of clay!!"], ["James S.", "Love it. Same setup as Moe's, but the food has a little more pizzazz. Liked the three types of tacos and the pineapple salsa. But it's loud. So loud that I didn't notice that someone was trying to take my order. And lunchtime traffic made it really hard to get in and out. But the food is worth it."], ["Joe C.", "Voted Best Burrito in Nashville by me! I've been going to Baja since college and I've always loved the chicken burrito. Service is always quick, even with a line out the door, which is pretty standard at meal times. I see some haters talking about \"how awkward the line service is\" and \"how there are too many hand written menu items on the wall.\" It's called atmosphere. Just get a burrito and some fruit tea and shut up."]], "Five Points Cocina Mexicana": [], "Taco Mamacita": [["Anna Grace C.", "I have driven by Taco Mamacita a lot lately, so I decided to give it a try. I'm a huge taco lover so any opportunity to try a new taco place is always accepted!Their menu is a little different. The tacos aren't authentic mexican they are more like a modern fusion and I wasn't pleased. The tacos weren't good at all. Also, I had to pay for chips and salsa which strikes me as strange for a full service restaurant. The chips and salsa were both good - so I didn't mind the price. However, everything else was just mediocre.I wouldn't go again."], ["Peter P.", "When you walk in and catch Nate behind the bar you are in luck! He is a man of the moment who ensures you live in the moment and highly recommends the shot of the moment! The guacamole is delicious and not too spicy. We had Margaritas that are almost perfect! Just make sure you let him know how you would like it. They are happy to modify their process to please your pallet.The Shot Stache is a great way to get started on any day drinking tour."], ["Amy T.", "We love Taco Mamacita, first and foremost for their awesome patio. A beautiful view of the neighborhood with a great Mojito, what could be better?The queso is great and not too heavy, the tacos are creative and flavorful, and the gluten free menu is informative and thorough. There are so many options with a restrictive gluten free diet and they are absolutely willing to work with you. I'd stick to the tacos though, the enchiladas and nachos just aren't quite as good :) The taco soup also looks delicious, I'll try it next time.The only thing left to be desired is a friendly host staff. Every time we've visited we've been disappointed at the front door. I know you're often busy, but we'd love to feel welcomed. Good thing the waitstaff has always made up for it."], ["Christina E.", "Thursday around 6:30pm... FIRST TIMER HEREParking:  Pay to park in the lot across the street, bring cash.Wait time:  I think they said 20 minutes, and it was probably more like 12 minutes (for a party of 5, first avail, outside)Chips & Salsa: WHAT A BUMMER these aren't free?! Also, the salsa tastes like BBQ sauce is a part of it, NOT my favorite.Queso & Chips: YES, order this!!  We shared this, with just a couple tacos and that felt like enough food, no sides.Black bean tacos:  I ordered this, no salsa verde or feta cheese, instead let's use mont/jack cheese and extra pico - perfection!  It was really yummy.I can definitely put down food, and this all was the perfect amount to feel satisfied.Margaritas:  $7 Silver vs. Gold -- GO FOR THE FROZEN ONE WITH THE OJ, you will NOT regret it!  I did the other one, on the rocks (like I usually do, as I'm typically not a frozen marg drinker), and I regretted not getting the same one as my husband.  It was great!  Also mine didn't taste like there was much alcohol in it.Service:  We were catching up with friends we haven't seen in over 2 years, and it seemed like we didn't hardly get any privacy the waitress was back SO OFTEN and almost rushing to get us out the door.  I was super annoyed.  However, the drinks and food came out fairly quickly which was nice.Hot sauce:  Ask them to make you some.  We used it as salsa for the chips, and it was fantastic.  Like a hot (NON BBQish) one - amazing!Overall I would recommend."], ["Carly B.", "Why hello wonderful, wonderful patio! This is a great spot to sit outside and soak up some sunshine while chowing down on delicious tacos.Pros: (2) tacos and a side for only $8.992 for 1 margaritas on Wednesday Fantastic patioCons:No reservations for the patio. If its a sunny day be prepared to wait 30-40 minutes to sit outside :(No reservations inside if party size is less than 8Chips and salsa are not complimentary.3 stars because of the cons listed above; 4 stars for the food itself. It was so good that I forgot to take pictures for you. Do forgive me, yelp."], ["Scott P.", "Food was interesting and fairly priced, but appetizers were lackluster. Korean tacos were the most redeeming entree, delicious.  Also enjoyed the chipotle turnip greens, which were a satisfying marriage of southern and Mexican cuisine. But where was dessert?  We hoped a hip treatment of the classic churro or at least some Mexican chocolate, but no dessert menu was presented.  I think there's a word for no dessert and it's called \"sadness.\"  In all seriousness though, the service was awful with no attention to detail.  Case and point she served us an overpriced anejo tequila when we clearly ordered reposado and by the way, there is a word for upcharging on salsa...it's called \"tacky.\" Seriously, at least tell us first... that was weird to be charged 7 bucks for salsa.  Atmosphere was pleasant and upbeat with great proximity to Downtown. An inebriated stroll in the local neighborhood is highly recommended.  7/10 would return, but gotta sit at bar."], ["Hank D.", "Once again they have exceeded my hopes by providing great service and even better fresh food. The experience is worth the drive over the bridge from the east side. Love this spot if you want to sit outside or in you will be the focus of great food and great service! Excellent overall vibe runs through this entire place...."], ["Victoria L.", "The impeccable customer service is where this place really shines. I have a dairy allergy and the first time I ate here the manager came out to let me know they have a separate station for cooking for allergies to avoid any cross contamination. On a separate occasion a friend was doing a very strict no processed food challenge and again, management came to the table and spent a long time with her understanding her needs and helping her pick a meal. In all honesty, without the above and beyond service, this place is more like 3 stars. The food is pretty health conscience, creative, and affordable. The execution and taste is a little above average. The decor is fun and \"hip\" and it's a nice environment for a relaxed dinner with friends or a casual date. It can be hard to get a table here during dinner hour sometimes and other times you can walk right in but that's most decent places in Nashville. When it's busy the inside gets a bit loud so I would recommend outside seating when it's warm enough. Overall this place has wonderful service, good/affordable food, and a nice atmosphere."], ["Jayson J.", "Nothing Mexican about this place ..tacos are bizare the tortilla soup nothing close to chicken tortilla soup .."], ["Heather R.", "Some people claim that heaven contains angels, clouds, and harps. While I have no opposition to any of those things, it is my hope that heaven will also contain a fantastic patio, margaritas, and tacos. Just in case it does not, I plan on taking full living advantage of the fact that Taco Mamacita offers all three (no death required!). Taco Mamacita is one of my favorite hang-out places once the weather hits tolerable outdoor dining temperatures. Their patio is lovely and shaded, so even when the sun hits its most delightfully brutal Southern stride, I can eat outside without fear of an \"Irish tan.\" Though their drinks are a little light on the alcohol, the atmosphere more than makes up for potentially not being drunk. Now on to the food. I have never had a bad food experience at Taco Mamacita. Let's start with the basics: tacos. But a taco can be so much more than basic, and the Mamacita does everything possible to ensure that you are aware of just how non-basic tacos can be. Go for their $8.95 deal and get two tacos from their diverse selection, plus a side. Highly recommended are the Korean pork tacos and the royal taco grande. Haven't found that the Caribbean jerk tacos were my favorites, but that may just be a matter of taste. If you are not in the mood for tacos, or on some terrible low-carb diet, the next stop on the menu is the Peruvian chicken, which is possibly the most moist, tender chicken I have ever encountered. If you can tear your eyes away from the taco menu, this is also a highly recommended choice.Moral of the story: If you are looking for harps, clouds, and other angelic totems, Taco Mamacita is probably not going to work for you. If you are fine with margaritas, moist chicken, and a damn fine patio, stop on in."], ["Steve S.", "I've always thought it wasn't too hard to make a decent margarita and taco but I've been proven wrong many times. However, Taco Mamacita excels at both! They've restored my belief that a great margarita and great tacos can make a great meal!Taco menu is extensive. I went for the baja fish taco and the california club taco. I preferred the california club taco more only because it had more flavor than the fish. Maybe it was because they use tilapia instead of tuna. It was still tasty but the california club stood out more with it's fresh flavor combinations. And while I didn't have it, everyone at the table raved about the Mexican street corn. You have to get on the cob. Margaritas were strong and tasty. It's a pretty simple & straight forward menu  but they do a great job and deliver great tasting food!"], ["J S.", "Ok, tacos are about the easiest thing to cook. So why are they so expensive at Taco Mamacita? Food was ok but NOTHING special. It's a taco. Nothing more. They can't even throw in some chips and salsa, what a joke!"], ["Misty K.", "Visited my sister in TN for a week and on my last day we popped into Nashville a couple hours early just to eat at this place that I saw on a taco show on the cooking channel and my sister pretty much disliked the place, but she is crazy picky. Her husband got the SLOPPY JOSE nachos and we asked for no jalapeños as he is pretty allergic and they came out with them on it, when we commented they took it back and instead of making him fresh nachos, they picked them off. Thankfully he didn't have a reaction, but he could have gotten really sick. He found a couple jalapenos on under the guacamole which is how we knew they just picked them off. Major points lost for that. I got 2 tacos, the SLOPPY JOSE TACO no jalapenos (no mistake made here) and the TACO ROYALE, they were both pretty good with the plantains on the side, they were pretty meh, but I was trying something new. I liked the Sloppy Jose better. I can't recall what my sister got, I think it was the CARNITAS. She really was not impressed and the shaved elote on the side, she really didn't like that at all, it didn't taste like an actual street vended elote that she was hoping for. The star of the meal was easily the guacamole and chips and the queso and chips. Holy crap, hands down the best quac I've EVER had. Next time I come into town I wouldn't really come back here for the tacos, but for the guac and the atmosphere."], ["Sean W.", "The service was a little spotty but was still good. It just seemed as if they weren't very organized. The food was absolutely amazing though. I had the Sloppy Jose and the Memphis tacos, with a slide of sweat potatoes fries. It comes with the really awesome chipotle ranch dipping sauce that hits the spot. It has a really cool atmosphere and vibe to it. Great little shops near by and I love that they are within walking distance of music row. If you haven't been, it's a must try."], ["Hilary H.", "The food is fast easy and delicious! So many good unique taco combinations as weLl as a good margarita combinations. There outdoor space is okay but could be a bit larger. I'm definitely a fan!"], ["Arash R.", "Cute little place with a nice patio but unfortunately the food is very average. Guacamole is good but the tacos ( I had three different ones ) were very cold and didn't have much taste to them. The enchiladas were very average as well. I'm visiting Nashville and don't know how are the other taco places but the food here is very average overall when it comes to Mexican food."], ["Aaron G.", "As a Hispanic from Texas I was highly disappointed with the food. The tacos are $4 ea! Food was okay, but the portions were rather small. Two tacos and a side cost me over $10, and I wasn't even full. This is definitely not a Hispanic restaurant and if you are looking for authentic Mexican food, do not come here. This is not the place."], ["Stephanie D.", "Delicious brisket taco! I can't remember what else I had cause it's been almost a year but I know I very much enjoyed everything."], ["Hall W.", "The food here deserves 3 stars, but this is one of those rarities whereby the exceptional service really pushes it up to 4.What I really like about this place is the great pricing - really great (probably why it is next door to a college). Given how this place has gastro pubby urban feel, the pricing is just as good as a hole in the wall. Everyone there was super nice, friendly, and always willing to answer questions and be super prompt.What is wrong with the food? It is pretty much the same level as chipotle - taste wise. Nothing to wow me. Good tasting yes, but for mexican, you have to impress me, and this one sadly didn't."], ["Pam X.", "Maybe I should've ordered something else, because I got the veggie enchiladas here and I wasn't feeling it. The portions were smaller than what you'd think you'd be getting at a Mexican joint (or it could just be that America has a portioning problem in general) and there weren't complimentary chips and salsa. The little Mexican place by my old house had better prices, portions, and everything came with queso...I do commend them on their efforts in adventurous taco names, though. That was a cute menu to flip through, although I didn't go for any tacos. Interior had nice decorations, but I'm not sure I'd come here again even over Chipotle or the like."]], "Taqueria Del Sol": [["Taylor J.", "My wife and I enjoy Taqueria Del Sol on a weekly basis- if not more. The taco specials are always a win, as are the staple fried chicken taco, the \"Memphis\" and the fish taco. If you have a chance to experience the \"Peruvian\" taco, consider yourself blessed. Many businesses have tried to exist in this building since I moved to town in 2009, but none have been remotely successful. I can easily say that Taqueria is in my top 5 restaurants in Nashville. I have watched them steadily grow, and consistently provide the most impressive service to their guests. I host a lot of friends on a regular basis from out of town, and it has become a tradition for us to hit Taqueria upon arrival at the Nashville airport. Javier and his business partner have built an incredibly satisfying atmosphere, with extremely fast service, and plentiful seating (both indoor and outdoor). To-go orders take minutes to pick up, and although the 12th south area can be congested at times, I always have an easy time finding a parking spot, thanks to the regulated/reserved parking area for guests at this business. If you find yourself thinking about taking a trip to Taqueria, do yourself a favor and head that way immediately. You will not leave disappointed."], ["Ashly M.", "My husband and I set out to explore 12 South one afternoon. We have a problem with eating, as in, it is our favorite thing ever to do. Due to this we try to find restaurants with great food and reasonable prices. Taqueria Del Sol was hopping when we walked in- it was around 1PM. You wait in line and order at the cash register. You seat yourself and your food is brought to you. I was back and forth between the special of the day which was a play on chicken flautas or the brisket enchilada- I ended up going with the enchilada. My husband did as well except he had the chicken one with the side combo of rice and beans.Start with the queso- it is DELICIOUS! It was spicy too and so so so good. Their chips are the best chips I have had since Don Pablo's closed (back in Buffalo). I was worried that everything was going to come out at the same time but when you ask for it as a starter, they got you covered.The food was tasty. I often stay away from chicken as it tends to be too dry but my husbands enchilada was delicious and not dry at all (I would say it was moist but I hate that word). The side of rice and beans was big enough for us to share as well and it tasted homemade. Often times I find myself at Mexican restaurants going, oh wow, they mixed a bag of frozen veggies into this rice. Taqueria's rice did not leave me with that impression. Do yourself a favor and scoop up the re-fried beans with some tortilla chips. I don't care what my husband says, this is neither weird nor disgusting. This was an excellent choice for lunch and they have an adorable patio outside to enjoy your meal as well. There is a fully functional bar, so if you need to pound a few back on your lunch break, they can accommodate you. The food is top notch and the price can't be beat. For queso & chips, two enchiladas, a rice & bean combo and two drinks we paid $16 for lunch. Totally worth it.Stop out for lunch and take a stroll down the street- all of the stores are extremely overpriced but fun to window shop. You won't be disappointed!"], ["Cory B.", "Fairly disappointing. As a \"taqueria\" they have a fairly limited selection of tacos. I had the chicken and the fish...The chicken was like eating a chicken sandwich from Wendy's. Fried chicken, lettuce, tomato, and mayo. Who puts mayo on a taco? The fish taco was two pieces of fish the size of my thumb with one slice of jalapeño and a dab of tartar sauce. That's it.... That's it?The only thing I liked about my visit was the salsa trio.  Aside from paying $3 for it, the salsas were very good. Probably won't be back... :/"], ["David A.", "Cool spot in my favorite neighborhood in Nashville. This place is ok but much better choices within walking distance. Had a few different tacos and living in Dallas for many years, I am a bit spoiled. Noting worth calling out. The prices are right and the staff is nice. You order at the counter and your food is served lightening fast."], ["Caz O.", "Good food. Cute place, decent prices! Parking was a bit of a challenge, but that's on par for the area!"], ["Daniel R.", "Cheese dip! Stay open all day!"], ["Josh H.", "This place is great. I've spent a lot of time in Austin, TX, and Taqueria Del Sol reminds me quite a bit of Austin Tex-Mex spots. Great food and drinks. Friendly, fast service. And good prices.Quick positives: dedicated parking lot for their customers (shared with the salon next door); lightning fast service (wait in line, order at register, then BOOM, your food is at your table in just minutes); and did I say great food?It's tough to find good enchiladas in Nashville, but this is THE spot. I love their cheese enchiladas and beef brisket enchiladas, and I prefer both with their rich beef red chili sauce. These are a safe bet to cure any Texan's homesickness. The tacos are fine too, but the enchiladas are next level.Their salsa trio is pretty darn good, but I usually go for their guacamole and/or \"cheese dip\" (queso blanco with chiles) to start, both of which are some of the best in Nashville.To drink, it's hard to resist the skinny margarita, which is actually just a REAL margarita (i.e. lime juice instead of a sweet/sour mix). On the rocks with salt, please. Choose from dozens of tequilas.The staff are always hustling to provide great customer service, and this is a symptom of a very present, hands-on manager. I wish this was the case at more restaurants. As we know, when the cat's away, the mice will play. But that's not a problem here. They seem to run a pretty tight ship.Finally, I'll address the prices. At first, I thought the prices were a bit high, but I realized that this is a counter-service restaurant. You order and pay at the counter, and then a food runner brings out your meal. So (mentally) subtract from your total what would have been that 20% tip, and I think you'll find that you're getting a great value for the quality of food and service. Enjoy!"], ["Gaby U.", "Great place for breaded chicken tacos and chicken enchiladas! Being Mexican and trying many of the actual Mexican restaurants in the area and not getting satisfactory enchiladas, this place has it! And it's a Tex Mex place! The chicken enchilada is soft and rich flavor and heaven. It is paired with beans and rice. That rice is amazing! Whoever makes that rice was sent from heaven because it reminds me of my moms fried rice! SO UNBELIEVABLY DELICIOUS. Most Mexican or Tex Mex restaurants have dull rice that lacks all kinds of things, even color! Not these guys! The chicken tacos are my favorite. They are breaded but the toppings and sauce they add to it make it fabulous. I always add jalapeños because... Duh. Referring to everyone else and the parking situation. I always park along the street. There's no reason for you to get mad for taking up space from a customer who is actually going in and out of the restaurant. Even if it's for 5 minutes you are taking up that some after you leave the restaurant premises. It's not hard to walk and extra 10 minutes from parking along the street. About paying for chips and salsa.. Y'all are funny. If you see that you have to pay for it and you don't agree on the price then why the hell are you ordering it? Your comments are irrelevant. MOST places charge for appetizers. Chips and Salsa are an appetizer. AND THIS IS NOT A MEXICAN RESTAURANT. It will not taste exactly Mexican, and it WILL have AMERICAN prices. #byefelicia"], ["Jen W.", "The chicken on the chicken salad is sliced sandwich meat. That's all you need to know."], ["Gina S.", "This was the first place we stopped at when we arrived to Nashville. The menu is pretty slim but the options are pretty great. I got an enchilada and my friend got the fried chicken taco. We sat on the outdoor patio - which was air conditioned. Since it was lunch time, we didnt get any beer or margaritas, but they were fully stocked! I"], ["Karina J.", "I love this place, the vegetarian tacos are a must have, they do have cheese so they are not vegan. They have a big variety of Tequila, so if you are a tequila connoisseur you must visit this place. This is a tex-mex restaurant but I would say the tacos are very authentic Mexican tacos, as well as the salsas and the guacamole. Great place for lunch and for dinner and for families. I highly recommend it."], ["Lauren L.", "This has been one of my favorite spots since it opened here in Nashville. When I tell people this is my favorite restaurant they are very confused... until we go and they try it. The customer service at this Taqueria del Sol is better than any of the other locations. Javier is always so friendly.Food is cheap AND delicious.If the line is out the door, don't worry. It typically moves very quickly (and all your wait time is done in line, your food comes out almost immediately after you order). You can go to the bar and order a drink (or GET A PITCHER) and drink while you wait in line. If you don't want to wait, grab a seat at the bar. Food recommendations:House margaritaThe guac here is incredible.The cheese dip is great but spicier here than other locations. The salsa trio is also great.FRIED CHICKEN TACO is the best tacoChicken enchilada with lemon cream sauce. Don't doubt the lemon cream sauce 'till you have tried it.Shrimp corn chowder (so great I order this hot soup even in the middle of July).- @gluttoneats -"], ["Dustin M.", "This is hands down the best taco joint in Nashville.The brisket enchiladas are the best enchiladas I have had in my entire life. Mall the tacos are fantastic and affordable. It's worth the wait in line. Tony the owner is so personal to his customers and because the food is so damn good it's easy to come back and support him."], ["Robert B.", "This place is so amazing! Not a huge selection of food but with this quality who could ask for more?Try the fish tacos. They have an wonderful sauce and jalapeños that complement perfectly. The carnita is also to die for."], ["Rachael J.", "Absolutely love Taqueria Del Sol. Their menu is very interesting offering different styles of tacos. I got two Fried Chicken tacos, my friends both ordered their vegetarian option (very spicy) and then the brisket taco as well. Ordering was very easy and finding a seat during the lunch rush was not bad at all. Their outdoor patio has air conditioning so you won't die from this weird heat wave going on. From what I saw they had a great selection of beer, and some nice house margaritas. I liked what I saw, but I'm glad I didn't order any because you pay $7 for a very tiny glass, doesn't seem worth it. But besides the drinks, the food was spot on, would definitely recommend."], ["The D.", "This place has a menu that would barely take up half a page but they space it out to fill the page.  This is a taqueria so you'd think the tacos would be good.   Horrible tacos.  Everything is al la cart so that's  how they get you on price. And everything is expensive. Chips are not free so you pay for a small basket of chips and salsa.  Sides were the best thing we had.  Won't  be back to this rip off joint."], ["allison m.", "These were the absolute worst tacos I have ever had in my entire life...dry, lacking flavor, just poor. I sincerely have no idea why this place gets so much business. As a positive, the queso was delicious, but I haven't met much melted cheese I don't like. Seriously, the tacos are not good, in fact, they are bad, which confuses me as I never thought a good taco, an edible taco, could be that difficult to concoct. I'll drive to chipotle next time."], ["Sophia A.", "Favorite lunchtime spot. Get there before 11:30 so the line won't be out the door.Salad is delicious and filling. Queso and guac dip are must haves. If you're getting the enchiladas, the lemon cream sauce is pretty amazing. Great, friendly staff.Margaritas are nice and strong. Perfect lunch spot for two or a small group."], ["Sabrina A.", "All I have to say is save your money and go somewhere else!! Worst excuse for Mexican food I have ever had, which is saying a lot because Nashville doesn't have the best selection anyways, but wow not even worth the drive.. Bartaco here I come."], ["Jason P.", "Beware of the parking lot. Even if you eat here and walk across the street for ice cream, the vulture parking lot attendants will sneak a boot on your car then charge you $50 to remove. No food or restaurant is worth that added on your tab. Just not very professional to do that. This is Nashville, not New York, we treat people the way we want to be treated. Just avoid this place and their trap!"], ["Michael M.", "Id have to say the chips and salsa and queso was good but the veggie tacos they serve are nothing more than pinto beans and some cheese.  No tomatoes no salsa not even an sautéed pepper or onion or rice or even a tomato.  Sees kind of lame that the don't offer a little better produce for vegetarians.   Perhaps the tacos with meat are good as they are about the same price.   Just sayin.  You guys need to step up your veggie taco game.   Will check back for a 3rd visit.  If its the same next time i don't think ill be back.   2 stars are for the chips and queso and salsa.   BTW you have to pay for chips and salsa."], ["Carolyn M.", "Had a nice meal here with my family and some friends. The shrimp fajitas are fresh and plentiful, but a little on the bland side. Guacamole is very good. The only real miss in our order was the carne asada tacos - super greasy and only vaguely reminiscent of the real deal. I'm not exactly a margarita snob, so it comes as no surprise I liked this one (or two). I know the fast casual format is trendy, but at this price point/experience, I kind of like a waiter. Maybe that's because the line was snaking to the door, and I hate lines."], ["Lyrad V.", "My husband and I have been here once with our friends who live in 12th South. I didn't realize it is a small chain restaurant, but regardless, I was pleased with this establishment.  I wish they would open one in Cool Springs! We'll definitely go back at some point. It's as good as Oscar's Taco Shop in Franklin but with a smaller menu with some different options.I made one mistake. I ordered two different types of tacos on the menu. They were good. My husband ordered some enchiladas. I tried them. They were amazing. I had food envy the rest of the meal! I don't normally order enchiladas from authentic Mexican restaurants, so I didn't think of ordering them from a Tex Mex place. But that will be all I order from now on (with the lemon cream sauce).This is a great place for solid cheap Tex Mex. The line was out the door when we went late one a weekend night, but it moves fast and people eat and move on so tables open up fairly quickly."], ["Brian K.", "I had seen this place a few times but never tried it.  I went here for dinner one day and it was great.  I really liked the atmosphere and the food was great.  I had the fried chicken taco, brisket taco and the carnitas enchilada with the green chile sauce.  And I started with the chips and guacamole.  It was all great!  I really enjoyed the enchilada and liked that the menu allowed you to customize it the way you wanted.  I also had a house margarita which went nicely with the food.  The only issue is parking is limited in the 12 South neighborhood and you may have to walk a little but it is worth it."], ["Carla S.", "The food is great, reasonably priced and the carnitas enchilada's are nothing short of fantabulous. The staff is wonderful and you won't be disappointed.  I recommend you eat here any chance you get whether your a local or in from out of town.  My husband and I located this place by driving to another establishment.  We knew we wanted to try it and decided to go for dinner last night.  We had chips and 3 different kinds of salsa.  The Memphis taco, the Carnitas taco and a fish taco which was Talapia.  The fish taco wasn't my favorite. I let the staff know that I didn't care for the fish and the manager, Javier was over at our table in no time.  He had sent out one cheese and one carnitas enchiladas.  This cheese is not your ordinary cheese. Once you eat these you'll think you have died and gone to heaven!"], ["Naeveah O.", "Food was pretty good which is coming from a person from Southern California who knows authentic Mexican food. The salsa trio was a great starter. We also got cheese dip which was okay. I tried the crab cake sandwich and a carnitas taco. Taco was okay... again I have really high standards so for Nashville it's pretty good... Crab cake sandwich on the other hand was excellent. My staff ordered a variety of the other tacos and ate them all up. Will definitely be back to try some other items on the menu."], ["Marika N.", "I can't vouch for the food here, but the margaritas are great. My friends and I spilt a pitcher one afternoon when we were killing a few hours. $24 gave 4 people two glasses each. The only downside was that there were two flies in our pitcher when we received it."], ["Jay G.", "Tacos. They are not traditional Mexican tacos, but they are GOOD. You know the thing you feel when you put food in your mouth and your eyes roll back into your head...you slightly slip into bliss...and lose yourself. Once your waiter/waitress revives you back with ammonia salts you soon realize you have just been hit with tastiness. Everything that they make is just excellent. They cook and execute everything to perfection. I have to tell you I really hate fancy places that try to cook elaborate meals but do not execute each part of the dish therefore it fails...miserably. This place does simple food well, by well I mean awesome. I always get the chicken and fish tacos. The chicken tacos: fried chicken tenders, lettuce, tomato, and a special ranch. The fish tacos: fried cod, jalapeños, lettuce, and a special tartar sauce. The chips they serve are my favorite style: thin and super crispy right along with their tasty cheese dip one cannot go wrong here."], ["Mary F.", "So we were trying to eat at Epice and no luck. Crazy full. The host at Epice suggested  several nearby places. We decided to try TDS. We stood in line a la Chipotle, studied the menu, and took about 8 minutes to make up our minds while waiting in line: shrimp grits, carnitas taco on corn tortilla, hot chicken taco, the Memphis taco, carnitas taco, green chili soup, chicken and carnitas enchiladas, cheese enchilada con salsa verde. Queso and guac with hot crispy tortillas. We gathered our drinks from the cashier: reposado margaritas and Sprites for our boyz. Setting a baseline:  We are very picky. Not about ambiance, but savory, spicy, garlicky goodness. We. Must. Have. But we also appreciate brisk no nonsense management. Between the two of us, my husband and have over 10 years of restaurant experience. The results can be inconsistent:  we can be indulgently forgiving or harshly critical. The essence for us is the earnest effort to make tasty, lovingly crafted food. This is 12 South after all, so admittedly, I arrived with a load of bias. Chilangos. The crowd was largely young and hip. This could mean vapid empty food. It could also mean hidden greatness.  Hey, here I am in Nashville, far away from deep Latin influences. The chances were, in my mind, probably vapid empty food.  Nay nay. Read on. TDS delivers. In spades. It's loud. It's busy. It's very professionally managed. No hesitation. No weakness or self consciousness and no indulgent  slacker behavior from the staff. Intense focus on managing a steady and heavy flow of patrons. This place is efficient, professional, and confident about turning out excellent, fresh and tasty food. We noticed more active on-the-floor/in-the-crowd management than in any place we've been with 5x the menu prices. Very respectable level of hot spice. Not tear-provoking or tongue-searing like we crave, but, damn.  Just good. Just right. Juicy pork. Juicy chicken. Authentic double layers of good corn tortillas. The shrimp grits arrived looking forbidding and boring all at once.  My lip curled. The sauce was such a dark, deep red, I braced myself for over cooked acidic red sauce; the neat white mound of grits in the middle looked pale and forlorn. I sighed and tucked in.  Oh. My. Sweet stewed tomato-ey goodness. I scooped up some pale grits. Ooo. Buttery. Mmm. Now all together. Shrimp, tomato sauce, buttery grits. More. My bias melted away. This was delicious. Simple shrimp, rich stewed tomato sauce, and buttery grits. Not a flat note in anything we had. Bravo!  We will be back!Parking right there on the spot."], ["Lisa B.", "Yum yum yum yum yum. Great patio, great food, great service (like, so attentive it was almost a little creepy). We had a little issue the first time we attempted to eat a Taqueria Del Sol, but I'm so glad we gave it another chance and came back!  Our first visit was on a fairly crowded weeknight.   You order first here, and then sit down and they bring you your food.  Well, we wanted to try to snag a patio spot on this particularly lovely evening, so my hot date left the line that I was waiting in to go grab a table that we noticed was being vacated.  A few minutes later he came back and let me know that he'd been kicked out of the table.  Apparently saving a table before you have ordered is a cardinal sin at this establishment.  He thought the staff member was joking at first when he told him he couldn't sit while I was in line.  He pointed me out to the staff member to prove that he was not just camping out, we were paying customers and would have food shortly, but upon pointing me out he was told I wasn't far enough up in the line for him to be allowed to be sitting at a table yet... um what? Our next visit was much, much more pleasant.  We were in and out fairly quickly for a weekday lunch and loved everything we ordered. Recommendation: carnita tacos and brisket tacos. Both amazing.  The rice wasn't my favorite, I'll opt for the beans next time (I stole some off his plate, they were good, shhh don't tell).  Next time I'll try it when I can try the margaritas (boozy lunches are kind of frowned upon at my workplace). Let's hope we're allowed to sit down for dinner next time. BONUS: Run across the street for some Jeni's ice cream if your delicious tacos give you a sweet tooth!"], ["Josh B.", "Don't go to the ice cream shop across the street after dinner. If you do you will be booted by some guy w a white T and a bandanna. Never again"], ["Harrison P.", "Very pleased with the vibe, service and food. General Manager Javier was very kind to take extra special care of me after the bussing team prematurely cleared my table while I was simply gone to get a refill at the self-serve tea/water station. Javier came to the table and apologized in addition to his staff's profuse apologies. Very soon thereafter, I had another piping hot basket of Fish and Memphis Tacos with a side of Refried Beans & Rice - enough for a to-go box. Overall, a fun, delicious social experience for a solo diner."], ["M S.", "Flour tortillas? Ick....."], ["Rich L.", "My favorite place to get food in Nashville. The owner is always there at the same time as me :-). Three Memphis tacos or three brisket enchiladas with red chili sauce are perfect"], ["Michael P.", "Terrific Tequila & Tacos on Twelfth I like alliteration, so shoot me. Short and sweet. Simple, great tacos with quality ingredients at a very reasonable price. Also you will find good collection of quality tequila. This of course can lead you down the path to \"you guys r da bestistist friends like eeevvverrrrrrr\" or a few quality drinks to take the edge off your day. Your call, your liver, just sayin what ya need is here, either way. Try the salsa trio, each freshly made and each one is addictingly  good.Tip: If ya sit at the bar you can order there an skip the line to the counter."], ["Melanie R.", "Delicious guacamole, salsa trio, and chips!  The atmosphere was lively with great patio seating and indoor bar/table seating.  There are great options on the menu but it is relatively short.  Will definitely go back next time I'm in town!"], ["Tim P.", "Average chain mexican food.  Completely unreasonable management contributes to poor experience.  Avoid."], ["Michael B.", "If you want great food at an affordable price, this is the place. The staff work as hard as any I've seen to make your meal great. My favorite thing to eat is the cheese enchilada with beef red chili."], ["Micheal P.", "We call this place taco del soso. That should be pretty self explanatory.They seem to have a three ingredient limit on any taco, preventing them from adding things that would take these tacos from so so to so awesome.They are, however, open on Sunday, when baja burrito is closed, and right across the street from the new Jeni's on 12 south. SO, if it's Sunday, and you want an acceptable taco and the best ice cream in the world, go to taco del soso."], ["Michelle P.", "I definitely did not expect this to be cafeteria style Spanish food. There was a crazy long line when I arrived. Seating is first come first serve so you are in line wondering if you are even going to get a seat. I ordered a margarita that was pretty good. My food was very underwhelming. I had a taco and the rice and beans mixture. The rice and beans were cold and the tacos were just bleh. The staff was very friendly and I can see why this is a good place for students. I think my palette is just a little more advanced. I like flavor. Ha!"]], "Mazatlan Mexican Restaurant": [], "Las Fiestas Cafe": [], "Oscar's Taco Shop": [["Kristin M.", "NEVER AGAIN!!! Decided to try a fish taco. They were about to close in about 20 minutes so they were cleaning up. There was a guy with gloves on who was mopping the floor and pouring chemicals into the bucket;wiping counters with gloves, no towels, just gloves. He then turns around and grabs a tortilla and places it on the grill..with those same gloves on. He then proceeds to continue cleaning. Then comes out and proceeds to make the fish taco with those same gloves on!!!!!! I immediately advised him that I did not want the taco. He acted as if he did not understand me. I advised him again that I did not want the taco and he grabs it, says profanities and then slam dunks the taco into the trash can. Another guy came out to make the taco but by that time it was too late. Of course I didn't want it! I asked the girl to refund me my money, which she did. Eww...The fact that he thought it was okay to use those same gloves to clean and cook says alot to me about this business..Never again."], ["Jessi B.", "Delicious! The husband and I stopped by for a quick bite to eat and were pleasantly surprised. Don't pass this place up!"], ["Charity L.", "Wide variety of Mexican on the menu. Quick to get our food even though line was lengthy. Surprisingly big proportions. Well priced with a friendly staff.I'd go back."], ["Dyann F.", "The chicken tostadas were VERY good. The margarita was even better! The queso dip is a little different then most but it was still tasty. The atmosphere is pretty nice too we were lucky enough to get a table by the open wall of windows and it was a beautiful night! Our server was very polite as well even though she did offer a free shot to someone in our party who was celebrating his birthday but then never gave it to him..."], ["Nina P.", "This place is nothing to write home about.  As a matter of fact I am not impressed at all.  I went there for lunch today and ordered a chicken taco and chicken enchilada.  I thought the chicken enchilada would have had cheese on it but it didn't.  I would rather to go Las Palmas or Q'doba.  The chicken enchilada is dry.  I will probably never visit again."], ["A G.", "My husband and I will pretty much seek out any kind of Mexican/taco place in every city we visit.  We're kind of obsessed.  This place was DELICIOUS.  A super hole-in-the-wall kind of feel, so we felt pretty confident we'd like it.  Not a ton of seating - we sat at the tables on the sidewalk outside.  We got there just as the lunch rush came through, so go early if you don't plan to take out.  The food is really fresh. The salsa is so good.  The serving is large, so go hungry.  I will definitely be going back whenever I get back to Nashville."], ["Caroline P.", "The fish tacos are out of this world! It's a perfect blend of tangy and salty! Definitely getting that from now on. Recommend it for all fish taco lovers!"], ["Bonnie T.", "I ordered 2 crunchy tacos with ground beef. I ordered and paid for sour cream but they didn't come with sour cream. Sad face. They WERE STILL AMAZING! The light, crunchy shells were what did it. Yum."], ["Amanda J.", "I've only gone for the breakfast burritos so that's all I can really comment on, but they are sooo good. If you get there before ten the breakfast burritos are under 3 bucks! You can't beat that. It's not all of them though I think only the bacon, ham, or sausage but still it's such a good price. Now if I had a choice id probably go 4 1/2 stars because I love rice in my burrito but every time I've gone they have told me that the rice isn't ready yet.. Well from their hours posted they have been opened for at least two hours. But the option to get potatoes for 50 cents added and the already cheap price compensates for this!"], ["Manuel D.", "Excellent Mexican food!!!...I am always looking forward to eat at Oscars... Live those authentic salsas... !!"], ["Aaron E.", "Simple fresh ingredients.  I had the fish taco and shrimp taco,  both were amazing! I've been back several times for lunch and keep ordering the same thing!"], ["Cameron C.", "This is my first time visiting Oscar's Taco Shop. The guy at the counter was really friendly and answered all my questions. I ordered the veggie tacos and they were delicious and super fast.  I think they make their own hot sauce and it's awesome.  I would definitely come here again!"], ["A P.", "So this place is an anomaly of sorts. Its VERY rare that I trust \"strip mall\" mexican, but this joint is the real deal. All the owners are from California and are mexican, so that puts them ahead of many out the gate. Their breakfast burritos are unreal, and if you sign up to receive emails on their list, many days they are $2.98.  Cant beat it for a 1lb stuffed burrito. Any other times I think they are around 4 dollars. The Carne Asada tacos for lunch are my \"go to\" every time, and I cant change. err.Delicious steak and simple pico with cilantro tops them, comes with a couple limes. :)The best."], ["Joshua S.", "Oscar's is the one place I go to at least once a week for lunch. Hands down best burritos I've ever had. It's a small place, and the layout is a little weird. I've tried every burrito that is on the menu and I loved everyone."], ["Jim C.", "Really good fresh tacos.  We had the chicken tacos and added verde salsa and they were excellent. Worth the 1mile walk in the rain."], ["I B.", "This place is freaking awesome! It tastes just like the stuff I got in San Diego. Then to make it even better the two salsas they provided tasted excellent. I will be going here again."], ["Ginger J.", "Great street tacos!  The girl taking our order was super friendly, which we loved.  The food was great and hit the spot!  Worth a stop!"], ["Michael H.", "Oscars is awesome.  I have worked downtown for over two years and just found this place after meeting a friend for lunch. The food was incredible and the service was great. The prices are very reasonable for downtown Nashville. There are a couple tables outside to eat at and there is a tv inside if you want to watch some news at lunch. I will definitely be adding this place to my lunch line up."], ["A O.", "The Nashville locals know - EAT HERE! As a downtown resident this is one of my go to spots for breakfast and fantastic cheap eats. Huge fan of the breakfast burritos which you can get ALL day. I usually opt for the junior breakfast burrito which doesn't include a meat - only eggs, cheese and potatoes but I can finish it and not feel over stuffed.  Plus, you gotta know a place with their own home made salsa is legit. When Pucketts Grocery down the street has a 2 hour wait wander down the street and get right in and save some dollars. Bonus - soccer on the TV all day."], ["Jason M.", "Very good authentic Mexican food in a fast casual setting.  Very good prices, great location , nice people too."], ["Arianna S.", "The ONLY place I'll for mexican food in Nashville. As someone who grew up in southern california, I am very picky about my mexican and this place is just about perfect. The breakfast burritos are very delicious and reasonably priced - make sure to add potatoes. Their tacos and enchiladas are great too. I only wish the location was larger and had more places to sit, but to-go orders are always quick and easy. Their red and green salsas are also very delicious."], ["Barnabas P.", "5 stars for the food. We had tacos and a couple different kinds of burritos as well as a torta, and all were excellent. 3 stars for limited seating and broken/limited drink selection. Over all a good experience and a great lunch."], ["Amanda M.", "Don't go if you want salsa or a vegetarian meal.I had two big issues with my lunch today.  I ordered a  vegetarian burrito & chips and salsa for take out.  The total came to around 8 bucks.  When my order was ready the guy asked me if I wanted salsa. Since I had ordered a chips and salsa and no salsa is sitting out in a \"serve your self\" style bar I think he's asking if I want extra salsa because I'm thinking surely I don't have to them I want salsa when I already ordered salsa.   I tell him yes because I want extra for my burrtio and he gives me two little salsas in something a tad bigger than a  plastic coke cap.  As it turns out that was all of my salsa & I didn't discover it until I was back at work.  Not only was it not even enough salsa to go with half my order of chips the cup was so tiny a chip wouldn't even fit into it to get any salsa so I had to dripple the salsa over each chip and try not to spill the precious commodity.  Fail!  Then when I start to eat my  vegetarian burrito I bit down on a piece of chicken.  That's it - No more Oscars.  There are a lot of taco joints downtown and this one won't be getting my business again."], ["Scott D.", "Great breakfast burrito. Very clean place. The staff is friendly. I came on Saturday morning but the cashier told me about the weekday specials. I will definitely be back."], ["Brandy W.", "With a disappointing showing of vegetarian food in the main walking areas of downtown Nash, I decided to hit up Yelp (let's be honest... I do this even if there are a ton of options in front of my noggin) for some Mexicannnnn.Love me some Mexican and I'm always looking for a joint that serves it up good and cheap. This place was given the thumbs up from my fellow Yelpers and I'm jumped on it.Lemme hear ya sing it: \"Jump, Jump, Jump on it...\"Anyway. Over the hills and through the woods... okay, just over the hills and there I was. Mexican mecca.I consulted about the beans and lard usage: none. Just oil. And the rice? Chicken stock. Be fore-warned, fellow vegetarians. The veggie burrito isn't so... veggie friendly.I ordered two bean burritos which were on $1.99 special and was stuffed to the gills with leftovers. I'm not a prissy chick and can totally eat a full Chipotle burrito without batting an eye, so don't think I'm being modest here.The place was packed and the two outdoor tables were taken. I parked my rear on a nearby bench and only half wanted to bolt my belongings to my body in fear that I might get robbed by the characters around me.But the food? DEEEEELISH. I would most definitely be back with bells on."], ["Tony B.", "Small store, good food! Street taco fare, so make sure to order a couple. The fish tacos are exceptionally good here."], ["Greg B.", "The food here WAS great, they had a change at who man's the cooking station... it might very well be the owner, because it seems like he is putting the least amount of ingredients possible to save a buck... The portions is what used to set the place apart from the rest of the downtown pack. They skimp on everything. I bought a breakfast burrito and experienced more tortilla than egg/ham/cheese.Bring back the old cook, or quit skimping on the food."], ["Mavis J.", "I liked the chicken fajitas. Friends had chicken tacos are were great! Great portions and inexpensive. Tortillas were awesome! Outdoor dining! Quick service! Will go back!"], ["Chris C.", "Tasty food and reasonable prices, friendly service too. Breakfast burrito and fish tacos are the bomb."], ["Ruiqiu K.", "2013/053Finished a job earlier than expected downtown and my stomach cried for lunch, even though it was only 10:30. I remembered this from Yelp and hoped that they would be open. To my surprise, they had been open for several hours, since they also serve breakfast.As soon as I got in, the guy behind the counter was already preparing to-go orders. Lots of them. And yet, no sooner than I sat down after I placed my order, it was ready. I had to chuckle when full-sized plastic squeeze bottles of both the red and green sauces were on my tray -- I was immediately transported to the Mission District back home.The hot sauce was mild enough for me, and flavorful. I was in a gringa mood and requested the hard shell tacos, rather than their standard soft. I wasn't too enamored with the chicken on my tacos; nothing wrong with them -- in fact, I could see each individual chunk rather than the shredded versions I've always associated with cafeteria school lunches. I've been gradually not liking chicken over the years, and I think this was one of those days. The salsas helped with the flavor and I ended up eating everything on my plate.The rice was different, to me. Not the standard \"Mexican rice\". This had corn kernels mixed in. And there was no heavy tomato paste component.Small place. About 4 tables of 4 seats each, and 4 stools near the window.Definitely a popular place with the local workers in the area. And when I was in, there were quite a few Latino customers, which again is a good indicator of authenticity.A restaurant I'd come back to, especially for its diverse menu, affordable dishes, and friendy and efficient staff."], ["Jamie D.", "Breakfast burrito update: someone better tighten my collar and hookup my chain..cause this dude's gonna be a regular!Ordered using my half remembered Spanish..Burrito contents:EggCheesePotatoTomatoAvocadoadd - salsa verde and rojorolled into a traditional flour tortilla All under $4The great thing about Mexican foods are that they are relatively healthy if consumed properly. Keep the quantities and meat low, add salsas (spicy foods help burn more calories), and pico de gallo, tomatoes, avocado, and you'll begin to reap the benefits of this amazing taco shop! I'm not gonna mark my territory, because I am a socialized animal. But, you are going to hear me barking cause someone better let me in to Oscar's!"], ["LaTamera W.", "Had the chicken quesadilla.  It was large, greasy, soggy, and messy.  I loved that it was huge.  Totally bigger than I anticipated. However it was not \"toasty\".  It tasted as if it had been grilled earlier and microwaved.  And come to think of it, I think there was any cheese.  It was filled with guacamole, tomatoes, sour cream, chicken, and loads of grease. This is a new place down town and I will give it another try because it's my first meal and you cant fairly judge a place on one meal.  Hopefully the next meal will be better.  Just note, I will not be ordering any quesadilla's from this place."], ["Sandra P.", "As a Mexican-American from California in town for business I was pleasantly surprised by this place! Nice tasty chorizo breakfast burrito that reminded me of the best of LA taco stands.  Tasty and tangy salsa was an added bonus.   The price was very reasonable and the staff was somewhat friendly.  I only wish they had Mexican coffee or Mexican Coke in a bottle! but they did have Jarritos sodas in the glass bottle.  Recommended."], ["Faithe D.", "Bomb breakfast burritos served by real Mexicans! Authentic small taco shop experience. Lunch is also great. Great enchilada sauce. Can't beat the potatoes on the breakfast burritos either. The staff always remembers my order and are kind and in a great mood every time I walk in."], ["James R.", "Dear Oscar,I was quite excited to drop by to grab a Taco or other Mexican vittle but alas you closed before your hours say you do.  I got there at 2:50 on Saturday (your front sign says close at 3 on Saturdays) to find that the chairs had been placed on the tables and one of workers said you were closed.  I was disappointed."], ["Brent E.", "Love Oscar's. Definitely a favorite lunch spot for me and many others as its hard to get in door closer to noon. Fish tacos and rolled tacos are my favs. Of all the downtown Nashvegas Mexican restaurants...Oscar's appears to use the freshest produce."], ["Richard C.", "Moved here from Houston over a year ago and have been searching for decent tex-mex.  A friend of mine who also moved here from Texas told me to check out Oscar's.  The food here is VERY good, authentic, and appropriately priced.  I would give 5 stars if the place had more seating and the lady running the register wasn't so sour."], ["Terrell L.", "The Fish Taco's were the Especial today !Very Good, Reasonable priced and Quick Friendly Service."], ["Beth L.", "Myself and two coworkers ate here for lunch one day. The food didn't taste bad, but I thought it was pretty greasy (I had a veggie quesadilla). We all ordered something different, though. Within about 15 minutes of eating, all three of us were in a panic. Let me just say that we all now refer to it as \"Oscar's Diarrhea Shop\". None of us will ever eat there again!! Unless, of course, we need a colon cleansing. I think it's just a little too rich/greasy - I prefer Chili Burrito."], ["Ian R.", "Fast. Good. Cheap.  Supposedly you are only supposed to be able to have 2 of those 3 at any given time.  Oscar's is doing it's best to challenge that whole equation for the downtown lunch crowd.  I have had a pretty good sampling from their menu including, fish tacos, burritos, quesadilla, fajitas, and tostadas.  For my tastebuds the food hits a nice sweetspot between legit taco truck style Mexican food and the more common Tex-Mex that is more prevalent in these here parts.  Oscar's calls it So-Cal Mexican, but having only been in So-Ten for most of my life I don't know how accurate that is.  I only know that it is pretty darn good.  I am very anxious to try the tortas and nachos to round the menu out.  The atmosphere is of a very straightforward carryout restaurant.  There is some bench seating and a couple of tables out front, but they are not particularly comfortable especially  when it is busy.  I have usually ordered to go as the service  quick and close enough to still be very hot by the time I get back to the office.  The only caveat that I have in this review is that I have heavily utilized Oscar's coupons, lunch specials, and emailed daily specials.  That means that I have rarely paid full menu price for my selection and the cheap at the top of this review has a small asterisk by it.  I take this as a positive and I appreciate that as a business Oscar's if very proactive in offering good deals for its customers.  Also, a positive is that everything on the menu is so good that I usually just go with the special regardless of what it is.  I have yet to be let down.  Oscar's is an excellent addition to the downtown food scene.  It fills a needed niche and will definitely become a valuable part of the lunch rotation."]], "Taqueria San Luis": [["Thiviyah R.", "This is probably by far one of the best places I had for tacos. It's a simple and small place located not for off from the airport. Since I moved to Nashville, I have been having tacos in this place far too often. The barbacoa tacos just melt in your mouth.It is not a sit in place but rather a place for a quick meal. Usually people park their cars and order what they want. They eat their food right by their cars hot and fresh or take the food to go. I prefer eating then and there itself while its hot and with their two sauces that they give.Love this place overall and I'll definitely keep going to it."], ["Ray P.", "Literally a hole in the wall taco joint. You stand in the parking lot of a carniceria and place your order through a window. No seats, not even outside. A few varieties of meat available in an equally limited number of styles. No rice. No beans. Nothing but delicious, delicious food prepared and served in traditional street food style. Good, cheap tacos.If you think Taco Bell is spicy, you do not, repeat NOT want to try any of the hot sauce they include with your order. However if you are familiar with REAL Mexican style tacos and want some extra heat, either the red or green will do you nicely. Depends on what sort of flavor you want. I like the verde, me."], ["Christa P.", "We decided to try this place out on the way home from Antioch. We were quite excited and walked up to the small window to place an order of tacos. We got carne asada burrito and carne asada, tripe and tongue tacos. They were all really good. Served with some sautéed onions, raw white onions, cilantro and fresh lime wedges. The tortillas were good - slightly griddled and double corn. The meats was chopped nicely and had great flavor. I would say it was a little overcooked for our preference, but all in all was great. The burrito was nice and large - stuffed with some beans and cheese. We would be back if we are in the area."], ["J R.", "Delicious tacos and made quickly. I had two chicken, two carnitas, and one pastor tacos. I ate them with the salsa verde and a cold beer. I enjoyed my meal. I'd go here again. Oh and tacos are only $1.35! Deal Maybe they will have queso fresco next time I come?"], ["Oscar Y.", "I drove by the huge steaming smokers outside the carcineria, and after driving another couple miles, drove back.  It was too eerily enchantingly not to at least investigate, and it kind of turned out to be a highlight of the visit to Nashville.The smokers and the huge chicharone cases were awesome.  And then at the little window around the side (the 'taqueria'),  the $1.35 tacos were great!  I got pastor and lengua, but they also have a nice variety including tripe, and chicharone in a green sauce.  Delicious, and adding the big floppy pieces of grilled onion to the little chunks of raw onion made for really satisfying flavor.  A great bite out in the anonymous outskirts of N'ville."], ["Ali S.", "I hate to give a local business a bad review but I wasn't impressed with this place at all.  Perhaps it's because I been to Mexico many times or because I tasted some great tacos in San Diego recently.   I got 4 tacos and 2 quesadillas.  The carne asada and baracoa tacos were quite greasy and super tiny.  They hardly had anything inside.  The chicken taco was okay but again had barely any filling.  The chicken quesadilla was just nothing special either and was also greasy.  After being disappointed many times I think it's about time to give up on authentic Mexican in Nashville."], ["Jonathan W.", "Best tacos. Univocally. The meat quality and the serving sizes are outstanding, and the sauces (verde particularly) are fresh and spicy. This wonderful five comes with my highest recommendation."], ["Danny N.", "I had driven by this placed hundreds of times in year's past before I was adventurous.  Now that I seek new authentic places I stopped by for a quick lunch to go.  The window which you order from might be intimidating, but the food is great.  I ordered a platos taco and a carne asada burrito.  The taco was delicious with the onions and spicy pork.  The burrito was large so either order a few tacos or one burrito.  I recommend trying it out."], ["Asher B.", "I am a taco lover!! And when I give a place five stars you ought to know they were incredible. This place is not a sit down restaurant. It's a small place with just a window. Located right besides a tiny meat shop, it serves up about ~1000 tacos each day.I went here after reading a few reviews on yelp and as I stood in  line to place my order I knew the place was going to stand out. The aromas from their kitchen was already ticking my nose. The line was primarily Hispanics other than me, and who better than their own know where to get the best tacos in town. I ordered the carne asada, the pastor, the chorizo and the barbacoa taco. The most stand out taco was the carne asada. The meat was tender and juicy and marinated and cooked to perfection. To give you a gist about how their carne asada was, here is a comparison. I like to smoke a cigarette after my dinner but after eating this there was no way I was loosing the taste in my mouth.If you are ever in this part of town, stop by and try atleast one taco. You won't regret it, I betcha!!"], ["Andrew S.", "It's such a nice surprise to get a break from taco places that pose as \"authentic\" like Taqueria del Sol that are more focused on being trendy than bringing customers the real thing. San Luis takes you back to the street vendors, as close as authentic as you're going to get in Nashville. Break away from the foodie spots and get a true taste of Latin America."], ["Cody H.", "My favorite taqueria in Nashville. There food is amazing! I recommend the burrito. It is huge! People assume that this is a \"bad area,\" but I assure you it is not. It is simply a very diverse immigrant neighborhood with lots of low income and lower middle class people. Don't be afraid to stop by.The only downside is you cannot call in your order (they never answer the phone) and you usually have to wait 5-10 minutes for them to prepare your food. On the upside, your food is always fresh and it gives you time to check out the carniceria next door (which has unbelievable smoked chicken and fresh made tortillas)."], ["Eddy W.", "We have been wanting to stop by here for a while and today we did. We got the cooked shrimp with the heads still on, the fish ceviche and the 7 fish seafood salad. We were going to save this for dinner but we had to taste it. The ceviche was the best we have had since our trip to Mexico in February. The cooked shrimp was outstanding.  It was perfectly seasoned and meaty. The 7 fish salad was almost as good as the ceviche. We will be back to try their beef, pork and chicken."], ["Ivonne B.", "Wow, it was amazing authentic Mexican food. Chicken quesadilla was delicious. Their red and green sauce is so hot but worth it. The el pastor torta  was delicious!!"], ["Gerardo G.", "Great tacos! The barbacoa and chicharron are my favorite. The carne Asada is usually a little dry, but still good. If you like lime on your tacos they tend to be a little dry so ensure you ask for extra lime or two. For 1.50 a taco they are definitely worth that. Also go into the carniceria next door and get the chicken, also an amazing cheap meal."], ["Liz W.", "best tacos in nashville. try the cabeza! use the green sauce!"], ["Robert S.", "It took a few visits to realize there was something good also happening at the other end of the main entrance to Carniceria San Luis.It took a few more visits for the perfect storm to form, that is, me being hungry at the same time I am at the carniceria.  The menu is simple: a variety of tacos and other hand-carried food.  In other words, no soups or platters.The tacos were the small kind that you would get if you were in Mexico and I had no problem with that.  The Lengua (tongue) was rich, hearty and served topped with wilted onions.  The Pastor (seasoned pork) was sweet, tender, and yes, hearty.There are no seats, indoor or outdoor.  You simply walk up to the window, knock politely if they don't notice you standing there, order, pay and wait until your brown-bagged order is ready to take away.A truly authentic experience!"], ["Jessica B.", "What a gem. Very simple yet delicious. I'm honestly always hesitant to try new places, but places like this make me glad I do. Take out only with a makeshift bar along the wall if you would prefer to enjoy your food instantly. We got ours to go and only waited about five minutes. Simple menu: choice of meats plus style in which they can be served (quesadillas, tacos, burrito). I got two carne asada tacos and one pastor. They are smaller tacos, like the pictures on here show but they are amazingly good. The carne asada was diced finely and flavorful. The pastor was the best I've had, not too spicy and not over done. I love the double corn tortillas, not overly oily. They were served with cilantro, plus diced and grilled onions. They gave us two types of sauces, both very hot but very good. And to top it off, everything is so affordable. Three tacos for just under $5 makes this somewhere I see myself frequenting while in the area."], ["Julia S.", "Really, really, really good tacos. We got a carne asada, chicarones, carnitas, and al pastor and they were all great. We also got a carne asada torta to share, which was tasty (though VERY messy because the carne asada is chopped up into tiny pieces so it fell all over the place). The salsas were very very good (the green is SUPER spicy, and I can handle just about anything)! I wish this place had seating or was in a more open area so we could have enjoyed our food there, but it wasn't a huge deal, as I knew what I was getting myself into. Will definitely go back for more soon."], ["Melissa B.", "Killer Tacos...I love the Tacos here!!I am so huge into the corn tortillas with the beef and cilantro with lime slices and then the salsa verde on the side...Not your typical Taco Bell Mexican Fast Food !!!They need to teach Taco Bell a few things about heading for the border !!! GREAT food!!!and cheap!!!Great food on a budget!! Order anything, you can't go wrong !!!"], ["Jason B.", "Excellent. Excellent. Excellent. The tongue is my favorite and pork is my least favorite (maybe slightly too dry, but still good). Priced right, quick, and delicious."]], "Las Americas": [["Kiara E.", "I am definitely a fan of this little hole in the wall place. My husband and i have been dying for some authentic pupusas since visiting Miami, and we finally found some! Walking in we were a bit skeptical because its didn't serve solely salvadorian food. We weren't looking for a Mexican knockoff version of this delicious stuffed pancake. But the prices were cheap enough (roughly $2.19 -$2.39 each),  so we decided to give it a try. All i can say is Yum! All were delicious and two is really more than enough. Trust me on that one... I can eat alot! The horchata was tasty as well. Didn't taste like the packaged kind where you add water. The decor was rustic and simple, but who cares? You aren't eating that. :) We will be returning soon. Oh yeah, go on a Saturday night, they have live entertainment."], ["Myelin G.", "Pupusas + Sopes = Siesta :)"], ["Jon S.", "I was working in Nashville and was lucky enough to have my friend pick me up for dinner.  We both love the Mexican food so the choice was obvious. I had 2 tacos de pollo which were made the perfect way.  Double tortilla, onions, and cilantro.  The biggest problem was that I couldn't decide which salsa to put on top.  I also had a pupusa which they claimed was their house specialty.  I am not going to lie.  I rather liked it.  I had the frijoles y queso one.  The only downside for me was them not serving iced tea.  Fresh brewed iced tea is my favorite beverage ever and was not available.  The ice water was pretty epic!  Don't miss out.  The real deal.  Oh yeah, the food is so cheap it is pretty unbelievable.  My portion of the bill (had I remembered to bring money) would have been about $5.00.  A can't miss."], ["Todd G.", "In my rotation of regular food places. Good Cheap Eats. The burrito is the size of a young child and costs 4.99... the Pupusas are 2.00.... so good.  We have always left full and happy. Everyone I take here goes back on their own."], ["Nikit K.", "Love the papusas and horchata. Fun store attached. You will be full when you leave. Loud, though."], ["Jo B.", "I loved every part of my experience at Las Americas. We're talking authentic Mexican food guys. I have tried just about every tacos they have and they are perfection. Don't be afraid to try the tripe, cheek or tongue...seriously. If you don't like it oh well, it only cost $1.50! The staff is nice and the food came out pretty fast. My husband and I shared 6 tacos, a pupusa, horchata and 2 beers all for around $21.47. I found my new go to taco joint. Happy Chef!"], ["Anna A.", "I like mexican but for me it's all about the cilantro, lime, and fresh picos which is certainly not the backbone of Nasvhille's Mexican food scene.  However the papusas at Las Americas (which ironically have no cilantro, iime, or pico) have become the only fried Mexican fair locally that causes me to close my eyes and groan subtly.  They are this corn pancake filled with anything from simply cheese to beans, pork and cheese, to pork rinds.  I've tried them all and I'm a purist, I like the plain ole cheese.   Now what takes them from something really tasty to something you daydream about at work is the cabbage topping along with the homemade salsas.  I'm so glad I indulged my crazy and tried this because this combination is inspired from a higher being.  One papusa is almost a meal in of itself but in case you need to supplement , I highly recommend the carnitas ( tacos I think)  i like the chicken ones which come with onions, lime, and cilantro and for $1.00 each which serve my need for a fresher lighter something.Drinks come in bottles so if you are not a big soda drinker then you can easily split a soda between two or three people.  The staff are extremely friendly even with a bit of a language barrier.    Venture out from your normal speedy gonzales, chimichanga fair and try this place, it really will change your life."], ["Morgan L.", "One word: Pupusas. It's hard to find pupusas in Nashville. The only places that have them are, like Las Americas, very out of the way. (Don't get me started on the sorry excuse for a pupusa that Chago's has on the menu...)The pupusas at Las Americas are enormous and cheap, cheap, cheap. The first time my friend and I got them, we assumed they'd be pretty small because of the price and ordered two each. Never again! One pupusa pretty much fills up a large styrofoam takeout container. It's a fried corn \"pancake\" stuffed with beans, cheese and pork if you want it. It comes with fresh cabbage slaw and a thin salsa to top it with. Call ahead and place your order while you drive across town to get to Las Americas. They'll have your pupusas ready when you get there so you can devour it ASAP."], ["Jerry R.", "This is one of those places where you go inside and the word \"authentic\" hits you immediately.  This is no chain store tex-mex place, but a small mexican place whose specialties are their papusas - a delicious taste treat that resembles a large pancake in looks but that's where the similarities end.  These are filled with bean and cheese, meats or other varieties of stuffing.  To top this off, they are brought out with a large helping of a cole slaw type topping called curtido - very delicious.Another item to try there is a drink called horchata - a rice and cinnamon milky type concoction that isn't too sweet but just sweet enough.  It is definitely something you have to try at least once.  You won't be sorry!  Each time my wife and I have been there the place has been busy - and for good reason.  The staff is very friendly and if you don't speak Spanish you can point to the items on the menu which is a combination of Spanish and English.  If you are looking for a quiet, intimate place, look elsewhere.  This small locale is a bustling business with a continuing din of kitchen staff, waitresses(es), and a spanish tv channel going in the background.If you want to try your hand cooking some of your own mexican food, there is an attached small store with a variety of items for sale.Bottom line - bring an open mind and enjoy!!!"], ["Mira M.", "Get the pupusa.  I get the bean and cheese one.  It really is enough for a meal, and very reasonable.  Though I usually sneak in one taco, and can't finish the pupusa.  It's not a fancy place at all, but I am not going there for the decor.  It's all about the pupusa."], ["Dondi D.", "When my husband and I were dating, I made him take me here for Valentines Day! Am I a cheap date.. NO, I just love this place! It's a hole in the wall and one of those places you really want to keep a on the down low. You would hate to ruin the vibe! Don't look for chips and salsa or a pitcher of margaritas... because you won't find it here! What you will find it a small room added to a small Hispanic market. The staff does not speak English but are very nice! My FAVS on the menu- TACOS CARNE ASADA - just steak, corn shell, fresh cilantro, onion and avacado. Then I use the salsa verde! YUM! And the PUPUSAS! It's a corn pancake stuffed with beans and chesses! Make sure you order a glass of Horchata to go for dessert! This is a great little find! Enjoy!"], ["rusty r.", "Do not get the green enchiladas unless you want the green stank on your teeth. They're bizarro. Although, Pupusa's = muy bueno.Now the horchata... sweet as cane sugar. I pretty much passed out post 72 oz Horchata and had dreams of an ocean of  'Chata and me floating the seas in a giant styrofoam cup. Heaven."], ["Courtney C.", "Pupusas, horchata, pescado frito + Great service from nice people."], ["KitKat A.", "Food here is delicious! Top picks: \"chile colorado\" (a bit spicy), \"enchiladas de chile poblano\", pupusas and chicken burrito. Place is totally unexpensive, and it has a Latinamerican market right next to it. I like buying coffee there.The only thing I would change: I would ask them to clean their bathrooms better."], ["Michelle M.", "Excellent! I've been going here for years and it is always delicious. It is small and not fancy, but the people are very nice and the food is flavorful, fresh and delicious. I still haven't tried the pupusas yet, I usually get tostadas and load them up with the fresh made pico and sauce, or enchiladas."], ["Veronica M.", "By FAR the best Mexican food I've had in Nashville. I'm from Texas so I'm used to real, authentic Mexican food and that's something I haven't been able to find anywhere in Nashville; the portions are always tiny and the food is way overpriced and lacks flavor. This place gives HUGE portions at very low prices (real Mexican food isn't expensive) and the food was great. This is definitely my new spot for Mexican food"], ["Luke M.", "The most authentic Mexican restaurant In Nashville. You can get phenomenal food for a very reasonable price. The Burrito Las Americas is to die for, you won't be disappointed."], ["Johnny N.", "Been going there for 10+ years.Tostada de  ceviche (pescado and ameron) are refreshing. The  papuses are a must try if you've never had them. It is a papusaria after all. They got Burritos, tacos, etc but you can get that anywhere. Rafael works the kitchen at night (white hair an stache).Unique place w/ a latino grocery attatched. Cheap beer and food but tasty."], ["Eric B.", "went here sunday for the first time.first thing i noticed is how small things are. the chairs, the table, the dining room, they're all small. i dunno if this place is meant to be more mexican or salvadorean, but they didn't bring out chips and salsa to start off with (which is completely cool). i came here to check out the pupusas, and i can report they're pretty good. i don't think they're as good as my favorite pupuseria, la usuluteca, but still very damn good. first off, they're not as dense as the one at la usuluteca, NOR do they offer loroco (boooo). they are, though, enormous. these things are about as big as the plate they serve them to you on. the cheese on the surface of the pupusas is nice and burnt up, i know i'm not the only person that likes cheese to be a little browned. the cheese did, though, seem to have a lot of water cooked off it and built up at the bottom of the plate. best thing... these mugs are two dollars a piece! so i had a meal for six dollars that i couldn't even finish. and it was a good meal, too.make sure you check this place out, i'll be going again.edit- my friend got some al pastor tacos, and they were the greasiest tacos i've ever seen. caveat ingestor...eric b"], ["Melissa L.", "I have not tried the traditional Mexican menu items but we have had the pupusas on several occassions.  Thes are cheap, good eats.  You can get them with any combination of cheese, beans (refried), and pork.  Las Americas' curtido is my favorite of all the places I have tried so far."], ["matt c.", "Pretty good papusas and tacos. Comfortably worn interior. Mixed crowd. Not many choices for Mexican in the Nashville area, except around this place on Nolensville Pk, but this is one of the more dependable and interesting. The guys from Chile Burrito said they go here sometimes."], ["Dallas T.", "Yummy, yummy, yummy. Try the enchiladas and papusas, as they are both absolutely to die for. Yes, it is a hole in the wall, but it is cheap and fantastic. Try it -- you won't be disappointed."]], "Tequila's": [["Tracy F.", "One of the most pleasant surprises I've experienced in Nashville to date...I was dragged here by my fiance, who wanted to try something new and different for lunch.  I was running errands in the Nashville West shopping center and told him to pick a place nearby to meet.  When he suggested Tequila's I hesitantly agreed, thinking the place would be the normal subpar Tex-Mex joint Nashville seems to have plenty of.When I walked in, I was immediately greeted by a friendly host, who offered a very genuine \"Hola, Amiga!\"  My fiance was already seated and halfway through a basked of chips and salsa.  He told me I needed to try some immediately, as they are the best he's had in Nashville so far, and I am a chips and salsa fanatic.  He was right!  The salsa is flavorful, with a good amount of tang and spice, and the chips were warm and fresh.  Tequila's had me right there.I ordered chicken fajitas for lunch, and they were served within 10 minutes of ordering, piping hot and sizzling on an iron pan.  The chicken was moist and very tasty, the portions of meat and veggies were both plentiful, and the tortillas were fresh and delicious.  My only complaint was that I asked that the fajitas be prepared with little to no oil, and they came out a little oiler than I would have liked.  Nothing some napkins couldn't fix!  My fiance enjoyed his soft tacos, though far preferred my fajitas.With tip, we thoroughly enjoyed our lunch for $20.  You simply can't beat the price for the quality and quantity of food you receive.  We'll definitely be back!"], ["Matt H.", "The food is beyond good. They also have a better variety of vegetarian options than most Mexican restaurants. Just all around really good!"], ["Brandon F.", "I'm giving this place 4 stars for one reason. It was way better then I expected. My girlfriend and I were looking for a New Mexican restaurant and saw this on yelp. We knew where it was and thought it would be a shady place. The shopping center it's in has that sort of appearance and vibe but being adventitious we decided to try it anyways. When we walked in I was pleasantly surprised with how clean and friendly the staff was. The food was like most Mexican I have encountered in Nashville and frankly I like El Stuffed Pepper or Rose Pepper better but over all everything was pleasant and the food wasn't bad. If your feeling adventurous and can't make up your mind like my girlfriend and I then take a chance on this place. I think you'll be surprised like we were."], ["Nick D.", "OK.... I live right by this place. Have been countless times. It's always been a decent place to get Mexican food on the west side. I'm still waiting for a GREAT Mexican joint to pop up over here. I've tried them all. No one is great :( Food here is just ok. Margaritas are not that good. They're the cheap green stuff that's watered down. Chips and salsa... just ok. These would all normally be reasons to not go back to a certain place but b/c of the lack of any good Mexican restaurants in the area and the fact we live super close, we kept going back. The main reason I'm not going back is the lack of customer service. A good restaurant recognizes repeat customers and should treat them as such. I'm not saying anyone deserves free food or anything but a genuine appreciation would be nice. My family and I never got it here. Sometimes we would come with a big group of friends and it seemed like they were upset we were there?! We've never not tipped well or anything like that that would justify this attitude.  After a few more bad experiences with the staff we've just decided not to go back here."], ["Debbie B.", "In visiting Nashville I relied on Yelp to take me to Mexican food - and Tequila's consistently had great reviews. Glad we followed recommendations! Tequila's had perfect service - amazing salsa - and the food was super yummy. You can't go wrong! Venture out and enjoy the margaritas!!"], ["Jason P.", "Took my wife and kids here tonight for the first time and will not ever go back. Food was normal Mexican food but the service was awful. It wasn't crowed for a Saturday night either. The waiter never refilled our drinks and my wife and kids went to the car as I waited 20 mins on check and I repeatly asked for it! Don't waste your time!"], ["Randy P.", "Awesome food and great service.  Will back if I'm ever this way again.  Best I have had in a while.  Salsa was nice and hot too.  I think most will enjoy it."], ["John W.", "There are three kinds of Mexican restaurants: the large chains that are tex-mex (at best); the cookie cutter restaurants; and, finally, restaurants like Tequilas.It has the items you expect from any decent neighborhood Mexican restaurant. But the menu is decidedly different from the run-of-the mill places, with a lot of unique takes on the old standards. There are also things that Tequilas does unique from other restaurants.Finally, one thing that sets a Mexican restaurant apart is its salsa. Tequila's salsa is just spicy enough, with good texture and flavor."], ["David O.", "In the south there is a term \"Fair to Middlin'\".  I suppose this pretty adequately sums up Tequila's. Once you get past the fact that the seats are very hard and the table and booths seem to be on ice, scooting around despite your best efforts to keep them in place (When I went to leave I almost took the booth out the door with me).Service was good, but the menu warns that each table gets TWO helpings of Chips.  I'm not sure if they are sticklers for this or if its just on there to prevent you from having an \"All You Can Eat Chip Buffet.\"The Fried Burritos would appear to be the signature dish, and I was not disappointed in them.  They didn't particularly blow me away, but I found them to be satisfactory.If you are in the mood for a burrito, but really wish it was fried.  This is your stop."], ["Sissy D.", "This was my first time at this place, I was over at Costco and thought I'd see if this was a find for authentic inspired Mexican food.....and it was a BIG NO.Everything is straight up out of a darn Sysco bag/can. No inspiration or creativity at all! A pile of mass produced crap smothered in copious- barely melted  amounts of cheese. I think they try to hide the bad food with cheese!Try Chuy's (where they actually make their tortillas, their poblanos are to die for, and they have 4-5 unique sauces to choose from! At least Chuy's has a little imaginationHow stupid do some of these restaurants think we Joe public are? I mean its pretty obvious what Tequilas serves is crap.And the waiters here are to consumed with hitting on young teen aged girls and trying to get a lay lined up for the night. Yeah I saw that today.I wont be back. It really sucked. Dont waste your money.I've had better back in my middle school cafeteria."], ["Terrell L.", "The vegetarian plate was good, I stopped in late in the evening for dinner and was served quickly at the bar.Chips & Salsa with a cold Cerveza while watching soccer on TV, life is pretty darn good."], ["Ashley S.", "Great food. Great margaritas. Great service."], ["Stephen L.", "This place is killer! The salsa is great! The service is excellent! One of my favorite Mexican places in Nashville! I have never had anything here I didn't like and there is a patio."], ["Robert A.", "This restaurant opened a few years ago. It's tucked into a corner of a shopping plaza, so I overlooked it at first. I finally went in after it had been open for a few months. The food was excellent then and has continued to be of the best quality every single time I go there. And because of it's location, I still often overlook it and every time I eat there, the food is great. I highly recommend you go there."], ["Zach G.", "Same sh!t.  Different day.  Margarita tasted like they melted salt water and poured it in the drink instead of tequila.   The fajita's were actually decent.  But nothing to go brag about.  I was disappointed because based on reviews it seemed this place had some LEGIT mexican food.  But yet again it was another Tex Mex place, that when I asked for a Chorizo Taco, he shook his head and said sorry, no we don't have that.  Really?   I will not return.I will say that the service was great and they were very attentive."], ["Angela F.", "Best steak chimichangas in town! The food is amazing, fresh and very affordable."], ["G. L.", "Tequilas has been my new favorite Mexican restaurant since the first time I went there, but I can't say much about the menu because I always order the same thing--chicken fajitas.  I love 'em, and Tequilas does them so right I crave them.  Well flavored and the veggies are always cooked just right.  Friends who order other things always finish their plate and compliment the food, so I assume that it's all good.   I don't usually eat chips and salsa while waiting for food, but their salsa is good enough to have changed my ways.  So lets get to the real reason I go there: the margaritas :-D  I prefer mine top shelf, on the rocks, no salt, and they're so good I always have a second.  The atmosphere is fun, staff super friendly (they always remember my name!), and the place is clean.  Don't let the restaurant's proximity to Dollar General and a bowling alley stop you from going---it's definitely worth a trip.  They also have a back room that I've been told can be reserved for large parties."], ["David S.", "I've been a regular here for several years, and cannot say enough positive things about Tequila's. The owner and staff are so accommodating, and the dishes are consistently tasty! My personal favorite is the chicken soup, washed down with a margarita (or two), and a crunchy taco (or two). It's a little bit of a drive for me, but I'll gladly make the commute to get my fix!"], ["adrian E.", "Watch out momma you are going to get slapped!... Really, it was that good. So let me tell the story. First, mad props to Yelp.com because this is the first restaurant that i have ever been to solely on the recommendation of this site. It was lunch time today and we were working in bell Meade and we were low on cash. In Richy rich-ville that means your options are limited. So i typed in the filter; cheap, close and good. this was the #1 result that popped up so off we went. I was their first customer of the day and was sat by the kitchen door. I knew i was in for an adventure when I immediately heard all the employees inside the kitchen give out a massive Aztec battle cry to start their shift. Then our waiter instantly appeared with chips and salsa. I was fully prepared to order their $6.00 lunch portion of fajitas when i tasted the salsa. \"WOW, this place may have some real potential\". That is what i thought when i decided to jump into the deep end of the menu and order the $12 palliadia mexicana fajitas. [sorry about spelling there]. It was wonderful. the churizzo was very spicy. the pork was very tender and the carney asada was not overdone. My friend also ordered the fiesta chicken and said it was awesome. I did not taste his food but the presentation was pretty with very festive use of red and green peppers. Our waiter did his job well by giving me at least 5 drink refills plus refills on the chips and salsa. the only negative was the food took 14 minutes to get to the table after we ordered it but i was understanding because they were just opening. Believe me when i say this is a place that i want to go back to with other friends and say \"LOOK WHAT I FOUND\""], ["Brian N.", "I've been coming to Tequila's now for a year or so, maybe longer. I live very close so I was excited to see a Mexican place that close to home when they opened.I can give a pretty fair review now that I have tried many items on the menu.  Fajitas - they're always good, with good quality meat, tender, juicy and flavorful. My favorite version is the Parillada Mexicana which comes with chorizo, chicken, steak, and shrimp and a carnita, along with the normal grilled veggies.  I will say that sometimes the carnita that comes with this is a bit dry and tough and sometimes the shrimp are overcooked, but overall this is still my favorite fajita dish. (When I say sometimes, I would say out of 7 orders it may have happened twice)The normal carnitas however are always top notch. I think the difference may be that the carnita on the fajita plate gets a bit of extra cooking time being in with the fajita mix and on that hot griddle plate)They also have a spinach burrito dish that is excellent if you're vegetarian. It's creamy and rich with cheese. It comes with two and is great with a guacamole salad. (lettuce, tomato, guac)I also enjoy the fish tacos, they are not fried but grilled and have a nice kick to them. If you want it HOT like I do, you can ask them to cook the fish in the diablo sauce which to me, is still not \"set you on fire\" hot, but others would disagree. I have a pretty high threshold for what most would consider hot.For a different type of lunch I ordered the Huevos Con Chorizo (Eggs with Mexican sausage) which comes with rice and beans, and found it to be great!  Light because of the eggs, but extremely tasty due to the chorizo being scrambled with the eggs.Their guacamole and salsas are always very fresh as well as the chips.Tequila's does a great job of offering the standard Mexican fare those in the US are accustomed to, but also has some items that lean more towards authentic Mexican. The one thing that is missing from the menu (and usually is on most Mexican joints) is a good Mole.  If they could add a good Mole chicken dish, I would be in heaven.  As I've said in previous reviews I'm a bit stingy with stars so very few joints get 5 from me, but Tequilas has always been a solid 4.They have a great and friendly staff, the food is never disappointing, and their prices are very reasonable. You can eat for under $10 easily, or you can get a large meal for between $10.00 and $16.00.If you live in, or are close to West Nashville, it's by far the best Mexican place you can find. And if you're looking for entertainment on the weekends, they do music and karaoke. (or at least they have been)They have a patio you can enjoy and a large back room for larger/private parties."], ["Megan C.", "Yum!  The bf and I came here for dinner on halloween weekend and enjoyed delicious Mexican food.  I loved the quesidillas I ordered and the chips and salsa were solid.  The employees were decked out for the holiday and one of them tried (somewhat unsuccessfully) to scare me, which was pretty fun.  Great service, reasonably priced, and I've heard they make a damn good margarita, though I haven't tested that out myself just yet."], ["Richard C.", "I grew up near Dallas, TX and ate Tex-Mex all the time...this is THE BEST MEXICAN FOOD I've found in Nashville so far. The regular stand-bys : Chuys, Las Palmas, Cinco De Mayo, just don't even compare. The prices are good, the service great, it looks like a hole in the wall from the outside, but once you step inside you'll see...this real mexican food the way it should be! Get the combo plate and choose your favorites. I ordered chicken burrito, chicken chille relleno, and chicken quesadilla with beans and rice only $10! Simply the best flavor and perfectly cooked, especially the quesadilla, light and crisp, but not oily or greasy. These guys know what they're doing, I'm going back...."], ["Westnashy Y.", "Tequilas does the normal stuff but there are exceptions, they let the real Mexican come out sometimes. fish tacos, yes.  the fajitas carabenas are good, the hot salsa (not served on the table you have to ask for it)  is authentic and the enchilada sauce is yummy. I think the owners are from Guerrero originally, which is on the west coast of Mexico. check it out."], ["Matt C.", "Tequlia's is a hidden gem. I've eaten here about 7 times now and its become my favorite mexican restaurant in town. If you go, try the Chef's special, a ribeye stuffed with chorizo mash potatoes. Its so good! The 5 different fajita combinations are also great. The wait staff is alway very friendly and the owner is excepional."], ["Melissa G.", "Good luck getting seated. My boyfriend and I walked in and asked for a table for two. The rude, what appeared to be 15 year old hostess held up her finger and told us to hang on a sec. She walked away to set up a table for a large group who was waiting. While she was setting up the table, another couple walked in, and the girl at the cash register asked how many and she sat them immediately while we stood there right in front of her. We continued to wait while the original hostess came back and began speaking to what appeared to be the manager. After standing there awkwardly for probably another two minutes, we decided to leave. RUDEST SERVICE EVER."], ["Sasha T.", "This review is long overdue considering my husband and I have been eating here once a week for who knows how long now. This place is by far my favorite Mexican restaurant in Nashville. I think we've tried one of almost everything on the menu and haven't been disappointed. I always end up going back to the Fajitas Hawaiiana (chicken, beef, shrimp, ham and pineapple) without fail because its that good. The staff is extremely friendly and attentive and the food arrives fairly quickly. Another big plus is their margaritas are awesome. Thursdays and Sundays pitchers are $13.99. Great food, great drinks, great service and the price is right. If you haven't tried Tequila's yet you really should!"], ["Christy L.", "Food was great, drink was even better. I think they possibly served me the best strawberry margarita ever. Can't wait to go back!!"], ["Erin M.", "I'm not giving 4 stars for exceptional, intricate preparation or beautifully crafted tequila cocktails. I'm giving 4 stars because this is as good as it's going to get in this price-range. The servers were friendly, polite, and extremely quick. The food had lots of flavor- as it tends to have when smothered in cheese and/or cream sauce. I had the Camarones Chipotle- which wasn't spicy at all, but was rich and creamy. The shrimp was juicy. We got a pitcher of house margaritas on the rocks for $15. Although I loathe Cuervo- sometimes you have to slum it. They were completely drinkable and I dare say I sucked down more than my share.Tequila's has a pleasant atmosphere, it's not expensive, and it's the perfect place to stuff your face full of chips and guacamole, get half drunk, and slump over in a booth shoveling a huge plate of comfort food into your starving mouth."], ["Sara E.", "This place has amazing salsa! Their guacamole is also very fresh and you can still see chunks of whole avocados in it. We also love their tacos and chalupas. The service is always fast and friendly. Overall a great option for good inexpensive Mexican food!"], ["Alea H.", "Workers are very friendly and the food is really good. Chips and salsa are probably my favorite of the places I've been in Nashville. We did get a couple things wrong on our order but they were so friendly that it didn't matter too much."], ["Steve C.", "I used to really like this restaurant. I went a couple of times a month for the past four years or so, either with a group of friends for lunch  or dinner with my wife. All that changed last Thursday night when I noticed the new No Guns sign at the door. It had just gone up that week. I won't be spending a dime there again."], ["Sheron S.", "Really enjoyed the \"fried burritos\"! Clean, fast & friendly place tucked away in a strip mall (next to Big Lots). Is a lot like Cinco De Mayo, but quieter with outdoor seating.."], ["Justin Y.", "It's nice to know there's good Mexican food in West Nashville.  The staff is nice and accommodating.  The food is always prepared quickly and well.  Be sure to get a tasty margarita to complement your meal.  The salsa is pretty delicious.  I would, however, avoid going when it's karaoke night (not sure what day of the week that is).In essence, I would describe this establishment as Las Palmas with slightly better tasting food."], ["Steph H.", "I've spent a lot of time on Yelp talking about the glories of \"authentic Mexican\" food, which is actually readily available in Nashville. Of course, there's plenty of TexMex and Americanized Mexican food available in Nashville too, and I happen to think that's a good thing. Sometimes you just want to eat something that's slathered in cheese sauce, am I right? U.S. Border Cantina used to be our go-to spot for Mexican food when I was craving queso and margaritas, but now that it's gone to the restaurant graveyard in the sky, Tequila's is our new haunt when we're in the mood for Meximerican (a term of my own creation) food. I think most of these \"Mexican\" restaurants are pretty interchangeable, but Tequila's food is legitimately very tasty (the fajita burrito is enough for two, though it's so yummy you won't want to share) and has lightning fast service. Additionally, while it doesn't serve the best margaritas I've ever had, it does offer up decent incarnations of them, and for a reasonable price, too. For $6.50, you can get a top-shelf marg that will seriously rev your engine. Better yet, they have plenty of drink specials, including $15 margarita pitchers on the weekend (and they're even cheaper during the week), which makes getting your tequila fix all the easier.So not authentic by any means, but still good in its own right. The food is filling and inexpensive and the service is friendly. Sometimes that-and a margarita- are all you need."], ["Tracie R.", "Yummo!  Great place for Mexican food."], ["Brittany S.", "I had a great experience here. Way better than at las palmas. I had beef nachos supreme and my bf had chicken quesadillas. I liked my entree a lot. Filling portions and the waiter was pretty attentive :) We'll be back!"], ["Helen Joy G.", "Gross. Everything was just gross. The chips tastes like week old cardboard, the food was so below average. Do not waste you time, money or precious taste buds here. I feel so sad I wasted my one meal in Nashville here:("], ["Victor F.", "After eating here for the first time over a year ago, I have been back numerous times. The food is very good and the service was excellent.  The entire staff was friendly and accommodating. Definitely one of my favorite Mexican restaurants in Nashville."], ["Riffi O.", "Husband and I went last night. We performed our own taste test of margaritas and decided premium brand was worth the $2 difference. We ordered a fajita mix and burrito with shrimp and mixed veggies ( on the especiale list). Both were more than one person could eat, succulent and well-flavored. Even the beef was nice and tender. The place was crowded but we were seated right away. Service v good.  Price range is just under $10 to $15."], ["Deepak B.", "Went there again for lunch cico de mayo. I still love this place! Low price, and food is consistently good. If it means anything, I am very picky eater."]], "Carniceria Y Taqueria Don Juan": [["Chris S.", "Ok, so you've had tacos before?  Nope, not unless you've had one of these or from another taco stand.  Meat, cilantro, onions.  Lime if you want it (you do) and green sauce (a must!). Get the carnitas.  You won't want anything else.  I've been here probably a dozen times and the staff is always very pleasant, serve your food promptly, and will give you free samples from time to time.  Eat them.  On Wednesdays they do a special on whole chickens: two for $15 with rice, beans, tortillas, onions, and poblanos.  This is delicious, falling-off-the-bone smoked chicken that is some of the best chicken I've ever had.  I recommend going with friends, preferably 4, if you're going for the chicken.  The only way this place could be better is if they also served beer."], ["Chris L.", "I never order carnitas, except for at this place. Tender and juicy with a crispy outside. Definitely done the right way.  And they put so much meat I the carnitas taco that you almost can't fold it. Perfect."], ["Derek K.", "I am amazed how many good reviews this place gets. Either people around here don't know what good food is or I got a bad cook that day. Why 1 star? Because I wasted $12 and couldn't eat more than a bit of this nastiness. The chicken was full of grizzle, there was no flavor and the dish smelled awful. Authentic or not, there are much better places to get your mexican."], ["Joe K.", "We ate here and thought the food was pretty good.  One of us had the beef tongue and pork skin tacos.  Food was good, but not 4 or 5 star worthy."], ["Tin N.", "This place is comparable to Taqueria San Luis. It's pretty good, but not as good as some of the Mexican food trucks (roach coaches) available in Nashville. Overall the meat is more juicy than the meat at the Taqueria San Luis window. I ordered 4 items: chicken quesadilla and three tacos (chicharron, asada, and pastor).The chicken quesadilla is relatively similar to the one at Taqueria San Luis--relatively flavorless but juicy. The chicharron taco was a pleasant surprise because it's often not available at most Mexican places in Nashville. It was juicy and spicy, but had moderate flavor. The asada here is more juicy but less flavorful than the asada at Taqueria San Luis. And the pastor is juicy, more spicy than most places, but not as flavorful as the pastor found at food trucks.When I looked around me, I noticed a lot of non-Hispanic clientele. It's a decent joint that's better than most Mexican restaurants in Nashville but definitely not the best. I feel that the food items aren't quite flavorful, but try to make up by adding more spice than you would find at other establishments. I do appreciate the wider variety here than at San Luis or the delicious Mexican food trucks.1 quesadilla ($5) + 3 tacos ($1)  = $8.00."], ["Kate S.", "Here's what to expect if you've never ordered legit tacos before...Tacos are one dollar.Corn tortillas, shredded smoked meats (chicken, beef, pork, etc), onions, cilantro, lime. They will give you a bottle of light green sauce to put on your taco. It's spicy and the best we can tell, we think it's avocado and sour cream based (?). Delish. There is no lettuce or tomato on a real taco. This place is awesome. Don't be afraid. Just do it."], ["Ana M.", "Maybe we hit it on a bad day, but sadly Don Juan really didn't live up to the hype. We ordered a variety of tacos and a quesadilla. The only saving grace would have to be the Barbacoa, which although a bit fatty, was very flavorful and right on in terms of authenticity. The Pastor and Carnitas were both really dry and the Carne Asada was tough and fatty. So sad, because we were hoping for great tacos. Plus, even though it's not what they're known for, the chips and salsa were obviously store bought."], ["Shami K.", "Don't be scared by the questionable exterior and odd setup. The food is amazing. No frills, which I am okay with because the tacos are about $1.50. Corn tortillas, meat that is never dry, onion, cilantro, and amazing green sauce that is super spicy! They have some outdoor seating- again, no frills. This place ties with Mas Tacos in east Nashville for the best tacos in town."], ["Carolyn S.", "I tried 4 tacos, one of each, chicken, pork, ground beef, and spicy chicken, it was good, not great. I will totally try it again though, who says no to authentic Mexican?"], ["Zach G.", "You know you are getting LEGIT mexican food when you are sitting at a fold up table with fold down chairs underneath a carport right next to the drive thru....best taco's in Nashville is a statement and it's true...the green sauce is the greatest....I love ordering their Chorizo Taco's, mainly because the girl taking my order smiles, which means I know a thing or two about Mexican food.   So avoid the CHAIN crappy Tex-Mex places....that litter our town...let those that think great shopping is getting a deal at Big Lots enjoy their crappy mexican food..and come down to this place and have the best tasting taco's you can get in Nashville...cheap as can be too...$1.25 PER TACO...I think Burrito's are $5 bucks and HUGE....girth not length...just like the ladies like...uh....I'll stop while I'm ahead...."], ["Elise G.", "Best tacos in town!  For sure try one of each your first time, but the tacos pastor are my favorite.  The prices are awesome for the amount of meat you get on the taco.  Definitely would recommend this place next time you consider a chain :)"], ["Ryan P.", "Outstanding. Authentic. Delicious. Chicken, carnitas, and barbacoa are my faves, but I've had them all."], ["Jason E.", "Just the best. The pastor is the best taco, the sauce more than earns all these rave reviews, plus the horchata is amazing."], ["Marshall C.", "The food is fantastic. My go to just about anywhere is a torta al pastor. These guys nail it. Location is a plus. If you go on a warm day you can close your eyes and wonder whether you've died and gone to Texas."], ["chad m.", "I'm not kidding around when I say this is THE PLACE for tacos and other such foods in Nashville. Totally legit, this place is the real deal. The staff are some of the nicest I've come across and the price is right! All the tacos are amazing, but I HIGHLY suggest the Barbacoa Torta. Thank me later."], ["Antoine J.", "Asked \"what's good? I'm hungry.\" Dude said, get a barbacoa burrito. I did. Very good, especially with the green hot sauce. I ordered 2 tacos as well (lengue and pollo). Great stuff. Will be back many times"], ["Suzette S.", "Really delicious.  Really fresh corn tortilla, juicy well seasoned meats (Ihave tried tongue*****, and chicken****), topped with grilled onions and an amazing dreamy, creamy sauce.  I will definitely go again.  It is hard to see from the road, set a bit back. You can park right next door.  The people are friendly, the service was really fast.  A great place for lunch."], ["Liz W.", "5 stars for the service and the green sauce. who doesnt love tacos?!"], ["Gregory S.", "this place is the jam....the green sauce will melt yo face. the ladies are nice. its clean."]], "Cinco de Mayo": [["Amanda K.", "This place is amazing. My girlfriend and I have been coming here for a few years now,  and it has never changed. The specials they have each day is incredible, especially the 2 dollar margarita special sun-tues. Great service, great environment! I would definitely recommend this place to anyone who is ready for some great Mexican food/drinks."], ["Krystal T.", "Cinco de Mayo makes the claim that they have the best margaritas in town. Totally not accurate. Around the corner from the White Bridge location, Las Palmas on Charlotte Pike has far superior margaritas at a substantial size for a great prize. However, the $2.99 margarita specials ($10.99 pitcher) on Sundays-Tuesdays make Cinco de Mayo a good deal.Otherwise, the rice and other entrees are rather generic in quality, but cheap."], ["Beth G.", "Best Mexican fast cheapGood and not Lard based love the owners brothers prices and food. Cannot say enough good things about this place. Another weekly goTo for dinner in and takeout!I get the soup when sick but love everything"], ["Heather R.", "This is one of my favorite Mexican restaurants of all time. Start with their drink specials: Sunday-Tuesday, pitchers of (very strong) margarita are $10.99 all day long. They have fantastic drink specials every day of the week, and, unlike a lot of Mexican restaurants, never skimp on the alcohol.There food is delicious, and affordably priced. An order of fajitas that includes generous helpings of steak, chicken, and shrimp is $13.25, and though the menu lists these fajitas as being a \"single order,\" there has always been enough for both I and my boyfriend. Oftentimes, we have even had some to take home! We have tried pretty much everything in this place, and experienced the same consistently high quality.My only (mild) complaint about this place is that the salsa is just okay. It is not very spicy, and somewhat watery. However, the quality of the rest of the food more than makes up for it."], ["Brittany F.", "Let me begin by saying that Sun- Tue they have $2.99 margaritas and $10.99 pitchers of margaritas!!!! That was the determining factor to get us to decide to go there! The margaritas are pretty good too, and if you split a pitcher with about 4 people you can get about 2 cups each for about $3.50, not too shabby! We ended up going in a big group this past Sunday around 8pm and since we had a large group we were in our own separate area which was nice, because we were loud and obnoxious! The server took our order quickly and correctly and the food arrived about 10 minutes later with no complaints from any of us! He kept our chips and salsa replenished anytime they got low! My husband and I shared a combination plate that had a burrito and enchilada on it with rice and beans, plus we both shared the pitcher of margaritas, before tip our bill was only around $15! The food is anything outstanding our different, just regular ole Mexican food you could find anywhere but for the convenience and the cheap margaritas, we will be back!"], ["Matt D.", "This place is in my top 3 for Mexican Fare here in Nashville. It is difficult to find Mexican food in Nashville that I really like as I travel a bunch and have access to really good Mexican and TexMex food many times during the year. For here at home I have 3 places I will eat and this is one. The service is always good. I don't drink but am told the drinks are really good here. If you get a chance, give it a try!"], ["Amanda C.", "our go to Mexican restaurant in Nashville. the food is always so good, the portions are huge and the prices are excellent. We have had several things here (fajitas, chimichangaz, burritos, chicken fundido) and can never decide what to order because it's all great! the steak tacos are simple but amazing and their drink specials couldn't be better. happy hour all day Sunday through Tuesday, 99 cent drafts Friday's after 8, and mango margaritas I could drink for breakfast! typical Friday night order of two meals, cheese dip, 2 margaritas and 2 beers comes in under $45 after tip!!"], ["Kimberly S.", "You know how everyone has their favorite cheap Mexican place and no other place can touch it? Well mine is El Porton in Roswell, GA, and I'm still trying to find a place that lives up to that. In Nashville, Cinco de Mayo is as close as I've come to finding my favorite Americanized Mexican. It's inexpensive, friendly, and downright tasty. Also, they have some KILLER drink specials. If you too are looking to fill the Mexican void, Cinco de Mayo will fit the bill."], ["Dew T.", "We love Mexican food. L.O.V.E. And love authentic Mexican food - so we try all of the restaurants around town.There's a lot of trendy Mexican Restaurants around town, but if you're looking for authentic Mexican (w/ awesome Queso), Cinco de Mayo is my favorite. And if it's not on the menu - ask. They've been very flexible on my meet-free days as well."], ["Jim V.", "The food was just alright. I don't like when you go to these types of Mexican places and the food looks like slop on those prison movies. I am a big fan of their monster margarita. I doubt we will go back to this restaurant because there was nothing authentic about it. The guac served with the chips wasn't fresh and you could 100% tell it was frozen prior to being served to us. But the three stars were definitely for the monster margarita!"], ["Jason B.", "This is your typical Meximerican place, but the food is outstanding.The pitcher of Dos Equis comes with a full pitcher and 2 mugs that are already full for under $9.Great food and a great beer deal."], ["Carissa O.", "Fast, cheap, easy. Chile rellenos are my go to but the steak fajitas are good too. Not a fan of the tacos here. Margaritas are good too and cheap."], ["Laura D.", "I flew in from NY to a hotel across the street and I was STARVING.   I saw the \"mexican restaurant\" sign and decided to give it a go.  (And obviously checked yelp to make sure it wasn't a one star joint)I must say....I've had some GOOD mexican food in my life.This restaurant was just sort of average to me.  Nothing really stood out.  Service was fast & friendly.  I got the enchilada and burrito combo.  It came with a heaping portion of beans and rice.  Was it good?  yes.  Did it satisfy me?  yes - all i had were peanuts on the plane.   would I come here again? nope.  sorry."], ["emily p.", "Delicious mexican food. I went on Cinco De Mayo, when it was PACKED- and the service was still patient and attentive; I really appreciate that. The margaritas here are also amazing!!"], ["Mike M.", "Busy place but we still got a table immediately on a Friday evening. Very loud atmosphere. Try to get into a side room if you want to chat. Not sure if they have hotter salsa but the salsa they bring is definitely for gringos. Food was decent but definitely not the best Mexican food in Nashville (I'm looking at you, Nolensville Road) and a far cry from what I'm used to. Don't even think about ordering a sopapilla. I was expecting the hot, soft, puffy pillow variety with oodles of honey to pour as I wished. Instead, I got a crispy, thin, flat frisbee. Yuk."], ["Lindsay C.", "Been here several times..the service is good, drinks are great , the chicken quesadillas are awesome and I love the chips salsa and queso! Highly recommended"], ["Prashant S.", "This used to be our weekday dinner place. We enjoyed the ambience until one day we interacted with the manager for the first time. I am not sure if he was having a bad day but he was not accommodating for a party of 9. we were not provided with enough chairs for 10 mins and upon reminding him (manager) he said \"it's not been 10mins yet\". Then also he did not accept our state issued drivers license saying it was not a permanent id. It was a print out by the DMV department. I UNDERSTAND HIS POSITION BUT HE COULD HAVE BEEN POLITE ABOUT IT, instead he was behaved rudely with all the guest.This cinco de mayo has a monopoly on Charlotte as there is no bigger and better ambience place nearby."], ["David H.", "Doesn't look like much from the outside, so I was a bit skeptical walking in.  Great experience though. Staff was extremely friendly and attentive. Salsa was excellent. Food was delivered quickly.Similar to Las Palmas as far as style and options. Didn't have an vegetarian combos, which would have been nice, but they were able to work with me without issue. And it's cheap. $20 for two people, including drinks. Couldn't believe it."], ["Kurt B.", "Food is always excellent, fast, and the service matches.   Cold beer and excellent margaritas.  The dip is very good, not that ketchupy stuff."], ["Sheena T.", "I am in trouble. I didn't realize there is a Cinco de Mayo 5 minutes from my house!! I'm both overjoyed and fearful at the same time because I'm afraid of how many calories I will consume here!I have visited the sister Cinco restaurant in Hermitage multiple times and was curious to see how they compare. I was not disappointed! They have amazing tasting salsa, it's just not quite spicy enough for me (I love the heat!!) but no worries, they have an extra spicy salsa you can ask for! Win-win! The only downside is that it's not tomato based, but mix them together and you have a hot excellent tasting salsa! For dinner I had the chicken fajita burrito and it was excellent! They covered it in cheese sauce which is always good, but I prefer the red sauce on a burrito. Next time I'll ask for it. The meat and veggies were SO good, very flavorful and the beans and rice on the side were great. We went for sangria instead of margaritas, it was super sweet but I love that they didn't fill the carafe up with ice so we got more! Our waitress was also lovely and friendly, and didn't give me attitude when I asked for more salsa :) I look forward to many more trips here!"]], "Chago's Cantina": [], "Mas Tacos": [], "El Tapatio": [["Darcy L.", "Unlike every other Mexican place in Nashville, el Tapatio serves cilantro!  It's a miracle.  Naturally, it follows that this is the best mexican restaurant in town.If you go there around lunchtime, they are outside cooking the chickens in the smoker and you can seriously smell it from a block away.  delicious.  The roast chicken is awesome, and the al pastor tacos and the carnitas were quite tasty as well.it is waaay tastier and cheaper than the americanized places over in east nashville.  Plus they are open every day, until 1am on weekdays and until 4am on saturday nights. NOTE:  There are 2 restaurants on Nolensville called El Tapatio, this one is the further south of the two and always has a taco truck parked in front of the dining room."], ["Samuel L.", "Let me reiterate, this place is fucking fantastic. Spicy pork burrito, awesome. Spicy red chile sauce, phenomenal. Chicken quesadilla, amazing. Out of all the things I've had there, these are by far the 2 best items. I'm going back again and again and again."], ["Hanna H.", "Taking a suggestion from a new friend, my husband and I swung by here after work on Friday to start the weekend off right! I am so sad that it's taken us this long to discover El Tapatio! Everything we were told about this place was true. It's a bit of a hole in the wall, but I LOVE that and the food certainly did not disappoint.While I was a bit upset at myself for not remembering more of my Spanish, it was easy enough to communicate with our waitress by pointing things out on the menu. I ordered three chicken tacos and my husband ordered a chicken burrito. We were not offered any chips and salsa, but after reading Steph H.'s review, I can see why...we should have known to ask! (To be remedied in the future!) My tacos were OUT OF THIS WORLD! The cilantro, crispy smoky chicken pieces, onions, fresh lime and small corn tortillas were the perfect combination of yumminess! So fresh and light tasting...I could have had three more! At $1.25 a piece, that wouldn't be hard to afford either! My husband's burrito was delicious as well. I was surprised to see they used sliced avocado in it and you had to specify cheese. He couldn't finish it all as it's a good portion for only $5! We also shared a glass (as big as your head) of their horchata and it was delightful! Only $3 and we had to take it to go as well.The place smells amazing and the ambiance is very casual. There were about 10 TVs (exaggeration) playing the same soap opera and I wasn't quite sure of the necessity of that many TVs. Oh well. They weren't loud so that wasn't distracting.I've been looking for a place like this for quite some time! Happy to know it is so close! (This could be bad...)"], ["Liam B.", "1/2 chicken and spicy pork tacos with pineapple, delicious. Guacamole and chips are great, too. You have to go here."], ["Steph H.", "This is hands down my FAVORITE Mexican place in Nashville. My husband and I have been going here for about a year now and we have not once been disappointed. If you are looking for authentic Mexican food, El Tapatio is all you need.For those who have only experienced Tex-Mex/Americanized Mexican food, the fare offered at El Taptio might initially seem surprising. The food is not slathered in thick/heavy sauces, nor does it contain very much cheese and sour cream is non-existent here. What you get instead is food that is incredibly fresh and very hearty, but never heavy. The tacos are akin to the ones you would get at the various taco carts around town: two grilled corn tortillas about the size of the palm of your hand filled with onions, cilantro, and the meat of your choice. Sounds simple, but it's so good! My favorite tacos are the lengua (tongue!) and the tripa (tripe!) - if you think you can't stomach stomach, think again! The tripe here is crispy nuggets of pure deliciousness. Still, if you'd like something a little less exotic, you can't go wrong with some spicy pork or the chorizo (the latter isn't listed on the menu, but you can ask for it and they usually have it). If you're looking for something more substantial the tortas (sandwiches) and burritos are super filling and very reasonable at just $5. I love the birria burrito (goat stew), but again, you can get any of the more conventional offerings like chicken, steak, or pork. The burritos come packed with rice, beans and avocado along with your meat, while the sandwiches have the same fixin's as the burritos plus lettuce, tomato and melted cheese. If you come with more than two people they tend to automatically bring out chips with salsa and guacamole--all for free!--but if they don't you can always ask for them to bring you some. The salsas that they bring out are smokey (the red one) and picante (the green one) and very good. Your tastebuds will quiver in delight since it's unlikely that you've ever tasted restaurant salsa that has this much flavor. You can also order beer, various softdrinks (including Mexican varieties), but you definitely need to try the horchata (rice water with a healthy dash of cinnamon). It's so tasty and will help you deal with any spice overload.It's true that Spanish is definitely the preferred language here, but don't let that dissuade you because many of the waitresses do speak enough English to get your order right. The food is so good that a little pantomiming is definitely worth it! There are few places in town where you can get such a delicious and filling meal for under $10, but El Tapatio is definitely one of them."], ["J K.", "I dig this place a lot. Mellow, legit, the half chicken plate is a great deal and as long as the chicken is recently off the smoker you're set. Open late night too, usually til about 2am."], ["Jerry E.", "kind of a dive, but the food is good and loaded with local Hispanic patrons. I almost felt like I was back in Mexico City, which I really enjoy."], ["Winnie L.", "Great Food, fab service, we loved it!!!!"], ["Ben G.", "On the quest for a fish taco, I stumbled into this joint.  Didn't find a fish taco, but I did find an amazing place to eat!The Ceviche (fish on hard torilla on the menu) is fantastic!!  The shrimp taco was awesome as well.  You'll get more shrimp on these $1.25 each treats than you will in entire meals at some fancier places.Guacamole is complimentary (a huge bonus, the trendy places are charing 5-9 bucks for this!)  though their recipie is a little different than most.  Chips and two types of salsa (and mole?) come free as well.Cheap eats, spectacular food, and very friendly staff."], ["David G.", "I was quite surprised by El Tapatio given all the positive reviews.  My girlfriend ordered fish on a tostada. The fish was gray and had a fowl taste.  I had gorditas.  While the gordita itself was very good the fillings were pretty rough (the beef was tough and very fatty and the chicken was completely dried).  We sent the fish tostada back but ate the Gorditas.  The waitress charged us for the fish and refused to take it off the bill even though we sent it back. (I know Spanish, so miscommunication wasn't a problem).  I'd probably say this was the worst dining experience I've had in Nashville.Cute building and you get to watch telenovelas which is a plus.  I didn't order the food some others are raving about so I'll give em 2 stars, but I can't say I'll be going back.  I don't know if they are under new management, but there are plenty of other options on Nolensville (La Hacienda, taco trucks) which are better choices."], ["Lovette B.", "Alright! So I have been back in Nashville for 6 months and I had not been able to find good AUTHENTIC Mexican food. That was until I tried El Tapatio. It is a small place off Nolensville rd but the food is authentic. Yes its true the staff speaks limited English, so read the menu and order. I had 3 tacos. No this is not that terrible Tex-Mex, it is real Mexican. SO my tacos came with the cilantro, onions, and a soft tortilla. My husband had this huge dish that had three kinds of meat and pineapple...it was surprisingly delicious. He cant stop raving about it. Anytime I need my fix I will be going back to El Tapatio."]]}