{"Mad Platter Restaurant & Catering": [["Dan Z.", "The Good: The pork was exceptional; service was good too.The Bad: Notta ThingThe Rest: This was my first visit. The food was even better than I expected. A great meal and service overall!"], ["Natalie D.", "Solid 4. The restaurant has a charming decor, plentiful parking in lovely Germantown. Host welcomed us upon arrival and walked us out when our meal was over, he was great! We ordered: cheese plate appetizer- good.Shrimp and Grits- delicious!Braised short rib- delicious!Filet- fantastic and perfectly cooked!We skipped dessert because we were too full. Food was 5 stars. Why the 4 star you ask? Our waitress was just ok (3.5 stars), she wasn't rude but she also didn't elevate our dining experience. Food seemed to take a while to come out, however we had good company and no where to go,  so it was ok. Germantown cafe is still my neighborhood favorite but we will definitely be back to the Mad Platter!"], ["Alyssa C.", "I had a great experience here for lunch yesterday 7/17! After 6 hours of flying, we went to Enterprise for a RentaCar and the gentlemen working there highly suggested we go! Started with sharing a crab cake (great flavor, as a new englander I have never tasted one with a little southern touch!) great rolls and fresh butter.Then I got catch of the day! Salmon, Jasmin Rice & Summer squash (so delicious) and for dessert raspberry sorbet! The decor and atmosphere was so homey and I loved all your old fashioned books! Thanks for the great first meal of my trip to Nashville"], ["Susan P.", "The reviews for Mad Platter are mixed and my impression after eating there is mixed, too.  We really like the Germantown area.  The service was slightly better than average.  We were there on a very busy Nashville weekend during Vandernilt commencement with 8:30 reservations and there were only about 3-4 parties in the restaurant which felt a bit creepy.  We started off with flatbread (really nice but too much cheese for my diet) and a bottle of wine.  We ordered a wedge salad , the fish special (dry), duck (very nice), the polenta veggie entree (like ratatouille ), crab cakes (ok--kind of mayonnaise-y), and another entree and ravioli appetizer .  Portions were plentiful.  We tried to order Elvis chocolate (they were out), then the waiter suggested tiramisu (it wasn't available after all).  So we ended our evening .I think there is just too many excellent food choices in Nashville for a place like this to survive.  I would recommend finding another spot.  Not a bad choice, but there are so many better options in this price range and lower that unless you really need a quiet and low key spot, I would search further."], ["Jerry S.", "We tooke the office staff by The Mad Platter for an informal lunch meeting. Marcia and the staff were very attentive to our needs and allowed us time and space to meet. we never felt rushed and always felt at home. The food speaks for itself. This place has a well rounded menu and delightful chef's creations that fit Germantown and Nashville perfectly."], ["Angie Q.", "Mad Platter was an impulse stop for brunch and we were very happy to discover this little gem. It was quiet and the service was delightful (Leanna). We started with the wild mushroom ravioli, which was good-nothing spectacular, but good. My husband ordered the bananas foster waffle, which we both enjoyed. It was sweet without being TOO sweet. I had the shrimp and grits. It was insanely good. I loved the gouda and sherry cream reduction. We finished with the trio of brulees. They were all good, but the blood orange soared over the others in flavor. The coffee was excellent and the cocktails were lovely. I enjoyed the spiked spiced tea and the husband had a bloody mary, which he said was excellent. I am docking a star simply because the bathroom really needs a good scrubbing and updating, It wasn't horrible by any means, but it is definitely not up to the standards of the price/class of the restaurant."], ["Candra G.", "Definitely not impressed.  Service was great, but that's about it.  I should have known something was up when the placed wasn't packed out on a Friday night in Germantown.  We started our meal with a cup of mushroom soup.  Gag - it had a weird after taste and lukewarm at best.  So, I unfortunately had to send it back (which I hate to do).  For my main course, I had the shrimp and grits.  While not the best I've ever had, they were decent.  My beau had the lamp chop.....which lacked any seasoning whatsoever.  Needless to say, we tried it - but most likely won't return because there are too many good restaurants in that neighborhood to choose from."], ["Aja B.", "This place was a complete disappointment. Incredibly overpriced for the tiny tiny tiny amount of food you got. The waitress lured us in by telling us the portions were generous, and it was just plain false. They were out of nearly everything and even made substitutions for things that were not on the menu and didn't tell you so we had to find out when we got something different that this was the case. I'm appalled that they are still in business after what was a complete disgrace of a meal that would've cost far less anywhere else and probably have been better. When we complained the waitress acted like she was doing us a favor by bringing out a Dixie cup with more food and said that's just what they gave her. Really? I will never dawn those doorsteps again."], ["Ruiqiu K.", "Finally ventured out to Germantown. Specifically to this place, but it was good to finally try somewhere else in this city.Had the chicken salad, which came on banana bread, which I thought was an odd combination. I've had better banana bread and this was somewhat stale. But I thought the chicken salad was very well seasoned. Fruit consisted of grapes, one which rolled onto the floor somewhere.Not a place I'd specifically come back for, but if I'm in the area and friends wanted to go in, I'd still try something else on their menu."], ["Benji G.", "We are in Tennessee for the first time. We wanted a good place for lunch and tried to go down the street to Mullen's but the wait was over an hour. The front of the house guy suggested a couple places including Mad Platter. This being Father's Day the menu options were a little limited. But they were fine and my family of four was able to choose something that sounded good to them. The service was a bit slow but they were obviously busy for Father's Day.Once the food arrived I was a bit surprised by the portions for the price. Fruit is three small pieces? It tasted good but would've been a much better value for a dollar or two less than they were charging.It was easily one of the most expensive meals we had on our 10 day trip in TN and because of the prices was just not worth it. If it was cheaper I'd go back. Otherwise, when we're in town we'll opt for somewhere else."], ["Tim S.", "Nice homey decor, prompt seating, service got a bit overwhelmed by the lunch rush after that.  We ordered a variety of dishes, all of which seemed pretty decent but all seemed to be influenced by committee rather than a decisive chef.  My carrot orange ginger soup had a fantastic mix of flavors and a great gingery bite but seemed too lightly based and insubstantial.  The Rueben (\"best in Nashville!\") had excellent corned beef but was light on sauerkraut presence and I'd be happier if the bread could decide what the hell it was (answer: rye only please). Don't get me wrong, I liked it and will be back but thus far my expectations were a bit higher than what was delivered."], ["Saam T.", "We came through on a food tasting tour. Service was good. We tasted the reuben. I love Reubens and have had my fair share. It was AMAZING. I was full before we ate, but I was the \"gonna eat that?\" guy to everyone that was eating their reuben slowly. Get it! The ambience is rustic and casual. Seems like a cool spot."], ["Sheena T.", "Mad Platter is a longtime favorite restaurant of mine. I made it back for the full dinner experience this weekend and wanted to write a current review.We had a party of 6 people, and they were very nice and accommodated the extra two people we brought along. I was bummed that they were out of the one cocktail I wanted, and then I tried to order wine, they were out of BOTH options that I asked for. Eessh... That wasn't great since it was 7:30 on a Friday night... come on guys!They no longer offer the price fix menu that they used to, they now change the menu daily and you need to visit their Facebook page to get a recent menu. Different. Kind of wish that they would post it on their website.Our table ordered appetizers, entrees, and dessert. The shrimp bisque was good but TINY, and the best dish was definitely the mushroom ravioli. It was out of this world. For entrees, the shining star was the duck, but I heard good things about the steak options and the shrimp and grits. I didn't love my lamb, but I think that is more because I don't like the shank part of the lamb. Will order differently next time. Our order of the chocolate creme brule was outstanding and I loved it! We made the mistake of ordering the chocolate Elvis as well and it was a very large piece of chocolate layered cake that was very rich. We should have stuck with the creme brule only, but hey, it was a Friday night so we splurged. Overall, a decent meal but not everything is a shining star dish and they need to stock up on their wine and cocktails!"], ["Gwen K.", "You'd think at the center of the Oktoberfest that this place would rise to the occasion and produce a menu that makes folks want to come back for a nice dinner on another occasion. Our experience was completely the opposite. We went here for dinner years ago, and enjoyed it. Since then, it seems it has not kept itself up - it seemed dirty, the service was slow, and the menu was disappointing. It was overpriced for the amount and quality of the food served, and we will never be back. I'd suggest going instead to some of the many other restaurants in Nashville that seem to care about their food quality, service, and reputation."], ["Scott H.", "Love this place. A hidden gem of Nashville. Great value and one of the best date night restaurants in town. Charming environment, nothing but good things to say."], ["Courtney A.", "This has become our go-to \"why fuss with reservations when there is bacon horsey Mac 'n cheese gnocchi (not the actual dish's name) to be had?\" In layman's terms: if you like upscale dining without the fru-fru pretentiousness of some places around town, you'll dig this place.Full disclosure: we tend to order two apps and split an entree, so we've only had a couple of entrées from this restaurant, but the shrimp and grits are always solid. We've had most of their appetizers so... ORDER THE GNOCCHI!... Because, bacon. And horseradish. And Gouda. ...Where's the question? Oh, and about the Portabella rav... I secretly want to order two plates of it and make it my entreé. My only critique is that I wish they were  a little more ballsy with the decor... If you're gonna go alice in wonderland, I want some weird Dali/Max Ernst stuff in there."], ["Lisa W.", "My husband and I ate dinner here a few days ago. It was absolutely phenomenal. We didn't have a reservation, and the lady that sat us assured it was no problem and that she was glad we were there. Her name was Robin and she actually ended up waiting on our table. The food was outstanding. My husband had the Duck w/ ravioli, and I had a collaboration of many meals. LOL. I have multiple food allergies, and Robin made sure that I was getting exactly what I wanted by explaining my different options and communicating thoroughly with the kitchen. She showed great concern for my annoying food reactions. She could not have been sweeter. I am usually so embarrassed to order food at restaurants, but she actually made me laugh about how silly that is. Our entire experience was amazing. We will certainly be back."], ["Alice H.", "We went for lunch today, not my first time, but I hadn't been there in a while since I used to work down the street. It was holy unremarkable, which is a shame because it is quite pricey for lunch. I give it two stars because the service was spot-on and I like the decor. However, it was far too loud and was a terrible place for a business lunch.I can't speak to the other's food, but mine was very disappointing. It began with a bowl of rolls delivered to the table. They were hot, but not particularly tasty and the butter served with them had a freezer-burned taste. I had the wild mushroom ravioli. It was absolutely bizarre. I love mushrooms, but this was covered in so many sauces (yes, two), that I couldn't taste the filling. Maybe I've watched too many episodes of Kitchen Nightmare, but the pasta didn't taste fresh or homemade. I think that Butoni wild mushroom agnoletti in the grocery store would have been better. Disappointing, too, because Lazarolli's is right across the street and I'm sure they would have provided wonderful ravioli.  Worst were the sauces. It was floating in a really thin tomato sauce that then had dollops of pesto on top. Both were salty, but then there were the most bizarre spices coming through (for example, dill and cilantro!). A light cream sauce would have been lovely and would have complemented the mushrooms beautifully! It was really, frankly, awful.But to make it weirder, it was served with mushy brussel sprouts that had been cooked with peppers and onions on the side. Maybe that's where that dill came from in the pesto sauce?They had a large sign up that boasted locally-sourced product, such as Noble Springs, but I didn't see any sign that there was goat cheese on the menu! Maybe I didn't read it closely.There are great places nearby that are good values. I wouldn't go back.(I've also had a bad experience with their catering, but that's another story for another day)."], ["Correy S.", "This place seems to want to be better, more tasty and more fancy than it actually is. Our appetizers took 45 minutes to get to the table and then our entree came 15 mins after, forcing is to scarf down the appetizers. Good quality didn't seem that great. Good temperature was really bad. My \"medium\" cooked steak came to the table barely room temp, on top of a bed of room temperature mashed potatoes and cold asparagus (really cold)."], ["JD C.", "Fun menu, great location, great waiter staff, interesting restaurant all the way around. We visited on a lunch date, but would love to see it in the evening for a dinner."]], "La Bamba": [], "Prima": [["John S.", "We ate at Prima on Saturday night with friends. Great place with a great vibe and wonderful staff We had several apps, all great, octopus, kale salad, endive saladFor main courses we had the swordfish, pork, duck and all were great.Service was perfect as well, especially given that the restaurant had only been open less than a week Definitely going back"], ["Aileen K.", "Great food, great ambiance, great service. The trout was excellent and a excellent healthy choice. The Brussels sprouts were good but could have been better without the anchovies. My husband loved the rabbit he ordered.  There are limited choices for vegetarians. But we will definitely return."], ["Andrew S.", "Prima blew all of our expectations out of the water! The food was exceptional, and the service, even better! Somehow we got a last minute reservation and we're very glad we did! The glass room is a must; definitely adds to the experience! Not very often you see a place that offers a full arsenal of linen, water and knives to choose from. Yara was our waitress and she did a phenomenal job! Great service, recommendations, and information on nightlife for us tourists. The home fries with foie gras sauce we're to die for! Bet you can't stop at just one order! Great cocktails, wine selection, food and service! A must do in Nashville!"], ["Jessica G.", "Way!!! Over priced..the building was nice but it wasn't that great..and the atmosphere was alittle cold and stuffy..all in all alittle disappointed"], ["Bill C.", "Had dinner there last night.  The service was exceptional.  Attentive but not intrusive, knowledgeable but not pretentious.  The kale salad with sweet potato chips was extraordinary, as was the endive salad.  You must have the whole trout, that they gladly filet at the table.  Also try the house-made chorizo.  The smoked pork was dry, and, for our table, over cooked.  Be prepared for your table to eat family style, which for us, was really fun.  And, the desserts, try everything!  The ambience is very east coast.  You could be in Manhattan or Philadelphia, but you are still in Nashville with valet parking.  The black and grey walls are complimented with perfect lighting.  The noise level is quiet enough to have a conversation, but you feel the buzz of a restaurant with people having fun.  The booths provide privacy, but you feel connected to the vibe of good food being enjoyed by everyone.  This is a great addition to the food scene in Nashville.  Go, go, go."]], "Pupuseria Salvadorena": [["Gaby L.", "I had never heard about pupusas in my life, but now they are one of my favorite dishes! Pupusas are somewhat similar to Mexican gorditas, but they are completely closed and have a little less filling. I can't really speak to this restaurant's authenticity, but that doesn't matter because it's delicious. The restaurant isn't fancy, but it is very clean and the servers are very helpful. Food is cooked on the spot, so it does take a little while to get your order, but the wait is worth it. I usually order two mixed pupusas and that's enough for me (they are served with homemade salsa and cabbage slaw). We have also ordered the empanadas and they're delicious, but it takes them about 30 minutes to make them so take that into consideration. The aguas frescas are made with real fruit and are really good. Plus, you can't beat the price!"], ["Tom J.", "Pretty good pupusas. Have had better, but these are good."], ["Melissa B.", "I love this place and I am so happy it is around the corner from my apartment. After work on July 31st, I had worked overtime and was worn out..so I decided to stop and grab some dinner.  Driving down Nolensville Pike I pass over 30 restaurants, but I knew exactly where I wanted to go..I wanted some Pupuseria...I was pleasantly surprised..they had remodeled inside and now they have some really nice new tables and chairs/ benches..looks so lovely inside. I went to the counter and ordered 4 chicken tacos, 4 steak tacos, one pupusa, and one beef tortas to go..and I waited while they made my request to order..so you don't have a fast food experience..you get HOME MADE ..HOME COOKING done to order...it takes a little while, but it is worth the wait.I love the food. Everything was delicious. When I got it home, I split it with my hubby and daughter and we had a traditional meal from El Salvador...and I love the food!!! you get so much food for the price. The quality of the food is Excellent and it is well worth the price..I can't wait to go back.."], ["Kurt R.", "Very good Authentic Salvadoran cuisine. When available get the caldo de res (beef soup), it is the best around. Fresh made to order cuisine. They are always busy."], ["Rachel M.", "This place is SO. GOOD. I'm not going to try to wax philosophical about the awesomeness of this food; I'm just going to tell you about it and tell you to go there. I'll have to go ahead and admit to my cultural ignorance and say that I had no idea what a pupusa was (nor had I heard of one), but that did not stop me from ordering one. It is meaty, cheesy, tortilla-y deliciousness; that's what it is. They come with slaw, which I normally hate, but this slaw is a little spicy and very good. The tacos are out of this world. Before trying the tacos here, I had recently claimed that another establishment had the best tacos in Nashville. That establishment may have been bumped to second place. They have the requisite Mexican Coke and Jarritos, but you can also get Horchata if that is something you fancy (I haven't gotten up the nerve to try it yet...next time, though). One of the best parts? The price. My husband and I got 2 pupusas, a burrito, 4 tacos, and 2 drinks for about $15. That's right. That's a 1 and a 5 and nothing else after it. We couldn't even eat all of that, either. It's a small place, and the parking lot is small so it tends to get a little crowded around dinner time. You will wait about 15 or so minutes for your food, but I promise it is worth it. Now, why are you still sitting here reading this? Go get some pupusas!"], ["Westnashy Y.", "get the mixed pupusas, they taste the best. The curtido has a  good tang. They have some extra green hot sauce on the table that will give you that extra kick (it's hot!)next time, desserts"], ["Blair S.", "I met a colleague for a lunch and wanted to try something different and something authentic. Pupuseria Salvadorena fit the bill. The service was friendly and patient, even though we were the only non-fluent Spanish speakers in the restaurant.We ordered several pupusas (cheese with chicken and vegetable) and a chicken dish. They accidentally brought me a beef dish and then apologized profusely. I stuck with the adventure and enjoyed it. The the ingredients were fresh and the flavors and textures were a delight. My colleague enjoyed the pupusas and was stuffed after two. I washed my food down with a large horchata and my colleague with a sugary but addictive grape Tropical soda.We finished stuffed, satisfied, and refreshed by our cold beverages. All of this came to under $20 before tip. I look forward to more meals here!"], ["Adam M.", "Fantastic pupusas! They came out piping hot and perfect. Next time the only difference will be that we request extra \"slaw\". I am certain it isn't technically slaw, but it is shredded cabbage with a vinegary sauce that is just great with the pupusas. I had 4. Next time will probably only get 3."], ["Leigh M.", "From the first time I ate here I've been a huge fan and it is definitely my go-to place for pupusas now. The pork & cheese pupusas are to die for, and the 'slaw' they give you to top them with actually has a bit of a spicy bite to it, unlike a lot of places that serve the same thing. It's absolutely delicious.They have a pretty nice assortment of menu items, and so far everything I've tried has been quite delicious, but I keep going back to the pupusas. The prices are very low (2 pupusas will fill you up and cost just a bit more than $4) and the staff is quite friendly. Just to clarify a couple of things, a few previous reviews for this place mention not taking cards and also a bit of a \"language barrier\". For the record, they DO take cards (including AmEx), and the servers I've had when I've been there have had no problem speaking english perfectly fine.I definitely recommend this place for a delicious cheap lunch, excellent pupusas, and some of the best horchata you'll ever have!"], ["Monica D.", "Awkward when i walked in being the onlyblonde English speaking female in the room. The  cashier made eye contact with me and motioned for me to have a seat. The menu is Spanish and English so that is good."], ["Ryan O.", "This place is good!For starters, like most ethnic places, it is insanely cheap. My entire meal of two queso con loroco pupusas cost a meager $4.92, after tax. About $2 seems average for most of the pupuseria spots around town, which is mind blowing considering how filling they are. I will say that unlike La Usuluteca, which is still my favorite, they do not give you chips and salsa with your meal. In all fairness, you really don't need those chips because two pupusas are more than enough to put anyone of moderate hunger down for the count.The pupusas here are slightly thicker, lighter, and fluffier than the ones of which I am accustom. They get bonus points for having loroco, which I hear other spots don't have. I was given a large bowl of curtido with my pupusas, which I can never get enough of. It wasn't as fresh or as crisp as I like but even mentioning that is probably being overly critical.Minor tidbits: They don't take cards, so it is cash only. English speaking staff seems non-existent so there was a bit of a language barrier but who cares, just point at what you want and grunt. They also don't seem to have any beer, so go ahead and get yourself one of those coca colas in a glass bottle."], ["Leia A.", "They have really good pupusas, served with the cabbage salad, at super low prices. And they also have horchata! Love this place."], ["Dirk H.", "Never done the Salvadorean food, so didn't know what to expect. All the other reviews are spot on. Only thing I can add is they do accept credit cards now.Very crowded at lunch on a Friday.I'll be back to try out more of the menu.Very reasonably priced, though the prices aren't on the menu?"], ["Aaron D.", "Delicious!Two carne asada tacos!Revuelta pupusa (beans, cheese, pork)!  (My first experience with pupusas. Man, I have been missing out for 35+ years...)Refreshing curtido (like cole slaw with a kick)!Cinnamon-y sweet horchata!Free entertainment via telenovela!Everything came to less than $7 before tip. (Others have said cash only. I didn't try a credit card, but I'm going to assume that greenbacks rule here.) Reasonably crowded. Seems popular with a demographic that should be able to judge the authenticity of the cooking.I hope to go back soon and often.Why not 5-stars?- The benches are comfortable, but the metal chairs are a little...industrial. On the other hand, they do look indestructible.- I was not blown away by either the verde or rojo salsa. But maybe El Salvadorean salsas are supposed to taste different than Mexican salsas? I shall return to investigate further."], ["Laura B.", "Went here for breakfast, actually haven't tried the pupusas yet. Service was friendly, I speak Spanish but they brought out an English menu for my friend. Horchata was great. Their card policy has changed, they did take my credit card. Breakfast was homemade tortillas, beans, avocado, crema, eggs, and cheese. Delicious. Only complaints were the seating was a little uncomfortable, and the menu listed breakfast at $7 but she charged us $8, saying an updated menu is coming soon. Other than that, great!"], ["Brittany O.", "My fiance and I were looking for a mexican restaurant on Urbanspoon and thankfully Pupuseria Salvadorena was miscatagoriezed.  The food was delicious and well-priced.  I had the chicken quesadillas (because I am not very adventurous) but my fiance tried the pupusas (beef and the loroco).  Until dining at this restaurant, we had no idea such a wonderful treat existed.  The horchata was amazing and creamy, not watery like many restaurants, although this may be a difference in the El Savadorian and Mexican ingredients.  The server was very friendly and we were well entertained by Univision!  Would definitely eat here again!"], ["Pilar A.", "Went there on Sunday night. There wasn't very many people at all. I ordered one cheese pupusa and a mango juice to go. I waited 39 minutes for the order to be completed. The pupusa was good but definitely not worth waiting 39 minutes. I'm not coming back."], ["Rudy L.", "SOLID LOCATION FOR SALVI FOOD. This place reminds me of my mom's home cooking. The owner also has a small grocery store adjacent to the restaurant."], ["Melissa L.", "This is my favorite pupusaria, hands down.  It's just luck of the draw as to whether or not you get someone there who speaks English very well but don't let that hold you back.  They have pupusas with your choice of cheese, beans, or pork or any combination of those or they have cheese and loroco.  They serve it with a bowl of curtido and the typical red sauce.  Their curtido has a little heat unlike most versions I have had but it's good.They also have great carne asada tacos.  The carne asada plate is also great.  They have a great really hot salsa verde but it's really more of a creamy hot jalepeno sauce.  And talk about cheap!  One pupusa with everything, one carne asada taco, and an imported coke is around $5."], ["Sarah D.", "Looking for a good, filling ethnic meal for $10 or less? This is your place.Pupusas are popular in Central America, particularly El Salvador.  Pupusas are round, flat, fat pancake - like items made from masa de maiz. They are stuffed with a variety of things including cheese, beans and cheese, pork and so on.  They are lightly fried and served with a cole slaw type mixture that you put over the pupusa. You can also add a little hot sauce.I had two bean and cheese pupusas and one chicken taco for less than $6. The pupusas were wonderful and not greasy. The refried beans were very tasty and not from a can. The chicken taco was authentic - on two small corn tortialls and a little onion. The chicken was full of flavor. One of the best I've had in town.  My dining companion had three pupusas, a Coke with sugar (not corn syrup) and a pastry for $10.I will definatly return as the food is wonderful and the price is right.  The atmosphere is typical of so many ethnic places with plain tables and chairs and a TV playing Spanish language soap operas.  The folks were very nice. We had no problem overcoming the language barriers. The menu is in Spanish, so is you are very uncertain, take a friend that can read the menu.Welch is the first street on the right on Harding Place after crossing Nolensville Road and after passing the Walmart.Note - bring cash as they don't take any plastic."]], "Rolf and Daughters": [["Bethany W.", "The best Nashville restaurant we've experienced! We've been here for happy hour and for a full dinner. Our happy hour experience left us wanting more; the cocktails are finely crafted, and the salad we shared was impeccable. For dinner, we split a few appetizers, all of which were outstanding. My boyfriend raved about his squid ink entree, while my chef's special grilled eggplant was the best eggplant I've ever had. It was seared so well and was accompanied by chickpeas, okra, and a light lemony sauce. In other words: Trust the chef. We capped the evening with a dessert, which also was delectable.A word to the wise: Make reservations well in advance. We called in one afternoon looking for reservations that evening. The maitre d laughed on the phone. This was a MAJOR turnoff for us, but I'm so incredibly glad that we overlooked that."], ["Cecille R.", "While planning a girls weekend in Nashville, this restaurant kept popping up on numerous \"Best of\" and \"Must Dine at\" lists. I was a bit apprehensive based on the menu online. It's not the kind of food I eat on a regular basis but I was game for something different.   I will advise that you need to make a reservation in advance . We were coming on a busy weekend and they only had a 530pm dinner reservation available for a Friday evening. It was early but we snatched it up.   The restaurant is located in Germantown and I would give yourself enough time if you are driving. Parking is off street, no actual parking lots. You may have to circle around the block or park further up the street .   The restaurant has that industrial sort of feel like it used to be a warehouse and then was transformed into a restaurant. There is a red brick wall towards the back with a bookshelf filled with books from left to right. We landed one of the tables against the wall but there are also a few communal tables in the middle as well as the bar area. The menu is best enjoyed when you order a bit of everything and share. The dishes are not your traditional \"full sized\"  so keep that in mind. Rather than quantity , they are all about quality of menu ingredients here.  With four of us , it allowed us each to have several bites to try of each dish. The dishes were beautifully executed and reminded me of the kind of dishes you would see being created on Top Chef. Also make sure to enjoy a specially handcrafted cocktail off their drinks menu. Service was exceptional and very professional.  While this probably wouldn't be somewhere I would eat regularly(based on the price point alone), it was nice to try something outside of what I'm used to and away from the touristy part of town."], ["Laura H.", "After a lot of traveling the last couple months, it was so nice to walk into Rolf and Daughters and be greeted with a warm smile and impeccable service. Welcome home to friendly Nashville! We had the crostini with butter beans and beef tartare as appetizers. The crostini was a thick slice of bread, toasted just slightly to retain the soft center. It was topped with a butter bean puree and sauteed sweet yellow peppers. It was my favorite dish of the night. The beef tartare served with sunflower-topped crisps was very good, but it did have a hint of a spice I don't love, like caraway seeds or fennel. It was not so much that it kept me from eating more than my share, though!Our entrees were a bit disappointing. Both were very salty, and I'm a huge fan of salt, so words I never thought I'd type. We had the garganelli (the better of the two) and rigatoni. I picked the rigatoni as it comes with lamb pancetta and broccoli rabe, and I expected my mind to be blown. It was very, very salty making it hard to eat much of it. I also like noodles cooked al dente, but these were almost too undercooked. The garanelli with pork ragout, while also too salty, was better. The ragout was rich and the noodles perfectly cooked. I wanted to love Rolf and Daughters' food more than I did, but will definitely visit again. They have great, friendly service and a nice variety on their menu."], ["Lawrence C.", "We decided to sit at the bar this time for dinner,  even though we had a 6pm reservation for dinner. We started with the delicious THE ABSINTHE FATHER, a concoction developed by Ed Kolb, one of the master bartenders.INGREDIENTS:2 oz Belle Meade Bourbon.5 oz ginger syrup.5 oz Steen's Sugar Cane Syrup.75 oz fresh lemon juice2 dashes orange bittersrinse of absinthe for the glassDo yourself a favor and try it. ...you'll be hooked.Rest of dinner was again outstanding.  This remains my #1 restaurant in Nashville!"], ["Dan J.", "Did not get a chance to take photos of all the savory foods. Busy enjoying every plate of flavor fusions. Got too excited having a little bit of most everything from lamb, testa, squid, fish, cauliflower hummus, carpaccio or tartare. When it came down to desert, we got greedy and ordered all three on the menu. So that one, I was able to take a photo. Enjoy !"], ["Shushu C.", "I had overwhelming expectations after hearing from a coworker that this was one of the best restaurants she went to while visiting in Nashville. Overall the experience was very good, but fell short in a few aspects.  The atmosphere is very nice...with outside seating and gardens/lighting. The view is not the best...but considering the area there is not much around to look at anyway. We started with bread and seaweed butter and salt. I am not going to say that they 're robbing you..but they're robbing you. The bread was good and the butter was good, but I didn't taste any of the seaweed. The waiter said that the seaweed was added for texture purposes......umm...right. I ain't salty or anything...ha...ha....ok anyway the bread with salt was good. I think with regular butter it would've been the same to be honest. Now charging for bread at a nice restaurant is a nono...Next...Chicken liver pate. It was probably my favorite part of the meal..I just love liver. The seasoning was great..but after 1 bite it started feeling very thick and dry with toasted bread so I think they could've prepared it differently to foil the texture.I got the squid in capellini, which was way too overhyped. To be honest I had a few bites and was a little unimpressed. The crispy fried bits (onions?)were everywhere and was good for taste but just ended up being too much on every bite. The sauce was also too simple, which made the dish just lacking in depth. I've had very good squid ink pasta..so personally I didn't prefer Rolf and Daughters version....But the pork ragu was...amazing. It was perfectly balanced and seasoned and I wanted to keep eating it. I really have mixed feelings about this place. It was just a few steps short of a 5 star review. We ended with the oreo dessert. Whatever the restaurants like jto do it to deconstruct whatever..idk i just still tastes like oreos. They made their own, but tasted a little too healthy. All in all, I was debating a 5 star review but..some points of this restaurant really deterred me. Anyway, this restaurant is definitely still worth revisiting and I will be back to see how they will have changed (if at all)."], ["Ashley T.", "We came here for dinner with my in laws when they were in town visiting. We called ahead on a Friday to ask about reservations and my mother in law was told that it wasn't busy so we wouldn't need one. I found that hard to believe but we went with it. We arrived around 7pm and the patio was packed, as well as the walkway leading up to the restaurant. We were told it was over an hour wait and when we asked about calling ahead, the hostess assured us they don't take reservations on Friday nights. Oh well. We had heard good things about this place and knew anywhere we went would have a wait. So we waited for about 45 minutes and our table was ready. We were seated at a long, community table in the middle of the restaurant with strangers. Not ideal when trying to catch up with family, but it was fine. The service was great. Our server was very friendly and knowledgeable of the menu. He gave us his recommendations and we ordered. My mother in law and my husband both ordered the pasta with red sauce and my father in law and I both ordered the trout. Ha! I don't remember anything spectacular about the pasta, but it did taste fresh. The trout was cooked perfectly and presented beautifully, but the parsley was overwhelming for me. Otherwise, this dish was unique and delicious. The atmosphere is cool and they were playing some pret-ty solid 80s country songs. We could barely hear each other to talk across the table, but the music was a fun touch. Not really what I assumed I'd be listening to while eating the most beautiful piece of trout I've ever eaten. HahaWe ordered 2 deserts on the menu to split, one was some kind of chocolate and coffee desert and the other was fruity. (It's been a hot minute since our visit so I'm drawing a blank). Both were really good. I was full so I didn't have much but otherwise I would have probably licked the plates clean. I would like to go back on a special occasion and try other things."], ["Mitch E.", "I hadn't planned on hitting up any part of German town while in Nashville. After debating where to have my final dinner down there, it was settled. We would be going to German town. Rolf's did not disappoint. It was an amazing meal, at a high quality establishment. Not much of a wait on a Saturday night. Waited by the bar and got a few drinks. Their Manhattan was solid. Once we sat we decided to split lots of things on the menu. All of which was very tasty. My favorite dish here though was their bucatini with octopus. I was skeptical of how well a place in Nashville would make a great pasta like this. They shot down any wonder I had. This was some of the best bucatini I've had.  My only complaint is that the meal knocked my friends out cold with a serious case of the itis. Come here hungry, and leave happy."], ["Kristin Marie S.", "Oh man, I hate to give it three stars, but there were issues. The food was WAY too salty. Everything, everything, minus dessert was too salty. Without the over-salting the food would have been 5 stars, no doubt. They use sea salt so you really need to use less. We went for our one year anniversary and this is what we ordered.1. Sourdough seaweed butter - not my fav, but I don't like seaweed. The hubbs loved it. It came with salt so I can't comment.2. Beef tartar - fantastic cut, presentation was wonderful! (too salty)3. Garganelli verde - Amazing, I LOVED it! (too salty)4. Roasted chicken - This I especially loved because it's like chicken piccata, but better (too salty)5. O&S tart with PB mousse - Out of this world! (No salt issues here)They accidentally put in an order of liver pate for us so we had that too. Again, wonderful, but too salty.Other thoughts:I feel like they need to expand and add a back room for dining purposes. I felt like I was eating in a bar, which I was. It's great if you want a loud dinner with people milling around you, but if you want a quieter meal this is not the place for you. I hope one day they can build out (obviously this is only if they want to).I loved the space (beyond the noise issues). The staff was fantastic. Our server was attentive and the food came out at a great pace. They treated us really well. I have nothing bad to say. The drinks were great too. They were made well, the bartender was pleasant despite the high-volume of people. He really made us feel welcome.If they can get the salt thing under control I would list this as one of my favorite places to eat in Nashville. I wouldn't necessarily come back for a quiet romantic meal, but I would come back with a group or to celebrate a new job or something. An event where you would want to get lively."], ["Yoonie Y.", "Rolf and Daughters is an amazing \"treat yourself\" meal and experience! I totally fell in love with this place from the moment I sat down. I had called about 2 weeks in advance to make a reservation for a large group at 6pm on a Thursday night. Unfortunately we could not grab a table outside but the inside is just as charming. Our server was so nice and explained the menu thoroughly. Cocktail menu was extensive with cute names like \"The Frank Lloyd Wrong.\" Portions are on the smaller side, so our server recommended a pasta for each person and to share a few entrees. We started with the bread and seaweed butter because I'd heard rave reviews. It was ok... The pork ragu was life-changing! Hands down one of the best things I've ever eaten. The squid ink pasta was also delicious. I can't say I loved my dish (a lamb sausage pasta) as much as I liked the others I tried, but the pasta was still cooked perfectly. I can't wait to come back next time I am in Nashville and buy a \"Pasta Manana\" t-shirt! This place is definitely a MUST if you are coming from out of town."], ["alan c.", "Thanksgiving Week 2015: visiting family here for the holidays and we showed up with a big party of 10 for an early dinner. Interesting menu as pointed out by others,...pastas and starters are the strengths. The seaweed butter and salt were interesting but I must admit,...at this price point we are accustomed to getting bread with the meal,..at least on the Left Coast were we live. Charging $5 for a few slices seemed off to me. The desserts were really nothing special and just brewed coffee (no espresso etc) left me wanting more. Good effort and apparently very popular in Nashville,....and in a cool location (old converted warehouse etc) but for $20+ a pasta dish a few more bites in those big bowls and throwing in the bread might be nice. Just saying. Overall solid effort. Stick with the starters like and the pastas and you'll be happy."], ["Michael U.", "Items Selected:Orange Shrub with LimeSourdough with Seaweed ButterSpring Onion Fritto Misto, Lemon, BottargaCrostini, Stracciatella, Watercress, Olio NuovoSweet Potato, 'nduja, Green Onion, Yogurt, LimePotato Gnocchi, Morel, Spring Garlic, PiaveSweet Potato Agnolotti, Mustard Greens, TestaSquid Ink Campanelle, Florida Squid, Shrimp, 'nduja, Basil, BreadcrumbsStumptown Cold BrewMeyer Lemon and Whole Grain Tart, Pistachios, Olive OilO+S Chocolate Cake, Coffee Panna Cotta, MilkStrawberries, Rhubarb, Almond, CoconutUnable to predict an arrival time for Nashville on a Monday during which several of the capitol's best restaurants are closed, it was with good fortune that walk-in only Rolf and Daughters was found to be only 75% full just after 7:00pm and taking a seat at the far end of the communal dining table with several seats separating us from the next party it was to a meal of almost universal excellence that we were treated, the hippest place in town also serving some of the city's best food.Currently helmed by former Gwynnett St. Chef Owen Clark, a man who stunned me with his creative cuisine in Brooklyn during an April 2013 meal that still ranks amongst the most memorable in the borough, the sharable plates at Rolf and Daughters see the young toque revisiting familiar territory with a focus on local produce and bold spice profiles amidst modest amounts of protein and suggested to be enjoyed in a series of three courses by a server extremely well versed in both ingredients and technique one would be hard pressed to name a single savory that could have been improved, even the non-alcoholic orange shrub proving to be the sort of fresh flavor I love as light notes of drinking vinegar lingered beneath a bubbly top note of citrus and soda.Inquiring on portions and preparations largely to maximize sampling of several plates amongst our party of three it was with house sourdough and seaweed butter that the meal kicked off and with vegetal brine helping to balance out the flavor-forward starter this is one bread most would benefit to pay for, the crisp crostini draped in watercress, stretchy cheese, and fresh olive oil equally simple yet delicious with an almost absolute lack of sweetness allowing pepper and buttery notes to flood the palate in a surprisingly unrestrained way. Moving on the flavors less subtle, it should seem rather obvious that fried spring onions dressed in citrus and briny shaved roe presented a significant upgrade on standard restaurant rings and, although not exactly large enough to share amongst three as a few bites will only leave the diner wanting more, the tender rounds of sweet potato topped in spicy sausage and those same onions were absolutely brilliant, the heat only arriving on the finish as yogurt tinged in lime presents an up-front bit of tang.Transitioning next to pastas, all made in house with ingredients that sang of farmer's markets in the spring, it was in three plates that appetites were invested and although the gnocchi was a bit softer than purists may prefer the addition of nutty cheese, fresh garlic, and earthy morels provided a depth of flavor rarely seen at 'hip' restaurants, the sweet potato packed pockets of pasta draped in house-cured testa somewhat resembling the flavor of stewed collards while the al dente Campanelle once again found Calabrian pork working its magic amidst a jumble of sautéed seafood given extra texture by just enough breadcrumbs to make it all work.More than impressed by savories, and fondly reminiscing about desserts from my Gwynnett St. experience, it was with a 'one of each' order from the sweets section that the meal would conclude, and paired to Stumptown's bold coldbrew the results were nearly on par with the rest, only the slightly over-applied coconut on a chilled plate of strawberries and rhubarb seemingly out of place, while both the subtle citrus tart crowned in nuts and bitter panna cotta topped in crumbles of cookies and sweet milk 'powder' were exactly what I'd expected - a study of contrasts without compromise ready to challenge and surprise."], ["Jean K.", "Half of a chicken is a hefty amount of protein for one meal, regardless of how tasty it is. And yes, the pastured chicken at Rolf and Daughters is delicious, but for $24, a wee bit of vegetables on the side would be nice.The menu was not well thought out and didn't list entrees separately. We were told that the beef sausage was an entree. However, it was served in a salad bowl. One sausage sliced into several pieces and covered with lettuce doesn't seem like an entree, particularly when the chicken entree was half of a chicken, albeit nothing else. I would have called the beef sausage a small plate or salad and the chicken a large plate suitable for sharing since there were no accompanying sides.Perhaps a more thoughtful menu format would have separated entrees from small plates rather than simply listing every item in ascending order by price. An untitled pasta section was separated only by a partial squiggly line. Besides the pasta dishes there were 4 entrees to choose from: brook trout from Florida, beef sausage, pastured local chicken and heritage pork. I wanted fish but since it wasn't local, I opted for the local pastured chicken.The chicken with preserved lemon and garlic confit was delicious. The skin was perfectly crisp and the meat was tender and juicy. Again, it was half of a chicken with no sides for $24. Perfectly cooked and delicious, yes, but it's still only chicken, even if it's pastured. It wasn't even organic. I would have preferred a quarter of a chicken with a couple of sides for that amount.The sourdough with seaweed butter appetizer was tasty but would have been better served hot or at least thoroughly warm. If the bread was complimentary, I would have overlooked it, but it wasn't. I've had complimentary bread, served hot and with infused butters that were better.Overall, the service was excellent, the ambiance trendy and whispers farm to table but in reality may be otherwise (trout from Florida?), the menu needs work, the addition of even one veggie to a $24 chicken entree would be nice and warm tap water in a pretty bottle is still warm tap water. Sorry, RaD, you're going to have to start living up to the hype and actually earn that 4th star."], ["Hye Eun C.", "I had heard so much about this place and finally had the opportunity to come. What a charming restaurant. My bf and I ordered: crostini with chicken liver pâté, spring onions with lemon zest, squid ink pasta, pork chop, and o+j coffee pennacotta. All the dishes were good, but my favorites of the night were the crostini and squid ink pasta. The crostini was flavorful with the sweet chicken pate, although I was a bit surprised that it wasn't warm or precut. The squid ink pasta had bold flavor and the seafood taste was obvious. Very cute atmosphere, especially the outside  patio area, and the service was great. The amount was decent for the price, as well, although it definitely is pricey. Would come again to try the other offerings."], ["David A.", "This place is off the charts great. Sat at the bar with my daughter and had a fantastic meal. Our bartender (and server) was fabulous. He whipped up some killer cocktails and recommended incredible food.  I have had some great meals in Nashville and I will but this place up against any of them.My daughter is vegetarian and we had much to choose from.  We love the winter greens, a beet and farro salad, and some incredible pasta.The preparation was fantastic. A memorable meal in a great spot during a weekend trip with my daughter. A perfect way to end our visit.Can't wait for our return visit."], ["Jay R.", "This place is incredible, plain and simple. We did not have a single average dish, everything was extraordinary. From the delicious crostini with bell peppers to the heirloom tomato and mozzarella to the main dishes of summer squash and ricotta, pork ragout with green noodles or the famous squid ink pasta, everything was brilliant. We ended the meal with the deconstructed chocolate cake, it was the perfect ending to an excellent meal. We sat at the communal table, which is a bit of a unique experience, but it ended up working out great. I will definitely be back, no question."], ["Jess ..", "The food could not be better. More inventive than I expected and so so good. The staff behind the bar was so friendly, down to earth and all about their menu. Ambience was perfect. Great idea for a date. Great bar and drinks."], ["Jane S.", "Every so often, you visit a restaurant that requires more time than usual to write a review - first, because there's too much goodness to write about, and second, you want some time to keep thinking back to the experience so as to write as holistic of a review as possible. Nearly two months have passed since I dined at Rolf and Daughters, so it's a restaurant that falls into this category. In terms of food and interior style, Rolf & Daughters is like most of its \"trendy restaurant\" counterparts. Blank&blank name - check. Badass industrial meets rustic chic space - check. Attractive, tattooed servers - check. Attractive, want-to-be-seen dining patrons - check. Food at places like this is hit or miss, so I was BLOWN AWAY by not only the deliciousness but also the creativity of the menu. I ordered the squid ink canestri, my sister got the gnocchi, and my cousin got the rigatoni. All three were equally delicious; I really was unable to pick a favorite. Hands down, the best pasta I've ever had. Other pastas I have from now on will probably pale in comparison to the three I tried here. R&D was one of the, if not THE experience, that completely made my trip to Nashville. R&D gets 5 stars for being amazing all-around!Tip: If you don't have a reservation, arrive right at opening. There was already a line of maybe 10 people ahead of us, but we got seated right away. We just had to be out within an hour and a half to clear our table for a reservation. We didn't feel rushed at all."], ["Emily T.", "The best pasta I've found in this town. It's worth the price - don't let anyone tell you differently. And if someone tells you don't NEED Squid Ink Pasta - get rid of them. You don't need that kind of negativity in your life. I actually NEED the pasta in order to live. It's that good. I haven't tasted a pasta I didn't love. The appetizers are slightly over priced but still delicious. The waitress was able to make drink selections based on my picky palette. She hit the nail on the head. The entrance is a little tricky to find but just follow the twinkling lights and you're close. Make a reservation - they get busy."], ["Janet A.", "So disappointed, I brought my daughter here for her birthday neither of us have ever been prior. My daughter and I requested a couple of simple changes to an entree to meet dietary needs only to be told the Chef is funny that way and set in his ways he will not prepare his meals differently than described on the menu. This is the only restaurant I've ever been to that the Chef did not try to accommodate request for the customer. The Hickory House at the Gaylord blows this place away in all aspects from the quality of the cuisine to the amazing customer service. Also, Urban Grub was much better than this place with amazing food and no problem making a few changes to the entree."]], "Germantown Cafe": [], "City Winery Nashville": [], "Holland House Bar & Refuge": [["Ann E.", "Very interesting decor. We had cocktails and shared some appetizers. The duck wings were excellent."], ["SM S.", "-Get there early for parking (or go late)-Full menu opens at 5pm/ drinks and apps hour prior-Classy vibe, yet casual spirit-Server was very attentive but let us sit and talk without interruptions-Pork tenderloin was phenomenal (must order)!-Will be back, no doubts"], ["Elise D.", "Such a sad experience. Holland House used to be one of my favorite places, but the service tonight was so abysmal I probably won't be coming back. It took an hour to get seated while we watched multiple open tables remain empty, all the while receiving eye rolls from the hostess.  There were only 2 bartenders on a Saturday night and one wasn't even working - he stood in one spot and made his friends drinks all night - leaving the lone bartender to struggle to attempt to keep up with the entire bar. Thank goodness Milo makes perfect drinks (hence the extra star). I was able to get 2 drinks in 3 hours. Not a good night at Holland House."], ["Jenna C.", "Coctails and an entree dish are a must. Craft cocktails are strong and tasty. Entree dishes are best, large, flavorful, and also a great variety of tastes."], ["Bridget H.", "The Good:1. The cocktails- YUM!  Terrific, creative selection.2. The appetizers... the truffle fries had terrific flavor, but half were a bit soggy.  I wish they were all crispy! The Bad:1. I wasn't really excited about any of the entrees.  Though, my short rib was lean and tasty.  Still, this wouldn't be my go-to dinner spot.2. FYI - It gets very crowded.  Reservations are strongly recommended.The Verdict- A great spot for drinks and apps"], ["Errol M.", "Was it the silver moon sparkling, so close and bright?Across our table, this quiet and perfect night.With smiles and laughter, diffused by candlelight,When I started thinking, \"This is one really cool place.\"************************Hey, I like smoke-filled dive bars as much as the next guy, but the Holland House was just a bit more my style. A beautiful patio, wonderful ambiance, and an easy place to relax and chill for a long time. We had eaten before arriving here, so the four of us shared a cheese board, clever cocktails, coffee, and the pleasure of each other's company. And sometimes, that's all you need. The Holland House is a true East side oasis in Nashville, and should be on your list."], ["Susie B.", "I was very disappointed that two menu items were not available last night 7/17. Server was greasy but good was not up to par!"], ["Lauri S.", "If you like good prices, great drinks and a varied menu...don't go here. What they lack in menu options, they make up for in hipsters crowding the bar. If you want server who cares about serving you and won't spend all their tips on a new tattoo for their entitled millennial life and pronounce gourmet food names correctly, look elsewhere. Not my cup of craft-brewered tea."], ["Chris B.", "This place is like an 8 or 9 out of 10.  Food was really great.  Here's the breakdownFried chickpea cake:  simple, nice flavor.  Topped with a light sauceMussels:  great broth made the dishFrisee something salad:  beet heavy...which is a good thingPappardelle w/ shredded leg of lamb and ricotta cheese - excellent entree.  I asked if the pasta was made in house and the waitress said it wasn't.  They get it from Alfresco.  At any rate, very tasty.  My girlfriend and I left satisfied but not stuffed.  Service:  our server was Danny (spelling?  not sure because Danny was a girl).  Friendly, prompt.Atmosphere:  sat inside at an intimate table towards the back bar.  They have a really elegant inside bar.  But I think their outdoor patio is the best of all their options.  For some reason, we never eat at the Holland House.  We never even think to go there most nights.  But we did and I wonder why we don't put it in the regular line up.  I docked 1 star because they didn't make the pasta in-house.  GF quote \"Simple, pleasurable, tasty\""], ["Shruthi L.", "This was one of the first cocktail houses I was introduced to on my visits to Nashville before I permanently became a bougie ass Nashville resident. I've been back on many occasions since then & I love the buzzing energy in this place. The people that work here are knowledgable & super nice as long as you aren't being THAT drunk idiot. Jk, they'd still be super nice. They've revamped their menus over the years so if you haven't been in a while, there are lots of delicious new things to try (mmm, hot chicken & truffle fries) One of my new faves, among others, is the La Paloma. Also, no more Thursday happy hours BUT they offer a $6 classic cocktail menu all of the time. Yay, good news! Heads up if you're offered a choice of alcohol and you're trying to stick to the $6 menu: it can hike up the price. I wasn't aware of that last time I was here & paid $20 for two gin gimlets. Don't get me wrong, it was a GOOD drink..just caught me off guard when the bill came. If you're thinking of doing dinner at this place, I'd recommend doing it early or making a reservation just to be safe. It can get pretty crowded & parking gets tricky in this area. Also, their patio is awesome on the right kind of night."], ["Josh H.", "Holland House seems to have gone downhill a bit. My first dining experience there was flawless, but there have been some misses recently. I haven't enjoyed the food or menu as much since Chef Kristen left. Service is generally just okay. I still really like the ambience and decor, and the addition of the outdoor patio was a hit in the warmer months.All in all, Holland House is a solid 3. I recommend it, but be sure to temper your expectations."], ["Cheyenne C.", "Used to love Holland House. Unfortunately, the mighty have fallen. They've gotten a new (very innovative) chef! While they now offer some Middle Eastern dishes that you can't get many places in Nashville (pro), they now only offer Middle Eastern dishes (con). Went there a week ago to find even the burger was now Middle Eastern. Really bummed because I enjoyed Holland House a lot. The variety of dishes and spices was key. Now it's become a Middle Eastern restaurant with way under-experienced bartenders. Sad day!"], ["Rachel D.", "Turned up around 6.15pm on a Sunday without a reservation and no issues with getting a table.We ordered the crispy black rice to share as a starter and my gosh it was good. Highlight of the night.The pork shank was delicious also. We weren't huge fans of the paprika potatoes, but it's possible we just don't love paprika enough - they really were covered in it...Good range of cocktails, friendly service - if we went again we'd probably choose to sit at the bar as we always enjoy watching the cocktails be created and chatting with the bar staff, and the square bar is perfect for that.One of the more expensive dinners we had in Nashville, but worth it was the quality and quantity of food."], ["Megha M.", "After hearing so much about Holland House , I finally made it here on a Saturday night with some friends. I was really disappointed - with not only the food , but the service and the restaurant in general. The place was burning up and clearly had no air. The service was really really slow , and our server didn't know the menu and wasn't able to make any recommendations. When we finally ordered , half the menu items were unavailable. When we did pick from an already limited menu - we weren't happy with the food that arrived - it just wasn't special! Very disappointed !"], ["Lindsay B.", "What a wonderful place in East Nashville- my husband and I had a lovely late dinner here on a Friday night. Reservations were a bit hard to come by when we made them same day, so I'd recommend on a weekend trying to make reservations early or plan on eating early or late- but it was totally worth it. My husband and I enjoyed a cocktail from their extensive cocktail list- and they had a good variety of beer and wine as well. We started with the cheese plate- which was wonderful- one of the best cheese plates I've enjoyed at a restaurant. When we ran out of the crackers to go with our plate the server asked if we wanted more and had them at the table in around a minute. From there, I chose to enjoy the mussel dish (an appetizer) as my entree because I love dessert. This mussel dish included chorizo in a tomato sauce- and it was absolutely delicious! We finished our evening with the cheesecake for dessert- it was lovely. I enjoy cheesecake when the crust is not too sweet (because the cake itself is very sweet)- and this was exactly what I like. Several people commented in their reviews about problems with service- but we did not have any trouble when we ate at 9 pm on a Friday. I would highly recommend this restaurant- it is absolutely beautiful inside and out!"], ["Christopher B.", "Drinks are great, and the back party room is an unknown gem in Nashville for a small party. I've eaten here three times with friends and family and each time the food is a little bland and flavorless. For the price point they could do a lot better. The atmosphere is very comfortable and interior has a nice rustic feel. Just wish the food was better."], ["Jessica S.", "I've been here a few times and decided to re-write my review after my most recent experience. I really do love the atmosphere of Holland House but I'd have to say that there are better restaurants to visit in Nashville. Here we go...So we arrived at the time of our reservation and were promptly seated. Our waitress was nice and one member of our party decided to order the 5 course meal. After she took our order, we realized she didn't ask how my friend wanted her steak cooked. Halfway through our appetizer, we told the waitress about this and she said \"well, you know, the chef will make it just right\". Again, she had a chance to ask my friend how she wanted her steak cooked, but didn't. Needless to say, the steak came out and it was not cooked the way my friend wanted it to be. She couldn't even finish her meal. From that point on, the waitress seem to have lost her \"nice\" personality and turned into a cold/rude person. Sigh.  On top of that, we sat at our table for 2.5 hours waiting for water and our cocktails. I understand that food takes a while to cook but our waitress rarely came by to refill our water. It was truly a frustrating experience. Everyone else seemed to enjoy their food but like I said, there are better places to eat in Nashville, with friendlier staff. It really kills a meal when someone cannot finish their food because of the way it was cooked. Holland House, I love your cocktails and overall atmosphere but I don't think we will be meeting again in the near future. Maybe next year."], ["Clara C.", "Ugh I want to give a 2.5 star review. I'll bump it up because I think what we were looking for and what this place actually is did not align. Anyways, to keep it short and sweet--food is whatever, drinks are good, service was meh."], ["Cari J.", "I have been here many times for drinks and small plates, and every time it was perfect. But Thursday night was the first time I had dinner. OHMYGOSH. I ordered the KLD farm burger because I'd been dying for a burger for weeks. Best decision I've made in a long time. But before I get to that, I'll start with starters. I ordered a cheese plate for the table, which was wonderful and exactly what I expected. I also didn't want to drink that night since I was driving, so I asked them to make me a mocktail of their choosing. Don't know what was in it but it was excellent! And at only $5, it was a steal. And now...back to that burger. It came with their amazing fries (score!). The meat was the highest quality, most perfectly cooked meat I've ever had in a burger. I mean, PERFECT. It had slightly melty Gorgonzola, caramelized onions, a fried yellow tomato, arugula, a fried egg, and deliciously salty, smoky ham. I added some whole grain mustard, because burgers need mustard. The bun was perfectly chewy and didn't break or tear even with all the messy ingredients. Best burger I've EVER HAD. Ever. And I've eaten more burgers than I can't count in more wonderful restaurants. It was a wonderful evening with great food and drink, and one of the prettiest and most relaxed environments in the city. If I lived closer, I would be here at least once a week. Keep it up, Holland House! You're perfect just the way you are."], ["Chelsea J.", "I have frequented Holland House for a drink and app while waiting the eternity that is the wait to get seated at The Pharmacy next door. Luckily, Holland House has great bar seating and excellent cocktails. I recently came here for restaurant week and was a tad disappointed. I would give 3 stars for my restaurant week experience, but considering my experiences in totality, I decided to give 4 stars overall. The two of us arrived for our reservation and we were told our table wasn't ready yet, even though empty tables for 2 were visible from where we were waiting. Then other groups of 2 who came in after us were sat before us. This peeved me. As a previous slave (aka waitress) to the restaurant industry, this doesnt make sense to me. Once we were sat (maybe the hostess noticed my unblinking stare at the empty tables) our waiter was prompt and our appetizers quite good. I got the green bean salad and would come back to Holland House for this alone. I ordered the pork brisket and while the sauce, and accompanying mashed parsnips were delectable, the pork left much to be desired. I know how hard it can be to cook pork, and sadly Holland House fell into this trap and served dry pork.We shared the bourbon and pecan cake which was really good but I could have eaten the whole thing in a single bite. For a $10 dessert is it unfair to expect at least two bites? Not sure I'll come here again for a meal, but I do enjoy their starters so I'll be around again."]], "Rumours East": [["Jesse F.", "Went here for New Years Eve, and was pleasantly surprised by the atmosphere. I hear \"remodeled Victorian\" and automatically think \"cramped and awkward\". Though it is a small restaurant, it was more than functional, and I thought the design and decor made excellent use of the dining space. The bar looked like a cozy place to get a drink, although I didn't have the opportunity this time around. I will note that the parking situation worked out great (close, on-street), although I fully acknowledge this may not be the case for non-early birds, residential roads being what they are.I did the NYE menu, which you would naturally expect to be limited + overpriced, and it was. Not that the $55 prix fixe was unreasonable for the occasion; in fact, it was the least expensive option I could find. But the pairings (4) were $35 extra, and the portions were definitely on the small side. As a comparison, a recent meal at the nearby Lockeland Table was similar in price and quality, yet must have been 3x the amount of food. Granted, I didn't go to LT on a holiday, and the menu there skews more traditional than contemporary, but a night at Rumours East will likely conclude with you digging in your pantry when you get home. The food itself was really excellent, and though pricey, the pairings were enjoyable as well. Since it was a one-off menu, maybe it's pointless to recount specific dishes, but I thought the (literally bite-size) fried quail and pilaf was a stand-out. Our dessert disappointed -- the torte was great, but not what my wife expected; hardly Rumours' fault. My carrot cake was pretty dry, though I did eat every bite, so it clearly wasn't offensive. I hope my comment to our server wasn't either, I just thought dessert didn't hold up to the otherwise lovely meal. Rumours East would still be in the \"special occasion\" category for me, but I might not be so afraid to snack in advance."], ["Cheyenne C.", "Low-key place in Nashville. The menu is a bit overpriced considering the food isn't as good as other restaurants in Nashville at that price. The food here is very basic... Long, delicious sounding descriptions on the menu, but the recipes are actually very simple. Cheese plate is just ok. Decent wine selection but not a terribly knowledgable staff. Nice staff, however. The decor and ambiance are great! If I could I would have given 3.5 stars."], ["Carol K.", "After driving around Nashville for about 30 minutes looking for a place that was open on a Sunday night, my friend had an epiphany, asked if I liked seafood and shot over to Rumours East.Now this should have been my kind of place- historic old home that was renovated to be a classy little restaurant, beautiful patio in the back complete with plenty of heaters to extend the season and a fascinating curved bar that made me just want to hop up on a stool and spend the hours sipping wine and catching up with friends.   They also use an interesting wine keeper system that keeps the wine fresh and at just the right temperature until it is poured.All sounds great, right?  That's what I thought.  But there was no room at the bar for us, and I was a little worried that it would be too cold to sit outside (my mistake) so we were seated in what probably used to be the living room of this old house.Now they have done a nice job with the space- with hardwood floors, contemporary furniture and an exposed brick fireplace.  But given how the rooms flow- we ended up being seated alone in one room- the fireplace was not lit and it felt like we were at the \"kids table\" at a family dinner.  Not exactly what we were going for.And when the menus came- know this.  On Sunday nights, the chef apparently \"tries out\" some new things so the menu is VERY limited to those 4 or 5 things and any of the things you had a taste for that brought you to Rumours East are not available.The other mistake we made was asking where all the seafood was that the other Rumors restaurant has (there is one over on 12th ave).  We were rather rudely told that \"this Rumours and that Rumours were not affiliated\" by the manager.  Okay.  Our mistake . . .but did you have to be rude about it?  Maybe suggesting why this Rumours was a good choice for us would have been a better plan?Needless to say, with the limited menu, the manager who made us feel bad and the \"kids table\" seating, we left to find a place that was a little more welcoming.But the next time I am in Nashville, I am going to give this place another try for their regular menu looks good and all the positive reviews here on Yelp count in my book.But it definitely won't be on a Sunday night . . .and I am going to stay far away from that manager.  He obviously missed class on the day they taught customer service!"], ["Misty P.", "Absolutely charming!  Love the niché French country outsider seating!  We had a bottle of wine and appetizers.  Service above par, location all bells and whistles.  Took a star for the salmon bruschetta appetizer.  Seemed great in concept, lacking in functionality.  The spice, crunch, and salmon could have been better placed.  Bravo on everything else!"], ["Stefanie P.", "Ive never eaten here, only drank here and I love doing that. They have the best wine menu in Nashville, and craft cocktails are limited but when you get one its super awesome and delicious. Very cool small place with original wood floors and great outdoor seating. Most of all I love just meeting a girlfriend up there and gabbin' about the boys. The servers give you space and keep the wine a comin' One of my favorite local businesses in East Nashville. Support it!"], ["DIanne H.", "Do not go here. The food was served cold and although we had reservations we got seated in the bar area. Not in the nice part of the restaurant the waitress said they save the four tops in that area for tables of four. Not s good experience   Not sure why people rate it high. Again. Do not go there unless you are in the know somehow"], ["Alana T.", "Great HH spot. They bartender was super nice and drinks were great. They give you just the right amount of attention! We did not eat because we had dinner plans somewhere else but definitely want to go back and try the food because it looked great!"], ["Christa P.", "The bar menu is really good- especially during happy hour. Cheese plate is awesome- really great jam accompanies it. The duck hot dog, empanadas, melted cheese - all really good- but the pickle plate is awesome!"], ["Alex B.", "We've tried to get into here several weekends in a row and finally succeeded this past weekend.  It's on the pricey side, but it was worth it.  The food was perfectly portions and the flavors were so distinguished.  You could taste every single ingredient in every single bite.Their cocktail list is quite extensive and full of originals, be sure to try some.  If you're looking for a nice dining experience with a trendy crowd, this is a great option."], ["Coco R.", "Nice ambiance...the restaurant atmosphere is beautiful, especially in the summertime with their outdoor patio----and the good feelings end there. Ridiculously small portions at a hefty price is common enough, but at least make the dishes pop in flavor...additionally, our server was not extremely attentive, it took almost 20 minutes for him to come by and take our order. Maybe he was biting off more than he could chew, but the restaurant did not feel extremely busy. Maybe I'll give them another shot and come back purely for drinks and the patio over the summer, but my relationship with their food is donezo."], ["Mandi R.", "I love everything about Rumours East, the only thing I don't love is that I don't go more often!  The ambiance is wonderfully welcoming, it feels like a house of friends having lovely conversations all over!  Their wine and drink list is very impressive as well.  Not just a wine bar yall, they have some amazing craft cocktails too!  Food isn't too shabby either, you can never go wrong with their artisan cheese plate!They also have a pretty impressive happy hour.  Now that I live on the East Side I cannot wait to spend this spring on their patio with vino and cheese!  Sounds like heaven.That's another thing, their patio is arguably the best in Nashville!  CHECK IT OUT!"], ["Kathy C.", "We've eaten here a couple of times but I neglected to write a review until now.Rumours East is a small house converted to a cozy little restaurant. Both times we sat outside on the patio. The food and service was great. The last time we were there was late Summer. We sat under the tin roof in the open air, overlooking the beautiful garden where they grow their own herbs and vegetables. The patio and garden is lit with white lights making the ambience perfect.My husband and I strolled through the garden waiting for our entrees as it started to rain. We got back to our table listening as the rain gently hit the tin roof. Our entrees, wine and atmosphere was perfect. What a beautiful date night. Rumours East got it right."], ["Samantha S.", "I'm honestly dumbfounded how I've lived in Nashville since 2004 and on the east side for 5 years not and have never stepped foot into this gorgeous establishment until a few days ago.We had wonderful service outside.  They seem to work great as a team as we had several people come check on us.  Our glasses were never empty!  I stole a couple delicious nibbles off a friend's cheese plate that has me wanting to come back ASAP and order my own food!I LOVE their back yard/patio area and their happy hour is something to brag about.  I see many summer nights being spent here."], ["Susan D.", "I went here during Restaurant Week 2013 very excited to try Rumours due to their good reviews. The restaurant is in a cute house-like building with outdoor and indoor seating. The hostess was great and friendly and let me sit wherever I wanted.Unfortunately, it went downhill from there. After the hostess sat me with my menus, she brought me my water. Then it took the bartender who was just walking by and noticed I was waiting on my server to show up 15-20 minutes later for my order to get placed. My server was not attentive at all throughout the night and she would show up every 15 minutes or so but never bothered to refill my water until I asked for my to-go box at the end of my meal. Terrible.As for the food, I ordered a Watermelon and Tomato Salad with feta and aged balsamic to start, then seared scallops with braised chickpeas and finally an almond and seminola cake with peach preserves and marscapone cream. Well, there were no tomatoes on the watermelon and tomato salad nor was there any balsalmic on the plate. The dessert was bland and not worth finishing. The scallops had great flavor and the highlight to an otherwise disappointing experience. Sorry to say not worth the pricetag. Next time I think I'll try Lockeland Table down the street- which was much busier than Rumours if that tells you anything."], ["Bethany M.", "absolutely amazing! I ate here with my family and loved it! We started with the mussels and full cheese plate. The variety in cheeses was very impressive. The mussels were garlicy and savory. For our main courses we had the filet, pork chop, and duck breast. the Filet was good. The pork chop was amazing. The duck breast was to die for! Great wine and cocktail selection. I would recommend this restaurant  to anyone and everyone!"], ["Rachel S.", "Rumours East, another proud-to-be-local dining and drinking establishment, located in the ultra coveted 5 Points area.  My first experience here was only so-so - the food was alright.  I want to like Rumours East more than I do at the end of the day.  This return trip gave me a little more to get excited about.I ordered a sampling of everything, starting with the winter salad.  I know it had a fruit in it - maybe golden raising? - but it was honestly so underwhelming I can't remember anything about it at all.  The same with the soup of the day, which sounded awesome - kind of a root veggie tomato based thing, with crispy fried sweet potato shoestrings on top.  Not a winner.However, what WERE winners were the lobster and feta ravioli - the homemade ravioli du jour - and the snapper dish with broccoli rabe and squash gratin.  The ravioli were wonderful.  Beautifully combined flavors.  And the snapper - gosh, it was resemblant of dishes in which I am able to take what I call a \"360 bite\" - I take a fork and make sure to get a taste of EVERYTHING on the plate on it, and eat it, and all of the flavors compliment each other.  The snapper was dressed with capers, and the squash gratin was to die for.  The broccoli rabe were perfect too. (However, don't plan on taking broccoli rabe home for left-overs!  This isn't a cooked veggie that stands up well to being saved for later.)After a glass of prosecco and this indulgent meal, I was out of room (and money) and did not order dessert.  But now I know I can return to Rumours East and find items I REALLY enjoy. (And maybe dessert will be one of them.)"], ["Jeremy E.", "This place has graduated to my top 3 in Nashville. I know I just wrote a review a month ago, but I went again this weekend and I am compelled to update. Hrant is the exec chef, and blows my mind with his flavor profiles and combinations of textures and techniques. I had some fam in town from Boston and needed to impress this weekend. Rumours delivered and then some. The food is creative, fresh, and has spices and textures you can't find anywhere else in Nashville, except for Etch, maybe. Etch is similar in technique, but sticks to more of a Euro/Asia spice set. (You can tell they cooked together before). At Rumours, you can taste Western Europe, North Africa, the Mediterranean, even South America. The food will transport you to the native country for a wonderful, delicious, moment. Not to worry, though. You always end up back in East Nashville. Service is outstanding, and you wonder if the staff is taking happy pills before work because everyone is so nice. Wine list is spot on, and the patio is fantastic. JUST GO ALREADY"], ["Dirk M.", "We have generally been fond of Rumours East, but our experience this evening was sub-par.  Drinks (wine and cocktails) were fine but the food was our problem.  My wife ordered the vegetarian entree (pumpkin dumplings).  While it was tasty, the portion size was barely an appetizer portion at an entree price.  I ordered fish on risotto.  While it was tasty, the rice was undercooked and crunchy.  Pretty big disappointment."], ["Ashwin M.", "You see, I'm British. I see a semi on the road and think, \"By golly! What a positively large lorry!\" I put my trash in a dustbin and walk on a footpath. I wear my knickers over my bums and tell people to bugger off if they're bothering me. So when I heard about RumoUrs East, I was, well, confused. The name...Rumours? With a U? East? I thought we were all \"The West\" I decided to investigate with my trusted sidekick, Dr. Waston.Watson and I packed our best monocles, waxed our mushes and headed to wet our whistles at Rumours East. We were magnificently impressed by the quaint countryside called East Nashville where RE stood. It was as we were treading on the footpath leading up to RE when Watson whispered to me, \"By Jove, Sherlock. Would it not be because RE was in EAST Nashville that it got its oriental moniker?\"\"BY JOVE, WATSON, ole chap,\" I exclaimed, bashing his head with a jolly good thump. \"That was alimentary! Genius!\"The décor inside was inviting and poring over the wine list, we realized that we had a serious list of wines to pick from around the world. So we ordered a glass each from Chile and France and felt quite regal indeed. Only last week Watson and I returned from the adventure of the Hounds of Baskerville and seeing the hounds, we had emptied our bowels. The good doctor put us both on a vegetarian diet to recuperate and I was happy to see that RE had an excellent pizza to eat. Watson pulled out some rubber balls, dropped them onto the wooden floor and said, \"Let us trip on 'em, Sherlock\" and we tripped balls as we ate and drank pizza and wine.But then, alas, news came that Professor Moriarty was performing at the Nashville Symphony and we paid our bills and left in a hurry, vowing to be back again."], ["Ali B.", "From the cheese plate to the hummus to the main course to the wine, EVERYTHING was great. I tried the top sirloin served with creamy parmesan grits, caramelized onions, and a spinach salad with balsamic reduction. The steak was cooked perfectly (medium) and the grits were killer.My friend had the gnocchi with chicken, spinach, mushrooms, onion, and garlic in a white wine cream sauce. Also an awesome dish! The gnocchi was so tender. Mmm.All around, it was a GREAT meal but a wee bit fancy. Rumours is a great place for a date night or an evening on the lawn with some wine."], ["Caitlin C.", "How many years did it take me to finally make it back to Rumors for an actual meal? Too many freaking years. I'm between 4 and 5 stars for Rumors. Honestly, I'm in love with the atmosphere and the place itself. It's gorgeous, cozy and just down right appealing. However, portions are on the small side compared to other places that feature similar menus, for similar prices, for similar quality - that's really my only beef with the place. NOW having said that, I left full after four scallops and two pieces of their bruschetta with ricotta and pickled strawberries. I guess I just wanted to have a another couple slices of bruschetta on the plate or maybe I'm just a fatty American. Service is some of the best in the city and they have a kick ass drink selection, as well as wine (duh). Their Paloma was LOVELY, no cheap tequila here my friends. Rumors is like Margot, I always forget about it, but I love it very much."], ["Lex M.", "Seriously amazing service! They let me in half an hour before they opened without complaint. Allowed me to order and take a load off while I waited for my friends. Also, amazing wine and great patio!"], ["Jennifer P.", "Their food was SO delicious, however something our waitress did rubbed me the wrong way. We went during Restaurant Week and they were having a wine 2-4-1 special but you had to order before 7PM. My friend and I told her this is what we wanted to do and she said that was fine. Our checks came however and it had 1 discounted wine and 1 full price wine. We asked why this wasn't reflecting the deal we got and she said since we didn't get our second glass served before 7PM (even though we had already ordered it) she said we couldn't do the deal. Um, this doesn't make any sense to me. First we can then we can't? Also, why didn't she say anything about that before, during or after the meal? Ridiculous.Other than that, it was a pretty good place."], ["Stephen M.", "Being a recent transplant to Nashville, I decided to venture to the 5 Points, East Nashville area for the 1st time, intrigued by the reviews Rumours East had received.  I had a delightful meal.  I was solo and was seated in the bar area of this rustic home-like restaurant.  I listened to a pleasant mix of music (including reggae) and not overly loud bar chatter.  There was a reasonable array of premium liquors presented on the chalkboard and a variety of specialty cocktails, beers and wines by the glass offered in the menu.  My waitress, Susan, was very pleasant, and made a nice suggestion for my dinner wine (Denairo [sp?] malbec).  I opened with the soup du jour, a creamy carrot miso soup which was absolutely delicious.  I wanted a pork porterhouse for my entree, but they had sold out.  (I arrived for dinner without a reservation at ~8:30 pm on a Saturday night.)  I tried their filet instead, and it was very tasty.  They pride themselves on their organic veggies and they were prominent throughout their menu and added great flavor.Now, portions are not overly ample.  In fact, Rumours East is one of the few restaurants where I've been served the right amount of food to fill me to satisfaction and not have me asking for a doggie bag.  It's not cheap, but I plan to come back."], ["Kendyl S.", "Went to Rumours East for my fiances birthday last weekend, his parents were coming in town and I thought the backyard would be the perfect setting for the event! I was right, the patio/garden rocks! I love the outside lights and the little garden, perfect for an evening meal.Anyway I had the shrimp and grits, and it was GOOD. I also had the beet salad which was good but could have used some goat cheese I think (what couldnt?) Also they didnt have any ravioli which was a bummer. I lived though. My father in law had the shrimp pizza, delish! Fiance had the seared tuna, Amazing! Mother in law had scallops, not as good as the others but still good. Go there!"], ["Dawn S.", "I have been here a few times and always leave happy.  The service is great and love the wine selection.  Most of all, I love the atmosphere.  Looking forward to spring so I can enjoy their lovely patio again."], ["Anthony C.", "I have been eagerly anticipating my first experience at Rumours East for some time after hearing many positive comments from friends around the neighborhood. While I would agree with their rave reviews on the whole, I would say that 3.5 stars would be my first impression because of a couple of very minor things.  But since the experience was better than a 3 and 3.5 stars is not an option, then 4 it is. Not that the experience was bad by any means, but maybe I expected too much because of the hype from my friends. Moving on........When we entered the front door, we were warmly greeted by the hostess. She was so nice when we walked in, and that, coupled with the fact that we were in an old house with a cozy fire going, felt like we were being welcomed into someone's personal home, and not a restaurant/bar. It was a very nice first impression and start to our evening. She then gave us the option to sit in the bar area or in the dining room with the fireplace. We chose to cozy up next to the fire at a small table. Our server Patrick quickly came to the table, introduced himself and promptly asked if we had any questions about the wine or appetizers. We started with a cheese plate and a glass of prosecco. The cheese plate came with four different cheeses, sliced granny smith apples, two small loaves of bread, candied pecans, and apple butter. I enjoyed all of the cheeses and loved them all paired with the fresh apples and ridiculously delicious apple butter. The prosecco was also a great recommendation from Patrick and worked well with the entire plate. Just as we finished our cheese plate, the entrees that we ordered were on the table. I ordered the lamb sausage with shaved carrot, celery, and apple salad with spiced almonds, and the couscous fritters. I was a little leery of the lamb sausage because it can definitely be a little gamey to me, but the spices in the sausage were a great complement to the meat and disguised any gaminess that might have been present. There was definitely a North African tilt to the meal with the spice combination in the sausage having cumin, coriander, cayenne, etc...  The almonds had some nice flavor and spice as well, but the couscous fritters were a little bland and dry. There was also a spicy tomato based sauce that was under everything that really tied in nicely with the other flavors on the plate. We decided that we would get our dessert to go because by the end of the meal we were too full to enjoy another bite. It was a dark chocolate torte with a mixed berry coulis and whipped cream. Even though I typically like desserts that are not overly sweet and love dark chocolate, this one was almost salty. Unfortunately, this was a big disappointment at the end of a pretty solid meal. Definitely not enough to turn me off from going again, but worth noting. I will absolutely go back and try their menu again, especially since it varies from time to time depending on the freshest available ingredients. All in all, a good meal in a warm, friendly environment that has earned them another visit very soon."], ["Derek E.", "I would recommend Rumours East. It is better than most restaurants but when compared to other high-end places in Nashville, I wasn't particularly blown away by the food. The atmosphere and drink selection were great. The service was good. We ordered the cheese plate for an appetizer and it was very tasty. The entrees were good but somewhat underwhelming. I'll definitely go back because the outside patio is so enjoyable and the food is satisfying, but if I want more interesting and lively flavors I'll stick with the assured Margot's down the street."], ["Emily E.", "Truly not much more needs to be said than the Winter Salad was amaze-balls!!  I loved the old house ambiance and the great atmosphere.  I was there for a girlfriend's 25th, where there were 4 different small groups of friends.  We all loved our different plates & had great conversation and a chance to get to know each other better!  Thanks Rumours East!  I'll definitely be back to try an entree...and the cheese plate...and the chocolate torte..."], ["Jen W.", "First timer at Rumors and a huge fan!!  Love the back patio, unfortunately the mosquitoes ate us alive.. will have to come back when it's not so buggy.  Our server was very knowledgeable about the menu and patient with our questions.  We got two appetizers, a salad and two entrees split between three people.  My favorite were the scallops and the cheese plate.  our guest, a visitor from san fran was very impressed.  Yahoo for Happy Hour!"], ["Ann W.", "Restaurant Week strikes again! I had not been to Rumours in a while, but was lured by the special menu and the proximity to home. The $30 menu came with three courses. I had the winter salad, which was perfect. It looked like it had not been dressed, but when I ate it, I found it had the most perfect light citrusy dressing on it. I don't usually rave about salads, but this one really was good. For my entree I had salmon, which came with a yummy lemon, asparagus risotto cake. Different and flavorful. The salmon was cooked perfectly. My dessert was a chocolate torte and, well, you just can't go wrong with that.I ordered one glass of wine, which I enjoyed, but my boyfriend got the wine pairings. The wines were all well chosen, including the port to go with dessert. I didn't think I liked port, but it was delightful with the chocolate. There was a surprise bonus - jazz playing in the bar. We were sitting at the bar, because I like sitting at bars, and were worried that the music might be too loud or annoying (having run into that occasionally at other establishments). Quite the contrary. The band playing was called Crackerboots and made the evening a romantic adventure. Mmmm . . . I'm already looking forward to a return visit."], ["Sarah M.", "Great backyard dining area...Food was WONDERFUL...Service was great. Go here!"], ["Em S.", "Mm, okay, this place isn't bad. The atmosphere of the large fenced-in outdoor seating area behind it is gorgeous. If you wanted to go on a date with me, I would be impressed sitting out there and enjoying the beautiful weather. The food is also decent - nothing spectacular, but fairly good. I went with some friends for Restaurant Week, which is probably a way for restaurants to increase their average check by a lot... odd that it remains wildly popular. Anyway, if you opted for the \"special menu\", it was $30.12 with $20.12 wine pairing, versus about $16 for the vegetarian entree on the regular menu (gnocchi).The first course was: \"Bruschetta with butternut squash jam, watercress, shaved parmesan cheese, and green chili reduction.\" It was OK. A piece of not-crunchy but not-quite-chewy bread with what tasted like applesauce on top... if there was any green chili reduction or watercress or parmesan cheese, the quantity was so small that I didn't notice any. Not particularly inspiring, and definitely not worth the price... One of the other people in my party had the salad - decent salad, but nothing spectacular.The main course was: Roasted eggplant cheese polenta terrine, arugula, and pickled onion salad. The sauce was overpowering! The eggplant, cooked very nicely and tender, would have been delicious had I been able to taste it better. The pickled onion salad, well, that was also very pungent and far too strong for the dish. But not bad. The portion size also was decent, not just a tiny sliver some fancy restaurants tend to do. Most of my party had the steak option, which they agreed was tender, although one person's cut was less high-quality than the others.The dessert I had was the chocolate torte. No way it was worth the $8 of the menu price. It wasn't bad, but again, nothing super-salivary-inducing. The bread pudding also wasn't bad, but nothing too special either.Thus, this is a charming little restaurant with a cozy inside reminiscent of a coffee shop and a gorgeous backyard grassy dining area that produces decent food, with plenty of vegetarian options, and can rightfully be in the lineup of yummy East Nashville food options."], ["Scott C.", "This was my first time checking this spot out and I was mad that i hadn't been until now.   We started off with the mediterranean platter, mussels, and the goat cheese and beet terrine.  Absolutely delicious!!  The scallops were to die for!  Cool spot in the trendy east side, and everyone should check it out if you have not."], ["L G.", "Very disappointed. I was really excited to try this place out because I had heard a lot about it. I ordered the sweet potato fries (soggy, too thick, and with a weird sauce) and lamb sausage (had a very over powering sauce) and was not satisfied or full. Waitress was wonderful and the ambiance was great... too bad the food did not live up to the hype because this could have easily been my new favorite spot."], ["Robert P.", "Took my girlfriend here for her birthday during restaurant week. I had put a note on my reservation that I wanted to sit outside in the back area and upon arrival was told it was full and would take 45+ minutes to sit out there so that was a bit disappointing. Still sat outside on the side area, but not quite as nice although still enjoyable. Our server was very nice and did a good job overall. Food was excellent, enjoyed every course, we ordered 3 separate dishes for each course so we could share half and half and got to enjoy a lot of tasty food. Girlfriend had the wine pairing which seemed to go well with the dishes presented. Overall very nice place and will be back in the future."], ["Marilee S.", "I avoid big box eateries that cater to crying babies, glutenous diners and menu items you can find in the freezer section of Krogers. If I'm going to pay to eat out, it has to be different, something I don't want to hassle making or the setting has to be so much better than my own house.We loved Rumours East. Just down from a commercial hub, the restaurant sits up off the street in an old house. We ate outside in the backyard. It was simply divine, albeit, a tad warm (as it was August), but they set up one of those commercial fans, the kind you'd find in a warehouse or an auto body shop.Before getting too far off track, the food, delicious, inventive and perfect portion sizes. For starters, fried green tomatoes and a shared salad. For our entrees, I had the scallops - seared so they were  firm, sweet and served over grits with a spinach salad. Husband had the pork loin. Fortunately, he was on a diet so he offered me a bite of the tender meat and a lot of his potato gratin and fresh cabbage salad and chimichurri.A final note, the server was delightful, attentive, but not pushy, knowledgeable about the wines, but again, not pushy and efficient. Except for the humidity and lingering heat of the day, couldn't have asked for a better dining experience."], ["Marcia M.", "I am writing an update to my very recent review on Rumours because it must be notated that this place is a wonderful place to host special events such as a wedding reception or large party. I was lucky enough to be a guest at a beautiful wedding celebration at Rumours East last night and was thoroughly impressed with the event. The patio was transformed with lighting, tent, a casual layout, and an impressive outdoor bar. The staff was wonderful and it made me realize what a great venue resource Rumours really is!"], ["Becca H.", "The ambience is amazing, the house charming, and the patio magical. Our server was fantastic, full of suggestions and appropriate wine pairings. We were surprised by an octopus appetizer, I don't believe it was on the menu but it was one of the best things I've put in my mouth. For my entree I had the duck and although I haven't had duck too many places it was the best duck I've had. I can't wait to return!"], ["Thomas L.", "Great dessert and great service.  I came here with some friends and my wife on a Tuesday night to grab some drinks and dessert.  We were seated promptly inside and were greeted by a very friendly waitress.   The large wine list made it hard for our crew to decide on a drink of choice so the ladies tried out too samples.  One of the samples was a recommendation of the waitress and she was spot on. We all split a bottle of wine and we could not pass up the chocolate torte made with local Olive & Sinclair chocolate.    The tortes were absolutely awesome and despite the small dessert selection, we all were very pleased with our choice.     I would highly recommend this place for drinks and dessert, in relation to this visit."]], "Americano - Freestyle Tapas Bar": [["Ashwin M.", "My name is King Felipe Von Toblerone and I am happy to say that my kingdom of Spain approves this tapas bar and its tastes. I hereby grant it the official El Yummita status which means it's one of the three tapas bars in the world that is authorized to serve food to me (the other two are in the domestic terminal of the Malaga airport) What are the requirements for El Yummita classification, you ask? They are quite simple. One, the el chef must have been trained in the deep southern heartlands of Andalucia, amongst the stone walls of the Alhambra and the narrow, winding streets of the Arab quarters. He must know the poetry of a huevo and how it must rise to a brunchful occasion to sing our glorious national anthem: Tortilla Espanola. The el chef has masterfully grated manchego cheese on the tortilla, and has taken it to outerspatial levels unheard of in our rich heritage of ten years.Two, the el tapas bar must cater to my vegetarian friends, for what is life without cooked and spiced vegetables? Battered and roasted cauliflowers, the roasted mushrooms, and tacos. Ah! What delightful. And what about a tribute to our queen, El Gordita? The el chef's Patas Bravas are so sublime in their crispily crunchily outside and creamily delicious inside, it's a delight to fly Southwest from my capital city, Ibiza, to Nashville just to eat them. I am happy to report that the el chef of Americano has met and exceeded the rigorously high standards of our national country of Espanola, and I, King Felipe Von Toblerone grant him Robinhood status for his congratulations on the El Yummita medal of condor. I don't comprehend why he named the restaurant after a coffee, but our national drink of cerveza is quite ensaddened. I also have recommended my servants ship a couple of crates of flamenco performers to juice up the place."], ["Phillip J.", "Americano's is the only Tapas bar I know of in Nashville. You must go try it out. I went with seven other people and they were able to handle a large party with grace,speed,and aplomb. The dishes were delicious, the service was personable, and congenial, and I think one of the ladies fell in love with Bellush,the bartender! A wonderful dining experience in midtown Nashville!"], ["Kim P.", "This had been on our list of places to go for a light dinner, but hadn't made it yet.  We instead went for a Sunday lunch, hoping for the Paellea, but it's not  on the lunch menu.  Instead we got the traditional Spanish omelet as well as the vegetable one!   Both were fantastic!  We have traveled in Spain extensively and are foodies.  Were were tempted to add the Kale salad( will do it next time) but instead split an almond croissant with fresh fruit!  The croissant while very good, was a bit hard.  Overall an excellent meal.  Total with tip was under $35.   We will be back.     NOTE:  we glanced at the Spanish wine selection( we buy a lot of Spanish wines and have toured the Rioja region), price point was great, but did not recognize any of them.   We will definitely go back for wine and tapas soon."], ["Tom S.", "After a heavy lunch of hot chicken, we settled on tapas for dinner to get something a bit fresher and less overwhelming. We were staying in the West End, so we chose to enjoy a crisp evening on the patio at Americano.To start, the recommendation by the waitress to try the sangria swirled in the frozen margarita swirl was great. (My regular on-the-rocks margarita was tasty as well). The food came out quickly and was very fresh and flavorful, especially the spicy ahi tuna guacamole.Overall, we were very pleased with our experience, and would recommend it to anyone in the area."], ["Craig R.", "I really enjoyed dinner here.  The mixed drinks were great and the wine selection was pretty varied.The spicy cauliflower and the Brussels sprouts were my favorites."], ["Jess-e A.", "First time having tapas and they were delicious. The server was knowledgeable on nearby attractions and they served local microbrews. Win, win!"], ["J P.", "The food was largely good. We ordered the garlic shrimp, the Brussels sprouts, heirloom tomatoes, quail, tuna guacamole, potatoes bravas and arugula salad. The quail was dry and needed some salt even although the dressing was quite intense. The sauce for the potatoes was too sweet for my liking and so was the tuna sauce. The sprouts were very good but the tomatoes were simply amazing. They crush their own olive oil which really enhanced the tomatoes and blue cheese and turned it into a delicious dish. Would probably have got four stars but then being completely ignored after the food was served so that I waited about twenty minutes for a drink refill was enough to drop a star. I complained to the waiter when he finally came around and he got me another beer. He was very nice about it but no offer to comp the beer or do anything else substantive to remedy the long dry wait cost them a point on this one. I would probably come back but only after I've exhausted the other restaurants in the area."], ["Scott T.", "Great tapas, Friendly staff and cool vibes.  The hot cauliflower his not to be missed!"], ["Angela M.", "In a word: delicious! I've been a fan of tapas for a while, and I love this place's take on it, and that they exist at all. All the reviews talking about how good the hot cauliflower is, are right. It is spicy, but it's also delicious. The fried cheese is also amazing. Then again, how do you mess up fried cheese? But the jam it comes with really sends it over the top. The patatas bravas was probably my least favorite. But, I'm spoiled by memories of delicious ones back east near Boston. The dipping sauce (mayo based) is delicious though."], ["Toni R.", "Had dinner here last week.  Tapas plates were good. I think we had one of everything between four people!  Fish tacos were ok.  Nothing special.  The fish in one of the tacos was a bit burnt.  They were more than gracious and took it off the bill.    All in all a good experience.  Food was sort of interesting and quite good.  Not the best Nashville has to offer, but nice for a casual dinner.  Washrooms were terribly messy.  Not part of the restaurant since you have to go out an inner door into a hallway for the rest of the building to find it.  Cocktails are good, and they have a happy hour!"], ["Brian N.", "This is on the end of my street, so it's very convenient for me to eat there.  The food is always fantastic, always.  I'm a vegetarian, and there are several items I could eat every day.The staff, though?  It's not that they're bad or neglectful, but they just lack a professional polish, and they can be pretty rough.   It also sometimes feels like a bar more than a restaurant, and they need to be careful about that.  If smoking were still allowed in restaurants, it's the kind of place you just know you'd leave smelling like smoke.  If they can get the waiters to be a little more polished, and do something to make it seen less \"bar-like\" -- I'm admittedly at a loss as to what that might be -- this place is a winner.   The food is good enough, though, to overlook that."], ["Elizabeth M.", "I've had plenty of underwhelming food and service experiences so I have to give props to the Nashville restaurant that got it right.I stopped in as a solo diner to a tapas restaurant. This can be kinda awkward to ask for at  a tapas restaurant but the hostess quickly and graciously sat me at the bar where I was quickly attended to by the bartender.I ordered a red sangria which was promptly made in front of me. It wasn't the best sangria I've ever had but it wasn't the worst either. I do think $8 for an average glass of sangria is a little much but I'll go for it. They do have a happy hour special of $5 sangrias on some days so I'll have to catch that.I ordered the Kale Salad and the Chicken Skewer tapas. The kale salad was AMAZING!! I will be ordering this salad again and again!! The manchego cheese on top was truly the \"icing on the cake\".The chicken skewers should really be called \"chicken skewer\" because you only get one. It's plenty for one person but may not be enough to share. The chicken is grilled perfectly and I enjoyed every moment of it. It's served on top of hummus and garlic mayo, which were fine but the chicken really made the dish. The service was impeccable and the bartender was friendly and welcoming. He even gave me recommendations for places to eat in Nashville.Check it out!  You will not be disappointed!!"], ["Nicole V.", "I came for the brunch and wasn't disappointed! Delicious Spanish chorizo, two for one mimosas, and great service. Really great service from being greeted at the door until I left a couple hours later. I couldn't believe how fast my food was ready, and it was flavorful, fresh, and highlighted the best of Spanish flavors. Next time, I'm getting the (hot) chicken and waffles to enjoy the Nashville take on already great brunch menu."], ["jae d.", "We tried this last night, and I guess the good reviews come from people who haven't experienced authentic tapas. Also, it being the only one in town, there is nothing to compare it to. The albondigas were the best of the bunch, the shrimp overcooked, and the tacos (yes,tacos in a tapas bar) were weird and awful. The atmosphere just isn't there ---multiple t.v.'s on sports channels. Thought we were going out for a nice evening, and ending up in a place that doesn't know if it wants to be a restaurant or a sports bar, was highly disappointing. Maybe we're spoiled, having moved here from Atlanta, with at leasttwo awesome tapas restaurants, but I did expect more. To sum up, readers, save your moneyand wait for the real deal  and owners take a look at Atlanta's Iberian Pig  and Cooks and Soldiers."], ["Queen B.", "Bellush the bartender was a charmer..  We all started with the sangria - margarita \"swirl.\"  Several glasses of red wine and beer.Then we moved over to a table and ordered:Paella, hot cauliflower, roasted pork belly & brussels sprouts, dates and pork belly, pears and chorizo, mussels and chorizo, beef tacos and fish tacos..A little this, a little that, lots of laughter and noshing..More wine and beer, more swirls, more pork belly and brussels sprouts, more cauliflower...To say we pigged out is being polite..Seven of my closest friends and myself partied all evening long on food, wine, and camaraderie.  The staff was awesome and attentive, the Chef knocked our socks off, and the bartender just kept making them..Great place for a party. Great place for a gathering of close friends that LOVE food.Great place to try new food combinations.We will definitely go back..  and do some more partying!Great find!!And thanks to everyone that made suggestions on the dishes.Everything was top notch, delicious and freshly made."], ["Jerud C.", "I'm spoiled from living in a larger town most of my life.  I admit it.  There's things I took for granted, and that have spoiled me.  Nashville is amazing - it's my home for the next decade.  But... there's a few culinary experiences that are missing.Or, were missing.  A Tapas bar.  I can't tell you all the memories that started to flood back at the idea of a tapas bar.  Swinging in with friends to share a pint and some plates.  Trying perfect sized portions of seemly normal food, prepared in ways you can't imagine.Americano has rekindled my supressed love for this style of cuisine..I swung in to see some friends after a game.  What game?  That's not important.  Follow the story.  I arrived late, but I had time to share a drink with my buddy, and talk food and whatnot with the girls.  After they left, I sat down for some Brussell Sprouts and Dates.D. Licious.Thank you, Americano.  You are exactly what we needed!"], ["Monica H.", "I will not dine here again. Portions were extremely small. My boyfriend and I left hungry (and I'm usually not one to complain as a small person). The service was decent. Food was interesting. However, we ordered one of their big dishes - the paella - and there was hardly any meat in it. Just rice! If you're a person who needs large portions to be full, I would not come here unless you want to spend a lot of money for decent food. I love tapas, but this place was a miss for me."], ["T M.", "The food is fabulous and the service consistently excellent. The kale salad is to die for. Crispy Brussels sprouts are marvelous. They have a fab veggie sandwich with Fried plantain slices instead of bread which is amazing. Great for lunch or dinner and plenty of parking. A real winner."], ["Katie N.", "We were visiting Nashville and staying in an Airbnb near Music Row. We had gotten drinks at the Patterson House and were looking for a place to grab dinner (and more drinks). I'm a huge fan of tapas - I love sharing dishes and trying everything. Americano did not disappoint. The brussel sprouts and hot cauliflower were my personal favorite and the drinks were delicious! I would definitely go back here next time I'm in Nashville."], ["Miles B.", "Something about this place rubs me the wrong way. Maybe it's hearing the manager have profanity laced personal phone conversations while standing behind the bar. Maybe it's the fact that I can see my food being prepared and plated by someone who has been plating and preparing everyone else's food and just cleaning her hands on her pants or a dirty dish rag. Who knows? The burger was good, so next time I'll just put in headphones and stare at the wall while I wait for my food."], ["Dirk M.", "Dined with my wife and daughter tonight.  Our whole experience started off badly and didn't get much better.First, we ordered drinks and a runner delivered water.  When my daughter picked up her water glass, the bottom of the glass fell off emptying the contents on our table and in her lap.Once we got all cleaned up, we ordered and began our wait for our first round of tapas.  After quite a while we noticed that a couple who was seated 10 minutes or so after we arrived were beginning to receive their food.  After a while longer our server came by and said \"have you already received your food.\". We said \"no\" and he said he would go check on it.  We waited probably another 10 or 15 minutes and the food began to arrive.  Our waiter apologized for the long wait.Service was reasonable for a little while.  We ordered one last item and told our waiter that it would be our last.  We finished the last dish and then began an incredible wait for our check.  Our waiter checked in with other tables around us probably 10 times and never once looked at us.  We were finally able to get his attention after a 20 to 30 minute wait for our check...and we had to ask for our check.I really do not know what the problem was.  Our waiter did seem to have a lot of tables, so I do not know if he is totally to blame but it was a bad experience.We won't be back any time soon."], ["Jusmary T.", "My first time. The food was really great  Megan was awesome  Kale salad was terrific. Atmosphere was good too"], ["Carey James B.", "An excellent place to enjoy tapas!Wine and cheese plate with real jamon from Spain!The quail is really good!I love the mixed grill.The service is very good too.Great atmosphere.They have just redone the wine list.Excellent choices."], ["Orestes C.", "We had dinner last night and the small plates/tapas we ordered were great: roasted dates, mushrooms, and croquettes. I do have to mention that this place has an unnecessary and bad obsession for mayonnaise: almost everything has the thing on top (even mussels, which doesn't makes sense). I had seen the pictures before so I always ordered \"the sauce\" on the side.We then ordered the paella but we returned it because it was too spicy and oily (this is not traditional paella in my opinion).Overall a good place to go for tapas and small plates along with some glasses of wine, will be coming back knowing how to trick the menu."], ["Jen W.", "I love tapas but I don't like spice/heat. I went for the steak tacos which are reviewed here as not being great but WOW! The flavour really hits you with that first bite and it makes you seriously look forward to the rest of the meal. Jalapeños were served on the side so you can choose whether or not you're gonna go hot. Potatoes were on the salty side having been sprinkled with rock salt, but still tasty. Delicious!Service was attentive, comprehensive and crazy fast!"], ["Amber H.", "Really great tapas! I love the small plate idea... It's So good to share yummy foods and sample lots of different dishes. This place is delicious. We had the spicy cauliflower, meatballs, chicken and waffles and a salad (sorry... I forget exact names of dishes).... Plus sangria. We all thought the meal was stellar and plan to return."], ["Shaun B.", "The Nashville Hot Cauliflower is worth the trip alone. The chicken skewer was the tits. The fried cheese was terrific. Drinks were pretty expensive but probably consistent with other establishments of this type. But don't let that deter you from trying the place. We made it right after happy hour, and their happy hour specials looked pretty good, so next time we'll definitely try to make it within that time frame.Give it a shot, its a different type of dining experience that we both enjoyed. We ordered about 5 dishes and that seemed to be the perfect amount."], ["Kristy V.", "Best new Nashville Restaurant. Try their margarita swirl. You won't be disappointed. Highly recommend!"], ["Summer W.", "Every single dish was amazing and servers were friendly, knowledgable and passionate about the food!"], ["Katrina G.", "While we have not actually been inside this restaurant, we did order delivery from them through Doorstep Delivery recently. Now I look forward to going there and trying it out firsthand. We decided to try a variety of items and were impressed with them all.Chopped Kale Salad - so good I almost finished it all before the hubs could try it!Fried Manchego Cheese - served with a blackberry jalepeno jam. Not spicy at all but still very tasty.Crispy Brussel Sprouts - apparently the dish du jour at most Nashville restaurants now. This is one of the better ones. Add pork to anything and instantly it's better.Smoked Chorizo with Pears - yummy but not as impressive as everything else.  Maybe b/c I'm not a huge pear fan.Hot Chicken Tacos - the hubs ate this one b/c I'm too gringo for that much spice. He says they were the perfect spice level.I was very impressed with everything we ordered. Definitely a good break from our regular delivery rut of pizza."], ["Kelly M.", "So glad we stumbled upon Americano after being told we'd have a 2 hour wait at The Tavern!! Amazing brunch and drinks! (2 for 1 mimosas, yes pleaseh) A group of girls and I (here for a bachelorette party) shared breakfast tacos--- best breakfast tacos I've had in a long time, hands down! We also the Brussels and cauliflower tapas, and fried cheese--- all delicious! Chicken tacos were also amazing as was the veggie omelet. Nothing was a miss. Would definitely recommend for brunch! Not to mention, service was exceptional!"], ["Adele W.", "We had low expectations thinking that this place might cater to partying college students as the photos on their website seem to portray, but we were pleasantly surprised on all levels by Americano.We ordered the Dates with Pork Belly, Chorizo Con Pan, The Blistered Tomatoes Con Pan, the Mushrooms Con Pan and the Fried Manchego with the jalapeno blackberry sauce and were were stuffed. Looking forward to going back for some paella soon. We ordered the margarita swirl with blood orange and the mango mojito. Both had nice flavor. I would only suggest that the mojito be strained and garnished with a whole mint leaf or such since the jalapeno pieces, seeds and tiny mint shreds kept getting stuck in the straw etc..but delicious anyway.The patio had a nice cross breeze and our service was excellent. David was training another server that night so we had double the service! There is plenty of parking in the back, and in the front lot, after the bank is closed, you can use those spots too, but they don't say that on the signs. We are looking forward to returning!"], ["Rob W.", "This is a late review so will keep it brief. Positives: the drinks were extremely good, and the shrimp appetizer with the roasted garlic was phenomenal. Negatives: it probably isn't a negative but more of an opportunity, the paella. I was so excited to be able to order this because only a few places in the city have it on their menu. But I really was not impressed with this dish. The rice was extremely crispy and over cooked. The meal was almost over whelmed with saffron, except for a sweetness that I can't really explain that I have never tasted in other paella dishes. I will give this restaurant another try because they had some very interesting tapas plates to choose. Just without the paella."], ["Erin B.", "We love Spanish tapas restaurants, so were excited to find this place while I was working at Vanderbilt this summer.  While I wouldn't necessarily call it authentic Spanish tapas, the southern flair in the dishes was fun and tasty.Ordered the brussel sprouts, fried manchego with jam, tuna guacamole, and mussels.  The brussel sprouts were by far our favorite, although we felt the sauce reminded us more of Chinese dishes than Spanish.  Fried manchego was just OK - not very flavorful, but the jam was good.  The tuna guacamole was also very good, and the mussels were phenomenal, though I've noticed they're not listed on the online menu, perhaps they've been removed since we visited?  Regardless, they came with a few pieces of the chorizo, which was AMAZING.  We'll definitely order the chorizo next time.The ambiance seemed nice, but the restaurant was almost entirely empty which was slightly unnerving, and our waitress was almost over-attentive because of it."], ["Dale N.", "@AmcanoNashville, First visit, very early lunch meeting, clean and crisp atmosphere, outside dining, friendly staff, small selection, not to much to mull over, everything we tasted was top notch. Jack was our server and did a wonderful job and Woody the manager made sure we were happy with our meal. Congratulations to the owners & chef on a wonderful addition to the Nashville food scene.We went with the following:Nashville Hot CauliflowerCrispy Brussels Sprouts Harissa Grilled ChickenHot Chicken TacosWould recommend any or all four. All cooked to perfection and seasoned wonderfully! I will be back."], ["Barbara T.", "Incredible service and Amazing food!!!!! Do not leave without tasting the Hot Cauliflower. It's a game changer. As is the Chorizo Con Pan and the Crispy Brussels Sprouts. It was all YUMMY!!! Had the good fortune of meeting the chef- smart, creative, and friendly!!! Thanks for adding to the growing list of fantastic eateries in Nashville!"], ["Morey K.", "This place is a new Nashville favorite! The tapas are amazing and the drinks do not disappoint. We've never had a meal we did not overly enjoy at Americano. Also, our server Paige was super cool and attentive. Be sure to ask her what the special is!"], ["Karen S.", "DELICIOUS! LOVED the chicken skewers and the Brussel sprouts! The service was amazing and we had an all around wonderful experience!"], ["Kevin B.", "My wife and I really enjoyed this place.  The wait staff was super friendly and helpful.  The dishes we tried were really good.  My favorite was the roasted dates with with pork belly and blue cheese.  My wife lived the mussels in white wine sauce.Some portions were a bit small for what you payed for them.  They charge $2 for four very small pieces of plain bread for dipping.Overall it was a great experience and would recommend it to other looking for a unique place in Nashville."], ["Rana M.", "So far, I've been there 4 times, and yes, it has been worthwhile to go back again and again!The very first time, we were just excited to try a new tapas place. It seems like the idea of tapas has fallen by the wayside since the late 90's.First of all, the menu is full of interesting, innovative takes on traditional Spanish tapas. We love the patatas bravas, the hot cauliflower, the shrimp, and the tuna guacamole.From the taco/sandwich section, I keep going back to the vegetarian jibarito sandwich, but the fish tacos always get raves. We've taken large groups for brunch, and similarly, everyone has really enjoyed the food. Believe it or not, despite my repeat visits, I have not yet tried the paella! Can't wait for the next visit!"], ["Julia S.", "My boyfriend and I had such an amazing date night here, and we're so happy they started up here! Unfortunately, they were out of paella, but our waiter Colin and the owner George were so accommodating and kind about it, it barely mattered. Instead we got a bunch of tapas, which were delicious! The abondigas (meatballs), fried manchego, potatoes bravas, dates, and tuna guac were all great, but the chipotle Brussels sprouts were the star! Combined with the drinks we both got from the bar (the mango jalapeño mojito killed!!) and the amazing service, we are in love with this new restaurant!!"], ["Brian O.", "Came here on a Thursday night and it was pretty empty. The atmosphere wasn't great, but it seemed like it would be much better on a slightly busier night. The server was very helpful and knowledgeable, which was great! We got several plates to share, and not one of them left us wanting. In particular, the brussel sprouts are a must buy, as are the tacos. I thought the prices were just a tad too high for the quantity of food, but we sure left happy!"], ["Paul Jen P.", "Amazing food.  Great ambiance.  Highly recommend the quail and fish tacos.  Will be back for more!"], ["Cathy M.", "We love trying new restaurants in Nashville and Americano ranks at the top of our list! Our server was knowledgeable, personable and attentive. Cocktails were wonderful, especially the swirled margarita. We had the tuna guacamole, crispy brussels sprouts and americano paella. Each dish was unique, fresh and flavorful. From the outside on busy West End, you would never guess that this place is a hidden gem!"], ["Denis D.", "Food great ... NO air conditioning!!!!  Don't come if you don't want to sweat profusely. It has been \"weeks\" according to the waitress, 2 days says the manager. Check before you come. The heat was out of control."], ["Monica O.", "So excited to see a tapas place in Nashville and it was great! We had the fried cheese with the blackberry jam, grilled chicken with edamame hummus, crispy brussel sprouts, blisters tomatoes, and the croquettes. I hate sprouts but this completely changed my view. I could have eaten bowls of these. AMAZING!! The croquettes are another not to be missed dish. The staff was very attentive and dishes came out hot and fast. Presentation was also well done."], ["Karen L.", "Love this place. Every dish was superb. The Chef is amazing and the staff is really friendly. Be prepared for a great surprise."], ["Maurice H.", "Best chicken and waffles I have ever eaten so far in my life.  Great mimosas during the breakfast specials."], ["Tara D.", "Dropped my jeep to get detailed stopped in to pass the time- so glad I did!!  Belush, the bartender was awesome!!  The chef- incredible almost as incredible as his menu!The Brussels sprouts changed my life, but the cauliflower will allow me to die with a smile.Can't wait to come back and try the rest of the menu!!!"], ["NunYa B.", "Absolutely tasty dishes/tapas. Had the guacamole and tuna, fried cheese and jam, chicken and sausage paella. Their mango-jalapeno mojito was weak but their margarita swirl made up for it.Service was prompt. Parking available in the back."], ["Gloria H.", "This place is awesome food and we are a foodie family so we are very critical! The crispy Brussels sprouts and hot cauliflower were two of our favorites. We had wonderful service too! Can't wAit to come back."], ["Lisa T.", "We sampled on a variety of appetizers including brussels sprouts, dates with pork belly, guacamole and spicy tuna, manchego cheese and BlackBerry jam, potato bravas and the americana paella.  Everything was wonderful and the group will definitely return."], ["Kaylyn M.", "Went here with my parents while they were in town. Had a wonderful waiter. Service was great! We ordered the Paella right after we ordered our drinks. It was incredible. Hit all the right spices. We enjoyed the brussel sprouts, croquettes, Smoked Chorizo and Roasted Pears while we waited for the Paella ( it takes a solid 30 min to arrive hot on the table). Will be going back for drinks and tapas soon!!"], ["Ashley R.", "Delicious. 7-8 tapas plus drinks was a perfect amount for date night with my husband. Hot cauliflowers, Papas (amaze amaze), Heirloom tomatoes with bleu cheese, and roasted mushrooms were the standouts for us. Didn't try the fried manchego this time but I'm sure it's awesome. How is fried cheese never awesome?? We will definitely return!"], ["Kristin W.", "Went here for my bachelorette party. It took an hour for our reserved table to be read, took 2 hours to receive everyone's food (they brought it each plate individually) the girl who received their food first was done eating  before the next girl received her plate. They then had the audacity to add a 20% tip to our bill."], ["Stephen O.", "Fantastic service, great food. All the dishes we ordered came out quickly and tasted great. Our server, Colin, was very friendly and welcoming and really made sure we were well taken care of. The place was pretty empty when we came and we got seated right away. But I believe that once people find out about this place, since it is still relatively new, that business will really take off. Great night!"], ["Braney M.", "Hands down my new favorite restaurant! The hot cauliflower is my favorite. The staff are super friendly and I love the atmosphere!"], ["Mark L.", "Eaten tapas in Spain and while not authentic to the recipes of the country still very good. Tuna Guac is mostly avocado and little tuna but tasty. Brussel sprouts are great. Mussels and chorizo are tasty and Potatos Bravas  are delicious. Great place and Jack is a terrific server and I suggest you ask for his section. Small wine list but works well with food. They could use mor Spanish wines to complete the meal."], ["Mark M.", "Unreal good.  Probably best meal I have had in Nashville so far.  Had Crispy Brussel sprouts, Spicy Tuna Guacamole, and Blustered Baby Heirloom Tomatoes.  Has good patio area, good atmosphere, and must have good drinks by the laughter at tables near me ;-)"], ["S R.", "This place is amazing!! I've been here twice for dinner with family members, and the tapas are really great. Both times we tried a bunch of stuff off the menu- everything was cooked perfectly, so there is nothing I don't recommend, but the real stand outs for me were the fried manchego, the dates tapa, and the chicken and hummus plate (this one really surprised me, as I'm not normally a fan of chicken, but it's phenomenal!). The staff are all on point and super friendly. Colin was our server both times and he is awesome!!"]], "Back to Cuba": [["John P.", "I keep coming back and I keep loving this place. I went alone yesterday so I could explore the menu a little more. I had the roasted pork dinner (rice, black beans, yuka), the cafe de leche, and the tres leches cake. And of course a beef empanada. It was all so good. Perfect way to spend a leisurely lunch on a Saturday afternoon."], ["Sergio S.", "Being from Miami, one of the first things I do when I move to a new city is look for Cuban spots. In true Miami fashion, I will also write this review like any Miami bro would. I'm an addict and when I need my fix please be sure to get the fuck out of my way. With that out of the way, this place is badass bro! I came for lunch on a weekday. Owner is sooo Miami. Got me the ropa vieja, tostones, arroz y frijoles, basically the whole damn menu. Can you say authentic AF? Cuz I sure can. Like for real though, that shit was fireeeeee. Irregardless, I dropped some Spanglish on the owner to build some street cred. It worked. After I finished ravaging my food the owner brought out some empanadas to go. Respect bro, respect. Oh and to those complaining about the service...welcome to your first Miami experience. Stop being soft and toughen up, you'll get the same service in Miami. You're right about the prices being expensive though but whatever its bomb Cuban in Nashville. I'll gladly hand over the plata."], ["Simon C.", "Ugh. Liked it on my first visit. Second visit a friend and I placed an order and then sat down. We waited a solid 40 minutes and asked about the food. It never came, so we walked out the door having wasted a lunch break. It gets worse from here.. The Owner ran out into the parking lot accusing us of not paying for our food. We explained the situation and she only said that the server must have done a bad job. No offer to get us food, no apology for the accusations. I'd like to have a good Cuban food option, but can't bring myself to go back and voluntarily give them my money after the experience with the owner."], ["Liz C.", "As a Cuban that grew up in Miami, this place is the real deal. The black beans are off the chain! Anything you get here is awesome. Love Alex, the owner. He's your typical, know it all, loud mouth Cuban. That's how we are.I had the pan con bistec & it was amazing. The bf ordered the palomilla steak with rice & bean plus French fries. My other friends ordered lechon asado with rice, beans & yuca. All was AMAZING & totally authentic. For the dessert we all ordered cafecito, rice pudding & flan. Will definitely come back while in Nashville."], ["Miriam F.", "Pretty good Cuban food. To get better than this you have to travel to Miami. Pork was excellent same as the black beans and rice. The yuca out of this world"], ["Corie K.", "Incredible! Perfectly seasoned, so good! Nothing fancy, just great tasting food! Wish it was closer to city center, I'd go more often. I can't believe it took me this long to try! Get the whole snapper- it's worth it! The roasted pork was super good too!"], ["Hart P.", "I enjoy Cuban food and had not found a good source in Nashville, until now. Family run with recipes that must have come from grandma. I have enjoyed the pork, fish and beef. Yes, I sample everybody's plate.The owner found out how much I have had eaten Cuban food and made sure I tried even more. I can safely recommend the entire menu. Do a dessert as well just to taste the local flavors."], ["Queen B.", "After the lunch rush hour, friend and I hit Back To Cuba for a late lunch.  She got the shredded pork plate (no substitutions, on any plate) and I got the grilled pork steak with fried yuca, moros and avocado on lettuce...They have a hot green sauce in a squeeze bottle that is definitely worth going there to have!My pork was tough, overcooked and dry, but.... the fried yuca was really good!Friend said her shredded pork was dry..  (maybe if they would shred it, and then refry it in lard, it would be more juicy)...$13 for my plate.$11 for her plate$2.50 for a side of plantains.(**** notice all the other reviews are on the Cuban sandwich.)I've had superb, cheap Cuban food in So Florida...This place does not compare.  But it is what it is.Not cheap, that's for sure.I will probably return in another 3 yrs.."], ["Nathan K.", "The food is quite good, or the Cubans are quite good.Of late, they are constantly out of Cubans later in the day.  This has to be their most popular sandwich (or certainly one of the more popular) and yet regularly out.  And I don't mean out by around 5pm--I mean out at 1:40pm.  They have an alternative sandwich, but its much smaller and not hardly as appetizing and its simply not a Cubano.There's also the occassional \"On 15/20 minute\" Break sign and locked door.  Its unfortunately not possible to know when the 20 minutes are up--which makes this challenging to deal with.  I saw this happen with roughly 3 people--presumably all employees on site.I've been a reasonably loyal customer for quite some time.This would otherwise be a 4.5+ review, but given the service and supply issue (ie not having key menu items on a semi-regular basis) I think it deserves a 3 out of 5.PS.  Its also closed on Mondays as I recall."], ["Charity D.", "AmaZing food. They've never let me down. From the cafe Cubano to the main dishes down to the empanadas- can't go wrong here! I highly recommend if this is your first time a must have is start with a cafe Cubano, have an appetizer or just skip straight to the ropa veja with rice, black beans and fried sweet plantains. If it is your first time, educate yourself with a google search or two before going so you know what you want to order. Let me address the service \"issues\". It's not American - there is a small language barrier - they aren't BK and they don't do it your way, get over it and enjoy the food."], ["Anna S.", "So ordering your lunch may be a little ambiguous when they are busy. Everything other than the Cubano sandwich is top notch. The fried plantains are so good and highly addictive. Back to the Cubano sandwich....only thing on the menu I don't recommend. The bread was like cardboard and cut the roof of my mouth. Can't go wrong with the fish or steak options."], ["Captain C.", "The Cubanos were huge easily sharableI would have liked them to be pressed a little moras the center was not hotChicken empanadas were greatVery large well stuffed and a killer chimmicurri on the sideInexpensive and will return again for that cuban fix"], ["Chris S.", "been here a few times. Food has always been good. The empanadas rule and the Cuban sandwich is delicious...the fries, which are pretty not memorable, are even good. They are just frozen shoestring fries but still. The only complaint is that they seem to run out of Cuban sandwiches alot. I got the last one the last time i was there and it was only 1230. I know it might seem kinda odd but a Cuban restaurant should not run out of its stereotypical main item.....its really good though if you can get it."], ["Sharon K.", "\"Back to Cuba\" is a solid choice for a good lunch. In the restaurant 'no man's land' near Grassmere Park this place is one of a handful of options. It is nestled in the modest strip mall on the corner of Harding Pike and Grassmere Park.You can get Cuban Sandwiches, pork tacos, or sauteed shrimp and fish to name a few options. I've had the shrimp plate with rice; the shrimp was cooked well, and had a nice tomato based sauce. It had a side of plantains which was awesome, then it had some sliced avocado (yum), and iceberg lettuce which was just alright, and then slices of tomato (these were not ripe though). I've also had the Cuban sandwich, no complaints there! The sandwich is huge, yummy, and very well priced. The lunch was prepared quickly and I was able to get in and out on a lunch hour with no trouble. The atmosphere is cheerful and cozy, it is a simple restaurant, family run and worth a visit if you work or live nearby."], ["Sarah H.", "I cannot say enough about this little place. The absolute best Cuban sandwich I have ever had. The black beans were seasoned to perfection, and the plantains...oh the plantains! You definitely don't want to miss this little taste of Cuba!"], ["Jamie S.", "Best churasco y chimichurri I've ever had! Even after living in Miami for 4 years and frequenting Versailles! Good service. Very chill. Worth the drive out. They definitely have gringo-fied their menu with tacos etc, but I would expect no less in Nashville. Missed the ropa vieja y Elena ruz, pero they had the essentials! They do have quite a large selection of sandwiches. Everything was delicious. Rice was perfect. Black beans 9/10. Cuban bread 11/10- flaky and fresh. Unfortunately they did not have desserts when I was there, but they do have flan and tres leches on the menu at least. It was definitely enough to make me home sick for more!! Will absolutely be back soon!"], ["Miss G.", "Yummy Sammiches.  I still don't understand why they are constantly 'out' of the Cuban Sandwich.  But, dang if it isn't convenient for take-out when you want something yummy that isn't pizza, mexican or chinese."], ["Suzi B.", "Authentic, delicious Cuban food. If this was in Seattle, people would be lined up around the block to get in. The cubano sandwich was big and tasty. Great white roll with crispy outside, delicious meat inside. Chicken soup was fresh and homemade. Great tastes. Divey goodness in a strip mall with a liquor store, two other restaurants and a gas station."], ["John M.", "Great Cafe Cubano and friendly conversation about Cuban politics and the island's future.Felt like I was back in Miami."], ["Tom J.", "I know nothing of Cuban food, but it's nearby so I've eaten here 3 or 4 times. I recently ordered the Ropa Vieja (shredded beef) special ($14) and it was good, but I've never been to Miami. I do know the black bean soup that came with it should not have been at room temperature, though the rice was perfect. The owner has a big personality, almost a Soup Nazi type, who does not allow smart phones to be used. But I'll buy in and say it's part of the place's charm. I've had other items such as the Cubano, and they all seem good enough, but there's an attitude of carelessness from the somewhat sullen staff, including, apparently, the kitchen."], ["Greg G.", "Yuck!Not honest."], ["Richard S.", "Not sure if I got them on an off day, but I am not feeling the 4 star loving. Greasy and semi bland Cuban sandwich and poorly spiced black beans do not cut it for my idea of tasty Cuban fare."], ["Monica S.", "Ok. Let me clear this up reap quick. The food here is delicious. I know what you're thinking....\"Why is she giving this one star?\"I promise I have a reason  I've been coming to this place for a while- great food, pleasant  staff, and true comfort  food. I was a Spanish major in college and a brief stint in Cuba left me with permanent  cravings for ropa vieja  and vaca  frita.  So when I say this is good Cuban food, believe  me, I mean it. That being said I just had my first interaction with the owner. I've dealt with my share of machismo- my father was Hispanic and I work with the culture everyday (I teach English to immigrants  and refugees ), but this gentleman  was unbearable. He was so pushy and rude I felt compelled to take my food to go. He almost didn't let me take my food- insisting that their was outdoor seating and I should stay- and then implying that I had seriously  inconvenienced them. Suffice it to say although the food is stellar I will not be returning anytime soon. I hope this business survives (for the sake of the other wonderful  employees), but the owner is, to put it simply, a jerk."], ["Coco D.", "I went there Friday it was slow yet my shrimp was cold in the shrimp tacos I ordered. The shrimp wasn't seasoned yet it was \"Grilled Shrimp Tacos\"!!!!! No heat at all. The fries were ok.they gave me a can soda and I had to ask for ice! Hats nuts. This was my first time there and I won't go back."], ["Christie D.", "Very good Cuban food!  Reminds me of eating Cuban in Miami.  Tasty plantains, black beans and rice, as well as the chimichurri sauce.  Pastries and café con leche were excellent as well!"], ["Keith H.", "Unfortunately, not impressed.  They were out of the Cuban sandwich, then the group and skirt steak were dry and lacking flavor. I've ate a lot of cuban food in Miami and this did not meet expectations or yelp reviews. I will give them one more chance and try the sandwiches but expectations are low. At this time, I would not recommend."], ["William C.", "Upon arrival we had to wait in what seemed like a \"we don't know your here\" situation, and we feared the worst based on hearsay of bad service. After about 10 mins our orders were taken and once we were served food (rather promptly I might add). It was like magic in our mouths! The camerones enchilados, the flan! The flank steak! Yes we shared and indulged in Cuban heaven! We will return and be happy to wait for what is arguably the best Cuban food we have ever had."], ["Ali S.", "This is the first and only Cuban restaurant I been to so I don't have much expertise but I enjoyed back to Cuba.  The Cuban sandwiches were tasty and also there chicken plate.   I highly recommend to check this place out"], ["Joe D.", "Amazing! This place is the real deal. Truly a hidden gem in an unlikely location. Authentic Cuban food, made to order, at a fair price. Highly recommended!"], ["I M.", "Great tasty food that feels authentic and gives us all a break from the standard sandwitches and plates you get everywhere else. I love the bistec sandwitch because the beef tastes like real meat. Also the fish al ajillo plate, super tasty and the only alternative to catfish that Ive found yet when it comes to fish meals. One of my favorite places in town"], ["G L.", "They never have the ingredients for a Cuban sandwich. I've stopped here 5 times and only had the Cuban sandwich once. I've left the other 4 times.  The sandwich is good if you ever get to have one.  20% chance though"], ["Eddie D.", "This is one of my favorite places. The sandwiches and other foods are amazing. Sometimes they do run out of certain meats for the sandwiches but its ok because there's other stuff on the menu that's just as delicious. The best sandwiches are the Cubano and the Miami. I had a pollo Empanada today and it was only a dollar. I could have bought 3 of those an been full. The food is awesome and worth a try. They do have plates like meat and sides but the sandwiches are where its at. Also fried plantains there and their milkshakes are pretty awesome. Don't expect it to be like a thick American milkshake though.When you walk in its very small and seating is limited but I like the feel of restaurants like that. I've never had bad service and the staff has always been friendly to me."], ["Ted C.", "I stopped by here after it's been burning a hole in my bookmark pages. I haven't had many Cuban sandwiches but even the 'eh' ones are still pretty good. The sandwich here didn't disappoint and I came in during a slow period so the counter service was friendly, though a little limited in the English. I ended up with the Cubano with the key ingredient: the crusty, toasted bread-which separates the men from the boys when it comes to the sandwich. I thought it was a little light on the roast pork-part of why Cuban sandwiches are so awesome since it's two types of pig in one convenient package. Still, the crusty, crunchy bread and the satisfying snap and crunch from it is still on my mind even after a few days. Just give me a second to recollect...Ok, I'm back.I got the passionfruit milkshake which was bright and fruity and surprisingly not super tart, more like a smoothie. Definitely worth the trip south."], ["Chris M.", "Service is horrible, but best Cuban sandwich ($7.50) I've ever had (including Cubanos from Miami and Puerto Rico) make it worth the wait.  Large portions on everything and great prices.  Not very many tables either so maybe don't go at peak time.  Great whole in the wall dive, I will definitely be back.PS. As there are no signs explaining anything in the restaurant, what you need to do is (1) order from the open counter, (2) keep your ticket, sit, and wait for your food, (3) pay at the cashier counter."], ["Daniel B.", "I wanted Empanadas. The Yelp lords showed favor via the App to a place near my house. I have been here before, but never had their Empanadas. Shame on me!The order consisted of two empanadas, one beef and one chicken. Both of the pastry goodness delights were encased in large shells. The meat pocket was on the small side leaving a large crimped edge. Each treat is less than two dollars and is packed with tons of flavor.The savory filling of beef was mild and had a green olive in the mix. It was easy on spice and nice light flavor. It paired well with the chimichurri sauce that I asked for because of its herbal garlicky bite.The chicken filling was really amazing. Although I was craving a beef experience, the chicken event stole the show. Wow! The stewed meat was flavor packed with a spicy depth of flavor and just a hint of heat. Good greif, it was good. I tried with the condiments offered on the counter, but it didn't need any assistance. The rich buttery crusts of both treats left behind \"chips\" that that I used to douse in the spicy condiments and herbal chimichurri. For good measure, I enjoyed a Cafe Cubano which was deep in coffee flavor and the sweetness of pure cane sugar. Oh, my, add a slice of their Tres Leches Cake after a couple of empanadas for $10 for the meal, you will have been transported to wonderful place."], ["Katie S.", "I love this place. I just went there for my 2nd visit and can't wait to go back for more. The food, as last time, was amazing, authentic, well-prepared, and I couldn't have been more impressed. The owner spent some time with us, sharing pictures and stories about Cuba. We left knowing a lot we didn't know before. Thank you!Edit: I forgot to mention two things: 1st, you must order in Spanish! It's a rule! 2nd, no cell phones are allowed while you're eating. The owner encourages you to enjoy the food and converse with each other! He's a lot of fun and it made our trip more enjoyable!"], ["Tiffany J.", "This is my favorite place to eat in Nashville. It's afforable and delicious. I always get the roast pork tacos with white rice and plantains. Tons of flavor in everything, including the rice. The blackberry juice is great too. The staff is always nice and I've never waited very long for my food."], ["Charles S.", "I hate giving this place a two star review. It's a small, locally owned business. The food is pretty good. The server was excellent. I just didn't feel particularly welcome. While my wife and I were enjoying our food, I received a text message from work. We normally have a no phones at the dinner table policy, but a glance at a message is okay at our table. While I was checking the message, a man, who I could only presume to be the owner, hollered at me from behind the counter, \"No texting, put your phone away at the table!\"My wife and I looked at each other, incredulous. I realize that it is his restaurant and he can run it as he sees fit, however, there was no sign notifying patrons of this policy. Also, if he wanted to make an issue of it, he could've visited the table and discreetly asked us to comply with his wishes. We DID comply, as I didn't want to be asked to leave while finishing my meal, but I will never dine in this restaurant again. It's a damn shame, too. The Lechon Asado was absolutely delicious. The rice served with it was also good, the beans just okay. If you go, be warned, the food is good, but keep your phone in your pocket, lest the Cuban Nazi make an appearance and bellow at you too."], ["Laila S.", "great tasting food, but never anywhere to sit, i always feel rushed (especially if you are lucky enough to get a table) and I don't like the way you order. I want to ask questions, ask opinions, and take a moment to review the menu. BUT over all the food is great, so i keep returning and jockeying for position of getting a table."], ["Kelly B.", "Good food! I grew up in Tampa and definitely miss the access to good Cuban food, especially a hot pressed Cuban sandwich."]], "Los Arcos": [], "The Patterson House": [["Joanna L.", "My boyfriend and I have been celebrating our 6 month anniversary this entire week. It's been pretty exciting. He loves Patterson house and it was my first time and it was really worth the wait. It's a bit cozy and we waited about 20 minutes or so on Saturday around 6:30pm but it was quite splendid. We were ushered into the room and sat by the bar right in front of our bartender, Matt. Matt was super. He gave us some time to look through the menu and poured us water which he was super attentive to. My boyfriend asked for something off the menu and he really went above and beyond to figure it out and made it for us and it was wonderful. We had two drinks each and we really enjoyed all four. We also ordered the pork rinds and shrimp corndogs and they were AMAZING. The shrimp corndogs are a MUST. The lighting is really dim but the everyone is great and the experience is completely worth it. Patterson house completely recommended many times over."], ["Travis B.", "The wait... 2 hoursThe drinks... WAY OVERPRICED.The bar..... NAZI.  You can't stand you must sit.If I pay $23 bucks for a drink I should be able to stand around the bar and drink. I will never go there again and will put out the word that others shouldn't as well."], ["Taylor P.", "My girlfriend and I were visiting Nashville for the first time and due to a recommendation from a friend that lives there, we went on Friday night.  Either make reservations or get there early! We didn't have a reservation and were fortunate enough to get there within 30 mins of them opening and we still had a 40 minute wait.  Once inside, the atmosphere is like that of an early 1900s speakeasy. Lots of natural finished wood, tin ceiling tiles, bartenders dressed in a way that further portrayed this vibe. I ordered a Southside with a gin that the bartender recommended instead of my original request (Plymouth) and he went into detail describing the finer points of what made it good. He sold me so I went with it - was very good. My second drink was a whiskey sour, and this was executed with perfection.   My girlfriend asked for a sweet/chocolate inspired flavor profile and he delivered. Her second drink was a Brandy Alexander which he made for her and let her try it before revealing what it was, which was fun.  The drink prices weren't terrible - $12 for most. This isn't a a \"rum and coke\" kind of place - go in with a flavor profile in mind and let them surprise you. The food was so-so - my girlfriend got the grilled cheese and tomato soup and I got the wings and the tots. The wings were pretty bad to be honest. To the point where they need to take them off the menu until they figure out how to make wings properly. They were breaded and just not good. Had an odd flavor. The tots were good but who can mess up tots? The grilled cheese/soup was good - but the soup was  somewhat cold when it arrived. This review gets 4 stars because the food definitely needs upgrading. The drink service and experience was outstanding. Will definitely be back!"], ["Joni W.", "Damn!  These were the best cocktails I've had in a LONG time.  Be prepared for a long wait.  For a party of three, we waited 90 minutes.  It sucked.  Bring a book and a jacket to wait outside.  Bring a game on your phone.  Get prepared for killer ambiance and some of the best drinks you've ever tasted, EVER!"], ["Lizzy Z.", "Great little speakeasy with cool decor. The wait can be long, but it is definitely worth it. They do not allow standing, so you have to wait for a table.The drinks are amazing and you can watch the tender, loving, care they put into each of their drinks. They have a small menu of appetizers -- GET THE SLIDERS. You will not regret it. I would NOT suggest coming if you're hungry. I personally love their take on an old fashion.  The password is Platypus Spoiler Alert: there isn't a password."], ["Mia F.", "Ok, I've been here a couple times. In my opinion it can come across as a little pretentious - depending on  your server and the mood they are in. The appetizers are nothing to write home about -  I was there once and we had tater tots with sour cream dip (ummm, it was ok), but I digress. The apps are not why you come to the Patterson House. . . .it's the cocktails. I've sat at the bar and ask the tender to make me something that tasted like a warm spring evening, and he nailed it - I can't recall the name, but it was a great drink, and it was awesome to see the talent behind the bar. It's a little pricey, but I enjoy coming here to have a swanky before dinner cocktail with my love and this is always on the list of places for family and friends to visit when they come to town. . . at least for one drink."], ["Mitch E.", "People tend to say the original is better. They're wrong. At least when we're talking about the cocktails at The Patterson House. The hype is big and the hype is real about The Patterson House. We stepped in and didn't have to wait that long, maybe ten minutes. Not bad for a Saturday night. The drinks here are legit. Starting with their bacon infused old fashioned. When ordering it, I asked the bartender if they heard of New York's PDT. He told me yes, and they had gotten permission to make their version of it. I'm so glad they did. It was better than PDT's and that says a lot. My friends and I ordered several rounds of drinks. Sampling and trying different creations that out mixologist concocted. Without a doubt in my mind, it was the best cocktail bar I stepped into while down in Nashville. Make sure you swing by."], ["Jacqueline M.", "So glad I found this little speakeasy prohibition type bougie-feeling lounge! The wait can be a little long as noted on other reviews since it's a \"sitting bar\" only and the lounge itself is not huge. We were lucky enough to get a booth after about a 15 minute wait but soon after lines were piling outside to try and get in. The Patterson House is limited in food items and we ordered just about one of everything since we'd skipped dinner. The menu is divided by liquor type and it's a lot of choices so be ready to take a minute before ordering since drinks tend to be priced a little on the higher side but they do not disappoint. Favorite food items for the night were the fried brie, the wings and the sliders. Tater tots were a little on the greasy side and the ones at Merchants are way better in my opinion so I'd probably skip it and opt for another choice. Overall this place had an awesome vibe...much different than some of the other bars you'll find in that Vanderbilt area so I was definitely thrilled to have discovered it on Yelp."], ["Krystal T.", "I love this place for its attention to crafting the perfect cocktail. The menagerie of liquors is mind-boggling. I recommend sitting at the bar if you've got a small group and watching the bartenders mix your old-style drinks.The old fashioned is the best in town, and you cannot get a true authentic Tom Collins, French 75, etc anywhere else. The bacon old fashioned gets a lot of hype. Personally, I think the bacon infusion smells like bacon but tastes more chemically on the palate. I would just stick to a classic old fashioned.Ambience has a true speakeasy feel with damask walls, chandeliers, and dimly lit interior with leather booths and seats. Come here for the drinks, but only nosh on the small eats to calm your booze-laden buzz."], ["Joanna R.", "Mehhhh. The cocktails were good and the fried brie was amazing, but for an hour and a half wait, I expected soooo much more.Once we finally got inside I was surprised to find there was nothing about this place that was \"speakeasy.\" Everyone was yelling over the loud music, which I was also sad to discover was not Sinatra or something similar. The service was impeccable but other than that, save your cash."], ["Carrie L.", "I was actually pleasantly surprised by The Patterson House. I wasn't overly enthused after reading reviews about the price/wait but we went to dinner in the area and decided to just check it out. Also it was recommended by Tami Taylor/Rayna James/Connie Britton in an article I read. We had been in the area the day before to go to Hattie B's and were able to scope out the location. I'm glad we did because there are no signs visible from the street so it would have been even harder to figure out in the dark.We showed up around 8pm on a Monday and there was no wait! Off to a good start. We sat at the bar. I was hemming and hawing at the menu. I didn't want to get something I could get at just any bar but didn't know exactly what I was in the mood for. Plus I had no idea what half the ingredients were so I just ended up winging it and getting a drink with rum. I can't remember the name but I think it's one of the first one's listed on the rum section of the menu...and it was amazing. Big fan. Citrusy and rummy and yum.It is a cool atmosphere and one of those fun places to come and feel fancy. It definitely wouldn't be a place I could afford to frequent but a nice ambiance and tasty cocktail. Perfect for a date or girls night.Added bonus: the 3 bartenders were all veryyyyyyyyy attractive."], ["Kevin M.", "Sean took care of us at Patterson house. It was our first night in Nashville and he was not only an amazing bartender and skilled craft cocktail man, but he gave us some great places to hit while we are in town.  The food was good, but come here for the atmosphere and drinks. The retro styling of the bar is much more suited to the newer style trend you see.  Hit this place up, well worth the stop. Has a Brooklyn, a bacon old fashioned, both were fantastic. The smokey was of the bacon old fashioned was solid, but the Brooklyn was amazing."], ["Bethany W.", "Another Nashville standout! Go early, as they don't allow standing, or be prepared to wait. The vibe here is outstanding; it beckons back to an earlier, simpler time. The bartenders are very knowledgeable and whip up incredible drinks with lots of depth; don't miss it!"], ["Jennifer P.", "This might be the HIGHLIGHT of our anniversary trip! This venu is beautiful, old world, charming. The bartenders are in suit vests. The lights are dim. The drinks are phenomenal! This is NOT the place to order a whiskey and coke. This is the place to try something new. The bartenders put on a great show making their concoctions and every liquor and infusion is the highest of quality. The drinks are fresh, new, different, adventurous. Embrace the concept and trust your bartender. Ours was great. He asked a few questions about preferences and delivered delicious product! One drink came out a little too dry for me, he remade it for me sweeter and didn't charge for the first. These guys are really here to make sure you get quality drinks you love, tailored to your tastes.We ate prior, so we didn't sample the food. But the girls next to us had the tots and brie and were really happy with them. They looked fantastic.I wish I could take this bar home with us. No matter why we are in Nashville next, if we can manage to go here we will! If you are open to a little adventure, this will be amazing for you. I wish I had more stars to give them!"], ["Samara K.", "One of my favorite places in Nashville.  My boyfriend and I dressed up as Jay Gatsby and Daisy Buchanan for Halloween so we figured this would be a sweet place to have a couple drink.  We only waited around 10 minutes and then we were seated at the bar.  The atmosphere was dark, music was perfect and everyone was great.They have a menu that's divided by base liquors and the drinks are listed below.  We both started with a whiskey cocktail and loved watching the bartender craft our drinks. Most drinks were around $12 each so a little pricy but so worth it.  They were great so we had a second round.I would definitely recommend!"], ["Kristine H.", "I absolutely LOVE the Patterson house. My favorite joint in Nashville that never fails to impress me night after another.  Drinks are top notch, and small bites to die for! The bartenders are super knowledgeable and servers are very accommodating to help you find the perfect cocktail.Highly recommended!!"], ["Kelli M.", "This place is very selective on who they let in.  What a shame.  We came to Nashville excited to try this place. Because we were not in our early to mid twenties (We're very hip and dressed impeccably well- as far as that goes, AND in our late 30's) and were not dressed in popped collars and designer threads, we were shoved to the side.  The hostess was dumb, and not friendly.  I'd never recommend anyone trying this place due to those facts alone."], ["Jazmine V.", "I REALLY like this place. I will be back. Let me preface by saying their food/drinks are a bit expensive...even for the thought/dedication that goes into the drinks. $12/drink for most drinks. Apps range from $6-$15. I had the oysters. There were 5 of them. They were very good...but $15 is a lot of money. But lets focus on the positive. You're basically walking into a pre-prohibition bar. The ambience is amazing. The bartenders look...handsome and well-trimmed. They are really good what they do. They will make you drinks that aren't on the menu if you just let them know what your taste is. Be careful, you might get lost and miss this place if you don't know exactly where it is. It's discreet. But it's an experience that you've likely never had."], ["Dennis J.", "Fantastic venue and drinks. Would highly recommend.I stopped by by myself on a Sunday evening around 9 PM, and I still had to wait about 30 minutes to get into the bar, so the place is extremely packed generally speaking. I dropped in to have a few drinks, the first of which the bacon infused bourbon. It was a very flavorful and subtle drink, and the cocktail list is extremely expansive and well constructed. The bartender was very engaging and informative for drink recommendations, and the venue is not too loud and not too dark, making it very conducive for conversation for small groups. It's a great place with great drinks and for small groups."], ["Alice W.", "Nothing tickles my pickle like a $14 cocktail and this place is one of the best cocktail places in the country. The cocktails here are legit and you could tell that the bartenders really know what they're doing. The bartenders are artists that take pride in their craft.My hubby and I had 4 drinks here. One of the standout was the bacon manhattan. Our second round of drinks, our server asked us give him some flavor profiles that we like and he made drinks for us. It was just great talking with the bartenders about bitters and even dough starters. They're so knowledgeable and obviously love what they do. What a gem. Be ware that there's going to be a wait but it's so worth it!"]], "Eastland Cafe": [["Cristina M.", "Great food for our company dinner. Fresh, pretty fast and consistent! Staff knew the food and drinks to pair. Must go even if you don't buy out the restaurant and have a set menu!"], ["Johnny T.", "4.5Eastland Cafe might not get the press/attention of some of its neighbors or comparable restaurants in the city but, trust, it's serving up some excellent food, satisfying cocktails and engaged service -- all in an environment you're going to want to experience. It had been on my to-try list for months and I'm glad that I had the opportunity to go there. Parking's a breeze (street or nearby lot) so don't let that be a deterrent (and, please, don't park across the street).Once you walk in, you realize that the space is a bit bigger than it appears from the street. This allows your group of six (or so) to be as comfortable as you might be on a date. It's homey and inviting but doesn't sacrifice ambiance for either. As is my custom, I began the evening with a cocktail before delving into wine/beer. As an homage to my many years in Chicago, I opted for the Violet Hour: gin, lemon, simple syrup, and lavender bitters. Unsurprisingly, it was a floral yet muted beginning to the evening. I'm not the world's biggest gin fan but I found myself intrigued by this cocktail. I'd, gladly, order it again. As I sipped my cocktail and took in the mood lighting, our waitress brought out a hot bread basket with chimichurri. Pace yourself on this or else it's game over. Because we weren't carb-loaded enough, we ordered the chitarra pasta -- which I liked saying because, Thundercats. It's an addictive melange of: red bell pepper emulsion, sun dried tomato, garlic, shallot, chile, and tapenade crouton. Incredible.For dinner, I thought I'd slow it down with a beer and some comfort food. I was looking for a barleywine but there wasn't any on the menu. I didn't hold it against them. Nashville is still getting its footing when it comes to beer. I 'settled' for a bourbon barrel ale to accompany shrimp & grits. Yes, I came to a restaurant like Eastland Cafe and ordered shrimp & grits. And, you know what? I'd do it again. These were ridiculous. Even though I am a native southerner, I am relatively new to the world of grits. I blame Cream of Wheat and early school days. Now that I know the warm hug of properly-prepared cheese grits, it's a new story. Not only did the plate have an ample amount of sweet & meaty shrimp, the grits were a star in their own right (and not just a side show). To the cheese grits add a healthy dose of mushrooms, green onion and lemon... and, man... don't even know. Again, coupled with my beer, it was the perfect pairing for a cold evening.But, if I was going all in, I couldn't just stop there, right? I had to have dessert. I had to have the granny smith apple donut. I mean, it's apple rings (healthy) fried in a cinnamon dough (donuts) and served with caramel ice cream/gelato/I don't know. My eyes had glazed. My ears weren't functioning. All I knew is that I had to eat every morsel of food on that plate. All else was inconsequential. After dinner, I barely made it home before popping my top button on my pants and passing out. Yeah, Eastland Cafe needs to be in your rotation."], ["Mia F.", "I've lived in Nashville for  9 years, and never gone to Eastland Cafe. I heard great things for a long time about the restaurant so decided to try it. . .  Honestly, I would give a 3.5 Star review if I could. It wasn't bad at all. . . just wasn't what I expected from the hype and for the money. Husband and I popped in for a quick dinner on a Sunday. We got a table right away, and the service was really good. We both ordered cocktails, but my husband had to send his back - it didn't taste much like the description, and the bourbon was weak (weak enough that I could sip it  - and I hate bourbon) . . . our server even agreed. We sent it back and he just ordered Bourbon on the rocks. However, my drink was great (gin, lavender and rosemary I believe). We ordered the Margherita pizza and shrimp and grits. We didn't want too much, so we decided to split the shrimp and grits. $4 plate sharing fee. .. .ugh. Really? The shrimp and grits were good, different -  with a French flare, but good. The decor was nice, service from our waiter was really good, but the food. . . it was just good. Granted pizza and shrimp and grits aren't anything adventurous. . . but still - for the cost of the drinks and food.I'll definitely try it again and order something different. . . . but it took my 9 years to get there the first time."], ["Shannon S.", "Reading through the reviews of Eastland Café prior to our dinner we expected a mixed bag of experiences. We got just that. The bartender (Will) was lovely to chat with and very accommodating while we waited for the rest of our party to arrive.Once we all sat down it took the server about 15 minutes to get to us at all... and the restaurant wasn't even full. We ordered appetizers which were overall delicious: pork belly, charcuterie plate, fried green tomatoes (not so delicious) but then had to pull the waiter back to order our meal.While others complained their chicken was dry and without flavor, ours was really yummy. Seems strange for a restaurant to have so many inconsistencies. They also charge $4 to split a plate which seems ridiculous to me. We had several courses! Overall the food was good but the service was really bad. It would be hard to recommend this restaurant to others."], ["Hilary H.", "This review is merely for happy hour. There were plenty of drink and food options with great prices for happy hour. The outdoor space is very nice and comfortable. There was nothing remarkable about the food- we had the pot stickers margarita pizza and pimento jalapeño cheese dip and all tasted pretty good... But I'm sure  those were the same pot stickers I buy at trader joes. Alas, the taste and speed of delivery were both good ... I'm excited to come back again to dinner. Oh and the sangria was great!"], ["Katherine R.", "Great neighborhood restaurant.  A little noisy when it is going strong at 7:30 on a Saturday night, but it was good food and service.  Enjoyed the modern industrial feel with a cozy atmosphere."], ["Liz W.", "Appetizer was good. We had fried oysters. Yum. The ambience was nice. The main meal was AwFUL!!! Both my husband and I ordered the grouper fish special at 29/dish. We spent the night trying to cut through a big piece of rubber!! We just fought over our daughters $6 kids meal. Will sadly NOT go back I cannot believe how much we paid for Panko crusted rubber"], ["Hall W.", "So I have a mixed feelings about this place.Lets start with logistics - good luck getting a seat on time (even with reservations - we waited about an hour) because this spot has become insanely popular (especially during the winter). They also seem to run out of things rather quickly (i'm assuming popularity has something to do it - then again popularity might be a sign of how they are doing things right).There seems to be an utter shortage of staff and I felt really bad for those that were there, just completely unable to keep up.Now the food is to die for and probably the best I will ever have in Nashville without losing my bank account. Everything from the bread to the salmon to the goat cheese spread is a heavenly experience. The portions may not be French, but they are on the smaller side of things for an American food standards. I will also say that the staff was super friendly to do what they could to take care of us when things died down and give us alternative menu options and comp us for the wait - which I really appreciate."], ["Jake S.", "One of my favorite happy hours ever. GREAT food and drinks for CHEAP!! Two thumbs up."], ["Kayla W.", "Wonderful atmosphere! Some of the best wait staff in town!  The food was perfect in every way! I could have ask for anything more!"], ["Allie W.", "Amazing amazing amazing! The goat cheese appetizer is a perfect way to begin your meal. The roasted red peppers really add to the app. I've only eaten the steak here, as it is one of the best steaks I've had in Nashville. It changes regularly in terms of cut and sides, but has always been delicious. Extremely tender and always cooked to mine and my friends likings. The service has always been impeccable, even on busy nights. Be sure to make a reservation as they are sometimes completely booked up for walk-ins! They are on open-table, which makes things easy"], ["John W.", "The hostess was very pleasant and friendly. Our server Nick (lots of tattoos) was a great server and very friendly. As far as good goes, don't expect the goat cheese brûlée flatbread to be a flatbread pizza. It is more of an appetizer style. The chargrilled broccoli lacks and char and is very undercooked. They have a quaint patio with two tables. On a good night, I would always recommend sitting outside."], ["Frances K.", "Fantastic service, food, location, and atmosphere.  There was nothing that I did not like about our dinner at Eastland Cafe. I split the PEI mussels with my husband.  We really really like mussels and these did not disappoint!  We also shared the margherita pizza which was much like a standard delicious  margherita pizza, but this one was extra FULL of freshness and flavor.  The cheese was extra melty and flavorful and the basil was really fresh.  Along with the fabulous food, my cocktail was also  top-notch.  I had the Violet Hour - because if I see lavender on the menu, I'm getting it. Our server, Nick, was also really great.  He was helpful and kept an eye on our table without constantly checking.  When he found out that we had just arrived in town, he made a list of places he recommended that we see while in town and really made us feel welcome.  He also recommended a sinfully desert - if they are serving the apple/donut/ice cream thing you must get it - especially if you like things that melt in your mouth. If I lived in Nashville, I would eat here regularly - can't wait to get back and eat here again!"], ["Judy J.", "My daughter and I stopped by last Friday night.  We were eager to eat here as we used to be regulars but when she went off to college I stopped coming as often.  This is my first yelp review and I hate to have to write it but the service was seriously off.  We were greeted by a nice lady at the door who gave us a table immediately, which was unexpected because it was a weekend night.  Initially we had planned on sitting at the bar and having cocktails while we waited as we did not have a reservation.We sat at our table long enough that we both read the menu a few times (it's a small place, with a small menu) by the time our server made it to us we were ready to order everything from drinks & salads to entrees.  Our server had a lot of tattoos and he seemed to have an ego/attitude to go with them.  It was a weird situation because we got our table so quickly and we were so grateful but this fella took a long time to get to us and then when we were ready to order everything it seemed as if we were annoying him.  The drinks came out quickly as did the food and every morsel was delicious.  My daughter had chicken and rice that was great and I had their fish special of the night and it just about knocked my socks off!  The food here is just that good!  Here's what concerned me the most about our meal.  As we finished our entrees I went to the restroom.  There were a couple of ladies in front of me so I had to wait.  The restrooms are close to a waiter station and the kitchen so I sat on an ottoman while I waited.  Our waiter was close by and I heard him talking about how he wasn'tt making good money so far that night followed by a longer conversation with a cook about an employee that he \"got fired\" that day.  There is no place where this kind of behaviour is appropriate.  That restaurant is very small and a customer should never hear that kind of conversation!  I was appalled listening to this guy talk about how he \"made phone calls\" and was going to be calling the shots.  Finally the restroom came available and I returned to my seat shortly after to find that instead of being offered dessert, the check was on the table!!!  When I asked him if we could have a dessert menu he rolled his eyes and listed off a few things but his delivery was so aggressive that we paid the check and went across the street for ice cream (which I will post a review for them as well).I'm not sure I'll return any time soon as I was really turned off by the lack of care our waiter had for us.  Obviously there are some things going on with this place but as a customer I shouldn't be subjected to them.  Our bill was over $100 which is typical these days but I didn't leave satisfied after spending that kind of money.  Not because the food wasn't good but because unfortunately although we got a table fast, we got a rotten egg server.  Maybe we will have better luck next time.  Maybe."], ["Chris B.", "More like 3.5 the food was good not great, with some interesting dishes but overall there are Better restaurants within walking distance."], ["J Alan S.", "I have spent a lot of time in Nashville over the years and my trip back was a reaffirmation of why I love this city. Besides the music and nightlife, it is one of the best \"food towns\" east of the Mississippi. On my \"zingarates\", I like trying new and different places to sample the soul of the city. I found just that when I visited Eastland Cafe in Nashville's Eastwood neighborhood.This \"trendy\" spot features great \"New American\" cuisine and a relaxing, comfortable atmosphere, which was exactly what I was looking for in the \"Music City\". Their menu was simple and concise, which pleased both me and my partner in crime.We began our culinary journey at Eastland with \"Charred Octopus\" featuring Peruvian beans, minted yogurt and arbol chile. It was simply divine. Tender and full of flavor. One of the best octopus dishes I've ever had. We also ordered their take on \"Agnolotti\" stuffed with winter squash, sage butter sauce and toasted pecans. Another superb dish.For my main, I ordered \"Duck Two Ways\" one seared and the other confit. It was amazing! The dish was complemented with farro, collard greens, chestnuts, fig jam and a laurel enhanced jus. What can I say? It was delcious.My partner in crime ordered their \"Tennessee Hereford Short Rib\" featuring braised carrots, cipollini onions, fingerling potatoes, spaetzle and a superb demi glace. Yet another amazing dish.All-in-all, a fantastic evening filled with first rate food, great service and a large selection of wine . I simply can't wait until I visit Nashville again! Job well done Chefs Wright & Lamb!"], ["Thomas B.", "The food, service, atmosphere and cocktail hour (4:30-6) is awesome. Go grab a $5 manhattan and a $7 pizza next Saturday and you will agree. Or go for dinner and get the duck (or anything else on the menu)."], ["TJ S.", "The food is okay but not a good value at the price point. Service is extremely slow. I would recommend finding a better place in the city."], ["Amanda B.", "The food was pretty good. We ordered pizza margarita and the goat cheese appetizer. We were starving after a long car ride and it was not the place to come. This place is good to come for drinks and a snack. The food that we ordered was good however nothing wow'd us. Cool atmosphere though!"], ["Steve E.", "How have I missed this and why is the buzz absent? Duck breast and fish dishes were both spectacular, service is great, menu varied and full of flavor. May have been shoved aside with all the boom in the food world in Nashville, but this place is a pro."]], "360 Bistro": [["Foodie A.", "Received a message they are hiring a new chef so I have edited my review."], ["Karen U.", "I used a Groupon offer to visit this restaurant tonight. I went early to avoid crowds, and was surprised to see people coming in at such an early hour. My server was Justin who presented the menu, wines and specials comprehensively without missing a beat. When I told him I like a certain type of wine and asked for a recommendation he presented a delicious selection. The soup was quite delicate and I chose a scallop special that was unusual, but very nicely done with just the right balance of spice. Portions are generous, so I brought desert home. I had a good experience, but I was surprised that the server assisting a couple close to me could not explain what a tureen is....one of the specials served as such....."], ["Juliana L.", "The service was pretty good.The 11oz. veal chop was ok, overpriced in my opinion. The crispy flatbread was pretty good, a great start to the meal. Maybe it set my expectations too high for the rest of it. My mom got the halibut, which was good, but again, really think they set the price too high, even if it was a special.They have a huge selection of wine on tap; the prosecco was delicious and bubbly like it should be because of the tap.Think if I'm going out for a nice meal and want to spend $100+ for 2 people, I'll go elsewhere."], ["Maya C.", "I just went to Nashville for the first time this February, and my last dinner there was at 360. And this place has it all.They let my friend and I in at 430 because it was relatively chilly outside, and they didn't open until 5.  They brought us our wine early, and the kitchen offered to open up at 445 for us.So, ambiance - well it started out quiet for us at about 5pm.  Then, within the hour of the place opening, it was jam packed. This was a Sunday night. Sooo many people were there.  Amazing service. The servers and hostesses all worked together to clear off tables and greet/seat people.  The restaurant is small so they aren't having to cover too large of distances. They really had a group feel to their work ethic.  Sit in the heated patio area when it's chilly. that was wonderful.Our server was hilarious, knowledgable, and provided the perfect recommendations.  He knew all his wine pairings and hit the flavors I liked spot on.  The wines were amazing, but very expensive.  At least for me on my poor, college student budget. regardless, I paid my $200.00 with a smile because this whole experience was phenomenal. Anyways, the servers were great. I drank the Oregon pinot noir called Cumming Road and that was delish. had the best dusty/smoky feel at the end. really enjoyed that with my pork chop... which came with pancetta, green beans, apple butter, and goat cheese cornbread. mmmmm. so juicy. the glaze on the porkchop was perfecto. mmmmphf.the appetizer we had was the fried calamari which was okay, nothing to RAVE about. I was starving, as was my friend. We snarfed the whole thing down, but the marinara was nothing special, neither was the fish. very plainly done Italian style. But - I liked it regardless. My friend ordered the short rib with broccolini and parmesean polenta. that was delicioso as well. mmmmm. so tender. sauce was perfect. broccolini cooked just right.and then, we bought a bottle of Kiona to go. mmmm. drank that back at the place we were staying... delish cabernet. I liked the pinot noir, but I prefer much dryer wines. For dinner though, the pinot was fine.dessert was the trio gelato scoops. we had berry, coffee, and mint.  biscotti came with. I wouldn't get this again. the ice cream was flaky and weird textured. flavor was good, but the texture was not for me. ambiance was very professional/classy in my opinion.  Dress nice, it seems kid friendly, but I didn't see a ton of kids.. didn't see much on the menu for kids either.music choices were great as well. it's always nice to have sweet background tunes.overall, you can't go wrong here. check it out, splurge, and enjoy. it's not worth the trip to 360 if you aren't going to splurge. so do it. go big or go home. sorry for the cliche, but that's just how its gotta be at the 3-6-0."], ["Charli J.", "I have been impressed with a few Nashville restaurant menus featuring local fare, grass-fed meats and outstanding plating presentation.  However, when it comes to Bistro 360, they take the cake when they take on and wonderfully execute the aforementioned.  Local produce, Grass-fed meats from Cox's Farm and Gold's Farm, the menu entices locals and travelers alike.If I had a motto it would be, \"Try everything once, even if you don't go back for a second helping.\"  That said, if duck liver pate or a white anchovy dressing doesn't have you looking forward taking your next culinary plunge, maybe a Handmade Potato-less Sundried Tomato Gnocchi with Lump Crab or a Sweet Tea-Brined Pork Chop will.I have only had the potato version of gnocchi before and was blown away by the silky texture of these.  Served over watercress with a lightly acidic lemon butter sauce that weighed down not one bite of the huge chunks of crab, I was in such 'awe' by this dish I almost had to pick my jaw up off the floor upon swallowing my first bite.3 words:  Goat.  Cheese.  Cornbread.Yes, I said it.  I ate it and loved it, too.  Accompanying french green beans and crispy pancetta, topped with a juicy pork chop and served atop a savory apple puree, my 'borrowed bites' weren't enough to fulfill my needs... this is THE dish I will be getting myself upon my next return to 360 Bistro.Long wine lists seem daunting?  Don't let this one be.  Your server will know exactly how to serve you and how to answer your questions.  Go ahead, test his/her certified sommelier knowledge!From the top: Ample parking, friendly seating staff, very knowledgeable servers and a tremendously chic ambiance & atmosphere.  Gorgeous--and I mean gorgeous--plating, equally enticing and deliciously delivered local food, and perfect wine pairings.  On the pricer side (most especially if you have alcohol on your bill or dare to try a succulent dessert) but worth every single penny."], ["Justin R.", "My girlfriend made a reservation here for Valentine's Day dinner. Let me start off by saying that the fixed menu was horrible. Not only was there not many options, but they ran out of certain items. I started off with a tuna carpaccio style appetizer that was passable at best. My \"filet mignon\" was brought to me well done when I asked for rare and was DEFINITELY not a filet. I'm not sure what cut of meat it was, but it was grainy and impossible to cut with the steak knife I was never given. On top of that the rest of the accoutrement was inedibly under spiced. Finally, the kitchen ran out of the dessert item we ordered at the beginning of the meal and we were never told until the end of the meal when they brought out the other options and just dropped them on the table. Don't get me started on how they failed with my girlfriends meal. In addition the cocktails we both ordered were poorly mixed. Over all I was incredibly disappointed. The restaurant was freezing cold and the service was passable. Putting up with this for the fixed menu price was tough. Will not be going back."], ["Ashley G.", "My mom & I absolutely LOVE this place! Great menu, great chef, great drinks, great service."], ["Meshelle E.", "Absolutely outstanding!  This was my first time there as I only learned about it through Groupon.  Not a single flaw.  Being a restaurateur I can almost always find some pretty big flaws......not this time. I had the scallops and my friend had sea bass.  These are some of the best scallops I have ever had.  I travel all over the world and am a true foodie I would put our experience last night up against most of my other favorites in large cities.  Blow your mind wine list and fantastic prices on their wines.  If you are someone who is looking for a cheap deal and don't appreciate good food don't waste your time and then write a bad review about prices, spare us all.The servers Justin and Josh were also outstanding.  Extremely attentive and very knowledgable about the wine and food menus. Looking forward to my return visit to Nashville as I have a new favorite restaurant!!!"], ["Marie L.", "Wonderful ambience. Odd location. I felt everything on the menu was overpriced. Our wine flights were 19 and 20 each, and they were just moderate wines.  We ordered the fruit and cheese plate for $19. It had two grapes that had been QUARTERED and scattered all over the plate and approximately 8 tiny slices of cheese. The bartender, as friendly as she was, could not even tell us what kind of cheese we were eating and made no attempt to find out. As for attire, this place seems like it could be whatever you wanted it to be. If you wanted to have a date night, you could dress up and noone would think twice. The same thing goes if you were going out for a casual night with friends."], ["Samuel E.", "Its been 2 years since I have been, so I don't remember the exact details except that I loved this place. The food was absolutely fantastic and the wine selection was amazing.This place is how you do it restaurant owners. The trend in Nashville for 'nice' restaurants is to dim the lights, have modern art/architecture and charge exorbitant prices while lacking true atmosphere, service and quality. These guys however nail it.The only complaint is the location...."], ["Marcos C.", "Great place, casual formal.. Waiters are very up to date with menu.. We downloaded a groupon coupon ordered a bottle of wine and food.. The original price was $135.00.. Ended up paying $48.. Thank you groupon.."], ["Bianca K.", "Today's Lesson: Customer Service ... and lets not talk about the calamari (eek).This bar is known to have some pretty high rollers frequent through so I shouldn't have been surprised when a co-worker and I were treated like peasants. Not many people inside, besides a few well dressed gentlemen with their lady friends here and there, so we figured we would receive great service and be able to eat within no time.. sooo not the case.. We ordered a lemon-meringue martini, which was ABSOLUTELY AWESOME, but unfortunately the bartender seemed very disinterested in serving us. I figured that maybe she was having a rough day or something so I paid it no mind at first... We politely waved her over so that we could order the calamari appetizer. She went from skinning and grinning in some old guy's face to looking at us as if she had a nagging dog biting at her ankles. Not sure if its because we lacked Rolex's and tailored suits or what... but I felt as if our business wasn't appreciated due to the fact that she assumed that we weren't going to spend any money. SMH! I guess this ism could be labeled as classism. NEVER AGAIN will I visit.-P.S. This place should reconsider the breading on the appetizer... not worth the money at all."], ["Jay G.", "A restaurant of course but I always sit at the bar. Being a drunk i always feel more comfortable actually sitting in view of the bottles I am knocking down one gulp at a time. This great space located just off the corner of the Hillsboro Center. They have a great 'happy hour'  from 4pm to 6pm. $5 martinis and 1/2 priced apps. A great deal. I tried the Mango Margarita but ended up in love with the 'Pumpkin martini'. A tasty elixir topped with freshly grated nutmeg.In addition to the great bar here what I liked was the scene, yea, its a milf scene. Much like a riverbank can become host to all types of oddities and treasures that flow through the arms of a river, 360 Bar is at the end of Belle Meade, Chickering, Harding and Tyne Blvd, modern rivers of pavement all. What flows through these areas and into the 360 bar isn't the runoff, gravel or sediments that one might find at Applebees or Waffle House, but gems, diamonds, rubies, the lode of Nashville's femininity, sanded and polished at St. Cecilia and Harpeth Hall. Bored housewives in need of a drink. Its a beautiful thing. These girls take care of themselves, no spandex or Lane Bryant here..It seems that it was important to meet the chef, Aaron, a lot of patrons there were visiting with him, a nice enough guy. He's supposed to be a magician in the kitchen, perhaps even a mad sorcerer.  On my first night here I ventured no further than the 'burger with fries' with a side of Gorgonzola, naturally. It was great, outstanding. I can't imagine how it could have been improved upon..except perhaps one last pumpkin martini for the road.."], ["VIcki T.", "Celebrated a wedding anniversary here last night and the experience was very pleasant.  Ordered the calamari - which my husband and I considered to be one of the top 10 calamari appetizers we have ever had - and we order it everywhere almost every place available.  He ordered the halibut special which was great and I had the burger which has a hint of sweet bbq and the fries are served in a miniature fry basket.  Well worth the $20.  Unfortunately, they were out of the wine my husband ordered so he substituted and it was not quite up to par at $25 for each glass - the wine was more expensive than our entrees.  Next time we may bring our own wine even though they charge a $25 corkage fee.  We would also be able to enjoy the wine at the proper temperature.  Overall, very good experience and the servers (especially Josh) were very attentive.  We will be back making minor adjustments."], ["Lyndi S.", "I walked in this place a little bit skeptical.  Partially because Nashville doesn't do fancy as well as they do dive-y.  Mostly because when Nashville does do fancy, it's hit or miss with the snooty-factor.  This place definitely did right by Nashville!  And by my visiting mother, who was looking for a nice night with a decent cocktail and a light meal.I arrived expecting a somewhat emtpied out restaurant, with 20-somethings crowding the bar.  I was shocked to find a pretty wide ensemble of people, and a crowded date-night scene.  The bar was open, so we sat there and got right down to brass tacks.  The drink menu.Great selection of wines, and a lovely little list of martinis and refreshing cocktails.  I went with a dry, nutty Shiraz, while boyfriend took on a deliciously spicy and fruity Syrah.  My mom went for the gold and beat us both with her Pumpkin Martini.  All were delicious!The food is no sham either.  We each enjoyed a delicious meal, all sporting very different flavors and varieties.  I had the Chilean sea bass, my mom enjoyed the salmon, and boyfriend took it home with the pot pie.  Spectacular plates.I thoroughly enjoyed my experience.  Cheers to the wonderful bartenders!"], ["Carol C.", "The only restaurant worth considering in the Belle Meade area. Consistently good....very knowledgeable staff, intimate setting, interesting food. Not THE best food , but it is always really really good food. I go there enough that I am ready for them to change out the menu, but we've never had a meal we didn't enjoy. Also a great place for lunch!"], ["Bob H.", "Great happy hour martini's and Tracy the bartender is hot!"], ["Jason S.", "I've eaten here and had good experiences and eaten here and had \"meh\" experiences.They have an excellent cocktail menu and wine list, which is a good start.  The downer is that the food has been really inconsistent.  Which is a drag when you are paying for what should be a pretty good meal.For the main menu, they change things up a bunch, the only things that seem to stay are the requisite \"steak\", \"steak frites\", \"fancy burger\" and \"chicken dish\".  Outside of that, they have the occasional fish, lamb, game, seafood dishes, none of which have been awe-inspiring.The service has always been good and consistent, no complaints there.  It seems as if in my experience that from the first time I came here that the experiences have been going steadily downhill.  A shame, really."], ["Leopoldine S.", "My husband and I went there for dinner.The inside looked nice but we were seated on the patio which is more casual. We got this incredible big wine list ( wines are very pricey ) and than the first 3 wines we chose where not available. The food was okay but nothing outstanding. The service is too fast, we got our appetizers after 10 minutes and hardly finished when we got our main courses.If I go for dinner to a restaurant I would like to spend a nice evening and not be rushed though, we were done in 50 minutes ......."], ["Hunter A.", "Last night on Valentine's Day my girlfriend and I had one of the most delicious meals in memory. I had the Tree Tips and my partner had the Walu. Both were perfect.The dessert, sweet potato pana cota, was a work of Art, beautiful enough to almost not want to meddle with it-- but of course we did. A very nice note.The best meal I have ever had in Nashville-- as well as very nice, attentive but unobtrusive service."]], "Sambuca": [["Jes O.", "Great service. Try the goat cheese stuffed artichokes! Amazing. We caught a great blues band, and got sat right away at 7pm in Saturday night. (Although to be fair.. The entire city of Nashville is out waiting for fireworks in the rain)"], ["Jillian T.", "Disappointing to say the least. I came with a large group and we had a limited menu due to the number of people. We waited over an hour for somebody to take our order. Our food arrived over another hour later. Servers ignored us and nobody acknowledged what was happening. When we reached a breaking point and complained, the staff mocked us and were not told to stop. The food probably would have been very good if it were not cold after sitting out. I would not recommend this restaurant due to lousy customer service."], ["Punam D.", "Came here for dinner on Wednesday night. What a disappointing evening. As noted in Alex's review from 2011, you can't ignore the band because they are completely in your face. I don't wish to complain; they weren't bad but if I had wanted to go to hear a band play, I would have gone to a bar. I went there with a large group, and was supposed to have a set menu but a few of us went off piste and ordered appetizers. I'm so glad that we did. The beignets were lovely and creamy and the lobster and crab were seriously tasty. The fried oyster had been obliterated by the cooking process and was just a hard lump of batter. The chicken samosa was good. The entrees were not so good. The steak came with a weird sauce and no sides. I would have ordered something had I known. i didn't even touch the set menu dessert.Service was good and friendly though. Wine was quaffable.No thank you to the rest Sambuca!"], ["Aisha M.", "Sambucca is a solid place for a night out. On my last visit there was live music. I ordered the pasta and my companion a steak. Both were tasty.I had the sticky toffee pudding for dessert...it was a solid decision."], ["Katrina L.", "Loved our server. Cumcumber pineapple drink was delicious. My entree was the scallops with risotto -- So perfect. Scallops were cooked perfectly and paired great with the risotto and asparagus."], ["Leah G.", "This is my go to lunch restaurant. I love the atmosphere inside, and their patio is equally marvelous. The lunch menu has lots of options, you can mix and match a variety if salad, soup, sandwich options. The best part? Apparently no one else in Nashville ever thinks to stop in for lunch! I have never had to wait for a seat, and the restaurant usually only has a few occupied tables. Makes it a fantastic place if you need something conducive for a conversation with clients or colleagues. I'm not as big of a fan for dinner - still love the atmosphere, but the menu just isn't my style at night. If I could rate lunch and dinner separately I would give them 5 & 3 stars respectively."], ["Emily O.", "Stepped in here before going to see a show at the Station Inn which is across the street because they only serve beer over there and I'm more of a hard liquor kind of girl...Very nice live band playing but didn't catch the name. Female lead singer and female backup were both great. Again with the cover songs tho...Shimmied up to the bar. Ambiance is chic and dark... The crowd was a little off-putting, maybe a tad too snotty for my mingling taste. Angie the bartender was great tho and did me a huge favor by making me a slammin' espresso martini. I was on the road all day and badly needed caffeine to perk up. Espresso martinis, when done properly are probably one of my favorite things in life. I don't usually order them tho because being a bartender myself I know what a bitch they are to make. She glady obliged my request and it was delish!My bf got a fancy $12 beer and then had major martini envy when he saw/tried mine. Place wasn't cheap but I guess that is to be expected in this part of town. Only had one round and left but it was a good one!"], ["Antony F.", "Came with a group for a late night dinner, ambiance outside was nice, I had the crab and shrimp scampi (minus the shrimp) and it was pretty good. I went to order a 2nd drink and was told the bar was closed, yet I noticed another server coming out with a round for the table next to us, not to mention some folks at our table joined us after, with drinks they bought at the bar. They closed early for a Friday night. Felt like our server was just done, and wanted out."], ["Angela D.", "Our visit started off poorly when the hostess said \"I need your drinks\" immediately after greeting us (referring to our empty coffee cups that we would have thrown away had they had a trash can outside). It just seemed extremely rude. Once we were seated, our server Robby greeted us and he was amazing from beginning to end. He made great suggestions and never rushed us. He was very laid back and knowledgable in the best possible way.The food was very good but the difference in portion sizes between the flat iron steak and the salmon was kind of odd. The band playing the night we were there was unreal! A lady named sissy was singing with them but I can't recall what the band's name was. The only other thing I found odd was the fact that a restaurant this nice has paper dinner menus. Overall, great experience!"], ["Tiffany B.", "Really really good service and a very attentive waiter. On the weekends (Friday and Saturday) they have a live band. When I went it was Al Green and the hard times. Lol. They were really in good though and had the whole crowd enjoying themselves.If you don't want to be close to the music there are quieter areas or a patio outside. The place is really nice. The drinks are on the more expensive side but totally worth every penny. They don't cheat you on your alcohol and they have really taken their time to come up with a creative and satisfying drink menu. Food was great. They serve small plates and larger meals. I ordered a small plate of Chicken Samosas. They were a tad greasy but the flavor was on point. In will definitely be going back there my next visit."], ["Charline H.", "I haven't been to Sambuca in years, but joined a friend at the bar on Saturday night. Our bartender was amazing. He ran the bar like the ultimate pro- cool and collected while sweeping in to take orders and refilling drinks as we enjoyed the jazz band. We enjoyed the small plates and I cannot wait to go back and check out the bar upstairs which was closed for a private event. Until then... I'll be dreaming of those Goat Cheese-Stuffed Artichokes :p"], ["Emmie L.", "This place is INCREDIBLE. I planned a bachelorette party weekend away in Nashville, and this was the first location I attempted to call a week in advance to make a reservation for eight. Sadly, they said they were booked at the time we needed. So I made a reservation for a different place. The other place fell through so a friend called Sambuca and asked again, and this time they said they had availability! I was really frustrated by the fact that we had been given different information, but my elation at eating here overshadowed it. They were so helpful and accommodating. Some of the most friendly service I've had. The waitress talked with us for a good while and provided great recommendations. We were seated on the top floor on the terrace overlooking the city, and it was such a lovely view and a lovely night. They had little candles on the tables and all these couches around the room and really ambient lighting. There was live music in the level beneath us and people were dancing. It was just such a beautiful atmosphere, everyone was so happy.Prices are high, but the food was worth it. We all got different drinks (around 11 dollars each) - I got the Tennessee Tornado which packed a punch, and was so delicious. My friend and I split a pizza, the name evades me but I know it had goat cheese, italian sausage, and prosciutto. It was AMAZING. And it was only 15 dollars and provided a great meal for two. Many of the girls commented on how amazing the shrimp and crab bisque was, and I also heard the beignets were to die for. Overall, this place was top notch. Great location. Great food and drinks. Great service. If I go to Nashville again, this is definitely going to be a must go."], ["Sara E.", "Hard to believe this place was recommended as one of best live music dinner clubs. Band was terrible (off key easy listening covers of every overplayed song in the universe) sea bass was very disappointing, small filet swimming in a sea of watery quinoa, cooked cucumber (who cooks cucumber?) and tomato on a few lousy leaves of of kale. terribly overpriced, can't believe I'm paying $40 for this meal and a drink. Won't return."], ["Jessica B.", "Went here with some girlfriends while we were in town for the weekend.  Not only was our waiter extremely helpful, our meals were amazing!  Patton James was playing and we all found the band very entertaining.  This place made me wish I lived in Nashville."], ["Josh B.", "The wife and I sat near the stage area. The band they had was totally amazing! The band's name was the Chris Weaver Band. The food was decent. The drinks were okay as well. But what got us was the air conditioning seem to be out when were there last Friday night! It was extremely hot inside. We don't like eating hot food when the thermostat is set to Hell. We were sweating profusely! We only come here occasionally and parking is valet tip plus $5."], ["Allaina L.", "One of my favorite restaurants in Nashville. The food is always amazing and normally the music is great too. Great atmosphere and the service is always on point. Definitely make a reservation because they stay busy. The patio is great during the warmer months, but the main dining area is the place to be to see the nightly band."], ["Tiffany O.", "We love this place!!! Miso sea bass and shrimp crab dip are to die for! Staff is always friendly but you need to make reservations in advance (more than 1 day).Love the romantic atmosphere and the music sounds great. Highly recommend for date nights and birthdays. Birthdays get a free dessert too ;)"], ["Chris M.", "My wife and I were so excited on our first night in Nashville but Sambuca truly underdelivered I'm sorry to say.  It's all about perspective right?  My college kids would have loved it.  My foodie wife and I found the entire experience average at best, though our waiter was kind and attentive. Tuna special came out cold, twice.  Hanger steak was comparable to something I could whip up in short order.  Oh well, live and learn."], ["C M.", "Difficult review to write - really was wanted a good experience but disappointed in terms of food quality, cost and frankly service. I would equate the food experience equivalent to that of a mass produced event type quality.   The restaurant was filled to capacity (not a bad thing) but the food fit - was somewhat lukewarm, dried, and lacking any serious flavor.   I had the red snapper étouffée- again, fish was overcooked and a bit dry.   My wife had scallops with risotto coins - very small serving and a bit salty.   Derive was adequate at best - appeared understaffed for the amount of people.  B coffee came after dessert - annoying.   Drinks were adequate at best as well.  For the cost ($150 for two - three drinks and normal dinners with dessert) just left feeling like we could have gone to a dozen other local new places and had a much better meal.   Good place for large parties I suppose."], ["Tim B.", "We went to the Gulch for a nice meal.  Sambuca had great entertainment, nice food, and great drinks.  We had an excellent time."], ["Mary F.", "Went here last week on a recommendation from our hotel. This place is perfect for a date night out. NO COVER and great live music. Beautiful decor inside , nice and classy.Menu was easy reading and tasty. Kinda pricey but expected with upscale ambience and free live music.Drinks were super tasty. I had the Tigers Blood.Service was great and speedy. I think our waitress's name was Natalie.Do pass up this spot if you like jazz and good eating."], ["Lyrad V.", "Don't let the fact that this establishment looks like a trendy upscale bar and lounge keep you from coming here for dinner. Their food is actually amazing. It only took me at least five years of coming to Sambuca to figure that out! My friends and I used to come here to hang out for drinks after dinner usually somewhere else in the Gulch. Sambuca has a great ambiance and amazing drinks. I loved their pomegranate martinis! One night we were hungry and got a few tapas/small plates and thought, man this is good food!Fast forward a few years later and we're now all married. My husband and I decided to make a dinner reservation for one of our birthdays. We were blown away at how good the food was! My husband had a really amazing steak here. The live music was a nice added romantic feature. I would definitely say this place is worth checking out whether you are looking for a place to hang with friends or for a nice dinner."], ["Scott B.", "Visited here while on a business trip to Nashville. It was a Monday night, so it was pretty dead. They did have some live music and a bit of an older crowd. I proceeded t grab a seat at the bar, and ordered a drink. They dont have any draft beers which was what I was wanting. Settled for a bottled beer and ordered the shrimp and crab in lemon butter sauce with linguine. The shrimp was very plump and flavorful. Was a little disappointed by the crab in it as it was more of a crab puree then actually getting crab meat. I told them light on the lemon butter sauce which is the way to go. Too much it may have been swimming in it since it is a very rich dish as it is. I wish they gave a little bread or maybe a side to go with it, but I think you have to pay for that. For the value I would say average, but thankfully the meal tasted pretty good. Barendar was nice, and they had TV's with some games on so that kept me occupied. If I go back may try someplace new, but if you are staying in the gulch this place isnt too bad."], ["Arshbir G.", "Went here on a Saturday evening around 7pm. Had no issues getting a table for 3 people without a reservation. The band was excellent; kinda loud for a good conversation. Drinks -- awesome! Food -- eh. I ordered the pizza and caprese. Not the best food I've had. The drinks and music made up for it. Service was really good."], ["Jennifer M.", "My husband and I really enjoy Sambuca, especially when The Diggy Band is playing. The food is delicious and we love the approach to spreading out your meal while you listen to the music. You don't feel rushed and can enjoy each part of your meal while also enjoying the music. The prosciutto mac and cheese is my favorite dish, with the sweet potatoes coming in a tight second. Creme brulee for dessert and all is right with the world."], ["Tom K.", "Went here with my in-laws for my fiancé's birthday dinner. We were expecting great food and atmosphere. Bottom line: food is way over priced, the service was average, the restaurant was very loud. I wouldn't come back here unless I had a discount."], ["Dana S.", "I made my first trip to Sambuca on 12/10/14 and loved it. I met a group of ladies for happy hour and had a great experience.First, it was not busy on this particular evening, so we had a very easy time finding seating. The bar area has several couches and over-sized chairs and tables in addition to regular tables/chairs and seats at the bar. The entire restaurant was very clean and decorated very nicely. The atmosphere was very warm and welcoming; all of the staff I talked to were extremely friendly and seemed happy to be there. This being Nashville, you can always find someone singing/playing and this place is no exception; a singer with a nice selection of Christmas music. Parking is also ample and very easy to find; there are 2 pay parking lots 1 block away - I paid $2 for 2 hours - completely reasonable. Good happy hour specials with a fun selection of drinks and appetizers; the food was excellent. I had the mac & cheese with prosciutto - a small plate but was more than enough for me and it was delicious.I will definitely be back to Sambuca!"], ["Emay B.", "Good food, good service, good drinks... Came here on a Friday night in August and encountered no wait to sit outside on the patio. Our server was attentive and offered a great suggestion as I was in between the salmon and the scallops. I took his suggestion and did the scallops and was so pleased I did. The flavors of the scallops, the tomato sauce, and the seasoning used paired with the risotto cake was out of this world. I encourage you to visit The Gulch and Sambucas. Oh and did I mention the $5 valet?"], ["Blake C.", "Horrible service for the price of food. Ordered a burger for lunch being one of two tables in the place it took 30 minutes... Served with no condiments... When I asked for condiments that took another 5 minutes. I have been here before for drinks but for it being the first time here for food I am not at all impressed."], ["Oz T.", "Needed a fun place for a client dinner .. been here before food is great. (Not cheap) Great atmosphere, music is a little loud but great for a fun place.."], ["dave p.", "Food was great especially the stuffed artichokes. Sat at the bar and the hot blonde behind there served me well!!!! She's great at her job and works hard!!! I will be back just to have some water maybe!!! Great place"], ["Faith T.", "This was easily the worst dining experience I've ever had. We had a reservation for a large party, which included a limited menu. Our entree order was taken well over an hour after we were seated.  After being largely ignored by our waiter, we received our cold food over two hours after we were seated. I'm not sure why we had a limited menu if our food was served cold.  Once our meals were served, we never saw the waiter again, even though dessert was included with the meal.  By the time we received our bills, more than three hours after we were seated, the band had packed up and left for the night and the restaurant was largely empty. When we complained to the manager, we were mocked and it was never acknowledged that there was a problem with the service.  I wish I could say that the worst part of the evening was the lack of toilet paper in all of the stalls in the women's bathroom. Sadly it was not.  If this is their normal level of customer service, they will not be in business in a year."], ["Marla T.", "This is absolutely my favorite spot ever. It has live music and fantastic food! I've been several times and every time I like it more and more. The music is fantastic! Great Cocktails and ambiance! So far for my Nashville spots this is my favorite!"], ["J S.", "Great food and service. Centrally located near downtown. Prices are reasonable. Only negative is the parking. I would go back!"], ["Jason E.", "Good food and really fun to go there. Beer was very tasty and live music was awesome. Get the catfish sliders they were the best!"], ["Queen B.", "Comfortable venue and plenty of space for 12 or so people to go enjoy a meal and great music.Pros:  Food is freshAmerican sized portionWaitstaff is attentiveWater glasses kept replenishedDirty dishes kept off the tableMusic is goodMenu has plenty of variety.Chairs are comfortableCons:Lacking BAM! in the dishes.ExpensiveWaitress suggests the most expensive wine on the menu, and doesn't tell you.I agree with everyone that said that the dishes sounded good, but lacked ooomph.I had the salmon Oscar tonight and the hollandaise sauce had dill in it, but I didn't taste it.  I saw it, but didn't taste it.Asparagus was cooked perfectly, salmon was cooked perfectly, portion size was more than ample.  In fact, half the size would have been perfect.Dessert:  I ordered the bread pudding with a syrup on it, and a scoop of vanilla ice cream.  The bread pudding was so dense, it definitely needed much more syrup than what they put on it... It needed all the bites to be wet...  They were not.But that's just piddly stuff..I think flavor  is lackluster.  It's like someone is afraid to create art with herbs, spices and salt....Wine:  I asked for a Pinot Grigio.  Waitress suggested a brand. I accepted, and then when I saw the price on the check.. I was surprised she suggested the most expensive Grigio on the menu...  When I looked at the wine list, there were 3 Pinot's... and the one she suggested was the most expensive.I wished she had said out loud, \"This ** Pinot is a good one, and it's $15/glass.\"I think that would have been more honest.The place was just less than half full at 6:30 on a week night.All in all..... there is at least 2 new restaurants opening a week, here in Nashville..  Not sure when I'll get back to this one.  Nothing was memorable."], ["Rolando O.", "Had dinner here with my sister and niece who is a Vandy student.   Best flat iron steak you will have.  Service was awesome.   If you get Jason, you will get top notch service."], ["Jennifer L.", "This was my second visit to Sambuca and it was amazing! We went on Saturday 10/4/14 and the band Minnie Murphy was playing. We made reservations for 6 o'clock (only availability unless we wanted to eat at 9:30) I dined with my husband and our two children ages 1 and 3. Yes it is very kid friendly! We were seated in the far left booth in the main dining. Perfect view of the stage. We were promptly greeted by our fabulous server Jordan. We knew we were gonna take the dinner slow because we wanted to see the band (they started at 7)! First lets talk about the food. We ordered the bucca beignets, bruschetta, garlic cheese bread, caprese salad, and the house salad to start! All was very very good. The kids enjoyed is all as well. We asked Jordan about the pinot noir selection. He suggested a few but pushed one more so based on our palate. We tried 2 tastings both were good. We trusted our server and order the Meomi Pinot Noir he suggested. He nailed it. It was a delicious bottle! My husband also order a sweet tea, where Jordan told us they didn't have any but could bring some sweetener. A couple minutes pass and he returns with the iced tea and fresh made hot simple syrup! He went above and beyond to get us our sweet tea! He just set the tone for the rest of the night. We were quite stuffed from all our apps but shared the Miso Sea Bass (another suggestion from Jordan) It was Fantastic! I seriously don't know where we put all the food?! Once the band started our kids hit the dance floor! They were not a disturbance to any of the guests dining. I actually think those around enjoyed their entertaining. We sat in our both listening to Minnie Murphy who was just as fabulous. The whole night was perfect. The service, the entertainment, the food! We will definitely be back when in town and ask for Jordan!Yes the venue is loud. Yes the food is yummy. Yes it is kid friendly. Yes theres a patio. Sambucca is at the top of my list for favorite restaurants."], ["Lisa G.", "Rates high in atmosphere for the live music and service.  The Peter Moon Band was excellent... really good w/ a crowd and loves to take requests; even if they don't know them, they'll try to play them.  Our waiter was timely and personable.  Excellent bartender.  Food is good but not great.  I had the chili rubbed scallops which came with risotto and asparagus, $28.  Good, but it came out lukewarm.  Risotto is not good lukewarm.  Nor are scallops, for that matter.  I also had the spinach salad (with strawberries, portabella, bacon and onion with poppyseed dressing) which was really good.  Sides for the table included prosciutto mac and cheese, which was delicious.  We also had some chicken and beef satay, and calamari, both mediocre.  For my happy ending, I got a chocolate toffee torte which was definitely more torte than toffee.  I was hoping for the opposite.  Very rich.  So all in all, mostly hits but some misses on the food... which, of course, is what we mostly go to restaurants for.  And the band doesn't come with the restaurant.  Still, I'll give it 4 stars since the service and atmosphere really were pretty great.  And valet parking is always a plus."], ["Ashley F.", "used to be my favorite place to come. the last three visits have not been good. service awful, food bad, warm drinks from the bar. the only thing this place still has going for it is the atmosphere. its completely overrun with bachelorette parties now."]], "Etch": [["Roland P.", "I was in town for a conference and went for lunch. I have to say this was probably the best meal I have ever had in my life!!! I had the roasted cauliflower as an appetizer, the Brisket Pupusa as my entree . I couldn't have been more pleased with the overall experience."], ["Linda B.", "A definite must!Shrimp/octopus bruschetta was amazing. If you can't decide, try it for sure. Nice portion as well.Lamb- tangy and flavorful, with a twist on what you would expect.Venison- ate every last bite. Tender and not gamey. Loved the sides it was paired with.Too full for dessert, but it looked scrumptious.Atmosphere- nice, dim lighting and more upscale than the Broadway restaurants.Service- I wish I knew our servers name, he was knowledgable on every level and was a pleasure. Definitely made our experience.If you are looking for a nice dinner, food a little bit outside of the box, you have to check it out!"], ["Ben H.", "Excellent food, excellent service, excellent atmosphere. A mixture of flavors you've never probably had, but will want again."], ["Chris K.", "FINALLY - a fine dining restaurant that has just the right ambiance!  We walked into this hip restaurant, and immediately felt at ease.  Classy, yet relaxed, decor; Miles Davis playing in the background, waiters and waitresses VERY accommodating and friendly - all fine dining restaurants should take note...waiters and waitresses that SMILE add immensely to a positive dining experience.  Great job, staff!Now the food - EXCEPTIONAL...really interesting dishes - roasted cauliflower IS THE BOMB.  Do not miss this appetizer if you are visiting for the first time.  I know cauliflower isn't the most sexy vegetable these days, but this dish is proof that it's making an amazing come-back!  The savory and sweet purees pair beautifully to your spectrum of taste buds; the almonds heighten the naturally \"nutty\" taste of the delightfully browned / roasted cauliflower.  We also had the catfish and coconut chicken curry.  Catfish was wonderfully crispy, with just the right amount of acid in the salad, sweetness in the strawberry preserve, tartness in the lime crema.The only reason I did not give 5 stars was because the coconut chicken curry with quinoa was unfortunately overcooked.  Some chicken pieces were dry, while others were barely over cooked.  The sauce was not as sweet and savory as I expected, but I also come from a Thai background, and it likely was not meant replicate Thai cuisine, but be an American twist on an asian dish.Overall - I will CERTAINLY be back - wonderful service, great food, great environment.  Well done Etch - keep up the positive vibe!"], ["Jennifer R.", "Food is great, but the atmosphere is a bit pretentious.  I'll probably go again just for the Cauliflower."], ["Louis C.", "Service, food, and drinks were all fantastic. My entire family loved their meal and we were all impressed with the service. Not mention, it was the best old fashioned I've ever had."], ["Deezy P.", "Wow! The food was amazing and so unique . You really can't go wrong with any dish on the menu. Our waiter Mathew was friendly and easy to talk to and very knowledgable about the menu. it was a great experience ! Even the Chef came to talk to us, she was hilarious !!! Highly recommended !!!!!! (Also be on the look out for same celebrities , we saw Mick Jagger !!! )"], ["Robert M.", "Was there last year - ate at the bar. Had read the reviews on the cauliflower, so I tried it, despite the fact I hate cauliflower. The reviews are right - it was spectacular. Pork belly was delicious (hmmm....occurs to me only now that I could have just ordered another one...). The butter tasting was fine (but I should have just gotten another pork belly....) It was enjoyable experience."], ["Cait C.", "We had the cauliflower, beet salad, venison, colbia fish, and lemon tart for dessert. All of the dishes had a lot of interesting combinations and creativity, but sadly there's nothing that I would go back for a second time.I'm giving four stars for creativity and complex flavors. The dishes are contemporary and certainly spark conversation."], ["Jackie H.", "Everything was amazing but the cauliflower is a reoccurring dream!!"], ["Sonia C.", "Etch was memorable.  The name fits.We arrived early, a good habit that I am picking up (I'm not living up to my name)and the hostess sat us immediately.  I was not too pleased with the table, it was next to the window, but it was only two of us, so I really couldn't complain.  The decor was simple yet chic.  Very zen. Our waiter showed up immediately and introduced himself, and gave us time to look through the wine list.  We never felt rushed or forgotten.  We settled on a simple Spanish Syrah ( their wine prices are reasonable). After the presentation of the wine, the waiter went through the menu with us and answered all of our questions.  To me that is a plus when the wait staff knows the menu.The two appetizers were outstanding!The roasted cauliflower drizzled with truffleoil was amazing and it came with with crema that was blended with feta cheese that was indescribable.  The pork belly was seasoned and cooked to perfection.The Etch salad was good, but I could have gone for more cauliflower.  Now the entree, I had the fillet, med. rare, sitting on top of puree of potatoes, and dressed with peeled asparagus.  The fillet was so good, ate all of my steak and left the sides there.  Needed room for dessert.After much thought, we finally narrowed it down to the rhubarb and pecan tart.  One word - delicious. Great food, great service and great ambience."], ["Gabi M.", "As the name implies, my dinner at Etch from a few weeks ago will be \"etched\" in my memory for a really long time... it was fabulous!I was the oddball out being the only non-vegetarian / vegan in the group, so there were many more selections that appealed to me than to my colleagues -- hello -- can you say the entire menu is amazing? Despite our different food preferences, our party of three agreed on more than a few things:1 - Deb Paquette is one of the most talented chefs ever!2 - Etch provides an incredible dining experience with top notch service inside a lovely modern venue.3 - That cauliflower appetizer (even though we ordered it with everything on the side) is perfection.4 - Ratatouille Crudo - mine as it comes and theirs without the cheese - also incredible... I especially loved this mix of healthy and fresh zucchini, fennel, carrots, champignons, basil micro greens, garlic olive oil, eggplant salt, red bell tomato essence, parmesan.  (Seriously, I could make a meal on this alone!)  In addition to the above, I had a glass of wine and the scallop entree.  My veggie mates had the Katafi Pastry entree, slightly tweaked for their preferences.  We all were extremely content with our selections.  Unfortunately, with all of the aforementioned food, we had no room left for dessert.  Such a shame because the entire dessert menu sounded insane in a good way.I only hope for a return visit one day to experience Etch yet again... Thank you Marcia M for suggesting we eat here and for making the reservation.  For anyone that may be reading this review, if you can get a reservation, go for it.  I guarantee you will etch some fond memories of your meal there as well.  Enjoy!"], ["Carl D.", "Delicious! Roasted Cauliflower appetizer was amazing! Split the fillet, medium rare, and it came out to perfection.  Wasn't excited after reading the dessert menu, but got the truffle and added ice cream and was super pleased. Service was very professional and offered a lot of options to help us make selections.If ur in downtown Nashville, I definitely recommend Etch!"], ["Tarantula B.", "Made reservations, no wait time upon arrival. 1st timers, was with two others and we passed many open tables and were seated at the back of the restaurant,but with a window view. Nice clean eclectic restaurant, our server was nice and very helpful. Nice wine selection. The Ciopino appetizer was very good and can be shared with others. The from the sea creation for us was Halibut, we were told they ran out of the other fish and only two Halibut plates were left. Another guest tried the Cobia and truly enjoyed it. We and others around us wanted to end the evening with the Peach tort but were advised they were all out - no dessert review. Overall enjoyed the experience the food was good and would return.  Curious on where we will be seated next time."], ["David D.", "Fantastic restaurant with very clean, healthy food in a modern, yet warm space.  Salads are outstanding and very inventive without being overbearing. I found the service pleasant and since I sat at the chef's counter I was able to watch the meticulous attention to detail in prep, cooking, and especially presentation. They are more than happy to stray off the beaten path should you have any special requests and as a final tip try the coffee.  It's great."], ["Joi B.", "Exquisite.To the casual observer, Etch is not at all a vegan restaurant. The menu boasts such meaterific dishes as pork tenderloin, venison and steak filet rubbed with smoked duck butter, yet there are vegetarian options, all involving cheese and/or butter. All it took was a simple (not-so-simple, really, but she made it seem simple) request to our waitress to \"veganize\" the salads and vegetarian entree some dishes and voila, we received some of the best vegan food I've ever had! So before I get into the food, I need to give major props for the service. I appreciate that although dinner reservations are hard to come by at Etch, they do make every guest feel like they matter and service is impressive: friendly, polite and approachable. Sometimes trendy places like this one make you feel like you're lucky to be there, you know?Now that that's out of the way.The food:All three of us couldn't pass up that Ratatouille Crudo, so we each ordered our own. And we each devoured it! If you want this salad vegan, just get them to leave off the parm. A delectable tower of raw zucchini, carrots, micro greens, fennel and mushrooms marinated in greatness. It's the perfect light app to get you ready for what is sure to be an outstanding entree to follow. The Katafi pastry. INSANE. I keep looking at my photo and I am not lying when I say that my mouth actually waters with the sight and memory of this fantastic entree. They made this to order for us, leaving out the Fontina cheese. Although I admittedly do think a fine cheese can only make a dish more delicious, I can't imagine that it's necessary here. I believe the vegetarian dish changes according to season, so I'm not sure if the vegetables are going to be the same for you, but last week's dish included a pile of kale, a whole grain and a charred tomato. On top of this lovely arrangement is a bird's nest of phyllo. And there's three different bits of purees (olive? carrot? beet? Some combination thereof that tasted incredible) that compliment everything beautifully. I want some more immediately... only, I won't be back to Nashville for a month.Bravo, Etch. You win the best meal I've had all month award!"], ["Jim H.", "Great place, if you are looking for a break from the drone of steak, fried stuff, barbecue, and the other mundane choices of Broadway.  Sit at the chefs bar if you are solo and watch the food come out over a glass of wine."], ["Umber A.", "This place has to be the best restaurant I have ever been to. Each bite was a foodgasm. I'm a carnivore however somehow the waiter convinced me to try out their vegetarian options. I ended up getting the roasted cauliflower for app. The combo of goat cheese/ red sauce/ pea sauce was perfection. For my entree I got the rutabaga La Plancha. Very flavorful. I literally scraped the plate clean.  Can't wait to go back. And the waiter was friendly and helpful! Service was excellent !"], ["Kimberly F.", "I've been wanting to try Etch since they first opened and finally was able to yesterday and we were not disappointed actually quite amazed. We split the beet salad which was delightful. Next I had the grilled lamb loin which is smack yo mama good and my beau had the grilled filet which was equally yummy. We will definitely be back real soon."], ["Ann E.", "Unfortunately, I was not overly impressed with the food here , which I had hoped to be based on other reviews.  The atmosphere was nice and service was very good. The roasted cauliflower app was very bland, was literally just cauliflower , roasted. The 2 side sauces they had on the platter to accompany it were good.  I ordered the catfish as my entree and i found it to be underseasoned. It was actually cooked very nicely, but could have been much better with more flavor in the batter.  Maybe it was the dishes I ordered in particular; I would be willing to go back and try something else. But for this lunch experience, I was disappointed."]], "Flyte World Dining & Wine": [], "Panaderia La Conchita": [["Mike D.", "Oh my... what a heavenly find this place was!  If you have any doubt about the authenticity of this bakery, then just look up at the ceiling where you will find dozens of pinatas hanging waiting to be brought home to be filled and beaten apart.  There must have been at least ten little children looking up at the pinatas and pointing as they begged and pleaded with their parents.  I can only imagine how much fun it would be to come in here with a blindfold and a stick and randomly swing that stick in the air repeatedly until I received a shower of candy!Anyway, I digress... they have a huge variety that includes tres leches, custard-filled delights, coconut encrusted pieces of heaven on earth, and even a few different varieties of donuts!  You should try them all :)My only knock is that none of the products have a description or tag of any sort to let you know what they are.  Time to go polish up on my knowledge of latin pastries..."], ["Billy H.", "This place is a true local bakery. I honestly had no idea this place was over here, which is surprising to me because I used to frequent the K&S Market that is the same strip mall. Anyway, this place was pretty busy when we stopped by around 4pm on a Sunday. I think that we were the only non hispanic customers in the store. The bakery is set up pretty straight forward. When you walk inside, the left side has drinks and refrigerated pies and cakes, on the right side is all the different pastries in glass, self serve cabinets. You grab a tray and tongs and pick out what you want. The trays are the same you get at a fast food restaurant that usually have the white paper liner. These trays don't have liners, I guess they clean them, but I wished they had some kind of parchment paper to put the items on instead of directly on the tray. There is a huge selections of conchas, Mexican sweet breads, churros, oreja, and pan de colotes. I didn't know these names until I googled for them. They don't have any names or prices listed at the cabinet area. They don't even have prices listed up at the front counter. We picked 5 different items and the total after tax was $4.46. Not bad at all. The guy that bagged our stuff was nice, the guy that rung us up was on his phone and didn't say the total or the change or anything. Of the 5 items we got, my favorite was the concha. I also liked the one item that looks like a triangle hot pocket that is filled with cream cheese (i think). The large round one with the strips was a little dry, but for the price I think that all of them were worth it. I will be back."], ["Joe C.", "This place is the real deal. So many delicious treats for an amazing price. We had a nice sampling of bread, cookies and pastry, and everything was fantastic. The birthday cakes look really good, and I'm definitely trying the tres leches cake next visit."], ["Jack L.", "My love of Latin American food and culture brought me to this little panaderia of heaven. I grabbed one of the trays near the register and a pair of tongs, then went around to all the cases and picked out what I wanted. A selection of empanadas, sweet bread, gingerbread pigs, and Tres Leche made it into my bag. Six items for $7.23, practically nothing. I asked for spoons right away to eat the Tres Leche and the wonderful woman behind the counter seemed to appreciate that I asked in Spanish, although it was not necessary. Great vibes and a market atmosphere."], ["Nurse Foodie B.", "Happy, Happy to find awesome Tres Leches Cake! Plus, an awesome bakery loaded with homemade pastries.  Reminds me of home. This California girl is elated that Nashville has a pandaderia!"], ["Laura B.", "Sweet empanadas filled with cream cheese or pineapple. Tres Leches Cake. Those little gingerbread pigs. Conchas, ojo de buey, elephant ears, and other pan dulce galore. Not to mention the little freezer filled with mexican style popsicles (paletas) and ice creams. If this is what you're looking for, go here. If you don't recognize anything from the above list, stop by this little bakery and pick up a bag full of sweets instead of picking up a dozen donuts, you'll make new discoveries and be the hero at work. La Conchita bakery is located in the same parking lot as the infamous K & S Grocery on Nolensville Road. When Panaderia La Abejita closed down in this spot awhile ago, I wanted to cry. When La Conchita opened about a year ago, I wanted to throw a party.The place is clean, neat, and generally friendly. It is definitely a family run business (complete with the occasional awkward teenager), they are very welcoming in both English and Spanish. They also have very reasonable prices (all the different items are about 60-90 cents a piece, and their Tres Leches Cakes are sold by the slice, or a whole cake for less than $20). They also seem good about seasonal items like pan de muerto around Dia de los Muertos, I think they sell Roscon around Three Kings Day. Although there are many hispanic style bakeries on Nolensville road selling Tres Leches and these other sweets, this one is my favorite and gets 5 stars for the friendly clean atmosphere, the prices (especially on the Tres Leches Cakes) and the fact that they have the best darn cream-cheese empanada de mil hoja that I have ever tasted, ever (and believe me, I've been around many panaderias). Those things come out from the back hot, flaky, and delicious and everyone I know that has tried one can't stop talking about them."], ["Eric S.", "I always check out the local panaderia whenever I travel and my son, daughter, and I checked out this one. Good stuff needless to say even though we came late in the afternoon. Great churros and my favorites orejas and puercitos. Friendly staff and a great selection of pinatas if you're in the market. Give it a visit."], ["Wendy T.", "I discovered this bakery through yelp, and everyone was on point....the sweet bread from this panaderia is divine!!! The actual bakery is clean, bright, and festive...pi~natas hanging from the ceiling..it is right next to an ethinic market too. It is marveous to find such a cute mexican bakery in Nashville with courteous staff. My friend and I were going bonkers while picking our bread....they had salvadorean quesadillas!!"]], "Nuvo Burrito": [["Megan C.", "Located inside a shopping center of restaurants you could say . ( There's a Quiznos, wing place , Gumbo place ). You walk up to the counter and they bring your food to you . I saw a microphone so maybe sometimes they yell out your name or a number to have you pick it up , I'm not sure . If you can't finish your food they have pre made to go bags with aluminum foil . Never saw it before , genius idea . I got a burrito and my other half got a quesadilla . Both come with side of chips and we ordered a side of cheese to go with them as well . Food was made to order and fresh . You can tell they use fresh ingredients everyday , or at least quality check things they keep from day to day. The quesadilla was made out of a thick deep fried tortilla , not your typical thin ones . They have vegetarian options as well ! Great portions . They also have different tortilla options :)I defiantly recommend this place ."], ["Brian N.", "I used to eat at the Nuvo Burrito on Charlotte, which is now home to Hattie B's.  When they closed that location -- and the one behind Marche -- I assumed the they went out of business.  My neighbor off-handedly mentioned that he gets food from Nuvo delivered, and I was stoked that they found a new location.  And they deliver!!!I loved the food at the previous location, but the decor was horrible, and kept me from going there more often.  I don't know if the new location suffers from the same horrible aesthetic, because I've had food delivered.  And everything is deeeeee-licious.  I'm a vegetarian, and they have a number of unusual veggie options.  For instance:  they even have a sweet potato quesadilla!  Everything I've had is fantastic, and I'm very happy to discover that they are back!"], ["Leah P.", "Walked in at 4:45pm on a Tuesday and there was someone behind the counter who said they were closed. Now looking at their hours...guess they are only a lunch place and I caught them at the wrong time :(Will try again tomorrow!"], ["Tyler P.", "Simply incredible! Great service, great food, and a great environment. It's located in a sort of food court style building, so there's plenty of space and food to choose from. There's also a great view of downtown! Definitely a must!"], ["José C.", "The place is inside a food court. The service is excellent. I ordered the second burrito in the menu it was a chicken burrito. Really good and huge. It comes with chips but if you want salsa, queso or wak is extra. The chips are kind of too salty for my taste. They should change it for a less salty chips.The place looks really clean."], ["Dave P.", "Excellent food in a cafeteria type atmosphere. There's a couple of other food places in the same room. Think \"food court\" and you have the idea. The food is very good and the presentation is wonderful for food being served in a basket. Kudos to the owners!"], ["Jessica F.", "I have ordered three different quesadillas, three different times, and have been happy each time.  The portion sizes are huge for the money, and the amount of flavor choices is impressive.  Their sides (salsa, guac and queso) are amazing too. I have recommended Nuvo Burrito to everyone I work with."], ["Heather M.", "They got my order wrong twice so on second time I just ate it even though I paid more. Then they threw away my receipt instead of giving it to me when I needed my receipt for my expense report. Very poor customer service. Food was only decent."], ["Sara N.", "YUM! Quality ingredients. It's hard to go wrong here. Burritos are big enough to feed me for multiple meals."], ["Chris A.", "I was disappointed that 3rd & Lindsley had closed their kitchen - it was 15h00 and I needed food. I remembered a while ago showing up to Nuvo nearby and they were closed at that time (19h00) so I drove over and it looked like I was out of luck again. But  the manager was having a business meeting and he was super nice. He said they close at 15h00 and I looked at my watch and it was 15h10 so 10 minutes after closing. He was nice enough to make me something anyway!  I got the 90210 Ques-Idea and cilantro lime hummus. It was so delicious. I appreciate them accommodating me after closing. The food court setting -although not like the original location, it didn't bother me."], ["Trevor S.", "I assume that anyone that can give nuvo 4 stars must just have a broken 5th star because Nuvo burrito is the absolute best! I have been an addict for 5 years now and I still can't get enough. I highly recommend the Plymouth, two little grills from Arkansas, the queso, or the mayflower salad, which is a deconstructed Plymouth. Give them a shot, you won't be disappointed!"], ["Dan B.", "Excellent burritos and hot chicken sandwiches. Super friendly staff-- they were so considerate when I forgot to tell them I didn't want bacon in my burrito and made me a new one!"], ["Carol N.", "Walked over from the Omni for a quick lunch. The place wasn't too busy at 11:30am on a workday and I didn't have to wait in line. The staff was helpful, pointing out options that weren't on the regular menu. I ordered the Ozark burrito to go. My order was made promptly, about 3 minutes to wait. The burrito was fantastic! Just a little spice, lots of veggies and chicken, delicious! I might head back here in the next few days."], ["Blake A.", "I had their signature item, the 90210. It's this big quesadilla like sandwich. It's too big to manage, chicken juices and grease dripping out of every side. The shredded chicken was a pinkish color and looked super low quality. After I almost broke a tooth on some sort of bone or very hard piece of flesh in the chicken, I didn't finish eating it. The dining room is shared with Quiznos and it's not all that clean. I'd head to chipotle if I were you."], ["Michael A.", "Wow, what a great surprise. For a place that's priced more like a fast food place and alongside other fast food-like places, this was a pleasant surprise! Massive Quesadillas! Fresh Ingredients - including fresh salsa. Great service. Awesome find. And since it's inside a quirky little building that's more like a food court - there's plenty of seating.Got the \"signature\" quesadilla- the 90120 - and the artichoke/chicken/white cheese interior was high quality, rich and satisfying. Plus, I've got a whole second meal with the leftover half!"], ["Kristin H.", "If you're in the area, it's not a bad option. That being said, I wouldn't make a special trip to eat here. The chips are from a bag and the burritos are too clumpy. Ex: one bite I only got spinach...the next bite I'd only get artichokes (yes, it was a veggie burrito). The place is in a cafeteria style room with 3 other restaurants. I left wishing I had tried one of the other places."], ["Rebecca W.", "Had the 90210 salad today as I'm eating low carb. All I can say is wow, it was delicious! I was shamelessly licking the pesto out of the bottom of the bowl when I was done. Can't wait to try more items."], ["Crystal H.", "Awesome food as always! Love this place! The original menu! The Ques-ideas and the new hummus is Delish!!! Great owners and staff as well"], ["Paul H.", "I was at a conference at the music center nearby, and was underwhelmed with the limited restaurant options inside the center. So glad I walked a couple blocks over to Nuvo! Delicious, FRESH food served by friendly guys (I got the impression they were the owners), for an incredibly reasonable price. I especially loved that they were willing to turn any burrito into a salad!"], ["J B.", "Nuvo is a local gem, owned and operated by two of the friendliest guys in Nashville. Their ingredients are always fresh and healthy, and spot on. Although they're known for their burritos, their salads might be the best in town. Don't be fooled by the food court location -- this is a spot beloved by locals."]]}