{"Sushiyobi": [["Dave M.", "Ordered take out with the Eat 24 app. Our order was accurate and ready quickly. They even accommodated our request for veggie-only tempura and extra chopsticks. The food was pretty good! We ordered an appetizer and four rolls of sushi. Recommend the Dr. Pepper roll and Crunchy Crab. The 5 stars are for the great attention to detail tho."], ["Kristie A.", "I have to give this place 2 star.  Food is good, don't get me wrong. But service is slow. They need more people to work it especially being located on Demonbreun. I waited more than an hour for my food and it has been a consistent experience for me. I've been here more than once.It's too bad because they probably have one of the best spicy tuna roll ever! it was so good but the service was just slow. The people are nice, though. They just need to staff their restaurant with more workers during lunch.if you have the time to wait, it's not a bad place."], ["Heather D.", "This was the most lousy, apathetic service I have ever had. I am not hard to please and fast to praise. But this place... I will never go back.Our server was rude and rushed with us from the beginning, like she had something better to do. I asked for the ginger said but add avacado. She brings me a totally different salad, and when I asked for what I'd ordered, she made a big stink about taking it back and then mouthed off about us to another server. We made it clear that we could hear her and that it was not our fault that the wrong item came out. I did not expect an apology for bringing the wrong thing (I mean, couldn't hurt, right?) but to talk about your table ten feet away from it is rude, especially when we have done nothing wrong.I also asked for vegetables with brown rice. She said they come with fried rice. I said, \"But you have brown rice on the menu, if you can please just substitute it. Even if it costs more.\" She finally says ok. Everyone finishes their salad and move to entrees. It takes ages, but I finally get my correct salad. Everyone else at the table is nearly finished with everything by the time she sets a bowl of veggies on the table in front of me, then hurries away. I did not even have time to ask about the brown rice that was supposed to be with it. Yet another 15 or so minutes later, as she walks by I call her over and ask where the brown rice is, and she rudely says, \"It's coming\" and walks away again, like I'm a huge bother for asking for what I ordered 45 minutes ago. Everyone finishes their meals as my veggies get cold waiting for the rice. Another 15 or 20 minutes later, she comes back to say, \"We can't make brown rice right now.\" (As they were not getting ready to close, they simply did not \"want\" to. But they are the ones who took so long and pushed us to closing time... we were there plenty early. At this point the veggies are cold and I am missing half of my dinner, so I tell her to just take it off the ticket and I will eat elsewhere. No one comes to apologize for the mess ups and bad service. No one offers to discount the table or anything to make it right. And, in fact, she charges my husband an extra $1.50 for some condiment or something he wanted. So they treat us like dirt, then nickel and dime us. I could not leave this place fast enough. No excuse for this dire lack of customer service or incompetence. Much better places around town."], ["Bethany W.", "A solid sushi pick near downtown but not a lot of vegetarian options. A quick, economical option!"], ["Hall W.", "I got it. This is Nashville and it isn't exactly known for sushi. Yes... this place of variety between the various tempuras and a gazillion sushi options. The service is super friendly and fast. But ultimately it is about the sushi:1. It is okay fresh - but nothing better than I have had in most Nashville places2. Awkwardly off temperature at times... as in rather warm riceAdd that to how its really difficult to park here and the loud music inside can be decently annoying - I wouldn't come to this place unless I was here for a quick stop and was walking distance.DO NOT GO HERE ON A DATE!!! Go with a friend when you are too lazy to travel for sushi"], ["Krista S.", "Had a friend bring me the the sashimi salad Togo. Looked awesome and pretty when i first opened the box. Then I really got into it and saw that the lettuce underneath was old and not fresh at all. Very disappointed. Even though you do get quite a bit of sashimi in the salad the old lettuce underneath was really off putting. Also the sauce just tasted like vinegar and soy sauce."], ["Christina C.", "I was craving sushi and happened to pass by Sushiyobi. I went in not expecting great sushi, but was pleasantly surprised that their rolls were very generously sized and the fish was decently fresh. I stopped in with a friend around 8pm and the service was smooth. We sat at the bar and got our food within 10 minutes of ordering. I split two rolls (Alaskan and over the Rainbow) with the friend for $20 (including tax/tip). There was a substantial amount of sashimi in the rolls - something that I always look out for at typical sushi joints. Overall, I have no complaints about my experience here. I would definitely come back to try other rolls and entrees, but probably only often enough to satisfy my sushi cravings."], ["B D.", "Confusion and long waits....I am not sure what is going on here. Seems like a lot of conflict with staff and the service is the lowest common denominator I have seen anywhere I have been - and I travel 50%+ of the year. I have been here now twice and to get 3 orders of sushi and 3 rolls took almost 45 minutes. The most disorganized business I have seen in a decade. Foods ok but the service is TERRIBLE!!!"], ["Ashley S.", "Ordered takeout. Takeout sushi is not always safe so I was hesitant but had been craving it. Sushiyobi does it perfect! Everything was right in place, Saran Wrap so it didn't fall all over the place and the rolls Bob Builder and Mexican were delicious! Very happy customer!"], ["Heather R.", "Went here for Valentine's Day, and was pleasantly surprised. I have not been the biggest fan of Nashville sushi (it's not a town well-known for its fresh ocean fish), and so I was delighted to discover that the fish at SushiYobi tastes fresh. I also enjoyed the wide variety of items (there were even rice-free rolls, for those on low-carb diets), and the prices were reasonable. While \"good sushi for Nashville\" is a different standard than \"good sushi for Seattle,\" this was definitely on the high end of the sushi spectrum for Nashville. Service was friendly and relatively quick. We ordered a mix of traditional and specialty rolls, and both were delicious. I would recommend this place, and plan to return."], ["Myan T.", "Sushiyobi has turned itself into our go-to sushi place mostly because of its location and the quality of its sushi.  The sushi here is actually very good and if this was a review for sushi only, I would give this place a solid 4 stars...maybe even 4.5 stars.  No, my not-so-good rating is for the crap they serve up for lunch.There are fewer things I love more in the world/universe/life than a great bowl of ramen.  Homemade savory broth, fresh noodles, there are few better marriages.  Sushiyobi calls its ramen \"The Best Ramen in Nashville!\"  If that's the best ramen in Nashville I need to hitch a ride out of this twisted twisted TWISTED town ASAP.  For $9.95 Sushiyobi will serve you a bowl of Maruchan (the red ramen package) ramen with \"Fresh From the Freezer\" vegetable medley.  Do the owners think that we're stupid?  We know you are serving up Maruchan ramen.  We've been to college.  We've survived off it when we had $7.25 in our bank accounts.  It's a slap in the face to call this ramen and it angers me that they have the guts to charge $10 for this abomination.  Greed is a terrible thing.  The Japanese make incredible ramen.  Embrace it and make something you're proud of or don't serve it at all."], ["Erin L.", "Got this delivered to me at a hotel I was staying at. Not the greatest honestly and the sushi tasted fishy which shows quality to me....."], ["Corey G.", "I was a big fan of what Sushiyobi does.  They are located in a hip area of town and my only complaint about them would be the lack of parking in the general area.  The prices are very reasonable for the quality and portions of the rolls.  They have a huge list of sake which were priced very well.  The food was very fresh and favorable.  My girlfriend and me split a Happy Roll, she had a Yum Yum roll, and I had the Spicy Yellowtail roll. They have some of the best Yellowtail I've tried in Nashville.  I'd recommend this place to any sushi roll lover!"], ["Jennifer P.", "Some of THE best sushi I have had in Nashville. We tried the White Dragon, Bob the Builder, The Big Easy and the Calamari rolls and all of them were fresh and simply delectable. Unique combinations, adorable atmosphere and fresh ingredients had me sold. I will definitely be returning asap."], ["Sheena T.", "I always enjoy Sushiyobi! Sushiyobi has a nice outdoor seating area right on Demonbreun (good for people watching) and is never super crowded when I've gone. I've tried a couple different things, but always go back to the Rocky Mountain roll. It is literally a mountain of sushi with spicy crab meat on top. Delicious! It's not cheap but not overly expensive either. I've tasted other rolls and entrees here and there, but can't cheat on my number 1 roll! If you are looking for a good sushi place, this is one of my favorites!"], ["David O.", "Stopped in for a lunch going away party for a former staff member.  With parties as large as ours you can always tell the limit of service a restaurant is willing to provide. I have to say they certainly acquitted themselves well.The food was decent. I didn't have Sushi though, just a \"box lunch\", so I can't speak to the namesake quality of the food.Parking is kind of \"sucky\" in this area because its mostly metered parking.  I suspect there IS a lot somewhere, but I doubt there is any situation where you won't pay to park.  Plan accordingly.I might not rush back here in the future, but I'd certainly return given a choice."], ["Christina L.", "This place is consistently good. The sushi is fresh. I especially like the volcano roll and the whisky on the rock. It's conveniently located on demonbreun and is spacious which is nice if u have a large party. It's definitively one of the better sushi restaurants in town but I wouldn't say Nashville is really a great sushi town to begin with!"], ["Dene L.", "Rats + MSGWe used to like this place.We came for soup and found that ALL of their soups have MSG because they don't make anything there.My food came out 45 minutes before my husband's. His noodles came out gray and unappetizing and the server admitted it wasn't what we ordered but because it took so long he brought it anyway. It was inedible and looked like Chinatown takeaway and they only offered to discount it. We ate none of it, but still had to pay for it.As we were discussing this, the server told us the chef is 'mean and doesn't speak English' and no manager was present who would speak to us. Meanwhile, bells were ringing and our server was scared and had to respond to the bells like a Pavlovian dog. He asked us not to say anything as he was clearly afraid of losing his job.The server was a smart kid and competent but the food and timing suck. I hope he finds a new job. Felt sorry for him. He was very embarrassed.As we left the building FOUR RATS scurried past us. Couldn't be much worse."], ["Jennifer M.", "Don't come if you're hungry or have a life. 2 hours waiting for sushi and when we ask about our food it's \"oh it's coming\". That was 30 minutes ago but the cooked food has been delivered..... I asked for chop sticks and you would have thought I asked for her first born."], ["Mike J.", "I am sad to write this review, as Sushi Yobi has been one of our favorite sushi spots in Nashville. Before I begin, I should qualify my opinion with the caveate that my evaluation is focused largely on the sushi.  By sushi I mean raw fish. We realize that the numerous variates of \"fried cream cheese, fake king-crab and gobs of spicy mayonnaise rolls\" soaked in lower sodium soy sauce are quite yummy.  But, I am evaluating primarily on the raw fish part, not the deep-fried tapas that passes for \"sushi\" at so many restaurants.With that being said I am sad to report that the quality of the sushi has declined to the point where it is slightly below average, and the service has dropped to well below average.To wit, my yellow tail rolls came with little \"chips\" of yellow tail as opposed to the finger cuts that I had become accustomed to here.  I suspect these were the remnants from someone else's sashimi.  Same for the Alaska roll - filled with chips of salmon - not so fresh either. Salad came with only a hint of dressing. Sake arrived with the saran wrap still clinging to the carafe (because they microwaved it to heat it). Carafe was hot, but sake was not. Sent it back...microwaved again, now hot - but they didn't refill the carafe, so we paid $10 for half a small carafe of sake. Salads were $4.50 a piece, so with tip we were gouged for nearly $60.00, and left hungry."], ["Joseph P.", "Chef special sashimi. Excellent- although I didn't care for the halibut. Also had the seaweed salad and tuna tataki. Yum! Servers were helpful and friendly. Plus buy two sake get one free!"], ["Lindse E.", "Love getting lunch from here. pretty reasonable prices and i like the lunch combos."], ["Alex B.", "Sushiyobi is one of my favorite places in Nashville.  I've been going there since my time at Vanderbilt as an undergrad and the sushi is to die for.  Servers are really nice and try to make sure that you have a great time.  It's a great place to have your birthday also!Their sushi is fresh and really good quality, and the nice thing is it's focused more on the fish than adding in a ton of stuff.  Definitely suggest and will plan on going back soon!"], ["Marcia M.", "$10 goes a loooooooooooooong way at Sushiyobi for lunch!I ordered the Tofu combo and was greeted by their house salad, miso soup, and a large platter full of rice, teriyaki tofu, broccoli, and some tempura chicken. I don't eat meat so the server was supposed to replace the chicken for a vegetable option but at this point I was so stuffed that I told her to not worry about it. Throw in an iced tea and my bill was $10.12. The food was okay but lacked a bit in flavor. I am curious to try some of their sushi assortment for my final call on this spot. TIP: Patio is great place to grab some rays and people watch on Music Row."], ["Chris D.", "I've been to a number of sushi bars in the south but sushiyobi has been the best so far. While the atmosphere is quite casual the food is top notch. They have an excellent selection of nigiri and rolls as well as an extensive sake menu. The nigiri I enjoyed was mostly salmon. It was cut in wide strips and melted in my mouth."], ["Amy V.", "I have been to Sushiyobi a few times and it is always a decent sushi experience. While it is no means the top sushi in Nashville, the location is great and the atmosphere within the restaurant is nicer than some of the other places in town. The dragon, caterpillar and yumyum roll will hit the spot and they have a good variety of beers, including the Japanese ones. There are also some larger tables that make it is easy to accommodate larger parties. There are large TVs towards the back and the bar as well."], ["Matt U.", "Had lunch with a friend here.  I ordered their Smoked Eel Salad which was very good.  David took care of us and let me know that after my glass of sweet tea ran low they had run out of it.  So I changed it up for a coca-cola.  The inside was very festive with holiday decor.  And then it hit me, I had always eaten outside on the patio without ever coming inside.  So it was nice to actually go inside and see it."], ["Danny R.", "I have not been to Nashville in a while and decided to go back to my old favorite sushi restaurant and get my Sushiyobi fix! They have the best sushi in Nashville! Hands down. The BEST! Taste the rice at any sushi place and compare it to Sushiyobi. Sushiyobi wins. The sushiya explained to me the difference in quality of rice that they use. The rice is not dry like most other sushi places. It's moist and has a hint of sweetness to it. Also, the fish is always really fresh here. You can actually taste the fish. Most places hide the fish with mayo and other sauces. Sushiyobi makes great rolls. The prices are pretty good too. My favorites are: Crunchy Mochi(probably the most popular), Spicy Scallop Nigiri, Rocky Mountain and you can't go wrong with the Rainbow or the Soft Shell Crab!"], ["Jessica W.", "The best tuna I have ever had.We were staying in Nashville for a long weekend, and really craving sushi on Sunday for lunch.  This place was within walking distance from our hotel, so we thought we would give it a shot.  Of course, we were the only people in there, but it was 12:01PM and the poor place had just opened.  Despite us getting here so early, the service was wonderful!  Our food never arrived too fast, and our waiter wasn't in too much of a rush to get us out.We ordered the tuna tartare, which was amazing, and some pieces of tuna (even better if that's possible), then finally the spicy tuna roll - wholy cow.  We did also have a few other pieces, but the tuna really stood out.  We will definitely be coming back next time we are in Nashville!"], ["Eric D.", "was in town for my birthday, this place was right across the street from our hotel and I do love me some sushi, so we had to try it out! Well...it sure was disappointing. Menus were sticky and hard to read, service was...well...we had a waiter but we had to throw things in his tracks so he paid attention to us (we were one of two tables in the restaurant so being \"busy\" is hardly an excuse). Food. Seaweed salad with no ponzu sauce is sad. Edamame with no salt. Ice cold broccoli with chicken teriyaki. Thank god you can't mess up beer.Just an underwhelming experience. Will avoid whenever in town unless desperate."], ["BethAnn S.", "We are not in California.  Its NashVegas so check your attitude about your fabulous experience at (no name dropping, but....) Nobu.  This is just really, really good sushi that is re-donc-you-less-ly (sound it out people) inexpensive.  Located close to Vandy and Music Row, we hit this place up for a bachelorette party.  With 8 demanding semi-intoxicated women, the service was fast and the food was excellent.  I ordered a grilled beef salad which was located on the menu right beside seaweed salad which I happened to know was a wee little tea cup saucer sized dish.  Well, turns out not so much for the grilled beef which was a full size jumbo salad  The key to ordering this is to ensure you don't get it as an appetizer when you are surrounded by hungry females.  The two bites I got in were amazing though - great, thin cut steak with a teriyaki marinade that was subtle. For dinner, I got the crispy shrimp with cream cheese roll -sooo yummy.  Ambiance isn't amazing, but it beats the pants of Ken's Sushi, my other go-to place so I can't take points off for that.  Although I do have to say it's likely not going to be an amazing date place but rather an excellent low key lunch.  Amazingly, every single person at the table loved their food, and that's a first.  And, not wanting to give this place undo credit, and feeling that extra 'Yelp Elite pressure', I opted to go back the following week during the cold light of day without a buzz and was equally impressed.  For super fun, be sure to hit their website for cute home touches where they offer you \"Direction\" and \"Reservation\" reflecting either a total loathing of plural or a cute homey authenticity that defines this place."], ["Bo B.", "I am here often for lunch as their specials are fantastic. $10 bucks will get you ALOT of good food.   The spicy grilled chicken lunch entree comes with soup and salad. Great value. Sometimes the service is a bit spotty but worth it overall."], ["Austin G.", "Stopped by here for dinner with some girlfriends and we were all very pleased with our meals. I had been looking for a good sushi place in Nashville, and Sushiyobi lived up to my expectations. It was nice that they offered other Asian cuisines other than sushi too. Our server was great and the prices were fair for good sushi. Very happy with our experience- I'm sure I will return again."], ["LM P.", "Years ago, Sushiyobi converted me from a sushi hater after a California Roll fiasco at Goten to a sushi lover!  Now, Sushiyobi is one of my favorite places to eat sushi in Nashville and stands as the meeting point for when my friends from out-of-town come to visit.  They offer a delicious variety of sushi, sashimi and other Japanese entrees. I would recommend ordering the Music Circle Roll for you fried lovers and the Pink Lady for those of you who like a little bit of everything.  The prices are fairly high, around $25 per person if you order an appetizer, salad, one roll, and a beverage.  I'm willing to pay that much for this sushi!  It's delicious! Other than one server, who we affectionately call \"The Mean Girl\", the service has always been friendly. We're usually there a couple of hours and they never try to push us out the door.    Thank goodness for this place.  If I hadn't been dragged here by friends six years ago, I would be missing out on a lot of sushi tastiness."], ["Cameron D.", "Sushiyobi makes sushi. It's not great, it's not terrible - it's just sushi. The freshness of their ingredients tends to vary wildly.If you're looking for more consistently fresh stuff (and are a party of no more than 4) check out Samurai over on Elliston."], ["Jacob G.", "Yep, this is a good one.  I went here for the first time about a month ago and have had to come back since!  My girlfriend and I ordered the Whiskey on the Rocks, Spicy Scallop, Futomaki, and a large assortment of nigiri.  I love mackerel & theres was spot on with a little fresh grated ginger and green onion.Second time back, I sat at the sushi bar and was a sorely disappointed to watch the sushi chef pull out a frozen block of vacuum sealed tuna.  RIGHT IN FRONT OF ME! I know it is probably difficult to get fresh fish daily in a landlocked city like Nashville, but still I couldn't help feeling like my $40+ ticket was a bit overpriced.  Sushiyobi in my opinion rivals some of the better sushi I have had in Nashville.  I will be back, but I still think Peter's Sushi in Brentwood is better, but it is a bit of a drive.  For cheaper sushi in this general area Zumi Sushi is also a good spot."], ["Megan H.", "The first time I went here, I left a huge fan of this place. The Philly and Music City roll are delicious! I ordered mine for pick-up, but the contact that I had with the staff was pleasant. I went there again right before I came home, and called in my order about 10 minutes before closing. The woman on the phone said she'd have to ask the chef and see if they could take my order (again, for take-out). I definitely understand that; working retail, there are people that pull that kind of thing all the time and make a long trip of it. My main complaint about that interaction was the guilt trip I received after the chef said it would be alright for me to order. I said, very clearly, that I understood if it was too late. They're about to close, I get it. If you say you'll take my order, then just take it. If it's that much trouble that close to closing, then say that you can't and I'll be happy to get my food elsewhere. Overall, the quality of the food I ordered was great. The customer service was decent, but I didn't order a side of guilt with my sushi, so go ahead and hold on to that next time. I think anyone dining in will have a great time here and enjoy their food, so definitely try it out."], ["Lucy M.", "Pretty standard. I never noticed this place until I had a lunch date with a friend who worked on Music Row, which probably makes this the central reason why people come here. And sure, it has its little things that make it unique and personal, but those things don't seem to have broken through the barrier to be considerable competition to some of Nashville's other sushi houses.    But sushi isn't really that demanding if you're up for whatever. They have the regular rolls you see everywhere, and the cook's special additions to the menu. I'm an Eel & Avocado kind girl, which can either be cooked to perfection or cooked enough then slathered in Eel sauce as a cover up. Unfortunately, Sushi Yobi leans towards the latter prep style, BUT they do have fresh Salmon Roe. That alone gives me reason to not kick up a fuss if I have to go there again. Yeah, a mouthful of oober-fishy tasting fish eggs is not where you want to be."], ["Janet S.", "On a crawl and after the mayhem of the Jack it was peace at Sushiyobi for some late night Sake and sashimi, and that nice Mrs Kim threw in some Gyoza on the house.  Sashimi was generous Korean size portions and the service sweet, prices reasonable and a calm stop before we headed back to more mayhem."], ["Marilee S.", "We came here for sushi and sashimi. That's what we eat when we go to Japanese restaurants. We each had a cold sake and shared five rolls. For around $60 plus tip, we paid and walked out.We thought it was a little steep, but hey, we figured it had something to do with it's location on Demonbreun.On our way out we passed three booths filled with customers all eating the same thing and it wasn't sushi. We'd made a huge mistake. These soups looked delicious.How could that be? I thought. Japanese soups never looked better, for that matter, nothing had ever looked better than sushi and sashimi in a Japanese restaurant before.Swirls of steam rose from each bowl o fresh vegetables and rich broth.Suddenly, we had this strong desire to return. Not for sushi, but soup. Go figure."]], "Koi Sushi & Thai": [], "Virago": [], "Sonobana Japanese Restaurant": [["Joanna L.", "This is actually my favorite place for sushi in Nashville. My old roommate introduced me and my boyfriend and I love this place as well. We had the spicy tuna, sonobana, temporary and one more that I can't remember at the moment and they were all really good. The one I can't remember had octopus in it and I'm not a huge fan of octopus but I enjoyed this one. The Nabeyaki udon was really good as well and was good kind of as a shared appetizer for us. When the rolls came out we realized we ordered way too much food but were glad to have had a variety. When people into Nashville and are looking for a great place for sushi, sonobana is the first one I recommend. Highly recommended!"], ["Sasser M.", "We had high hopes for Sonobana but it was for naught.  No one wanted to help us during our visit.  Our waitress disappeared and I literally tried to hunt her down after 15 minutes.  None of the other employees would talk to me and the manager wouldn't talk to us either.  After literally going to the kitchen door to find her, she finally returned.Our Miso Soup was barely warm, practically cold.  The accompanying salad was very soupy, swimming in salad dressing.  When my bento box arrived it had the wrong meat in it.  That might have been find except the meat was hard as a rock.  The fried tempora was cold and chewy.  Who the heck serves cold fried food?  They finally offered to bring the right meat out but it arrived very late after we had stood up to leave.  Again, the meat was overcooked and hard as a rock.In my mind, this place is likely a shadow of what it used to be.  That is the only way I can imagine how the previously good reviews of Sonobana reflect on this restaurant.  Memories don't create good food folks.  I'd skip this place and go somewhere else."], ["Walt H.", "This is, in my opinion, the best sushi in Nashville, HANDS DOWN. Me and my girlfriend try to go here at least once every month or two, and always wish we went more. The prices are generally average to below average (especially given the quality), and the service is always impeccable. The alcohol prices might be slightly high, but that's not surprising considering alcohol is not a main fixture of the restaurant, The wait staff is incredibly friendly and happy to explain things, and I've yet to have any bad rolls here. The sushi chefs are very authentic and they do not disappoint! Some nights of the week this place can be really packed, but middle of the week it tends to be pretty easy to get a table quickly. Call ahead if you're concerned. Also, definitely try the Sonobana roll and the nabeyaki udon!"], ["David D.", "Very traditional yet spartan Japanese restaurant.   This is authentic in that you have Japanese chefs, dishes (sanma!), and even a Japanese grocery store.  Sonobana has been around about thirty years, which is good because they have relationships to procure the best fish.  However, it's also bad as the decor is reminiscent of a terrible Chinese restaurant and some of the staff are a little past their prime.  That said people are friendly, the menu is very eclectic, and where else are you going to get broiled squid and hamachi kama in Tennessee?One other heads up, this place is very inexpensive, not in a good way.  We re talking very casual.  Chipotle is upscale on a relative basis."], ["Beth G.", "This review is for the GROCERY ONLY.  Love love love their grocery. Their food seems touch and go so I have not been back recently. Again the Grocery. They have their seasonal items which makes me so very happy. Seasonal and cultural presents on a timely basis! What fun is that? Son likes the sweets that we had in Japan and in Hawaii. I don't feel the same about the sweets, but then again, I don't like Mochi as much as he does or the red bean sweets. Must be an acquired taste like mushrooms. They have lots of green tea things, like Mochi Ice cream, see what I did, I like green tea but not the mochi but will forgo the mochi flour to get to the ice cream. We all make sacrifices. They have green tea nestle chocolate and Kit Kats in different flavors. Sakura- Cherry, is seasonal and difficult to get unless you are Osaka, but this grocery store has carried Raspberry, Cheesecake and of course green tea. I used to go for the Wasabi paste when we could not get it in everyday grocery stores, but now go for monthly sweet visit for the son and to see what flavor Kit Kats that may come in. The people at the registers is always sweet and speaks decent english and also my son and whomever is there talk a little so he doesn't forget his Japanese. Really love how great this little store is off White Bridge."], ["Kaleena 'Kala' H.", "My husband and I have moved to the Donelson/Hermitage area, so we don't get to frequent Sonobana like we used to. However, while running errands the other day we decided to stop here for lunch. I decided to order 3 sushi rolls, while my husband ordered the mixed tempura lunch. I ordered the California roll, the New York roll, and the Scallop roll. The Scallop roll was good, but the California and New York rolls had absolutely no taste to them. The only thing I could taste was the roe. My husband said that his lunch was also tasteless as well. However, our waitress was very friendly, and kept our waters refilled. I was sad to see that the quality of the sushi had gone down the past couple of years since we were previously frequent customers. I just hope that it gets better."], ["Robin B.", "This Nashville favorite is in the same shopping center as another sushi restaurant, so do not confuse the names!  This place is so reasonably priced, I gawked at our lunch check and looked around for someone else whose lunch we could pay for.We are Memphians, and this slightly dated, but well-loved place harkens back to the grubby 1980s origins of sushi in America.  It is TARDIS-like in that it appears tiny on the outside, and once you reach the back of the room, you realize that there are more rooms- private dining rooms, sprawling extra dining room, and a hallway leading to an asian grocery store. The Laura roll was memorable- it has both tempura shrimp and warm mayonnaise, PLUS warm avocado, so the whole thing is a melty, salty, chewy firework for the palate.  I also enjoyed the Lilly roll, and one other.  My son and I split the seaweed salad appetizer (really for one person), and my daughter loved the tofu steak appetizer, which has Mexican flavors, with stir fried green peppers, onion, and bean sprouts. If we lived in Nashville, this would be on my go-to list for sushi spots, and not just for the food.  Our service was excellent.  We were greeted by the owner, served by a red-lipped and lovely server whom we could tell was passionate about the restaurant and caring for her patrons.  The owner's wife spoke with us at length to make sure the kids were happy (our children are used to Vietnamese food, so we have to explain to them what they are ordering with other asian varieties.)Likelihood of returning?  9.9 out of 10"], ["Num N.", "I've been coming to Sonobana for over 10 years and this place never disappoints. Something to keep in mind is nigiri is by the piece so less commitment. Things to try: sweet shrimp nigiri, smelt toe with quail egg nigiri and a hand roll, particularly the spicy scallop hand roll. One last thing, this place is more of a family restaurant. So don't come here if you want to have a night out with your girlfriends and be out and about."], ["chad m.", "My wife found a dead, dried-up, rotting mouse under our table. (Best to not bury the lead)Went for a party in that room where they make you take your shoes off. Ate our bland meal, a bento box and sushi rolls, then someone joked about how hard it would be to clean under the tables in that shoeless room, and so my wife grabbed her phone as a flashlight and shined it under there. There it was, dead mouse right at our shoeless feet the whole dinner. Waiter and Management offered nothing but a sad apology. I know these sorts of things happen, but this is a place I won't be coming back to. It was not a fresh mouse, it had been there a while. Literally the most grossed out I've ever been in a restaurant."], ["Kiki C.", "Best sushi in Nashville. Everything I have ordered there has been delicious. They are very sensitive to food allergies and the waiting staff is super friendly. Insiders tip: some have been known to call the place Sonny Bono."], ["Cher Y.", "Pretty good sushi for the Nashville area at reasonable prices. My go to place when the craving hits. Pros:-Good fresh sushi - prolly about as good as it gets for Nashville-Nice variety on menu - noodles, bento boxes, etc-Good value for the buck - good portion sizes-Attached to a neat grocery store-Apparently you can rent japanese books/videos in the back...-They also have traditional Japanese seating private rooms if you have a large groupCons:- The service is a hit or miss as Yelpers have noted.  After 4 terrible service experiences back to back (being ignored, waiting on the check for 30+ mins while these waiters were just obviously socializing with their fav customers at the expense of others), i stopped coming here for 6 months.  Yes, it was that bad.  I went back this past week, and it looks like they got rid of the terrible waiters - the new crew is much better.  I hope it stays this way.  If i ever walk in there and see the offending wait staff again, i am walking straight out. Keep up the great work with the food!"], ["Katie I.", "some new favorites I've added to my rotation: Lily roll- a must! Yellowtail nigiri- so amazingly fresh! spicy salmon- yummmm emma roll- great for sharing. Staples like crunchy tuna/shrimp/crab- all so yummy and fresh.  I recently asked what was in their crack-like salad dressing. Surprisingly it's a pureed conglomeration of carrots, apples, sesame oil, sesame paste, onions. Sells for $4.50 next door and makes for a great marinade at home along with just drinking it after you've devoured even the crappiest lettuce. Miso soup- divine. Fresh, crispy tempura. Broiled eel- delightful. Also love the Spring Roll, Futomaki and Nashville roll. There are so many weekly regulars here like myself, the staff has watched my family grow, they have become like family. I don't know what I would do if this place didn't exist. One of my all time favorites!"], ["Julie B.", "Best sushi in town! Little pricier then Sushi Train but so worth it!"], ["Daniel B.", "Just average sushi and sushi rice.Service is good to excellent"], ["mary b.", "My favorite sushi in Nashville! Fish is fresh and elegantly prepared. The menu has tons of options (great pictures of fancy rolls too!) and the Japanese specialties are excellent -- shumai, natto roll, etc...Downside: strip-mall ambiance and lack of speed. Last time I visited, the sushi chefs were so backed up that the restaurant stopped accepting to-go orders.To me, that just means the secret is out: best local sushi found here. Also, lunch menu special bento is a terrific value ($10.95 for soup, salad, lots of sashimi, rolls, and veggies)."], ["Lauren W.", "FOOD: AwesomeSERVICE: PoopyExplanation:I have to re-evaluate this place. While I have been going here for at least 3 years constantly and enjoying all the food, the service has completely gone downhill. The last two times that I have been (within the last month) I have had horrible service. The food took forever to come out and the waitress barely serviced our table. Our food this past week came out very late and cold. They even didn't divide up the order correctly so there was a bit of guessing at who ordered what. Everyone at the table came over to apologize about the wait and the food, but no one really offered to do anything to fix it.  Eventually after a bunch of back and forth and them remaking some food- they reduced our bill significantly. While that eased the sting of the experience, it doesn't change the fact that they cannot handle the size of a regular dinner rush and service greatly suffers.It saddens me to write this because this has been my go to place for years! (I hope to change this if service improves!)"], ["Nilay H.", "I really enjoyed their Bento box! So delicious and fresh. Also, the sushi was amazing and the atmosphere was very great :) also, there is a cute little Japanese market next door where we got some great Japanese snacks and candies!"], ["Jason B.", "Prepare for a step back to the 80's when you walk in.  This place definitely needs a cosmetic update.   I was pleased to see a large table of Asians when I walked in.  If Japanese people are eating at a sushi place, it has to be pretty good right?The sushi was really good.  Our server was attentive and helpful.This place is not for a sushi novice.  It has the feeling of being much more authentic than some of the more commercial sushi joints in the area. If your norm is crunchy shrimp and California roll, you could be a little overwhelmed.Overall it was a nice change from my normal sushi places.  If you've been curious about Sonobana, give it a try."], ["Brandon F.", "Good by Nashville sushi standards but giving 3 stars for people visiting and looking for sushi.  We go here plus a couple of other spots when we are dying for sushi but truth be told have a standing sushi night like we did in other cities.Nashville has a burgeoning food scene but sushi isn't on the list of great new places.As typical with Nashville sushi, Sonobana is heavy on rolls and not expansive or special on nigiri or sashimi."], ["Mojo L.", "The food was great but the portion small. The sushi special for 4 isn't enough for two persons. The service was great. I'm not going back because of the portion"], ["Alex P.", "Not the best I've ever had, but it was alright...  First off, its tricky finding this place but its located behind Dalts and its in the same strip mall as Sushi Train.  anyway, the interior seems dated possibly because of the wall facing the parking lot with all the ugly paintings, I mean local talent... And the booths were too cozy- it's not like I'm heavy or closterphobic, the space was just tight.  Also, since it was a Friday, I guess it's not unusual, but the sushi wasn't super fresh.  I was disappointed with my spicy salmon and eel rolls.  But the house salad with ginger dressing and the miso soup was fine. I think I would have been more excited had I discovered the little market attached to this restaurant... I guess that means I'm coming back at least one more time."], ["Kim L.", "Love everything about this place!Yu Dofu was awesome!The Veggie Spring Rolls and the Nashville Roll are a must-try! As always top notch service!!"], ["Alishah N.", "Possibly the best sushi I've had in Nashville. The salmon sashimi reminded me of a place I'd use to go to in Seattle where the salmon was so fresh and soft it tastes like butter.The place is super friendly, service is great (better than Peter's Sushi) and the price is incredibly low considering the quality.If you're looking for a new sushi place, I'd definitely give them a shot. I'd go more frequently if I lived closer."], ["Leigh J.", "Who would have thought incredible chirashi could be found in land-locked Nashville, Tennessee? The chirashi at Sonobana is so good it eats more like an expensive box of chocolate truffles than a box of raw fish. This one includes fresh cuts of maguro, sake, hamachi, white tuna, octopus, ebi, surf clam, mackerel, crab stick, and a delicious freshly-made tamago that is closer to a dessert.  I'm not crazy about surf clam or mackerel, and Sonobana has always been more than willing to oblige with whatever I have asked to substitute-usually more yellowtail (which is my favourite) but they've also been known to throw in pieces of unagi (delicious barbecued eel) despite the fact that it's not something typically included in chirashi.  I love spicy mayo, tempura crumbs, and ponzu as much as the next American sushi-goer, but the fish at Sonobana is so fresh and of such high quality that it is better with fewer embellishments so you can actually taste the subtle flavours of the fish.  Better yet, you can alternate each mouthwatering bite with a forkload of one of a lovely selection of extra goodies they pack into that little box, including sweet pickled burdock root, seaweed sunomono, strings of crunchy diakon root, pickled ginger, and wasabi.  All of this sits on top of a bed of seasoned rice sprinkled with sesame seeds, seaweed, tobiko that is a culinary triumph on it's own.  I often ignore rice to fill up on more fish, but Sonobana's is so good I find myself continuing to eat it even after the fish is long gone.   Hands down the most satisfying chirashi I have ever eaten."], ["Jenn G.", "I was sooo skeptical of this place (and its attached grocery store) when we first walked in, then intimidated when I recognized almost none of the rolls on the lengthy menu.  But it was love at first bite!  These people KNOW their sushi, and my friends and I turned our table into a free-for-all buffet, trying everything we could afford to order.  It was the best sushi I've ever had, hands down.  Everything was so fresh to the point that I can't even think the word \"fresh\" without remembering the Sunflower Roll!  Not exaggerating, I want to make the drive back to Nashville just to eat at Sonobana again."], ["Rachel C.", "Great selection, everything is fresh.  A little on the small side for seating and staff gets overwhelmed.  Great service and descent prices."], ["Jenn R.", "I liked this sushi restaurant and was a repeat customer over the last few years. By Nashville standards it was one of the better ones.Was being the key phrase. I brought 4 friends in tonight for a birthday dinner and had such a poor experience that I was embarrassed and bummed out for the birthday girl.The waitstaff and the owner did not even come to the table to apologize only to make the excuse the two customers at the sushi bar were being taken care of first. In fact , they did not even try and make an effort to make the \"over one hour wait to get our sushi after it was ordered\", right. I was very embarrassed as I had recommended this place to people for a special occasion. It took 45 minutes before all of our salads arrived after ordering. It wasn't even busy as usual.The waitress was nowhere to be found. The eel was tasteless and rubbery and had to be sent back.The udon soup was gross.The sushi was not  good as it once was. I am shocked that they made no effort to make four customers happy. I can not even recall the last time I was this disappointed in the overall experience of a restaurant. I will have to bring my business to Arigato Sayonara or Virago from now on."], ["Howard L.", "I still eat here on a regular basis. My only gripe is that the Tuna isn't what it used to be, but I'm guessing there are factors beyond the restaurant's control behind that. Overfishing, declining stocks, toxicity, etc etc. I read another review that made me angry: \"This restaurant was better when it was BenKay\". Ok dude, I was around when it was Ben Kay and the food hasn't changed. Beside the Tuna, everything tastes as great as it used to. That water collecting at the bottom of your salad bowl? That's salad dressing, smart guy.This place is still tops in Nashville. That sushi train place made a mistake trying to compete, because they pale in comparison."], ["Tiffany M.", "Hands down the best sushi I have here in TN. I'm from NY and I love this place. Food is good, tons of rolls to choose from and super affordable!"], ["EdDee P.", "This is a review update for 5 stars to 3 stars and I'm sad to do this. This place has been my favorite, however they have been so busy and need more staff. The wait is forever!!!! Apparently they are one sushi chef short. Worth the wait. Call ahead of time!! For large parties order private room. The room looks like you are sitting on the floor, but there is room for your legs to hang . . . just like in the Geisha movies"], ["Allison B.", "Love!!!!!! This is my go-to spot for sushi! The staff is amazing and the food is to die for. Please don't choose Sushi Train over this place! They also do $20 all-you-can-eat every year during the Super Bowl!"], ["Holly J.", "We went on a Sunday late afternoon and got right in.  The sushi was great but the service was horrendous.  Looked like they had plenty of help. 4 chefs too.  After watching several people get served before us (we had plenty of time to do this), I was thinking there had to be some sort of server hierarchy going on. The rolls, seaweed salad, and broiled squid were so good that we will give it another try.  Hopefully it was just a one night thing."], ["Pamela B.", "Oh my goodness, the spicy crunchy shrimp roll is amazing.  Portion sizes are big, so fresh and tasty.  Nice quiet and relaxing atmosphere.  The staff is friendly (and super quiet ).  I haven't tried much else but I plan to..."], ["Mark S.", "Another great experience at Sonobana. As many of you probably know, Sonobana is owned by the family of Moon Sun-myung - a significant Korean industrialist who is known for the Unification Church and his many commercial endeavors including the Washington Times. They also own a sushi purveyor and that explains the quality of the fish that they serve.  Moon died in 2012.Sonobana is easily the best sushi that I've had outside of New York, San Francisco and Chicago. Their sushi menu is diverse and includes things you don't often see such as ankimo and awabe - uni is also available if you ask. For Americans who don't understand or appreciate tratditional nigiri sushi or sashimi there are also fru-fru rolls. My guests all enjoyed the dinner and the excellent service we received, I'm looking forward to my next visit."], ["Jamie A.", "Rebekah...Roll....thank you Rebekah, whoever you are, for coming up with this delicacy! It was basically a tempura fried California roll sitting in sweet chile sauce topped with baked shrimp and spicy mayo. Definitely not healthy, but amazing! I have to say I didn't like the spicy crunchy shrimp roll. Honestly I don't much care for the toasted sesame seeds and it was covered in them. I'll probably try it again and ask they leave the seeds out of the rice. Hamachi (yellow tail) nigiri was pretty standard. Beef gyoza was delish. My boyfriend loved the caterpillar roll. I am happy that we have a new sushi place in the rotation!Oh, they appear to be very kid friendly.  Usually not my favorite thing, but I was happy to see that all the kiddos were well behaved.  Nice job, 'rents!...one more thing...the sell McCallan 12 year scotch for $7ish!"], ["Esther L.", "Sonobana is one of the things I miss most about living on the West Side. The udon soups (try the duck!) are a nourishing dinner during bitter winter nights, made even cozier by the green tea. The fish is the freshest in the city, so I choose sashimi or nigiri when I am lucky to be in that part of town. The only disappointment is consistently overcooked edamame, which doesn't seem dire enough to warrant a lower rating. Service is friendly, refills are prompt. I miss you, Sonobana!"], ["Kristen H.", "after i wrote about this place, i got hungry, so we went again last night. and it was even better! same great service (different server though), and the food was even tastier. very good experience."], ["Mala H.", "Astounding. Sashimi so fresh you'd swear it was about to jump off the plate.I am returning for their Sashimi boat and bringing my dining out group - Nashville Foodgasm next month.Totally an unexpected gem and worth a try. The lunch bento box is extremely generous and a terrific value. Angelfish liver was a delicious and lovely surprise item on the menu during my visit."], ["Trish T.", "My friend took me here to eat lunch after class.  She's a devoted customer to this restaurant.  It has good quality fish, but I really hate when my sashimi comes out warm.  It's happened here 99% of the time when I've gone with my friend.  It is comparable to Peter's..quality and price (but I've never gotten warm sashimi at Peter's).  This place is a low-key sushi joint, so nothing exotic or crazy here :)"], ["JJ S.", "As a San Francisco native of Japanese descent I'm picky about my Asian food. This place impressed me. Super fresh fish and the sushi was well executed. Good selection of hot and other food including hard to find items like hiyayako, oshitashi and sukiyaki to name a few. Good service and a nice neighborhood vibe. The bonus was being able to buy the great Bonita flakes they used at their grocery store next door. I will definitely be a regular customer."]], "Nama Sushi Bar": [["Steven B.", "Ate here with my wife and parents about a month ago. This place sucks. Mediocre sushi, dumplings with nothing inside them and tempura that isn't tempura. Go down the street to Samurai Sushi if you want great sushi. Battered and fried food isn't automatically tempura. This stuff was greasy garbage. This place has too much money backing them to be this crappy. But then again, it is typical for Nashville to embrace mediocrity."], ["Zach P.", "Being from the Knoxville area I've heard great things about Nama but just never found my way in. My brother and his fiancé recommended Nama and said it was new to the scene. We went on a Sunday night and the crowd seemed light which is preferable bc sushi is a time consuming prep generally. We ordered spring rolls and calamari apps and they were pretty good but the $6 for 2 spring rolls that were essentially a roll of dimes seemed inadequate but the flavor was good. We got 5 rolls- 3 of which I remember Moon special- great roll but had carrot and cucumber mixed around, unsure of it other than filler and seaweed salad. It was a good portion but at 18$ should be. Overall good. The Atlantic roll was well prepared and delicious Get it! The mowie wowie was different and everyone enjoyed it. I could see sushi purists being up in arms that it had untraditional topping of citrus salsa that was borderline hipster. It's worth a try. The overall vibe of the place was trendy and relaxing. Kudos to the layout as this place has some new age charm to it. They have valet parking too but there's a lot across the street for casual parkers. Fun spot to try out. But be warned it'll lighten up your wallet."], ["Peter S.", "Bar staff was very nice and very helpful I what to order. I had the soy joy and crazy tuna rolls. The soy joy was really good but the crazy tuna was just okay. I had a few fishy bites in the crazy tuna. There is a lot of rolls that had snow crab in it, so if you like them with snow crab I would go. I prefer tuna and the choice for tuna was limited. I also had the Tito Kyoko drink and it was fantastic, if you like wasabi I would try this drink. Overall it was good but not to die for."], ["Diana O.", "A nice sushi spot with patio seatings. They have valet available or you can find a street side parking. I had a good experience. The prices was a bit high for sushi that was medicore. If you like trying out new places go for it."], ["Adrianna S.", "Was very excited to visit this restaurant since it is a new addition to Vanderbilt's Taste of Nashville selection. However, I will definitely will not try this place again for sushi. Sushi was verrryyyyyy overpriced compared to main competitor (Osake) and was unimpressive. My sushi rolls were very bland, small, and not worth the price. It seemed like the rolls were under sauced with eel sauce and spicy mayo so you'd be forced to ask for extra sauce on the side at a price.Additionally, the far side of the restaurant had a rancid smell as if water had been wasted but not soaked up leaving a rotten smell on that side of the restaurant. In contrast, the fish tacos were very good and one of the cheaper items in the menu for a sizeable amount of food."], ["David O.", "The Better Half wanted to try the new Sushi Bar that is Nama.  The place is very very nice, and feels quite upscale.  That certainly doesn't come without cost. The FULL price rolls would easily break the bank, but Monday is Half Price Roll day (From a select Menu) and fortunately includes several types, without including the entire menu.We started off with Miso soup which really is my only major complaint with this place. The bowl they serve the (full price) Miso soup in is so shallow that the spoon doesn't even hit the bottom.  It's over before it starts! I felt like they might as well have put my soup in the bowl you put your Soy Sauce in!Otherwise, we had the Pizza Roll, Crunchy Shrimp, Tempura and Orange Crush roll. The Pizza Roll was the one I disliked the most.  Its well made, it just had something I can't quite pin down about it I didn't care for. On the other hand, the Orange Crush was the biggest surprise. It was quite sweet and a unique take on Sushi. I absolutely recommend trying that one.In the end, the price is the barrier to me. For the Half Priced Rolls we paid about what we would dining at a \"regular\" sushi place. If you want the upscale atmosphere this is a great location, but if you just want good sushi and a decent price I recommend Sonobana or other local choices."], ["Hall W.", "The sushi here isn't awe inspiring world class, but for Nashville (and especially TN), it is still pretty good. The presentation is great and they have a comprehensive ingredients. However, taste wise, it just lacks that balances of an amazing sushi. Ironically, I would say the best points to Nama isn't the Sushi part, but the bar part. They have pretty amazingly well made mixed drinks and awesome drinks selection. They also have super amazing deserts too.The feel is modern trendy, but without overdoing it. The service is just beyond spectacular. Overall its a spectacular experience for a pregame dinner or a Friday night drinks..."], ["Scott H.", "Would have loved to have tried the food tonight but sat at the bar and no one would wait on us. 3 people at bar more focused on cleaning glasses than waiting on customers."], ["Joshua R.", "This place is not a good choice. Sat outside next to a cleaning bucket with dirty water. The server seemed upset to see me there for lunch. I usually don't trust restaurants in this area but needed a quick lunch and sushi sounded great. The sushi is not traditional by any means. I am from a beach town so maybe I'm just not used to it but the quality of the fish was definitely in question."], ["Stephanie C.", "Excited that Nashville has a true specialty sushi place! They had a great selection of different rolls and some non-sushi dishes as well!  I like that they have a full bar too.  The sushi wasn' t blow you away but we are about 10 hours away from the ocean.  They did have a few TV's too and valet which made parking super easy.  For it only being open 2 days we didn't really have any glitches."], ["Guglielmo F.", "Excellent sushi and attentive (just the right amount) and friendly staff. The nigiri was incredibly fresh and amazing - and the Soy Joy roll was a great new experience. May be back for dinner."], ["Caroline B.", "I attended a yelp event here tonight. Great staff and service. I liked the restaurant, but it was a little dark (I had to sit at a weird angle to even look at my menu). Get the Asiago crab dip, or you will regret it for the rest of your life. If you get the house salad, ask for extra dressing. The dressing is so yummy, but there's barely any on the salad. I had the pizza sushi and it was yummy. Good flavor. If you get the tempura sushi, ask for some extra heat to be added - we got some extra sauce & it was well worth it!The truffle dessert was sooooo good, but very rich."], ["Lauren L.", "This place came highly recommended from friends who had tried it, so I was disappointed. I am so glad I went on half-priced sushi night because the #1 thing about this restaurant is that it is EXTREMELY overpriced. For sushi that is not great quality, $18 dollars a roll is ridiculous. For that price, go down the street to Virago where the sushi is amazing for the same dollar amount.  The service was only OK. When we arrived the restaurant was basically empty but they sat us in the back of the restaurant by the back door (that kept opening and blowing cold air in). Drinks were meh. Overall- I won't go back. Not sure how long they can survive doing half-priced sushi the same night as the other big sushi place in Nashville."], ["Seth T.", "I've had fusion sushi from the east coast to the west and Nama is, by far, the best I've EVER had. To find fresh fish in a land locked state is obviously difficult yet this restaurant somehow does it! You should eat at the bar if you want the best service. When I went in I had an amazing experience with a vibrant young lady, I think her name was Madi . Order a chef's choice from any of their fine sushi chefs, personally I love josh and Logan, and expect to have an amazing culinary experience! Don't be turned off by a slightly higher price point. Paying a little more is well worth it. I go to Nama at least once a week!"], ["Anna J.", "Came here the other day for half off sushi, and was very disappointed. The rolls sounded amazing, but when they came, they were all let downs, maybe except for one (the tempura fried one). My biggest problem was the fact that none of the rolls were rolled tightly, or the rice wasn't cooked well, so when you picked one up, it would fall apart. The rice to filling ratio was off on some of the rolls. Nothing tasted spectacular, just average. Service was alright, our waitress didn't seem like she was having a good day."], ["Beth E.", "My husband and I used to frequent Nama Sushi Bar when we lived in Knoxville, so we were super excited to hear that they were opening a location in Nashville as we have been disappointed with most of the sushi joints in Nashville.I am excited to report that the Nashville Nama location has definitely lived up to my expectations and we will definitely be recommending it to everyone we know!Our favorites include the crab and asiago dip appetizer, tempura roll, soy joy roll, dragon roll, rainbow roll, and Atlantic roll. Maki rolls are also tasty and they have great specials. Good for groups and sharing. House saki is also yummy!!"], ["Thomas I.", "Tried out Nama sushi bar tonight. It was expensive food that should not use the word \"sushi\"Over cooked rice, nori was not prepped right.Tempura & cutlet cooked in the same oil? Taste was off. The prepping of the curry was not Japanese. Yet I don't know which style of curry serves undercooked bell peppers.If you are feeling for Japanese, don't go here. Grocery store sells better prepped sushi.As Japanese, this place feels more insulting than disappointed. Would I go back again? NoWould I go eat here if it's all paid dinner? No"], ["Dominic L.", "While very trendy on the inside, the quality of the sushi nor the service lives up to those expectations. We ordered sushi to go from here and they told us 10 minutes. We arrived at the restaurant to find the two orders the place were rather overpriced, quality unbecoming, and we waited 25 minutes while ordering overpriced drinks at the bar. I don't think they have a legitimate sushi chefs. Rather a bunch of college students have taken some course on how to make sushi."], ["Norra T.", "I wish I could've given this place more stars. 1 star bc the soy joy roll was good. But it lost a lot of stars because of the sashimi platter we received had yellowtail with bones still in it. I found 2 bones in 1 piece and 1 bone in another. Be careful if you decide to order any sashimi. Brought this to my server's attention and nothing was done or addressed. Don't bother ordering a whole bottle of ozeki unfiltered sake either. You won't get the bottle. They pour the cold sake into a large sake carafe. The large sake carafe is only good for 6 shots total... just fyi. If you purchase ozeki bottles elsewhere it's good for at least 9 to 10 shots at the very least.  The sake shot cups are the same as any other sushi bar. Do not be fooled."], ["Charlie M.", "I thought the sushi was just okay. The service was very friendly and good. I just don't think the food is that good and it is expensive."], ["Kylie H.", "The ambiance of Nama stands out against the other sushi spots on Elliston. It's a great place to fulfill your sushi fix, have a nice dinner with friends and not spend a fortune. Drinks are also reasonably priced. Sushi was good, the only thing I did not care for was the calamari appetizer."], ["Andy W.", "I freaking love Nama. Best sushi in Nashville IMO. But the edemame just never works out. Always cold. Always dry and too hard. The thing is, pf changs is down the street and their edemame just crushesssss namas. It can't be hard. But man they really need to try and just make it like the other places. Not a huge deal. I'll still keep coming. But my wife hates coming with."], ["Samantha N.", "Recommend the half price sushi days! We had the soy joy, pizza roll, and Kim Chee and rice. Also, on the main menu, enjoyed the tuna poke. If you like seaweed, this is a must!"], ["Chelsea J.", "Their lunch special can't be beat! The sushi is fresh, flavorful, and service is (usually) great. I probably wouldn't come here for dinner though, its a little too pricey."], ["Scott H.", "When hipsters make sushi, it's not good.  Maybe Japanese hipsters, but not these folks.  My girlfriend loves sushi. She will never come back to this place. Not good. I had been traveling out of town for a number of weeks, and my girlfriend missed me, but did bring up the fact that we had not gone out for sushi in a while. This was to be a reconciliation dinner of sorts. All it did was cause further fighting. We decided to get a sample of three different choices, one was the Cali roll, one was a avocado type deal, and the other one was some kind of crazy spicy tuna, which was worst one.  We about puked on the tuna one, which I think the waitress noticed and she removed it from our bill.We ended up going across the street to the Gold Rush to get by bar food, even though we probably got lung cancer.  It was better than terrible sushi. Nothing is worse than terrible sushi."], ["FoodCritic 6.", "This place was okay! Not all that. Very nice and upscale place. Whet there with a group of friends waiting one hour for our food. The sushi was not all that. If you want good sushi I wouldn't go there. Better place around town than this place. Too over priced for some loose sushi."], ["Cary B.", "Daughter and I are in town for college orientation. Staying nearby at Hilton Homewood Suites. Nama's is a block away. We had 2 appetizers: seaweed salad and tomato/avocado salad. Both were delicious, but the tomato/avocado salad lacked some flavor which was quickly remedied by some sea salt. We had 3 sushi rolls: Cali, Crunchy Shrimp, and Dragon. Would definitely get the last 2 again. Outstanding!! The Cali was a crab and mayo blend, not a whole piece of crab. Had more flavor but not a lot of crab meat. We took our desserts to go: truffles, and salted caramel cheesecake.  Small portions but divine!! Service was slow on a Monday night but we weren't in a hurry. And the place was very busy. My daughter now knows of a good sushi place here in Nashville within walking distance from college."], ["Angus N.", "Really enjoyed this place, we brought the kids. It was a mellow Monday night, half price sushi. Loved the Pizza roll and the Soy Joy. We didn't order any sashimi, not sure about that this far inland."], ["Kayce T.", "Rachel was awesome, she suggested the Ex-Girlfriend and didn't disappoint. Seviche was great, and the tempura roll delish! Staff was warm and friendly!"], ["Tammy T.", "Nama on a thursday night for half off sushi?!?! DONE AND DONE. Although there is only a limited amount of half price sushi you can choose from, the price definitely makes up for it! Crunchy shrimp for $4.50. HELL YES! The interior is very spacious and DARK. Might need to bring a flashlight next time to see the menu. I ordered the crunchy shrimp and spicy tuna. The crunchy shrimp was absolutely delicious. Hello crunchy shrimp and goodbye mickey d's! (jk, mickey d's, you will forever have a place in my heart) The spicy tuna, on the other hand, was really fish and didn't tasted fresh at all. yuck! That just means two orders of crunchy shrimp in the future!"], ["Vanessa K.", "I love me some good sushi and I found some here! The rolls are bigger than most and they were delicious. My group ordered the Boston, Crazy tuna, and Fancy Scallop rolls. We also ordered the calamari to start, which was a bit chewier than I like, but  it helped me save room for the sushi. We got som cocktails that had a hint of alcohol thrown in there and weren't mixed very well so I would just go with a beer next time.  The place was cute & modern inside and the ambiance was good - we sat at the bar and watched a game. The more I write this review I realize the place wasn't bad and I did very much enjoy the sushi, but that's about it. I'll probably come back if I can't find parking for Samurai, which is what happened on this visit.."], ["Joanna F.", "I chose Nama because I had a bad day, and it was a outdoor dining and the evening weather lent itself to being just that, outdoors. I figured I would rejuvenate myself and then go home. It was a busy Friday night. I was given an alert buzzer and sat at the bar to have a drink while waiting. It was interesting to notice that many of the people coming in after me all looked a bit alike, blonde hair teenage types with necks craned to see who was there. It didn't take very long until I was seated and was much shorter than initially expected. My appetizer was AgeDofu. It was served in a bowl large enough for bouillabaisse. The nondescript liquid reached halfway up the tofu. I didn't finish it.  I ordered several rolls off the menu. Out of the three rolls I ordered I ate two pieces of each. I usually take food home after grazing, but none of this was worth it. All I kept thinking was if an out of towner came here to eat they would really think we were backward. The architects get kudos. The chefs? Certainly not chefs but most likely low paid employees who desperately needed jobs. Avoid this place unless you want to have a drink on the patio. Avoid this place if you ever had good food in your life and know the dif. Avoid this place if you don't want to take a cigarette lighter and just burn your money in front of your eyes. Just AVOID this place unless as I said before to have a drink and sit outside. Do you want good sushi? Down the street at Samurai...walking distance so leave your car where you parked it."], ["Sheri L.", "Great service. Great location and ambience for a fun night out.  Creative sushi and hot dishes."], ["Michelle L.", "Went on a night that was not busy with my boyfriend because we LOVE sushi, (not just because we're asian, but we just grew up with it, so i mean, we definitely know our sushi) and we wanted to try this place out since we're so close to it. Keep in mind that we DO NOT mind paying 100 dollars for dinner for two. We usually eat a higher end meal at LEAST once a week. We've been to multiple sushi joints all over nashville. Including places like Samurai, Tenno, and Wild Ginger (HIGHLY recommend). We definitely had high expectations for this place. VISUALLY: VERY appealing. The atmosphere is great, wine list had a good variety. We ordered the ex-girlfriend which was one of our server's favorite. It was pretty good! my boyfriend got some kind of sushi platter that came with a basic roll. The roll that came on his platter was just SO BLAND. It was just lacking that burst of flavor that a roll should have. Not only that, i noticed my boyfriend was not touching his sashimi or nigiri pieces. I asked him what was wrong, and he said that it smelled funny. Being a server myself, i always want to give the restaurant and it's workers the benefit of the doubt. I've dealt with one too many difficult customers that were just so rude. Eventually, i took a whiff of the fish, and WOW DID THAT THING SMELL. It actually smelled like ...well, FISH. Like it had been left out too long instead of in the fridge or something. Just COULD NOT eat it. Definitely disappointed. I think we paid about 70 dollars including tip? but it was not worth out money. Not thinking of going back. Maybe just to try their sweet potato mousse and kitchen dishes? but for the sushi? nope. no thank you."], ["Leslie J.", "I guess my expectations were too high, as this restaurant has been recommended as one of the new hot spots in Nashville, and not just for sushi. Well, I was a little underwhelmed. The sushi was good, without a doubt, but, it's hard to make a roll worth $18. There were also some little things...like the fact that their \"house\" champagne is J Roget?? It's $3.00/bottle at the wine store...the worst. And, they sell it for $7/glass?? Come on, now. Any decent restaurant should not have J Roget in their establishment! The hot sake also seemed bland, with a watered down flavor. The highlight of our meal was the ceviche...oddly! Lots of fresh fish and shellfish mixed with pico, and avocado slices on the side. It came with a basket of chips which were not even needed. The ceviche can stand alone! As far as atmosphere goes, the space is beautiful...large/open, clean, modern, and with an outdoor patio that will be great when it cools off a bit. Also, we had great service from the bartender, Jay. I would definitely return, but I might try it on half-priced sushi night!"], ["EdDee P.", "My boyfriend and I came here opening day. Service was great. Staff very friendly. It was not too busy (yet) prices are expensive but the portions are big. Usually we order 5or6 rolls from o sake down the street. We ordered 3 and were full. Rolls were amazing! We will defiantly come back. Drinks were amazing! However, we will be rotating shifts with o sake"], ["Sarah C.", "Last night we randomly came across this amazing place! The great atmosphere, great service, and great drinks really hit the spot for us. The sous chef came over to our table to welcome us and made us understand more about the restaurant. He was a very nice man; he is truly passionate about his work. We will be back soon! Perfect for a date night!"], ["Will P.", "Just checked this place out for the first time. Love the vibe. It's hip. It's urban. It's everything a new downtown restaurant should be. On mondays and thursdays apparently they do a few of the cheaper rolls for half price, so we definitely took advantage of that. We also indulged in the crab-asiago w/ Naan appetizer which was good. I give it 3 stars mainly because the normal prices are pretty high for a sushi place, and the service was fine but not great. I'd give it a half star bump if I could. Aw screw it I'll give it 4 for trying."], ["Suz J.", "I just started their lunch club with my Lunch Club card from Nama Sushi. They stamp it when I go for lunch and give me a $20 gift certificate on my tenth lunch visit. The Soy Joy albacore tuna roll is about eight pieces of sushi with crumchy cucumber and my preferred there. It's flavored with horseradishy wasabi and a generous application of eel sauce. Nama in the E23 is a little snazzier than the typical Nashville sushi restaurant. Table settings and service are comparable to the Belle Meade sushi place I go to although the sushi at the west sushi bar is better. Prices match this West End location, so I'll be going in the future when they have their half off / half price specials on the sushi or on the alcohol."], ["Randi T.", "always excited to try a new sushi place in town.  our usual go-to is Samurai, this place is definitely an upscale version with overloaded rolls.we were overwhelmed with the menu but our server was super patient with us.  we started with the calamari salad - DELISH.  thumbs up.  next was the crab dip - thumbs up again. not sure I would order again, but my husband definitely would...the rolls...fancy scallop roll was okay.... just not that flavor full and full of creamy sauce.  we did the sushi platter chef's choice ($25) and got to choose what nigiri and sashimi fish we wanted (great plus to that) and also what special roll we wanted - the chef will make anything.  our server told us to pick one of the expensive rolls and we can alter it any way we want.  long story short, we got the wrong roll and thank god.  it was fried (was that a fried eggplant on my sushi?) and was drowning in creamy sauce.  our server saw it was wrong and came right over and got us a new roll.  the new one was good but again, 3 sauces too many.  the sashimi was really good and tasted fresh, thumbs up for that.we would go back, but not order rolls again, sashimi and appetizer orders only."]], "Two Ten Jack Izakaya & Ramen House": [["Austin G.", "Two Ten Jack is in East Nashville and a cool part of East Nashville. I met two friends there and was instantly impressed. The seating and atmosphere is cool and the servers give you a warm towel to wash your hands the moment you sit down.We started with a few amazing appetizers like the spicy (not really spicy) edamame, the brussel sprouts (amazing!), and some fish appetizer. The ramen was the only disappointing thing about this place. It was good but the pork ramen wasn't as flavorful as places I've been to in DC or NYC.Still recommend this place, though!"], ["Thomas B.", "This place is great and unique to Nashville. With a patio and a solid beer and cocktail selection, I recommend going on a nice evening. I recommend doing several courses and enjoying the whole experience. It's not so pricey if you have friends join you. The sashimi plates are very small but all carefully seasoned and presented. We really enjoyed the pastrami hamach and the yellowtail jalapeño. The brussels sprouts are really great and large enough for several people to share. I was a little underwhelmed with my sushi roll but my friend's garlic noodles made up for it. Finally you have to go with ramen. The chicken and pork were both delicious."], ["Janine A.", "FOOD NOT SERVED TILL FIVE!! They open the place but only do drinks for an hr. beware. Noodles were good but the broth was clutch- amazing atmosphere."], ["Kristin Marie S.", "I'm not sure if it's fair to review but I'm doing it anyway. We went on Friday when ramen master Nakamura was in the house. Oh. My. God. It was one of the best meals I've had in Nashville. Hands down, top two. We were offered five courses. They were as follows:1. Edamame and Tsukemono (pickled veggies) paired with a Lovely Rita2. Yellowtail jalapeno sashimi and sushi (a play on a Philly roll) paired with a Riesling3. Kara-age with negi dip (fried Japanese chicken) paired with the Death of Meiji4. Hatsu (chicken heart) and Australian Wagyu short rib with corn on the cob and miso butter paired with a German smoked beer5. Tori Paitan (ramen) paired with sakeHonestly, almost everything was a highlight. If I HAD to pick, I would say for starters the sashimi. Now this is how sashimi is supposed to be cut and taste. Holy moly, I was in heaven. I literally died and woke up in Japan. The fried chicken was fantastic, the miso butter corn was divine and the ramen. Oh my goodness, the ramen. Sorry Otaku, I hope you went and tasted how a broth should be made. It was tasty, not too fatty, and bold. And the pork! it melted in my mouth. I am literally salivating writing this review. Someone please send me a bowl of his ramen! The drink pairings worked as well, no complaints there.As for the decor and atmosphere, the place is slick. They really thought about the concept and made it come to life. I loved the lighting, the tables, the bar, the colors. Can you tell I liked it? Loved it!Based on the first four courses, I have high hopes for the place! I am praying that Chef Nakamura left his ramen secrets for Chef Benefield and crew to replicate."], ["Corie K.", "I enjoyed Two Ten Jack. I'm not typically Ramen crazed or even a fan but must say, I was pleasantly surprised how much I enjoyed everything from drinks to apps to ramen. I had the pickled vegetables, Brussel sprouts and chicken ramen. The service was great- friendly, attentive, and had great recommendations."], ["Karri B.", "Any broth that cooks for 60 HOURS must be good.  I'm not a huge meat eater but after watching a show on Cooking Network about ramen I knew I had to try the pork ramen.  It didn't disappoint and there were so many complex flavors brought out by the length of cooking time to make the broth thick and creamy.  The noodles were thin but filling (I thought about getting the extra noodles but after my bowl was brought out I knew a made a good choice to get the regular amount), the pork was so tender it almost melted.  The soft boiled egg was perfect.  If I had to choose a last meal, this would be it!Everything else we had (cocktails, beer, sushi, seaweed salad, gyoza) were amazing as well. We made last minute reservations on line for six people and we were glad we did.  There was an hour wait on a Tuesday night at 6:30.It's worth the wait.  This place brings a whole new element to the east side.  We will be back!"], ["Kristie A.", "The ramen broth was delicious but the noodles weren't as fresh as they should be for the price. Server, Kait, was very knowledgeable and attentive. Long wait so make sure you have reservations! Overall, ambiance was good but it's just a little overpriced for the quality of the food."], ["Clay G.", "Went for the first time on Saturday night.  I must say it might be one of the best run restaurants I've ever patronized.  As someone who for 3 years had been a trainer at The Cooker which was in my opinion one of the best run restaurants in the 80's.  I was impressed by their use of technology and simply how quickly our different orders made it to the table.  It was impressive.  And the food was good to boot.  I don't think there was anything special about the Sushi.  I've definitely had better, but the brussels and the peppers on the small plates were really good.  The corn was really good and the skirt steak was REALLY GOOD.  Would definitely return."], ["Cari J.", "So I'd been hearing all the ramen buzz as of late and figured I ought to ch-ch-check it out   since my only ramen experiences involved Maruchan.We were greeted at the door by a very nice host, and there was no wait when I got there at 6:00 on a Saturday, which shocked me. We were led to a booth that was comfortable and roomy for the five of us. Our waitress was nice and relatively knowledgable. Friends ordered cocktails and beers that they were all happy with, and I got a mocktail that was deliciously minty and cheap ($4). I ordered miso soup, which was very tasty, but in light of my ramen experience, unnecessary. My friends and I got a couple of small plates to share. The crispy Brussels sprouts were VERY tasty, if you like Brussels sprouts (and I sure do!). The J.F.C. was alright, but nothing to write home about, and certainly not something I'd pay $7 for again. I ordered the corn yakitori, which was \"half of a half\" of an ear of corn, grilled to perfection, slathered in magical miso butter that I would swim in if given the opportunity, and topped with a small mountain of grated horseradish. I could've eaten about 4 more of them. SO delicious. I ordered the chicken ramen, and it was fabulous. The broth was so hearty, flavorful, and velvety! The noodles had great, slightly chewy texture and were much more substantial than the average noodle dish. I didn't eat the soft boiled egg, because I can't eat runny eggs...it stresses me out. Overall, excellent flavorful dish. I'd definitely order it again.My only issue with this place is the pricing! The portions are fine, and are in my opinion, a refreshing departure from the usual \"eat-til-you're-ashamed\" portions everywhere else. It's just that everything seems to be about $2-$4 too expensive..doesn't seem like much until you order multiple dishes (which is advised) and have a pretty expensive bill. I wouldn't order starters again, as I wasn't impressed, but the service was good, the vibe was decent, and the food tasted great, so I can concede 4 out of 5 stars. If the prices went down a tad, I'd gladly raise it to 5. :)"], ["J R.", "So disappointed that it's all gone! I got in quickly since I asked to sit at the bar. I ordered the tori paitan and a ginger drink. I also ordered the Japanese fried chicken to go. I hope that it will be good! The only think I didn't like is that you had to pay extra for chili oil or burnt garlic oil. Who eats Asian soups without these essentials?! I'd come here again."], ["Sally M.", "Hip, chill venue with delicious food. I felt like I was back in San Francisco - or in Portland, OR (somewhere I haven't yet been). As this is only my second time ever to Nashville - with the first being a visit to Vandy in high school to check it out - I had no idea what to expect. Sure, I knew about the music scene, the country influences, the BBQ, but I'd only heard mublings about the foodie/art/culture/hipster thing. It was like I was in a nice, non-pretentious hipster-landia.The same cool ambiance, rustic-chic decor, and slightly unusual (yet still authentic to its roots) food - in this case Japanese. Delicious chicken ramen that reminded me of Katanaya in SF. Cocktails that reminded me of Rye Bar in Georgetown. Spicy hot pepper appetizers with the taste, but sans the burn-your-mouth spice. With figs. I loved this place. (And I'd share more details of what I ordered, if only their online menu would load.) :p"], ["Juliet Q.", "Been here several times since the grand opening, two ten jack remains \"the best\" in Nashville for ramen! Just love this place. Stopped by with family today and ordered loads and loads of dishes and ramen, awesome as always !"], ["Triston A.", "Really good, first time at a red lantern. Just wished they had a bigger sushi selection.  But great none the less for a night out."], ["Emily T.", "We loved our first real Ramen experience. It's the kind of stuff that sticks to your ribs and sits heavy in your tummy. We also got the hush puppies - amazing. The happy hour special was a sake punch. Having never had sake before it was a great way to try it. Our waitress was knowledgable and so friendly. The atmosphere was a little dark for my preference. Things came out so fast we felt a little rushed. All in all it was awesome and we will return!"], ["Jennifer M.", "I want to start off by saying that I fall in love with Nashville more and more every time I visit. That being said, Two Ten Jack just upped the ante.We sat in the community table room and had Miyazaki films playing for the duration of our dinner. What a treat! We had two servers, one was just starting out, and they were both highly attentive, explained everything perfectly and extremely social with us. This is EXACTLY what I want in a server. We took the Izakaya route and started with the Poke and Shishito Peppers, along with a small hot sake. I have to say that the figs were a perfect touch to the peppers and the sesame chicharron added the perfect crisp to the Poke. Next we tried the Gojira Roll and it came out with a HUGE shrimp head that had the sweetest and juiciest meat, holy cow! SO. Freaking. Good. Then came the Pork Belly and Hotate yakitori. Both of them melted in our mouths but the Hotate (scallop) was probably the best scallop I've ever had. No joke. It was in this buttery sauce that just made you moan out loud without realizing it. Good thing the atmosphere wasn't silent... We ended with the Tonkotsu ramen which was too die for! There wasn't much pork belly and I was happy about that, seeing as we had just devoured the fattiest piece of seared pork belly with the yakitori.Everything was epic! I can't stop telling EVERYONE I know about this place! From the service to the food, we walked out of there pleased as punch. One of our servers even recommended a local bar that he thought we'd really like. That review will be on the No. 308 page so you should check them out as well. Seriously."], ["Micheal P.", "My experience with ramen is limited to that served by Otaku South, but I'm well versed in things that are delicious, so I hope that makes me credentialed enough to review Two Ten Jack.Now that construction is finished, the shopping area that houses Two Ten Jack is really a pleasant place to be. Parking is no longer a total disaster, so you needn't factor that into your dining decision. We only glimpsed the inside decor for a second because we chose to sit outside, but the place looked really swank. There was even a silent projection of one of Michel Ocelot's stopmotion-style silhouette animations, which means the person in charge of design has excellent taste. As an added bonus, Jeni's ice cream is just a few steps away, meaning you can cap off an excellent meal with an amazing dessert. The server started us off by saying that the restaurant was intended to be some sort of traditional japanese pub, where diners would typically eat several courses, starting with smaller ones and working their way up to a final dinner-sized something (like ramen). I heard other servers parrot this introduction to those that were seated around us, and I have to say, I found it annoying. It was as though they were saying, \"Welcome to our restaurant. If you would like an authentic experience, please order one of everything from the menu.\" It sort of left us feeling like the American assholes that just came for ramen.But we did actually order a smaller plate of sashimi, because it caught our eye. The pastrami hamachi ($10) is topped with mustard roe and rye olive oil, and it is, in a word, incredible. The fresh white fish was the perfect canvas for these bolder unexpected flavors.We then got what we came for, ramen. My husband ordered the tonkatsu ($14) and I ordered the tori paitan ($13). Both soups had incredible depth of flavor. The chicken meatballs in my soup were deliciously bright (were there notes of citrus and ginger?). The broth in my husband's tonkatsu was rich, but not too heavy. The noodles were perfectly chewy. It was delicious.Still despite being thoroughly impressed with the flavors served up at Two Ten Jack, we both felt that the price point was just a tad too high. That kept this rating from reaching that fifth star."], ["Victoria A.", "Meh. I hate to be that yelper who posts a less than stellar review on a high rated place but I wouldn't be a good yelper if I wasn't honest. First impression was it looked very nice. We sat in the outdoor patio because we had our pup with us (they're dog friendly) and we were greeted by our waitress right away with water and an explanation of the menu. She was very helpful with recommendations and translating anything on the menu. Their menu is small and not super descriptive of the items. What I mean is very vague. I ordered the sunomono which typically is octopus or conch served with some cucumber and rice vinegar. What actually came out was a small plate with shredded lettuce and just a few small pieces of octopus and scallop. $9 for that. Next I ordered a miso soup which was good but too salty and that's a lot coming from me because I'm the kind of person who likes salty stuff and it was $5 for this little cup of it. Lastly I ordered the volcano roll just to give it one more shot. Ugh. $15 for 4 pieces of ordinary \"sushi\" that lacked so much flavor. My fiancé ordered the pork ramen and even he said it was way too salty but he ate it anyway because he was hungry. We really were not impressed and came out to be quite disappointed despite the great reviews. The two stars are just for the staff because they provided good service but the quality of food and the price did not match and was a super turn off for us."], ["Jennie L.", "would be 4.5 if possible.great vibe, great drinks (cocktails on tap are always a winner) and great music (yep, we're still down with O.P.P.). we went with the small plates/sushi/skewer options and the portions aren't large so you can just keep ordering as your heart desires. standouts for us: the poke (tuna tartar deliciousness), the skirt steak and short rib skewers were insane. I also really liked the avocado (obsessed). Don't think you could go wrong with any of the choices.pleasantly surprised at how much we enjoyed the meal - will definitely be back!"], ["Sam L.", "A good mixture of traditional Japanese food. The ramen has a great broth and pork is well cooked. The noodles were a little undercooked. The yakatori with beef, eggplant, and scallop all were high quality and cooked perfectly. The miso seasoning on the eggplant is spectacular."], ["jim h.", "Good drinks and interesting food! Also great patio for when the weather's nice. Doesn't really feel like Nashville to me, which is nice sometimes. :)"]], "Jimbo's Sushi & Korean Food": [], "Sushime": [], "Ken's Sushi Japanese Restaurant": [], "Sushi Train": [["Daniel M.", "It's got a cool little gimmick going with the train.  The sushi is good for the price. A few tips. .... Don't judge the place based on the lunch selection.  They do a lunch special but the assortment of sushi is limited compared to dinner. It's good though for 8.99 all you can eat. The dinner sushi is priced higher,  but there is a better assortment on the train. The best sushi is ordered from the menu.  If you want large portions,  this is where you need to order from. Off course,  It's the most expensive. Staff is friendly and efficient.  I come here all the time and will continue to do so."], ["Simon K.", "$8.99 lunch buffet...Anything else I have to say is not going to communicate the point any better than a 3-star $8.99 lunch buffet.But if you want more, here it is:Food: Better than grocery store sushi. * Btw, I don't mind grocery store sushi (it serves a purpose in this world.)Atmosphere: The interior is way too nice for a restaurant called \"Sushi Train.\"* Bright burnt orange pleather seats and dimmed neon green lighting.  Weird, but it didn't ruin my meal.Service:  If you had bad service, it's b/c you're an idiot and don't know how to serve yourself.* The \"Train\" practically eliminates almost every aspect of some one serving you.Price: C'mon, it's $8.99* If you're putting the words \"sushi\" and \"buffet\" together in the same sentence, then you're not allowed to be overly critical of where you eat.If you're hungry, then you should eat here.  You will walk out feeling happy.If you're a restaurant review douchebag and end up eating here, then you walk out of here still being a douchebag."], ["Casey S.", "I like this place. I've eaten at conveyor belt sushi places before. This place has a cool atmosphere, the inside feels kind of like a club. It's dark but they have colorful lights.We went for lunch, and they have an all-you-can-eat option, but you only get certain colored plates. This wasn't an issue, as there were a TON of rolls to choose from. They even had desserts and salads/non-sushi items. This is pretty rare for a sushi-train type place to have other items along with the AYCE option, so good on Sushi Train!It's so fun to \"catch\" your dishes as they come by, and the staff were constantly cranking out rolls that were running out. We ate enough to feel like we got our money's worth. I believe the AYCE lunch was about $8.I felt like the quality of the overall rolls was reflected in the price, but I will definitely be coming back for more. This would be a GREAT place to bring a group of friends. The bar is shaped a bit like an S so it's  not the most convenient for talking to friends, but it would still be a blast."], ["Ann C.", "The best conveyor belt sushi I've had. I've been to numerous places in Washington for conveyor belt sushi and this was the first outside of there. Best tasting, and misty hygienic conveyor belt sushi! And u love that the refrigerator extends through the whole restaurant to keep the fish fresh."], ["Charnelle Y.", "I can't complain the lunch special is well worth the stop!!! As you seen the photos the train was well stocked, and not cheap items either! Very mixed plates, a lot of different flavors we had the following items between my husband and I...AAC Roll - Avocado Asparagus CucumberSnow Crab RollSpicy Tuna RollKani SaladTuna Cucumber SaladEdamameShrimp tempura rollCalifornia RollThere were few others but I couldn't keep track, the service was okay nothing to write home about! We were the first here for the day but it soon became a packed house so make sure to plan ahead! Did not get any dessert but the Oreo mousse cake looked amazing!"], ["Allison L.", "Convenient and fast sushi...Not great service and have definitely gotten still frozen pieces of fish.The nice thing is if you aren't too picky you never have to wait as there are never any lines."], ["Billy H.", "I woke up to a Groupon email and this place was featured as 19 dollars got you 30 bucks. I clicked over and read through the reviews on Yelp. The feedback was mixed. I decided to not purchase the Groupon because were going to be dining at lunch time and I didn't think we'd spend the 30 bucks.We entered the restaurant at 11:45am on Sunday. It wasn't too busy at that point, but it did start to fill up around 12:15pm. Fill up, not overly crowed though. They have a full sushi, Japanese, and Chinese menu you can order from, but I feel if your going to a place called Sushi Train, you ride the train. The train is a long, covered and refrigerated train that takes 12 minutes and 49 seconds to make a lap. Yes, we timed it. The items on the train are on color coded plates, each color representing a different price. The lunch (11:am-2:30pm) prices are $.99, $1.25, $1.75, $2.25, $2.75 and $3.25. For dinner (4pm-Close) prices are $1.25, $2.00, $2.50, $3.00, $3.50, and $4.00.Our server was prompt & asked our drink order & we told him we were going to have the $8.99 lunch special. It really is special. For $8.99 you'll have your pick of ANY plate on the train, except the pricey red plates. It's ALL YOU CAN EAT. The train has different rolls, from cooked to raw. It also has desserts that coast around on it. The sushi. The sushi is good. It's comparable to what you'd get at a good sushi restaurant. It isn't AMAZING, but for the price you cannot beat it. From the rolls I had, only two I didn't care for. One was because I grabbed a \"Philadelphia roll\" that was cooked. I didn't see the cooked part & I hate smoked salmon. It tastes like cat food (I don't know what cat food tastes like). The second one I had was a tuna roll that had been on the train too long, the rice on the outside was dryish. Overall it's a neat little dining experience & a great value for the $8.99 lunch special. I like the freshness of most of the rolls and also the ability to try different rolls & not get stuck with a bunch of pieces. Will I be back again? If I get a sushi craving & I'm in the area, you bet."], ["Beth G.", "Pretty decent for conveyor belt sushi.Service is very good at dinner not sure abt lunch never been. Habachi good too without being crazy expensive. Pretty dang good forLandlocked sushi with entertainer in the train and nice service."], ["Michelle P.", "This is definitely a hit or miss place. I really wanted to love this place...but I couldn't in the end. Yes conveyor sushi is a novel experience but the inconsistent quality of fish (read great salmon horrible sea urchin) and service leaves me ambivalent. The groupon deal did ease the blow a bit. The hostess sat us while taking a phone call (as in she picked up the phone as she was showing us to our seats and then scuttled off). The server was very thorough and genuine with his recommendations and catering to our needs even knowing we were primarily here for the a la carte sushi. They have beautiful presentation for their ordered rolls like the pacific roll, but personally that flavor mix was not to my taste (still beautiful though!). So while I did not find myself in love with the place it is worth say a lunch or if you really really want to catch your sushi with good company it's worth some loving on. Just please don't get the sea urchin. It broke my heart (just a little bit)."], ["Zeb M.", "Sushi Train is basically what you'd expect from its name. It's decent sushi, but not a place I would go to unless I'm pressed for time or want a cheap dinner - which can easily be cheap as long as you're careful about what plates you're grabbing from the conveyor belt. The restaurant is very modern and clean, and it's never busy when I'm there, so it's not a bad place. Just, you know. Okay."], ["Heather R.", "Remember that game on Pokémon Stadium in which you had to eat sushi off the conveyor belt? The one where I always thought, \"Wouldn't it be the coolest if this was an actual thing?\"Turns out, that is an actual thing.Sushi Train is definitely an experience that everyone should try once. Sushi goes by your table on a conveyor belt, and it is your task to be attentive and quick enough to grab the good ones as they go by. You are charged based on the number of plates you have at the end of the meal (each color is worth a different amount, going up to $4  for the most expensive--prices are eminently reasonable). Of course, if you are not really a sushi eater, you can always skip the super-fun part of this whole restaurant experience and opt to try hibachi or Chinese food off the more traditional menu instead. Now, while there is something delightful about grabbing sushi off a conveyor belt, the delight tends to fade once the food is motionless in front of you, largely because the sushi is only okay. It has a nice personality, but you wouldn't want to go out with it again."], ["Victoria L.", "Sushi delivered fresh to your table via... conveyor belt? Yes it's exactly what it sounds like, my friends. I guess Sushi Conveyor Belt isn't quite as catchy. I love sushi and the concept is really fun. I usually feel like I'm going to explode when I eat sushi simply because I can't decide on one or two rolls and end up over eating due to my severe sushi FOMO. (Fear Of Missing Out). Since the whole concept of Sushi Train revolves around getting tiny plates of sushi samples I don't have that problem here. Anything I've ever ordered off the menu was fresh. However, I know you're really here for the \"train\". If you're going to use the train instead of the menu, you probably want to keep your table to 4-6 people. Beyond that, the people at the far end can't see anything as it whizzes by. This takes away from the experience and could cost you a few friendships if you're not careful. Sometimes the sushi on the train isn't very fresh and they seem to have trouble keeping certain rolls stocked. If you see something you like you better grab it fast because dinner will be over before it comes back around. The restaurant is clean and I've always experienced good service. That being said, the sushi isn't outstanding but compared to what usually passes for sushi in Nashville, I definitely recommend stopping by. Be careful though, those little plates add up quickly!"], ["Alexandra F.", "I don't what it is about sushi train, but it's so good. I've never dined in, but I imagine it's and even better experience. I've gotten takeout more times than I can count and every time my order was ready quickly and correct. Their soup is awesome. Crab rangoons are killer and you get 8 in just one order which is ALOT. Everyone is very friendly. They have great lunch specials where you can get two or three rolls and soup or salad and it's very reasonably priced. Every time I eat here I want more. Can't say enough great things about this place.Order the crunchy shrimp roll! It's my favorite of the \"not super expensive\" rolls."], ["Ellen F.", "Chooo choo. I'm a very efficient conductor at the train. Pull them, and eat them. Don't over think it. Here's how it works, the plates are color coded. Unfortunately, they add up QUICK, so the R x R crossing can be dangerous if you don't look both ways.  There's also an average of three pieces per plate, so if you can, board the train with a group divisible by three. I would recommend the place, but we only go here when we can buy our train tickets on sale (groupon). Otherwise it's just too pricey. Please excuse all of the train lingo, I needed to dork out for a minute."], ["Molly N.", "Lunch special on sushi all you can eat for $8.99.   It was a decent deal and the sushi is average.   Unique dining room experience bringing some Asian flair to Nashville."], ["Clayton M.", "They really should change their name to Just Train. 30 minutes in I've yet to have more than desserts and edamame go past. The server is very inattentive, 5 occupied tables with empty drinks."], ["Libby B.", "I am always hunting for new and exciting sushi places. This one was exciting, but not really for the food so much as the atmosphere.When you walk in, you can't tell if they were going for a nightclub or weird 70's diner feel. The neon and LED lights all over suggest nightclub, but the enormous windows have a screen or something over them, it always looks dreary outside no matter what the weather.The main attraction here isn't the sushi so much as how it gets to you. A waiter brings your drinks, and then, if you're ordering from the lunch menu as I have, you pay $8.99 for all the plates you want that aren't red (the red ones are extra).  A refrigerated conveyor belt snakes throughout the restaurant, with placards before each dish revealing what they are. When you spot a dish you like, simply lift up one of the tube doors and grab it! They don't seem to restock too often, so you might be out of luck if the dish you want doesn't appear on the first go round...or the second.The sushi itself is all right, but it didn't stand out to me in any way. The dishes seemed heavy on the tempura and spicy mayo, and the healthier options seemed smaller and less exciting on the plate. My verdict: Sushi Train will satisfy a sushi craving (on the cheap), and give you some novelty along the way. Lunch with coworkers, sure - but try something more upscale if you're looking for say, a date spot."], ["Mike S.", "This place is worth checking out with a groupon, esp for dinner. Their all you can eat for lunch is pretty decent as well (apparently just $9!) Some of their entrees are kind of weird, like adding cream cheese to sushi, but I suppose that as a Southern thing ;) For my first time I would just check out the train and not order anything from the menu. The biggest thing about raw fish is that it NEEDS to be fresh, and I be found it to be reasonably so.My only complaint is that there is too many tuna dishes and not enough of the others, but that's a personal thing."], ["Krystal S.", "This place is great. My son loves it as well! We took friends there recently and were a little bummed that they don't stock the train through out lunch including the last 1-2 hours before closing until dinner. There were rolls we wanted to get, but couldn't since  there was only an hour and half left for lunch (they said they stop adding rolls). I was told I could pay extra for the roll, but I took it as poor service."], ["Scott P.", "Went for the all you can eat lunch special. The train stayed empty almost the entire time. I mentioned this to my waiter who seemed not to be concerned. On my way out he let me know the tip was not included on the bill."], ["Hall W.", "I was super excited that I finally found a Sushi conveyer in town... and zoomed to it right away... So the to start on a positive note - YES they do have really attentive service...- YES there is a wide selection of sushi- Holly crap... this is the best priced Sushi I have ever seen...Now on a down side...- They don't do a really good job of refilling the train, because only half the options on the train were even available...- The sushi is okay - a little bit better than packaged sushi- this is one of the more schizo interior decorating gigs I have ever seen..."], ["Caroline H.", "Eh. I think Sushi Train's problem is that the train is too long and the menu is too big! The sushi isn't BAD...it's just not that high quality. I've been here twice and did the train the first time and the hot dinner menu the second. My train dinner was just OK, but was pretty fun to pull stuff off the train. It ended up being kinda expensive for mediocre sushi, but I had a nice time. I opted to try the hot dinner meal the next time and asked our waitress for details regarding a specific tofu menu item (Ma Po) and all she could tell me was that it was a tofu dish with spicy sauce. No other details. So I went for it (was this a mistake? maybe). And, just as she told me, out came a plate with tofu and a red, gelatinous spicy sauce. It was like an entire grocery store block of medium-firm tofu chopped up on a plate with sauce. No vegetables. No frills. Just tofu. With sauce. The tofu was just heated, not pan fried or anything so it was really soft which some people may prefer, but I certainly do not. It was definitely edible. My boyfriend gave me his mushrooms from his Yang's spicy chicken to give me some texture to my mush pile. It just really wasn't my favorite, but it WAS cheap and a huge portion (comes with rice, salad and soup too!), so there's that. Additionally, I never got a water refill. The waitresses were nice and all, but really couldn't give us ANYTHING when it came to our menu questions.  The restaurant is huge, which I think might be a detriment. I wish that the train were just a small feature of a great Japanese restaurant, but sadly, that isn't the (refrigerated, sushi-filled) case. Sorry, sushi train, I probably won't be back."], ["Queen B.", "All the reviews that said how mediocre this food is --- was right on.Had a daily coupon for this place and thought I'd try it.Fish seemed stale - old - not moist - but dry, like it had been sitting around for quite a while.Cute idea, great gimmick, but they really need to improve if they want to stay in business.  I would not return."], ["Christian M.", "I absolutely, L0VE L0VE L0VE this place! I've been going here since it first opened in the year of 2013 and Ive been accompanied by the same exact waitress since. If you ever go, ask for Kipley! I promise you she is the best! If served by her, you'll never leave disappointed!  She knows my usual, the  Salmon roll with a sweet tea and yum yum for my dipping sauce. I usually attend the Happy Hour special where you can choose from 2 to 3 different types of sushi rolls. Added is a salad or soup as well. You can never go wrong with this place!"], ["David O.", "The Sushi Train does not go \"toot toot.\"Overall I'd say its pretty good, but I think the pricing making me feel awkward about really digging in.  The Better Half was right in that we usually pay more for Sushi at other places, but it still felt expensive and we were hungry later. Perhaps my miserly ways were the problem, I don't know.However the sushi WAS good (Especially the Nashville Roll and the Samurai Roll) so I have no complaint taste wise.Now that I have been though, I can't say I'd rush back."], ["Danny N.", "Cool concept as the closest conveyer belt sushi to downtown Nashville, but the product lacks anything setting itself beyond grocery store quality.  I didn't choose any rolls that tasted bad, but also nothing blew me away.  I don't see it staying in business though I don't wish such.  I probably wouldn't return unless a group of friends was already going."], ["Nina G.", "This place is awesome!! This is 5 star quality for cheap sushi in a landlocked state - no easy feat people!  It's a nice break from the standard boring ol' restaurants and the lunch deal is stellar - $6.99 for 2 rolls and a miso soup or salad.  Good for: solo lunch during work hours, lunch with co-workers, lunch with friends."], ["Susannah B.", "I can't really write a bad review because I know everything is \"you get what you pay for.\" But regardless, the sushi seemed a bit old. I was actually afraid to try the crab sushi because it actually looked terrifying. But overall I can't really complain. Cheap meal, mediocre sushi."], ["Cody H.", "So the sushi isn't top notch here, but it is still pretty good.  The environment is really cool though.  There's a large selection of sushi, and it's in small portions so you can have a good assortment without going broke.  Sit near the chef station so you get first pick!"], ["Cory B.", "This place is cool! My wife and I have been looking for a sushi restaurant with the conveyer belt system for awhile now, as it creates a kind of novelty dining experience. We've only lived in Nashville a few months now, so when my wife saw their ad in the Scene, we jumped at the chance to eat mobile sushi. The overall atmosphere is semi intimate and somewhat communal with small tables and bright colors.The conveyer belt winds through most of the restaurant offering small plates of sushi at interval pricing. Pricing per plate also varies by lunch or dinner times. We happened to go on my wife's birthday during lunch. When we got there, there were only about 5 other people which was good, because it meant that we wouldn't have to wait long for sushi or worry about missing out by being at the end of the train. During lunch, prices range from $0.99 to $3.25. And if you go on your birthday you get $15 off if you spend $50 or more. It's quite a deal during lunch, because we had a hard time reaching $50 to begin with. My favorite thing about the train is that they offer more than just sushi on the train. They have appetizers like edamame and Asian style salads, and desserts like cheesecake and brownies. Sushi Train also offers food other than sushi. They have a menu with noodle dishes and other items. They also have tables away from the conveyer belt for larger parties. I highly recommend checking it out."], ["Corey W.", "So I've been to this place four times now with mixed results but overall I would give them good marks.First the service. The servers have always been very accommodating. You can tell they are new at it but always very accommodating and friendly. A few of them need to work on their English, but their friendliness always made up for this. All but the first time I went it has had fairly good foot traffic and the first time I went was a week after it opened. Never had a bad wait except on Sunday when they had an all you can eat Sushi train.Now the food. So I have had both off the train and off the menu. All the off the menu items I thoroughly enjoyed. It's mostly Japanese with a few other Asian dishes. If you find the train off putting (your loss) you can order rolls off the menu. Definitely try their tempura banana's and ice cream for desert. Now for the train. The novelty alone makes the trip worth it. Me not being terribly patient love the fact I can sit down and be eating within minutes. I timed it, it does take about 15min for the conveyor to make one full pass but I usually find something I like after a minute or 2. The other thing I love is I can get just 3-4 pieces from 3 or 4 different rolls for the same price I could get one roll of all the same. One issue you will have though, if you come on at a time they are packed and your at the end of the train it will be hard to get something you want. I've gone on a Friday night though and was sat at about the middle and had no troubles. Go on a Sunday and get seated at the end and you'll feel like the guy who went stag to the prom. Sitting by the punch bowl hungrily eying all the rejects no one else wanted.Some are scared off by the thought of sushi sitting around, but it travels in a refrigerated tube, and last time I checked they are touting a score by the local health department of a 98. If you don't like the thought of it being in a perfectly fine REFRIGERATED tube for 30 min or so before you eat it, order a roll off the menu."], ["Abby H.", "This was the first time I had ever been to a conveyor belt sushi restaurant and loved it! I had bought a Groupon and thought I would give it a try. It was fun and the sushi was pretty good! You didn't have to worry about ordering a whole roll and then not liking it since the plate make it more manageable- however I enjoyed most of what I tried. I will definitely be back!"], ["Katie I.", "I give them 6 months top.Tried about 5 different kinds of sushi on the sushi \"train.\" It tasted like krogers sushi. Everything tastes premade and the salmon was far from sushi grade quality. Ordered my kids chicken yakitori and rice. The yakitori was huge chunks of chicken with red and green peppers on a skewer. It was more like kabobs than traditionally thin sliced teriyaki tasting yakitori. The chicken was terribly seasoned. It had hues of cinnamon and cumin, I believe. Kids wouldn't touch it and my kids love all foods, especially any type of chicken. We decided to get out while we could and ended up shelling out $30 for hardly anything- we were starving. Then as we are paying, my son projectile vomits his entire dinner everywhere. It was a terrible experience. Will stick to sonabana for good sushi."], ["Lucy O.", "When we got there not much customer was there, but we were seated way behind the corner.  Almost end of the belt... All the same sushi we could find and just keep waiting and waiting. And not many variety of sushi was on the belt. It is little trouble some to open and close rid every time when you want to take sushi. Little over priced. Recommend you eat burger before you go there."], ["Nickie G.", "Come on ride the train!  Choo choo ride it WOO WOO!So my brother and I sometimes have sushi dates and we decided to go try the train now located near Target on White Bridge Road.  It is in the old Chinese place, but even farther back in the day it used to be a Quincy's.  Yeah.  Old skooool.We had to wait for a seat near the train, but only for a few minutes.  The train is actually a glassed in, refrigerated, conveyor belt that snakes throughout the seats in the restaurant.  Just the idea of it is pretty fun.  The food is on different colored plates and the charges for each color are posted.  There are signs in the conveyor belt beside each type of sushi so you know what it is.  All you have to do is reach in and grab it.  You can also order off the menu so we got some pot stickers from there and started grabbing sushi.The pot stickers were pretty good and the sauce they came with had nice flavor.  As for the sushi...well...it is a step above Kroger sushi but it isn't going to blow your mind.  It is very average at best.  I had the basic salmon sushi, yellowtail sushi, and tuna sushi and they weren't bad but not awesome either.  The surf and turf roll was good.  Some of the rolls had fried components and it kind of lost the flavor of that since it is cold in the conveyor belt.  Some of the rolls were good, some were weird, but it was fun to just grab whatever you want at that very moment.  I suspect a lot of this is much better when ordered straight off the menu.  Plus I could have had sashimi and avoided a lot of that rice that just fills you up.  Oh, note that they do have wine/beer.  And that they bring a fortune cookie at the end of dinner (isn't that Chinese and sushi is Japanese?  No matter, I liked it.) Our waitress was sweet and quick to get our check and fill up drinks.  The manager of the joint was a sassy fun Asian girl that came over to chat with us, semi-flirt with my brother, and even offered us a beverage.  As I was already on glass 2 of chardonnay I passed.  But she was fun!Is the sushi going to blow your mind?  Not likely.  But don't overlook the novelty and FUN of the sushi train.  It's nifty."], ["Michelle H.", "Here's the deal. Sushi Train is a cool thing to experience once. It's the only sushi place in Nashville like it (that I'm aware of) and if you're into trying new things, you'll go and be all \"WOW! SUSHI ON A CONVEYOR BELT!\"Then you'll taste it and be all \"Ohhhhh . . . right . . . sushi on a conveyor belt.\".The setup-brightly colored plates roll by with three or four pieces of sushi. Each plate is labeled with the type of roll and what's in it. Each color equals a different price amount, also clearly labeled. You reach in and grab what you want. The good thing about this is you're likely to try things you wouldn't normally try. Jalapeno, apple, steak roll for four bucks? Why not! The bad side of this is it's sushi on a conveyor belt.I'll confess I never ordered anything off of the menu. Friends of mine did and said it was very good. (The sesame tofu dish.) It takes forever for the menu food to come, which is brilliant on their part, because guess what you'll end up doing while you wait? That' s right. Eating sushi off of the conveyor belt.When the novelty wears off, check out Samurai. ;)"], ["Kaleena 'Kala' H.", "My fiance and I decided to try out this place after hearing about it from a friend of ours. We had heard about the restaurant while it was under construction, so we were excited to find out that it just opened. The atmosphere was very nice and I loved the look of the restaurant...it had its own modern uniqueness to it. The staff was very friendly and also took the time to explain the concept of conveyor belt sushi to us. I loved the variety of sushi that was offered on the conveyor belt and tried different ones, including the California Roll, the Crunchy Shrimp Roll, and the Shrimp Avocado roll. All were very tasty and fresh! One of the things I loved about the conveyor belt was that they also included a sign that showed the name of the roll and the ingredients in it. Once we were full, our waitress added up our total by the number of color-coded  plates we had (prices ranged from 99 cents to $4.00), which were quite a bit since we were very hungry, lol. They also offer traditional Japanese and Chinese food on a separate menu, which was a plus.I haven't stopped thinking about their sushi all day since we left the restaurant because it was very delicious...I hope to go back soon to try more of their food!"], ["Jennifer P.", "Sushi Train takes your average sushi experience and puts it on wheels.When I first walked in, I didn't expect the whole restaurant to be one big conveyor belt. That was pretty neat. Like the serving style, the atmosphere was very modern too. Lots of natural textures and bright colors. Sure, the sushi isn't the best Nashville has to offer but I thought all around it was alright. Some of it was definitely Publix quality, but you'll have that. The best roll I had was some Crazy Girl roll that had eel. It definitely didn't make me sick AT ALL so don't believe that malarkey. haha.All in all, this idea of this place is pretty fun and although the sushi didn't blow me away I had a really good time experiencing it."], ["Christine R.", "Horrible experience for the whole family, especially for my son.  He thought train meant \"train\", yet it was a conveyor belt of ugliness.  There's no comparison to Genki Sushi in Hawaii, where a bullet train speeds up your order in style with touch screen ordering, extremely high-tech.  This place is so lame, they outta be ashamed of how they're fooling customers...false advertising.  All the items looked dry going 'round & 'round, tasted stale.  I can only imagine the plastic screens cover some of the unfreshness, as most sushi places are served open air.  Our waiter couldn't juggle more than two tables, and forgot my son's drink.  I gave them benefit of the doubt and ordered some items off their menu and Chinese food, which I should have known any place that does Chinese & Japanese is not authentic.  I was right, everything tasted nasty, my son disliked their kung pao chicken...it didn't even taste like chicken.  My husband refused to eat, and he's Caucasian, a country cowboy who has been spoiled in SF to know the true meaning of authentic Asian food.  Yuck, yuck, yuck!!!"], ["Caleb H.", "The lunch menu is a good place to start. I got 3 good size rolls for $9. You have a decent selection of some of the basic rolls and can supplement from the train for some of the more exotic rolls based on your tastes.  Everything tasted fresh.  Would definitely come back."], ["Jessica M.", "I really enjoyed this place. The sushi was great & I loved being able to try different kinds since the portions on the \"train\" are smaller. Prices are reasonable as well & it's a nice atmosphere. I'll definitely be back."], ["Edna P.", "My daughter and I had a fantastic experience there. The food was very fresh and we couldn't stop eating. I am looking forward to taking the rest of my family there when we go visit our daughter that just started her college at VU. It was entertaining to see the food go by you and reasonable pricing. The service was nice. We were never in a sushi restaurant that the food rides by you and you get to pick and choose. Like I said very entertaining and different. We are from the west coast and wish something like this was close to us. I recommend this place highly."], ["Jessi K.", "I actually signed up for a yelp account just to write this review, that's how bad it was. Being a sucker for both sushi and all things gimmicky, I had been wanting to check this place out for awhile. Finally went a couple of night ago for dinner before a night out. I can be a bit of a picky eater when it comes to certain ingredients, so I opted to order off of the menu rather than get my food off of the train. I should have known what I was in for when my miso soup came. It tasted like somebody had dumped a whole shaker of salt into it, and had only a single piece of tofu that might have been the tiniest I've ever seen.My friend ordered the tempura appetizer, and the shrimp was not tempura battered, but breaded with panko. Strangely, the veggies that came with it actually were battered, so it's probably a good indicator that the shrimp came out of a box. My boyfriend ordered some Chinese dish of chicken and broccoli, but couldn't eat it as the chicken was very undercooked. I got the Dream Roll without cucumber, and had to force myself to finish it only because I was starving and didn't have time to get food elsewhere afterwards. I kept taking out components to figure out what was making it taste so awful, but I never could pinpoint the culprit. It was all bad. I had intended on getting desert off of the train, I assumed the Oreo mouse pie was probably made elsewhere and therefore might be ok (which it was) but the waitress was really pushy about asking which one I wanted and insisted on finding it along the conveyer belt for me, rather than letting me get it myself, thus taking away even the gimmicky fun of the experience. Also, around halfway through our meal, we all noticed little bits of something floating in our water. Overall, the only good thing was the unopened bottle of nigori we ordered, but even that was overpriced. Save yourself the disappointment and go across the parking lot to the always-on-point sonobana! Or literally anywhere else."], ["Alan W.", "I love the concept of Sushi Train, sit down and let all the wonderful different varieties of sushi come to you!  The all you can eat lunch buffet is incredible, even if it doesn't include some of the best rolls they make.  Anytime I'm looking to get my Sushi fix during lunch you can most likely find me at Sushi Train with a stack of plates off to the side and a big smile on my face!"], ["Amanda Y.", "Would definitely recommend giving this place a try. It is an enjoyable experience watching the \"train\" and seeing what comes next. Some of the sushi is a little basic, but they have good unique rolls.  Wasn't impressed with the Crab Rangoon, but it is a sushi place. Give this place a shot for your next sushi craving!"], ["Ruiqiu K.", "2013/071I'm going to buck the trend to say that I actually liked it here.Of course, my friend and I had the luxury of:a.) Time. We arrived at 4:37, a few minutes after they started their dinner service.b.) Location. We were seated near the front of the conveyer belt.c.) Attentive service. Coming in early, we didn't have to compete with other diners for the waitress' attention. She filled our waters several times.We're both from the west coast, so the novelty of \"kaiten zushi\" / conveyer belt sushi wasn't what we came here for (although I did find the conveyer belt longer than I expected it to be).  We both have husbands who don't like sushi so we decided we could go together.Although we got there early, the chefs were still rushing to get the sushi prepared. I'd say it was still a good 10-15 minutes until the conveyer belt started moving. We were in no hurry.Place is new, so it was clean. I didn't care much for the lighting -- it was too low / yellow. My vision isn't the greatest. so low lighting made the large font announcing the food slightly harder to read than it should.We both ordered miso soup from the menu, but we intended to get whatever interested us from the belt. Because they had just started dinner service, the same dishes came around about twice. By the time we left, there were definitely a lot more variety. Unfortunately for my friend, the one dish she wanted (her go-to dish) came after we had settled the bill. We were surprised that the belt started off with a lot of desserts. Maybe they were intended to be there a while. There were a lot of sushi with random fruit on top or cream cheese. And there was the traditional fare, both cold and hot. Because we were there early, I could have confidently tried the hot food; any later and I would have stuck with the cold.The belt was slow enough that you shouldn't miss what you wanted, but fast enough that the food cycled through in time for you to get what you want. I'd say the sushi was good. I still won't question where they source the fish. I've been dying for sushi that I didn't care. Overall, because we were able to get (mostly) what we wanted and got out within 45 minutes, it was an enjoyable experience. Perhaps this review would be reduced by a star had we come in after 5. By the time we left, the place was already filling up quickly."], ["Charles H.", "Okay, this sushi is probably not \"4 star\" worthy but the experience and value deserve top marks.The concept (which I believe is common in Japan) is different than any other Nashville sushi joint. The sushi revolves around the restaurant and diners are able to select which dishes they would like. Again, the sushi is mediocre but the value, concept and excellent service get top marks in my book!"], ["Alice H.", "I agree with some of the other posters--the food is just fine, but you know what? It's a gimmicky kind of place and I had fun. After reading several of the reviews, I was disappointed to be seated near the very end of the train, but perhaps we were there when it was slow enough that it didn't seem to matter. It's not amazing food, but I'll be back for sure. I do wish there would have been some more low-end cost items, but even still, it was good and fun!"], ["Ashley V.", "This is a fun concept, & it gives you the freedom to try a lot of different rolls. Each plate has 3-4 pieces, so you can try lots without getting stuffed. Plus, it's fun to watch all the options come by on the conveyor belt. The one downside: for anything you have to order, the service is slow."], ["Allison B.", "The food on the train is cold, so it's the quality of grocery-bought sushi. & when I went, the food I ordered off of the menu took forever to get, and it was nothing special at all. My advice? Go across the parking lot to Sonobona. They're AMAZING!!!"], ["Monica P.", "Sushi was good, but I've had better. They do have a variety so that's a plus. I just don't like where the conveyer belt is placed. You would have to ask to sit in the center to be close to it & so you can grab what you want."], ["Jason S.", "One of the saddest sushi experiences in Nashville or perhaps anywhere.Turned into a novelty because of the \"train\" experience.You too can simulate the same experience in your home, just get some day or two old sushi from Kroger or Publix and push it around on your counter, add some train sounds.Or, if you are a jackass with little to no taste, claim you love it, as you watch the dollops of excrement and rice shuttle past you.(Make sure you hyrdrate thoroughly, because when the violent gastric reprisal starts, you're going to want to be ready)AVOID.(previous review much more funny but deleted due to offensive content)"], ["Tracy F.", "Ew.I came to Sushi Train with my coworkers in its first couple of weeks of business.  The lunchtime crowd was sad, as we were seated near the one other table of people in the whole restaurant.  After watching the train for awhile, we decided we weren't comfortable ordering many of the options available--most of the rolls looked as though they'd been on the train since the beginning of time, which does not fare well when it comes to \"fresh\" fish.  We were too scared that we'd get food poisoning to enjoy any of the sushi options.  All of us decided on the hibatchi, 2 of us going with the tofu and the other going with the chicken.  All of us were extremely disappointed with the cold food, the small portions, and the lack of flavor.  We were also disappointed by our server, who seemed upset with us because we decided NOT to just pull food from the train, but actually order something she'd have to bring us.Before our food had even arrived, we'd already decided we would never come back to Sushi Train again.  If you're in the mood for sushi, choose Sonobana (practically next door), instead."], ["Matt S.", "I am not afraid to admit that I enjoy a good gimmick with my meal, so here is your third star, Sushi Train.  If the spectacle of conveyor belt sushi is alluring to you, as well, and you find yourself here, my advice would be to find a seat in the first third of the line, preferably somewhere that gives you ample time to make your decisions as the plates approach, but also a wide selection.  Take what you like and enjoy the disappointment of those further down the line when their favorite dishes are already snatched up.The sushi tastes fine, except for the Surf and Turf roll, which I thought was above average yummy, with a good marriage of beef, apple, jalapeno, and seafood.  The steak was especially nice, with a light torching on the outside and a rareness on the inside that made it go along nicely with the texture of the sushi roll.Alas, my sushi math--which consists of adding red plate plus blue plate plus yellow, etc., then subtracting the total from the amount you intended to spend on dinner, then calculating the velocity of the approaching train car of tamago and factoring that against the statistical probability and length of time until you will see it again in the next sushi cycle--is not especially good, so I ended up spending more than I typically would on sushi that was not as tasty as I would typically expect it to be."], ["Misty M.", "Darn good sushi!The atmosphere is super cool and you get such a wide variety of rolls both raw and cooked. It was awesome trying different rolls. The signs are super informative too telling you what's on each roll. Super yum!"], ["Jacob T.", "This place really is the best bang for your buck Sushi restaurant in Town. Being well versed in Sushi, I truly respect the food at this place. They have tastiest, best size servings in Town as well as a full Asian menu. Check it out during lunch time! Very affordable off-the-train Sushi of all kinds as well as the $9.00 3-roll lunch special which I personally always get and I choose the Salad as my side. Their House Salad Dressing is so good."], ["Rachel M.", "Ok, so I noticed that whatever this used to be (it escapes me...was it Chinese?) had suddenly turned into something called Sushi Train when I was running over to Target on my lunch break one day. I was like \"and so close to Sonobana?\" The only reason I even noticed it is because the building that housed Calhoun's is gone and you can see in that direction now. I remember thinking \"Well, I'll look that up on Yelp later and see what other braver-than-me people are saying.\" I'm very particular about sushi...if it's a new place I want other people to have tried it first. So, thanks, all who have written reviews before me. AnywayIt was the Friday before Christmas, and my husband and I actually had the same day off of work (you'd think that since I'm off for a whole week every other week this would happen more often, but it doesn't). We had already had cheeseburgers from Hoss's Loaded Burgers for breakfast-starting the day off right and all that-and we were trying to decide what to do for lunch (to give you a time frame, breakfast was at 1 in the afternoon, so it was about 6:30 when we were trying to decide this). I suggested this place because my husband has always been enamored of kaiten sushi bars as was beyond excited when I told him we had one now. We hopped in the car and made the trek from Smyrna to White Bridge Road. Since it was the Friday before Christmas, I don't know if the crowd there was indicative of a normal Friday night crowd, but it wasn't that busy. The hostess told us it would be about 20 minutes. We were seated in under 10 minutes. We got lucky and got the two seats at the very beginning of the conveyor belt...as in, we were the first ones to see what was coming around. It doesn't take much to excite me. As mentioned in previous reviews, the plates are different colors, and each color is for a different price. Off the top of my head, red is $4.00 (the most expensive) and light blue is the cheapest ($1, I think). When you see something you want, lift the door and grab it. I was elated to find out that the conveyor belt was covered and refrigerated. I have a thing about people potentially breathing on my food. I want as little of it done as possible. I can't stand buffets. Also, no hot sushi. Yay! I'm getting off track...You can have your meal two ways: order off the menu (you can get larger sushi rolls, noodle dishes, rice dishes, appetizers, etc) or grab your whole meal off the conveyor belt. My husband and I had the bright idea that to save money we were going to order something off the menu and then 'supplement' it with a couple of plates of sushi a piece. Yeah...don't do that. After I saw all of the different kinds of sushi go by, that's all I wanted. I think I ate one noodle out of my plate of chicken udon (I didn't like it very much, either...but I think it was me, not the noodles). We ended up grabbing like 8 plates of sushi. I recommend the 'Crazy Girl' roll. It's a $4 one, but it's worth it. There was one roll that looked very interesting, but we were too chicken to try it. I think it was called 'Surf and Turf,' and it had several types of fish and green apple. Their Spider roll is good as well. There was also one called the Naruto roll that went around right when we sat down, but by the time that part of the belt came back to us it was all gone. We waited for it the entire time we were eating and for about 30 minutes afterward. Finally my husband mentioned it to our server, and she was like \"Oh, I can tell them to make it for you!\" So if there's ever something you're craving or wanting to try and you don't see it, just ask for it. The roll was on the conveyor belt in less than 5 minutes, and it was well worth the \"if we had known to ask for it\" wait. Long story short: we loved it. It's a fun thing to do for date night. I totally recommend it."], ["Tripp E.", "Don't diss the train. People smirk at the novelty of conveyor belt sushi but there's something there, it's a great way to sample smaller amounts of many different rolls. There's a silly sense of urgency because you don't know if that one you want to try will come back around but that's the fun of it. I pulled off a salmon and yellowtail sashimi, I did not expect to see straight sashimi choochoo'ing down the line. I went with 2 friends using an Amazon local coupon but blew that $30 value on 2 bottles of Nigori sakè. We didn't order any food off the menu, no edimame, soup or desserts, just belt sushi. With STUFFED bellies we racked up about $65 of food before tax between the 3 of us, that's seems pretty reasonable to me. We all thought the fish tasted fresh and the rolls used quality ingredients. One of us liked the Snow White (white tuna roll) but did not see anymore coming so we asked the server and she snagged one for us! We also found and ate salmon roe wrapped in an artfully cut cucumber cup, surf clam and octopus nigiri. I look forward to going back but maybe I'll skip the overpriced Nigori."], ["Benjamin S.", "Finally, a kaiten sushi bar closer to home. What was once a ho-hum asian buffet is now an awesome sushi restaurant featuring conveyer belt sushi! The prices for any given plate range from 99 cents (for an all veggie roll), to $4.00.My fiancee and I waited for what seemed like forever for this place to open, and when it did we were not disappointed. They have a great variety of sushi rolls and even some nigiri that circulate on the enclosed, chilled, conveyor. All you do is lift up the door next to your table, and reach in and grab what you want. I will say that this place just barely makes 5 stars as some of the rolls fell apart (never a good thing); but they make up for it with the variety and the fact that each line of sushi is preceded by a sign traveling on the conveyor telling you what type of sushi is next. Their spicy salmon and tuna rolls were amazing as were the regular ones. I did not find one bad roll on the line.So bring your money, cause it can add up really fast, and a big appetite, you will not be disappointed. That being said, if sushi is not your thing, they also have a selection of Chinese and Japanese dishes you can order straight from the kitchen."], ["Micheal P.", "I was hesitant to go to this place because of the mixed reviews, but I'd obviously have to try it at some point... because conveyor belt of sushi!So, here it is. The train is novel. The sushi is just fine, but not stellar. And expensive. Seats are hard to get because everyone is excited about a train of sushi. If you, like me, ignore these reviews and go because this place has the market cornered on trains of sushi in Nashville, then here are your tips.Go early on a weeknight. If you have to wait, ask the hostess for a drink menu and someone will come by and take your drink order. When you get to the train, you'll be tempted to take a familiar roll (like salmon and cucumber), because you're hungry. Be patient. Sushi Train doesn't do basic rolls better than your favorite sushi place (and your favorite sushi place is Ginza, right??), so don't waste your money on them. Instead, wait for the specialty rolls to come around and get the surf and turf. In fact, get all of the surf and turf rolls you see. This is the one shining gem of sushi train. The uncommon ingredients blend to a bright and pleasant flavor twist on typical sushi. If I were forced to return this place, I'd sit at a non-train table and order this roll, even though I stick to bonafide legitimate japanese sushi at other restaurants (If you tell me you usually order pansy-ass crazy fried rolls, I have stopped reading your reviews).choo choo, nashville."]], "Orchid Thai & Sushi": [["Adam W.", "Absolutely amazing.  I LOVE spicy thai food, and if you order Very Hot (level 4 of 5), it's actually very hot. (unlike other Thai places in town which dumb down the spice levels).I'm from NY, and the Pad See Ew is better than any Thai I've had in NYC.  Coconut soup is another hit.The whole staff is great, but Lily is one of the stars.  She's fun and friendly!"], ["Billy H.", "We ordered some sushi to go on a Sunday afternoon. We had saw they had 3 for $11 deal. We ordered 6 rolls in total & two ordered of spring rolls. On the menu, it's worded like you just get one spring roll for $3, but you actually get 2 rolls for $3. We used a new app called Favor to deliver the food. We ordered the following rolls, avocado, crunchy shrimp, crunchy crab, spicy tuna, tuna, & salmon & avocado. I liked the tuna, it was a large piece used in  the roll. I noticed that they are a little stingy with the avocado. There wasn't much of it in the avocado roll or the salmon & avocado roll. The spicy tuna was minced tuna, I prefer when it's a piece that is marinated in the spicy sauce. It also could use a little more spice. The crunchy crab & shrimp was a mistake to get as a to go roll because the panko crumbs were chewy, not the restaurants fault though. The rolls come with ginger, wasabi & a nice little cup of soy sauce & not the annoying packets. The spring rolls were good, a nice crunch to them & were accompanied with duck sauce. I liked what I had. I think next time we will dine inside & skip the to go order."], ["Peter M.", "This place has a nice, comfortable atmosphere, and it is just about what you expect from a Thai restaurant on a busy strip.  The food was A-OK, service fast and friendly, and while nothing stood out that really 'wowed' me, I can honestly say that there's nothing I can fault.  Decent spot if you're in the mood for Thai."], ["Carolyn M.", "I had a big old bowl of soup and it was delicious. My friends got sushi and that looked good too. But the service was pretty inattentive and the smell in there is slightly mildewy."], ["James W.", "Amazing sushi, must try the hot ginger tea! Very impressed with quality of food and service. Will go back again and again!"], ["Brian K.", "The temperature inside the restaurant was way to hot. Everyone at our table was sweating and the tables around us were complaining also. We had the Basil Noodles and they were great. Be forewarned.  We ordered saki bombs, but instead of serving with cold saki, they served with hot saki.  Didn't help partnered with already hot room temperature. The miso soup was great!  We order a large array of sushi. It all tasted good with great presentation. Then we found a hair in one or the rolls, and we were done. It was time to leave."], ["C T.", "Went on a Sunday evening and Tom was our sushi chef - he was nice and my sushi was great. The real star was Lily...she was an awesome server and super sweet. Will be coming back for sure."], ["Dez S.", "Decent California Rolls but Crunchy shrimp rolls weren't so crunchy. Boiled spinach appetizer was yummy (served cold). Prices kind of high except during lunch. There was a weird smell from the fountain in the lobby."], ["Stacey W.", "Kinda gross. The restaurant smells bad, and it was almost empty. Even so, the server took a long time to take my order, and by the time she came back I was no longer looking at the menu and quickly pointed out what turned out to be the wrong roll. I wanted the \"super crunchy\" roll but got the \"extreme crunchy\" roll, which is not my thing. I left half of it on my plate. Also, I left with a stomachache."], ["Anita A.", "Delicious delicious Thai food! Decorated nicely on the plate, good wait service and nice atmosphere.  I will definitely go back. Green Hills is a little complicated to navigate (traffic can be a headavhe) but if I'm in the area I'd pick this spot!!!"], ["Erica F.", "I came to Orchid Thai & Sushi for lunch with a group of friends. The place is located kind of weirdly on the side of a building tucked behind some construction at the moment, but the hanging banners and frankly - ginormous - sign along the main street only just prevented me from turning early and getting lost. (Lost is kind of my forte).In any case, we were seated quickly and got our drinks. There was great happiness at the table when we discovered the lunch menu on the back page - huge portions still and a great lunch price tag! The options were only slightly pared down from the dinner menu, too so it still took us a while to decide.We ended up sharing an appetizer plate for the table and I got the Basil Noodles lunch portion as my main - spicy level 4 out of 5 - very hot. Per norm, we were treated to the yummy little broth soup that comes out to whet your appetite shortly after we ordered. Our appetizer platter came out fairly promptly after that and was plenty for the table of five even though it was two spring rolls and four dumplings. The chicken was moist and flavorful and he sauces that came out with the appetizer platter were very yummy with one sweet and spicy and another peanut butter-y goodness. We hadn't gotten to the point where hunger means you actually finish off the full appetizer platter before our main dishes came out. I really liked my spicy noodles - they were the perfect spicy level I'd expect when I ask for four out of five - flush to the face, slight sniffles start up and red lips can feel the capsicum. Mmm...I think the decor is a little cheesy, but neon lights aren't really my thing and it wasn't offensive at all - one big plus for dinners is that they didn't overcrowd the middle floor tables and (bonus!) their bathrooms were super clean. Overall, service was great, the place is well-laid out to feel like you can have a nice time here and not feel packed in or rushed - even if it had been busy - and the food was very tasty and a good value - especially lunch! I'd come back again and I'd bring a group too."], ["Hall W.", "I'll admit it... I came here for my pre-Hunger Games - Mockingjay Part 1 lunch... Its hard to find a good thai place in the South (period)... but Orchid does a pretty  excellent job. Its flavor might not be Thai authentic (for the knit pickers)... but between offering your custom hotness and a plethora of sauces, everything you try from the spring rolls to the dumplings will fresh and crisp with flavor.I had pa ta (probably spelled it wrong), and it was just as good as I had it in New York City.This place goes short of 5 for 3 reasons...1. Its interior decorating is rather unoriginal and tacky2. Its menu is ridiculous. I'm not a fan of mega menus...3. sushi could use a bit more work - not bad... just not great... go for the Thai... not the sushi..."], ["Beau H.", "Cozy, quiet, clean and friendly atmosphere. Koji is by far the best sushi chef I've ever met. Food is delicious. Service is prompt. Prices are more than reasonable and the food is amazing!"], ["Dave C.", "Came it at 11:30am on a Monday for lunch. There was only a few tables seated and I sat at the bar in front of ESPN on TV. I got the lunch sushi special (2 rolls and soup) and an appetizer. I'm stuffed on delicious sushi and dumplings for $15. I wish I wasn't wearing dress pants...or I wish my dress pants had an elastic waist!  The dinner menu looks a little pricier but the lunch menu is great. Plus it's got easy parking and no green hills rush at lunch!"], ["Corie K.", "I ordered carry out from here today. I chose to try Orchid because it was on my way to a friends house and there was a Groupon and I offered to grab everyone sushi.The sushi looked good and my friend said it was really good. I ordered Pad Kee Mao for myself and we shared gyoza and spring rolls. I ordered my Pad Kee Mao spicy and it was not spicy at all, which was a key downs Thai food isn't great to me without the spice. There was barely any chicken or veggies I it either- very noodle heavy. I did love that it wasn't weighed down in oil though like some places.The spring rolls weren't anything special, now was the gyoza. The apps seemed a bit high priced. The meals and sushi seemed standard. I was a little sad I didn't make it in time for lunch menu- I called on order at 3:45- their site doesn't list how late lunch ribs but another place I frequent for Thai runs theirs until 4pm. Unless it's convenient there are better  options for sushi and Thai all things considered."], ["Nina M.", "Great service, nice atmosphere and best Thai around. Sushi is great too! It is hidden, but entrance from Warfield is easy and no typical green hills parking issues..."], ["Alan J.", "Place a little hard to find as it does not face main road. Keep looking an you will find.  Enjoyed their fresh rolls with shrimp and the chicken pad thai. For the spicy level beware.  I had medium and it was excellent. I would suggest ordering low in spice and adding at table. Can't imagine thai spicy."], ["allison m.", "It wasn't awful, but was not great. There was a strange smell upon walking in (note to self:  walk out when the restaurant smells funny). We were one of three tables- service was fine, but the food was so mediocre. I hate to leave a bad review, but I feel that I need to shower when I get home. Tried it, won't be back..."], ["Sylvia J.", "I love this restaurant - great Thai food, cocktails, sushi, and even some Japanese food. Usually not that many customers, which is perfect for me because I hate crowds, and it's a very intimate setting with down to earth servers! Great great great, I love coming to this restaurant!"], ["Sean J.", "This is one of the best Thai places we've been to. The food was great. The service was exceptional. The place is hard to find, tucked in behind the shell of a radio shack, but if you're in the area and in the mood for some great Thai food it's a real winner!"]], "Samurai": [["Thomas H.", "I'm not too sushi in general, but I was having a craving for it last night, and joined my friends (J & C) for the first time here.  It's an unassuming little storefront on Elliston Place, and it's easily overlooked.  Maybe that's why I'd never been there.  The atmosphere inside is simple-- very basic, and a little dated, and the flow of the restaurant is odd.The appetizers are very limited: miso, salad, edamame and gyoza.  That's it.  There are no hibachi or other Japanese entrées available.  J & C are regulars, and they guided me through the simple menu and made some recommendations.  I don't eat raw. The gyoza were a little chewy, but my salad was completely on point, and very generous.I could nitpick the basic menu and the décor, but frankly, who cares?  Sushi.  They offered up platters of the most beautifully prepared rolls, nigiri that I've ever seen.  Gorgeous stuff.  It came out very quickly.  I went with the Vandy Roll (a deep fried deliciousness of crab meat, cream cheese and avocado) and the Happy Roll, a soybean-paper affair with strawberries and eel sauce.  J & C had a festival of clams, shrimp, salmon, tuna-- mostly raw.   I actually tried a piece of a roll containing raw seafood and enjoyed it.  The prices were very reasonable, the wait staff efficient, albeit not engaging at all, and to be honest, that was nice for a change.   I will definitely go back to Samurai when I'm in the mood for sushi again, which, after last night... could be soon!"], ["Stefanie P.", "Its been 4 years since my last review and It deserves an update. It tastes better. After recently eating more sushi, I went back to Samurai. It's good. The fish tastes good. The service not at peak times is fast. I like that the place is small. I still went with Spicy Tuna Roll and Vandy Roll. Both still delicious!"], ["Odalys M.", "I had Palm Beach & regular Hawaiian Roll with Mango added. They were super delicious, loved variety of selections & the service was great."], ["Emily C.", "Favorite sushi place, I'd recommend the dragon roll and California sushi roll. It's around $15 for the two rolls. Well worth the price."], ["Justina L.", "I'm only giving this place 3 stars because I understand it's Nashville so I decided to be a bit more generous with the ratings. Coming from Toronto where we are known for having a diverse selection of food including Japanese food, my standards for sushi is pretty high. Taking into consideration I shouldn't expect much here, I'm still fairly disappointed as all these reviews got me overly excited!I got the nigiri and the dragon roll. Yes the portion of the fish was huge but they were not fresh at all given it's an a la carte restaurant. My maguro tuna was very chewy - I could hear myself chewing it. The eel wasn't that great either. The dragon roll was decent.Overall I would not come back here for sushi. Given the quality and price, it's not worth it. However if you really need your sushi fix and you're from out of town, this isn't that bad for Nashville standards, but definitely not up to Toronto standards. I'm just a really tough critic when it comes to sushi."], ["Sarah C.", "I just love Samurai. It is a solid sushi place off Elliston. They's got the ginger salad dressing. Who doesn't love that? I mean I may or may not have kept the residual dressing in the bowl to dip my sushi in....don't judge!I typically go for the dragon, Alaska or veggie. Seriously, can't go wrong. Can get pricey with the upper tier rolls. Worth it, people!"], ["Adam B.", "A nice, tiny sushi place. They had a wide variety of sushi options (including several with fruit in them). My friend and I had a large sample of their rolls and were not disappointed. All the fish tasted fresh and the rolls were generous in size. Add in a couple of large hot sakes and it was a nice start to the evening."], ["Andy B.", "I have a new favorite sushi place in TN.  The hamachi was very good and so was the Jane Roll.  The crispy roll was meh.  From a Californian, this place is good.I'm leaving my above review because this place has been wonderful every other time, but I just went for lunch and ordered a jane roll and a candy roll to go because I had my pooch with me.  I ate it in my car right outside right away.  It was average at best. If they offered me $20 in free sushi, I would take it happily, because it just wasn't worth it. I went back in to ask if there was any reason it just didn't seem fresh, but I think with the language barrier, I'm not quite sure they understood what I was asking. I certainly will be back no matter what, and this was the day after Christmas, so maybe it wasn't that fresh this one time, I don't know. It's just that if you're gonna charge me $20 for lunch, I'm gonna expect it to be good and fresh every single time. The owner was at a table right next to me when I was asking the waitress if it just wasn't very fresh and he didn't seem concerned at all. Maybe it's my fault for not asking him directly."], ["Karrigan S.", "The reviews on this place were great, so when I got to the place, I was surprised. It is def a hole in the wall. But it's clean. (I felt safe eating there) The food was AMAZING. The staff was super friendly, and helpful. It took me so long to order because they have sooo many rolls. Try the Vandy roll if you like tempura and meat, sooo good. And I saw several people that suggested Dr. Larry roll, but when I read that it had mango, I was turned off. My sister ordered it and I tried it..hate I didn't order it. The mango is so subtle, it added a great contrast to the roll. Will be here again. The prices were very reasonable."], ["Aivid A.", "Best sushi in Nashville! Service was great and food was fantastic! Will definitely be back! Thanks Mr. Choo :)"], ["Caleb A.", "Not terrible, but their selection of rolls wasn't really up my alley. It was fresh and what I ended up getting was pretty good."], ["Tran T.", "One of the best sushi restaurants in Nashville. Owner is Korean and the sushi chefs are Korean and Japanese. I had to give out this fact because any sushi restaurant runs by the Chinese is just a no-no for me. It is a very small restaurant, not good for big groups (more than 7). The sushi bar is tiny. I got stuck twice trying to get in and out of the sushi bar (the chairs are too big for a tiny bar). You literally will be rubbing shoulders with the person sits next to you. It could be a good thing if the one sitting next to you is hot! If not...well just enjoy your sushi! :)Keep in mind that Samurai specializes in sushi only and they do a wonderful job. The sashimi here are so fresh (Tip: put an \"S\" next to the item you order. For example: White tuna - S). My favorites are the White Tuna, Salmon, Unagi (get Nigiri - fresh fish with rice), Crab meat (special order, not on menu), and Yellow Tail. They serve the sashimi on top of cucumber salad, which was very crunchy and refreshing. The rolls are also very good. There isn't a roll I don't like from their Samurai Specialty Rolls and World Rolls menu. They have rolls that come with fruit. Very unique. If you like eel and avocado, I suggest getting the Red Dragon Roll.Tip: At the sushi bar, after you have filled out the sushi sheet, make sure to give it to the waiter. Don't put it on top of the glass case (other sushi restaurants do this) or your order won't get in. The only thing that kept me from visiting this place frequently is street parking. They don't have a private lot and it is a pain in the neck for me (not good with parallel parking). However I will be back when craving some good and fresh sushi :)2013/#70"], ["Myan T.", "The boyfriend and I went to Samurai Sushi on a Friday night with high hopes as it is a place with 140 reviews that averaged 4 stars.  We learned that Nashville doesn't have a really great sushi restaurant to put bring this very average restaurant back down to earth.We recently moved from Orlando so with our first paychecks we thought it'd be adorable to treat ourselves/celebrate new beginnings, etc etc etc.  6 rolls of sushi, a handful of sashimi, and about $70+ later, we were left with the overwhelming feeling of meeehhh.Firstly, the fish isn't all that fresh and the rolls are over-done.  Whatever happened to just letting the integrity of the ingredients speak for itself?  It's freaking sushi. You don't need to put 10 different things into a roll and then deep fry it and then cover it in eel sauce for it to be delicious.  Some good quality fish and properly prepared rice is really all you need.  Let the quality of the fish be the star of the roll and for the love of god stop deep frying everything.  Generations of Japanese are rolling in their graves.  And what is with this whole strawberry sushi craze?  I thought I'd give it a shot based on Yelp recommendations and 2 weeks on, my stomach still churns at the memory.It's not that Samurai is the absolute worst sushi in Nashville (you can go to Ken's for that), it's just that the food as a whole is really really mehhh.  I don't know if it's because TN has to source its fish from the coast and as a result all of its sushi restaurants suck or if its because Samurai just has a really cheap and therefore crappy fish supplier.  Either way, we wont' be back to Samurai.Pros: 1. the place is cheap.  3 \"fancy\" rolls, 3 normal rolls, about 8 pieces of sashimi, and 2 beers was about $75ish with tip.  2. the restaurant is also cleaner than Ken's though that particular standard of cleanliness isn't really tough to beat.3. most of the food isn't absolutely disgusting.Cons:1. the rolls consist of more ingredients than a Papa John's supreme pizza2. the fish isn't really like that fresh.3. overall just very average food."], ["Danny K.", "Simple and seemingly fresh Sushi, Samurai has nice menu of simple sushi dishes.  There's not much to speak on in terms of the atmosphere. I wouldn't recommend it early on if you're taking a date there. No frills, except tasty sushi."], ["Stacey M.", "This place is awesome! The atmosphere is somewhat hole-in-the-wall (don't come here if you're looking for a fancy place. Come here for fantastic sushi!). My husband and I both agreed it was some of the best sushi we've had in a long time. Our favorite rolls were the Dr. Larry and the Samurai roll but you really can't go wrong here. The fish is really fresh. They don't use a ton of rice in their rolls or nigiri which is nice (I hate when rolls have a ton of rice). Take out orders are done quickly. Our dine-in experience was great too. This is definitely our sushi spot when we make it into town. Love, love, love!!"], ["Wes  L.", "I had high hopes. Upon relocating to the area from Florida, I'd hoped for more after reading reviews. I cancelled a reservation at Virago, because sushi shouldn't cost $20+/roll, and settled on the hole in the wall experience at Samurai. I ordered 5 rolls and gyoza. Fried rolls were mushy and tasted like flour encased rolls left over from Costco. 3/5 rolls fell apart and while the fish was decently fresh, I had to eat it deconstructed and opted to each by hand. One roll was soaked in sriracha and hardly edible...I think I'm hoping for too much in middle Tennessee and will continue to steer clear of seafood in landlocked territory. Other reviewers clearly don't know what good quality seafood / sushi prep tastes like - God Bless"], ["Claire C.", "The best sushi in Nashville hands down (yes including Virago). The fish is so fresh and the majority of rolls are raw, which is surprisingly hard to find in Nashville where everyone prefers their rolls deep-fried. The ambiance is nothing special, but if you are looking for amazing sushi at affordable prices this should be your spot. I just wish they were open Sunday's !!"], ["Stephanie H.", "Very good sushi! Mr. Larry and Dr. Kaiser and went to San Francisco and realized they had the most flavor of the three lol"], ["Ashley E.", "Excellent sushi!! Yes, the location is small, but you just have to plan a little ahead of time so you get there at a good time (or expect to wait a bit)--it's well worth it either way. There were PLENTY of sushi rolls to choose from, as well as the usual appetizers and sashimi. Service was quick and courteous, and prices were great. My husband and I are already planning our next visit! We were seated in the main area with the sushi bar (which is aprox. 6 stools)--there was also an additional room, but I wasn't able to see if a large group could be seated. Depends on their table moving rules. I would call ahead of time to check on that."], ["Bob R.", "Best sushi in town!  Would be 5 star if there was more seating.  Sometimes hard to get in on busy nights"]], "Midori Japanese Korean Restaurant": [["Corey M.", "This place is friggin' amazing. It has a small and simple but comfortable interior, the people are very friendly and welcoming, and the food is killer. HIGHLY recommend their \"Lion King\" roll. Perfect spot to go for an informal, relaxed setting for sushi."], ["Luis C.", "The inside of facility is kinda cruddy. No style and lights are super bright looks like a house. How ever the food was good and sushi was good too and they have great prices!!!. I will return. They need to improve the attention to customers."], ["Tracy F.", "If we could give Midori 4 1/2 stars, we would. Come on, Yelp, allow us to make that happen!We came here on a Saturday night for a relaxed dinner, and literally wobbled out from being so full of delicious Korean food!  We ordered 3 of our standard Korean favorites: seafood pancake, bim-bim bop, and spicy squid and vegetables.  The food came out hot, fresh and perfectly cooked.  The seafood pancake was HUGE and chock full of squid, shrimp and green onions and topped with a delicious sauce.  Our only complaint was that the pancake was a bit thick compared to others we've tried elsewhere (but we'll let that one go on account of the pancake being, overall, quite delicious).  The bim bim bop (my personal favorite) was good as well, full of veggies and accompanied by a perfectly spiced sauce.  I would have liked more beef in the dish, but it was otherwise very tasty.  The spicy squid dish had plenty of squid, big chunks of zucchini and a variety of other vegetables.  Our main courses were served with the standard Korean appetizers: kimchi, spicy daikon radish, bean sprouts, potatoes, and other fun dishes you just need to try to complete your experience.  The waitstaff was very friendly and eager to make our meal a good one.Both my fiance and I were spoiled by Koreatown in NYC, where we ate some of the best Korean food in the USA.  While Midori isn't quite up to par with the amazing Korean BBQ joints in New York, this is certainly some of the best Korean food we've found in Nashville.  It's definitely worth the 30-minute drive from Bellevue to fulfill our Korean food cravings.  We didn't try either, but the other Korean dishes, as well as the sushi, looked delicious.  We'll be back!"], ["Sarah W.", "Would've given 5 but the service is really slow. The food was delish though! Great, fresh sushi!! Our server only came to get our orders and bring beverages then never returned until it was time to leave! Will definitely be back, but only for takeout!"], ["Michelle P.", "Absolutely delicious! I came for lunch on a pretty slow day. It was just two other occupied tables and myself. My server was a really sweet lady. I have never eaten Korean food and she explained the menu to me. I am a soup girl so I opted for a \"hot/spicy\" veggie soup with Beef. It was awesome! Although, to me it was not hot. My soup also came with white rice and array of pickled veggies (kimchi?) I had never had this and was very surprised that I absolutely loved it! When I got my check they gave me a really sweet melon to round out the meal. I would definitely come back here."], ["FoodCritic 6.", "Love this place! Nice and friendly place. Love the sushi. Good service. Can't say anything more."], ["Sharon H.", "Dropped in here just on a whim. What a great hidden find! We got the Buh Go Gi beef that came with some little side dishes. Kimchi was as good as any home made I've had, and totally beats any store bought I've had. The sushi we ordered was the spider roll and OMG roll. The sushi was good but my only comment is the seaweed used is a bit tougher than I like. The servers were helpful and friendly. It's a small joint but packed with YUM!"], ["J R.", "Absolutely worth the drive to here. Korean Bulgogi and Japanese Udon noodle soup was so filling and fresh for our group of 4. Very busy place, no wait though. Bathroom clean. Service sincere. A lot of natives there, great sign. Just absolutely satisfied and will return again."], ["Lindsay M.", "My husband and I have made this place a regular for takeout. The sushi is superb. It's fresh, beautiful, and tasty. I don't worry about getting sick when I eat the sushi here, which I can't say for other places. The employees are very friendly and the atmosphere feels home-y and authentic. We have never eaten in the restaurant, but they are always so nice when we pick up our orders. Sometimes we will go there to order and have a beer while it's being prepared. I love love love this place. I wish it was a bit closer to me, but we don't mind the 20 minute drive for the quality."], ["Zindan T.", "Went in for Korean food came out with a new outlook on life. It was the best giabee I have had in a very very long time. Seafood pancake was huge and packed and that's what a lot of Asian places are missing. I'm not a huge fan of soy sauce and none of the food here needs it! Already went twice before I left this review!"], ["Bethany C.", "I love this place! The sushi is inexpensive and delicious. I recommend the poki roll and the crazy roll."], ["Rachel J.", "Place is quaint. Price is right. Been open for AT LEAST ten years so they must be doing something right. Tried it tonight, had sushi, was not disappointed. Yum!"], ["Jamee C.", "I absolutely love love love this place. I am fully Korean and I've tried pretty much all the Korean restaurants, Korean-owned or Korean-ran restaurants in the area and I would say this is the best Korean and Japanese restaurant in Nashville.I love that they don't try to Americanize the food or play any of its flavors down. Especially my mother was from south coast in Korea - their foods are a little more spicy and seasoned than people up further north due to warmer weather - and this suits my appetite very well.The atmosphere isn't the nicest and they don't have the nicest furniture but everything tastes great. All their ingredients are fresh and I was actually pretty impressed with the quality of raw fish they served, especially regarding this is Tennessee.I have not been disappointed by their food ever. I must be honest and point out their Japanese food is a little Koreanized but that is what I am used to so I love it, and it's not far off the charts from authentic Japanese food as some of the American-owned Japanese restaurants.My boyfriend's never been to Korea, and never tried Korean food but he loves the food here as well. Highly recommend this place."], ["Aaron H.", "Midori was great!  I got the Bulgogi. It was just as good as the several times I had it in South Korea. I also got a spicy tuna roll, which was spot on.  Their menu is great. It's sort of a hole in the wall type place."], ["Jason P.", "Our new favorite place for Korean food! I tried it out and loved it so much I took a friend visiting from Australia a few days later and he loved the food as well. Unlike most places here in town they have a choice of 4 or 5 different types of sake (and soju if you are lucky). It's a small place, mom and pop nothing fancy but the food is far better than i expected. Service was attentive even though they were busy both times we went recently. It's not fast, there is a little lady in the kitchen cooking. team of one. don't get in a hurry good things take time. What really makes it a great experience for me is when the staff are willing to answer questions and make recommendations, and these folks are super nice and helpful. Several ladies came by to ask us how we liked everything and help us with the more exotic choices we made (they kept warning us to stir the hot pot so the rice wouldn't brown, but that is my favorite part!). The seafood pancake is an enormous yummy fried miracle. trust me if you like seafood/octopus you will love this. The ribs are awesome but you will have to fight the other people at your table for them. don't say i didn't warn you. If you go on friday night at 7 don't expect to be out of there in 30 minutes. We got a ton of food for a very reasonable price. Can't wait to go back and try the sushi. Banchan were different each time we went and all were tasty, again if you enjoy authentic Korean food."], ["Diana J.", "My new favorite sushi spot. Ridiculously good. Service is great, servers are nice, and the chef will make you something whether it is on the menu or not."], ["Elizabeth P.", "This is my go-to lunch spot, weekly. (Except Tuesday - closed). I get my sushi fix here on the reg. Always friendly, always fast. Decent prices & quality."], ["Yvonne Y.", "why not show the business hour in Yelp？when u came at 2：00，they told u they closed. but Yelp said their business hour from 11：00am -9：30pm！"], ["Tiffany D.", "I guess I didn't realize how much I like this place until I realize I've been here almost 10 times. It's a good sign when you see a lot of native people there. I come here for Korean food. Eating the small side dishes is my favorite part and the fact that they refill it makes it even better. The service and the staff were friendly. I had the Bi Bim bap? It has beef veggie and rice. I recommend getting it in a hot stone pot if it's your first time. Sushi- there's a lot left to be desire. We had the eel roll with cucumber on the outside. It had more texture than flavor."], ["Jennifer W.", "This was my first time trying Korean food. The service was very friendly and helpful in helping my family select a meal we would like. I definitely want to come back!"]], "Sushi O Sushi": [], "Ninki": [["Charli J.", "Friendly service, beautiful presentations, fresh fish, you can't go wrong.  This is the first time I have ever been presented with sushi rolls sitting on a plate above blue flames.  How exciting!  And on Wednesdays when it's 20% off all sushi?  I'm there.UPDATE:  I am taking away two stars from my original review.  A dining experience for a friend's birthday left me never wanting to go to Ninki again, as the service was terrible.  Bringing out dinner plates at various times and forgetting to submit an order for a guest at the table until AFTER all checks had been delivered to the table is by far, the worst thing a server can do.  This is exactly what our server at Ninki did.  my friend had to ask if she was ever going to get the food she ordered when all the individual checks were already delivered to the other guests at the table."], ["Janet S.", "Coming in from a Bellvue roadtrip we stopped in here at around 3.00 pm on a Tuesday.  There were still a few stragglers from lunch - the vibe is dark and soothing, gentle Moby tracks were wafting and the lighting low.  Service prompt and attentive, panko fried avocado appy was delicious with hot mayo.  The Wasabi roll was beautifully presented and tasty but devoid of wasabi, no matter plenty to dip into on the other plates.  The Maguro and Saba were both delicious and generously cut.  A ginger Martini thingy was quite lovely.  We split all this for $55, it seemed a little pricey and it is far from home but definitely A-OK.  Private rooms and hibachi tables available."], ["Ramiro R.", "The food is absolutely awesome! Finally one place that has the clear onion soup and not just the miso. They use to carry Blue Fin Tuna, but don't anymore. That was a draw. Ninki is my favorite Japanese Steakhouse in all of Nashville... worth the price."], ["Ray L.", "With the amount of Japanese restaurants that are in Nashville, most are mediocre to... bleh with a few hidden gems.  This place is unfortunately not one of the latter.  There kitchen serves not only sushi, but also serves bento boxes and teppanyaki.  I came here three times and based on those experiences, I would probably say that if you want food to arrive on a timely fashion, make sure you order their \"hibachi\" and that the rest of your table does so too.Let's start with the best thing that they do well: The NINKI bento boxes during the lunch special is extremely well priced for what they give you and the kitchen actually cooks up a pretty delicious (albeit thin) tonkatsu and tempura.  My only complaint is that you have to get fried rice with the dish.  The onion soup is actually not bad.The next best thing? The teppanyaki that they call \"hibachi\".  It's nothing like a Benihana since they aren't as fun to watch.  With the hibachi, you get the meat of your choice (beef, chicken, salmon, and shrimp and you can choose how well done you want the beef).  I ordered the beef and even though they cooked it to medium rare as I had ordered, the beef they serve though is unfortunately not of great quality.  On my first visit with my group, we ordered different items and for those of us that didn't order the teppanyaki, we waited so long that our friends who did had already finished eating.  Our waitress though was quite helpful and did the best she could to keep us complacent.  On our second visit, we all ordered hibachi and this worked out much better.I haven't had their sushi so that judgement is reserved for another visit.Price: 4Food: 3Service: 4"], ["Matt L.", "I've tried a lot of sushi in Nashville, and have always felt it was a little lacking. Until now. I found Ninki. It's wonderful that the best sushi in Nashville also happens to be the best prices. I just had a $6 rainbow roll piled high with tuna and salmon on top, while drinking a manhattan. That's right...they also have a bar. Best deal in town. Definitely give this place a try."], ["Vicki S.", "I'm sorry to do this to you, Ninki, as we've had a pretty good run during your 50% promotion (which seems to have gone on forever), but you're losing a star. The service on a recent night for a friend's birthday was confusing and infuriating. I've dealt with the slow service in the past, figuring it was worth it for such a great deal. On this particular night though, my entire table of 7 people were served their food long before I was. I waited patiently for a while - until the server started handing out individual checks and I STILL hadn't recieved my meal. I'm talking a good 20 minutes between my friends' food arriving and me sitting there hungry and angry. Turns out she never put my order in. How does that happen?I have not been back since, and it will take a good deal of convincing to get me back again. Sometimes you really do get what you pay for."], ["Kitty K.", "Ninki has beautiful food. I love going for lunch or getting take out whenever I'm in Nashville.The only reason I'm giving 4 instead of 5 stars is that their fried rice used to be AMAZING, just the best, but last time it was more greasy than usual, couple of my Nashville friends said the same thing. But regardless of the rice, it is nice, stylish, pretty, and tasty."], ["Hoa T.", "Went here because I had the LivingSocial coupon and I will say that I will be back. I did not even know that they have hibachi but I'm glad they did because a friend was not that into sushi (baffle my mind I know). Service was top notch. The Hibachi chef was very personable, nothing too flashy but with a drink in hand, the experience was great. I had the gyoza for appetizers, mahi mahi entree, and wasabi margarita to drink. The gyoza was good, typical but good. The mahi mahi was cooked well, I had it taken off the grill before it was overcooked, gotta be careful with fish. I also tried my friend's calamari steak. It was pretty awesome I may have to get that next time. The wasabi margarita was not overpowering with just a hint of wasabi at the end. I was definitely pleasantly surprised.The sushi menu was pretty extensive and not too pricey either. I ordered the Pretty Woman Roll (shrimp tempura on the inside with raw tuna on the outside). It was so tasty. My friend had the Volcano roll which came out on fire. A+++ for presentation.I will definitely come back especially on Feb 27, 2012 since it's their 1 yr anniversary so 50% off sushi roll baby. Can't wait!"], ["Ben F.", "Here's my quick and dry review of this place, which I USED to frequent about once per week.I rated 4 out of 5, based on my experiences with other sushi restaurants in Nashville, because it is unfair to compare to some of the other sushi restaurants I've been to while living in Manhanttan, NY. I usually rate sushi based on three criteria. Rice, Fish, and Presentation.Here, the sushi rice is of good consistency and taste. Not too dry, not too mushy. Good overall texture. Not too sweet or too much vinegar, but seasoned right for my palate.Here, the fish is always consistent. Fresh and vibrant in color. The raw scallop is so-so.  Sea urchin is good. Occasionally, they have specialty fish like Toro. The nigiri fish is sliced appropriately, in terms of size and thickness. Acceptable fish to rice ratio, but could be more delicate.Here, the presentation is average. I'm not expecting much, particularly since the prices are average. Again, not delicate but acceptable.As others mentioned, the location (in a strip mall) is quite deceiving. I would have skipped this place had I not stumbled upon it by accident. The interior is ok decorated with appropriate lighting. If it's busy, it can get a bit noisy inside due to the high ceilings and large interior space. Service is average, friendly. Sometimes a bit slow when busy, but expected. Sometimes when it's busy, they look clueless. They have sake, wine and specialty drinks, but I cannot comment on this since I get water.I love raw fish and shellfish. I love toro, hamchi and mirugai. Sadly for me, people in Nashville tend to favor the more common fish so this place doesn't carry the more selective fishes/shellfish on a regular basis. Ninki sometimes sells the fatty salmon skin, which I HIGHLY recommend. I typically order the nigiri or the chirashi here because ANY specialty rolls tend to mask the flavor of the rice and fish. I realize this may be desirable for some, but I prefer the raw taste. I eat all my raw seafood without any garnish - no cocktail sauce, lemon, nothing. Only wasabi and soy sauce. Sometimes, without it too. If I'm on a budget that day, I'll stick to ordering their maki rolls since it's always 50% off for dine-in customers. The hibachi is so-so.  Not my favorite, but I come here for the sushi.Ok, so maybe this wasn't a quick review. Too bad we can't do a powerpoint presentation, complete with animation. I'll end by saying this...the place is Japanese owned and operated. Why is this important? Because it is."], ["Amanda F.", "Cute, dark restaurant. My boyfriend and I have been here a few times and we love it! There are tvs with sports playing too, so the guys don't get bored. Definitely recommend."], ["Craig W.", "This is as authentic as you can get in Nashville. The feel of the restuarant is like an establishment in Tokyo. The sushi and other dishes are fresh and delicious. Not to mention they have a half priced sushi menu everyday of the week. I recommend Ninki to anyone who enjoys fresh and delicious Japanese cuisine."], ["Q Y.", "I would agree someone's post here regarding the general sushi situation in Nashville. Mostly mediocre, only if you know what to order. This place's special point is its lunch half price for rolls. Well that's the reason I went there last time after avoiding it for a while. All rolls on the menu were half price. But the halfed price was still higher then other places. Felt ripped off."], ["David O.", "The better half and I stopped in at dinner for Teppanyaki. The location is very nice, but as other reviewers have said, it's quite large and feels a bit empty. For us, Service was prompt and friendly. We even had a table just to ourselves. Food was decent, but not great. I found the Sushi to be average (We ordered the \"Sexy Girl\"), but its possible I'm just a snob about such things. For dinner I had the Hibachi Salmon which was really good. I've never been to another Teppanyaki place that offered this so it was a pleasant surprise. The downside was the absence of Teriyaki Steak for the Hibachi. Overall I'd probably return, but only for the Salmon, which I did enjoy quite a bit, but it wouldn't be a strong recommendation to others if you are looking for something to just BLOW YOU AWAY."], ["Kelly V.", "I went to Ninki for the 2nd time last night, and again I loved it!  The mixed reviews scared me at first, but I wanted to check it out for myslef.  I was definitely pleasently suprised walking into this restaurant, it loks small from the outside, but its actually pretty big! We got excellent service, and the food was great both times!!  My boyfriend and I got the teriyaki tofo, and its the best we've both had! We also got the happy sunday roll, which is to die for! Yuuuum! The only reason it does not get 5 stars is because my boyfriend and I do not like the fried rice, thats the only complaint we have with this place. As my boyfriend said last night its a fried rice away from being perfect!"], ["Dan R.", "I just moved to Nashville from SoCal and have been very disappointed in the sushi. Ninki did not disappoint! We didn't try the hibachi, but the sushi and drinks were very creative and delicious! I will definitely be coming back!"], ["Elated J.", "Sushi yes...HIBACHI NEVER!  The chef (from Wyoming) was sarcastically arrogant and rude.  He threw the food on the plate, was unengaged, unenthused...NOTHING like the great chefs at Tokyo!  The vegetables were hard....the rice was in clumps (no flavor).  It was so bad, I was mad lol. They have also changed their clear onion soup recently...it's like a store bought broth now:-/I really can't find anything good to say about this eating experience!  I had been there before for sushi...I should've never ever in life explored!  I don't want my money back...I want my wasted calories back LOL"], ["Jason P.", "Excellent sushi!  Very fresh and well priced.  Hibachi is great as well.  However, we've been forced to wait for our hibachi table to be full before they would cook for us.  With two small children that are hungry, that doesn't sit well.  Food gets 5-stars and the occasional wait on the hibachi table brings the overall to 4 stars."], ["E G.", "Great little place tucked away in a strip mall next to Bellmeade Kroger.I mostly have either had sushi or lunch specials but it is very reasonable for a Japanese Sushi and Steakhouse. I love the Bento box. Sushi, Tempura, Tofu/Beef/Chicken with miso, salad, gyzo all for $12 @ lunch. You can't beat this! Sushi specials are also excellent during the lunch hour and the they have some speciality items no one else in town has.***'s due to the waitstaff. They are not very thrilled to be there. Maybe the management. Either way, its a good bargin for the money!"], ["Rahel K.", "So I'm here right now at Ninki ..... ordering carryout; waiting at the sushi bar; drinking a glass of Chardonnay. To my left is a quiet large screen TV, a cozy couple, and a semi-stocked bar. Behind me is a chatty group of girlfriends. To my right a large room with multiple tables romantically lit for good ambiance but with outdated decor.  In front of me attentive sushi chefs. Oh, what's this? They hand me a 20% off coupon next time and thank me profusely for coming in.  Do I need a coupon for sushi?  Then the waitress hands me the bill. Ouch; $70 for 5 rolls, edemame and a glass of wine....but I haven't tried the sushi yet. So now I'm at home and I've just finished the meal. The rolls were small but REALLY good. Unique combination of flavors like tuna and mango, and bonnito (smoked fish skin) toppings. Will I be back? Yes, but only with my coupon."], ["Chef X.", "Where's my salad? Where's my soup?  Where's my server? I know where the rest of the staff is-standing in front of the G-d Damned front door sucking down cigarettes. Classy. This place needs a GM that can run a restaurant instead of a flock of half-wits that can't. I've been to Japan, too dude and this ain't it."]], "Ichiban": [["Jennifer T.", "Ambiance: intimate and cozy. Nice break from the hustle and bustle outsideFood: excellent. Generous portions and perfect noodle texture and broth (and I go out for ramen a lot :)) )Service: attentive but not over the topWould come back in a heartbeat!"], ["Johnny T.", "Who would have thought there would be such a legit Japanese restaurant smack dab in the heart of Downtown Nashville? Well, don't think too hard about it because Ichiban is here and fantastically real. The warm wood, full bar and expansive menu offers many experiences far past maki, I have found this restaurant to be one of the Music City's finest offerings when it comes to rolls.The only real issue is getting here. Ichiban doesn't have a parking lot and its location on 2nd Ave means that parking is an adventure in frustration. I can count on one hand the number of times I've been able to score street parking anywhere near the joint. So, when planning an evening here, think about transportation well in advance. Otherwise, you're setting yourself up for a bad time. Once you've figured out parking, however, everything else is aces.Whether dining in or eating out, make sure you take advantage of the marvelous maki that awaits at Ichiban. Being that I don't enjoy cream cheese or mayo or any sort on my rolls (come on, Americans; we can do better than that), my taste in rolls falls pretty squarely in the sushi chef's wheelhouse. I've been impressed by the Ichiban roll, spider roll, holly roll, rainbow roll, and caterpillar roll. All five have fantastic flavor, good balance, a nice amount of pieces for the prices, and none of the devil's condiments on raw fish. When feeling particularly hungry, you might even find me ordering a crab salad. While not the trendiest or most fab (location-wise) of sushi establishments in Nashville, Ichiban offers up really good product again and over again. Those 2nd Ave rents aren't cheap, y'all. Ichiban has to be doing something right to be staying in business for so long. If you haven't discovered what that is as of yet... change that. Soon."], ["Steve C.", "I like this place. The Japanese waitresses and the chef are very friendly. Decent place to have a lunch or dinner. Food is great, I'd suggest only order their sushi and rolls from the restaurant, their other Japanese dishes are just ok"], ["Abeer H.", "This place has very slow, rather unfriendly service, but the food is great - fresh and yummy, and we scored a large table for our group upstairs and that was great too. I had unagi with rice, and hot sake - both delicious. The sushi looked great too - I'd try a roll or two next time."], ["Jennifer P.", "My boyfriend and I are sushi snobs and have tried a large number of the sushi selections Nashville has to offer. When planning his birthday, I decided to go somewhere I kept hearing was \"very authentic\". Ichiban did not disappoint! I must admit, I was concerned by its location... aka tourists. However, this place is one of those great hidden gems and surprisingly did not mimic the hustle and bustle of 2nd Avenue. The sushi was some of the freshest I've had in Nashville and the service was prompt and delightful. Our waitress even surprised him with a huge plate of green tea ice cream and lit candles once they overheard it was his birthday.I couldn't have been more pleased with my experience and food. I will definitely be returning!"], ["Michelle P.", "Surprisingly good and fresh sushi for middle Tennessee. Service was speedy and kind, definitely felt like a little world of its own, situated next to Goorin's hat shop on 2nd Ave as a subtle option for those wanting something different than the typical \"honky tonk\" experience for a meal. I really like their spicy tuna, which I know sounds really basic until I elaborate that I've worked almost 5 years in the sushi industry in the past and have yet to find a quality spicy tuna roll that wasn't caked in \"spicy mayo\". Ick. But they did it :) so for sushi purists, go all out here. From their caterpillar to fisherman roll to even the simple spicy tuna they do it right and well :)"], ["Toni M.", "I visit Ichiban about once a week for lunch.  The miso soup and salad are always a yummy start.  I love the lunch box choices.  The spider roll is my favorite.  Servers and chef are always happy.  A great little Japanese place in the literal heart of downtown."], ["Jena S.", "Great sushi spot here in downtown Nashville! There are some other good sushi restaurants here, but this one is legit. Even though it is located on 2nd Ave, it is kind of tucked away and not many tourists seem to patronize Ichiban. (Presumably they are there to get the \"Nashville experience\", so BBQ is probably more their thing) So I've not seen the place get too crowded.Definitely THE place to go for sushi here in Nashville."], ["Simon T.", "Even people from Tokyo think this is the best  sushi in Nashville. Meet a man from Tokyo last time we were here that said that the sushi here is comparable to sushi you would find in Japan."], ["Rena H.", "Had been in Tennessee for three days with American food, I really wanted something asian. Found this place on yelp, went in there around 9 PM and I loved it.  I got the spicy crawfish roll and the ramen.  Ramen was full of flavor and huge portion for a decent price.  This is a must go place when I'm in Nashville next time."], ["Rae S.", "We knew we were in the right place when warm washcloths were given to us.  The soup options were delicious and full of ingredients.  My Sukeyaki  was enough for 2. We did not try the Sushi but it looked very fresh. Try it you will like it.  My friend had many questions patiently answered."], ["Josh R.", "Small restaurant but has a great feel and atmosphere. Sat at the sushi bar and ordered the chirashi. It was $18 and came with soup and salad. They filled the bowl full. I was very pleased with the quality of fish and the options. There was at least 18 pieces and I ate it all! Some of it was fish I don't care for generally, but I took it as a challenge! I highly recommend and wish I had more time in Nashville to go back!"], ["Keith G.", "In a sea of touristy country bars and lackluster restaurants on 2nd Ave, Ichiban is a welcome reprieve.  I go here pretty frequently.  The \"piece de resistance\" is the pizza roll - pretty adventurous and very good!  The service is super fast and attentive as well.Also, they have great lunch combos - soup, salad, and 2 rolls for only $9!"], ["Sanjay R.", "Great sushi rolls and very reasonable prices. I tried the Holly Roll, Salmon Skin Roll, and Karate Roll. All were well done! A quiet spot in the middle of a busy an crowded tourist area."], ["JR C.", "We were told by multiple people that Ichiban was THE place to go for Japanese, in Nashville, and we weren't disappointed.  The service was great, the fish was fresh and tasty, and everything was spot on.  This was a little more pricey than your standard strip mall sushi place, but the quality was there.  We'll definitely be back, the next time we're in Nashville!"], ["Alexandra H.", "They don't offer raw salmon, which I've never encountered in my life. Also, most of the sushi was way too large, and the spider roll tasted bitter. I've never been to a sushi place where I didn't finish a roll. We didn't finish 3 of our rolls. They also don't specify that a tuna roll is actually only nigiri sushi. Not at all impressed, and I will keep my business with samurai and Ninki."], ["Michael W.", "You can cheat westerners, but by no means it is good japanese food! Really lack 'skill-man-ship'(匠人心)."], ["Marion S.", "Found this on yelp and was excited to try something different besides BBQ!  Place was as described - hidden away down 2nd ave, with a cozy feel. We were ushered in immediately and sat in a booth in the back.  My husband and I split a Yaki soba which was not specifically on the menu but they assured us they had it and it was delicious!  The entree came out quickly and then shortly after we received our sushi -again fresh, well made and plenty for us to share.  I would go there again and again if I lived here.  Trust the reviews and give Ichiban a try!"], ["Jim D.", "Ichiban has been my favorite Japanese restaurant in Nashville for 22 years.  My reason starts at the door.  The room is nice, moderately lit and inviting.  There is a full bar with a good but rather small sake list.  Way in the back is the sushi bar which looks nice but I've never eaten there.The service is really good. We have been there enough that not only do they know our names but which sake we drink and what we typically eat. We always have service with a smile.  The food is wonderful.  My wife loves the sukiyaki and pork dumplings.  I usually order two crunchy shrimp rolls (which they do better than anyone else in town) and an order of kushikatsu because I obviously need more fried food in my diet.Give them a try!"], ["Rick D.", "Had a hankering for fish tonight.  Solid sushi experience that I didn't expect in the Midwest."], ["Shana B.", "To my surprise I came back after 15 years from living NYC and this restaurant was still here! Was my favorite back then and still is now. NY has some of the best sushi bars in the US  and this place holds up to the bar. Fresh and surprisingly new things I've never tried. The only thing it lacks on is atmosphere otherwise staff and food is wonderful. Will never stop going. #1 in my book!"], ["Don W.", "Ate lunch here the other day, while in town for a conference. Favorable reviews and walking distance to hotel led me to choose this restaurant from among three or four seemingly comparable choices.In a nutshell, I thought it was great. Giant clam and Uni were not only on the menu, but available. The albacore was phenomenal, and they had sea eel, which isn't always available at many sushi bars. I had these, as well as their Yellowtail, also excellent. They had a number of rolls and specialty rolls that several fellow patrons ordered, but they're not my thing.Highly recommend."], ["Julina K.", "Ichiban is my FAVORITE Japanese Restaurant here in Nashville. They have the Best Sushi, my favorite is the Dixieland roll, even their crunchy shrimp room is good. I ordered it for a friend that doesn't like to be too adventurous with sushi. I so always order the yellow tail fish neck & the soup, I forgot what's it's called but they know exactly what it is because I order it every time I go. Normally it's ramen noodles, but I like the udon noodles instead with pork and veggies. But I guarantee everything there is delicious and fresh. Oh and I love the grateful dead drink, it's a Long Island with chambord liqueur. It's strong, but good."], ["Tom K.", "The Sign is a little difficult to find on this restaurant heavy avenue. Went here for a nice sushi double date where we found decent prices and sushi. The service was great and very attentive. Being from the New York area, I found the ramen sub-par. At first glance, it appeared to have it all. But to be critical, Broth wasn't full of the pork-based masterpiece flavor found in the east parts of world and United States (NYC). The noodles also did not have the same flare. I didn't finish the meal yelling \"Kaedama\"!"], ["Lexie D.", "My boyfriend and I were here visiting and we had a craving for sushi, as we usually do. We stayed at the Renaissance Hotel (which I do recommend) and the clerk at the front desk suggested we go there.Overall, we weren't impressed. My biggest complaint was the service. I HATE being rushed to read a menu and make a decision and within 8 minutes of sitting down the waitress stood over me to make a decision. I hadn't even looked at the sushi menu. My boyfriend ordered his usual and was not impressed with the Spider roll. I ordered the chicken teriyaki and again, not impressed. It was very small portion and the chicken was dry despite being soaked in sauce. We did order the Miso soup though and that was very good.Next time we are in town, we will definitely try something else. Overall, it was expensive for what we ordered."], ["Erin D.", "I and another person were the only ones eating in the restaurant on a weeknight. As I reviewed the menu, two waitresses hovered a couple of feet from me. I found this to be a bit annoying. I ordered the miso soup (tasted as it should), unagi sushi, crunchy sushi, and spicy tuna. The size of the sushi pieces has been one of the biggest I've eaten. The spicy tuna was the spiciest I've eaten, and it was so spicy I had a hard time finishing the sushi. My meal cost about $20.For the price, the restaurant was ok, but ambience could be improved. There's nothing that screams, \"You have to come back again!\" and so I give an average rating. If you're downtown in Nashville and want sushi within a walkable distance off of the Broadway strip, this will suffice. But don't expect anything glamorous!"], ["Steve W.", "I've spent the last 3 weeks trying to convince my wife to get sushi with me. I don't like it that much, but I've been craving it like pregnant women crave ice cream and pickles. Finally, at the end of our long weekend road trip, she caved. Unfortunately she waited until we were in Nashville vs a coastal city, but I wasn't complaining. I opened yelp and as it was freezing cold and we were walking from the country music hall of fame, I picked the highest rated place that was less than 1/2 mile away. They offered a decent lunch special which allowed you to get 2 or 3 rolls, but the selection was limited. It came with soup and salad. My wife got the veggie roll and spicy tuna. I went with the salmon and yellowtail. All the rolls were made fresh and quickly as you would hope for at lunch. The downside of this place was the service. It wasn't bad, but it was borderline abrasive. I know they were probably trying to help the work lunch crowd that was in a hurry on a Tuesday, but we had been seated less than 5 minutes and the waitress asked 3x if we had decided. Overall left happy with my warm soup (did I mention it was cold?) and tasty sushi. Hopefully those cravings don't come back around for a while."], ["Christina S.", "Small restaurant two doors off Broadway.  In an area where no food other than BBQ is present, I could live in Ichiban.  A great place for sushi and Japanese dishes.  I especially liked the Udon noodles, and all the sushi we had was great. I believe they close after lunch before dinner, so call if you are midday to see if open.   Across from Wildhorse Saloon."], ["Lake M.", "If you're looking for authentic Japanese in Nashville, this is your place: stellar katsu dishes, quality noodle soups, and a pretty good sushi selection of nigiri and rolls (I'm not much of a roll guy, but the Dixieland roll made an impression on me).Atmospherically, Ichiban is ideal for a handful of dinner settings, and the service is great: the servers tend to you when needed, but don't hang around when not. The gentlemen behind the sushi bar are friendly as well, and if you're well-versed on Asian culture or the ins-and-outs of the Nashville bar scene, you can have a pleasant conversation with them on slow nights.All in all, it's the best Japanese you will find for now in Nashville. It's Downtown, so you will have to pay for parking. It's on Second Avenue, so it is a little expensive. And it's geared toward a Western palate, so some of the soups hold back on the dashi broth and miso. But that said, I give it four stars; it's the best I've had in Tennessee since I moved back from Japan."], ["Jamie M.", "In from out of town and came to eat at Ichibon based on the great reviews. Too bad they were closed an hour before listed closing time and I won't get to try it. What a waste of time driving downtown and paying for parking!"], ["Lauren S.", "Best sushi in Nashville by far. They have a huge menu for everyone that loves sushi and for those that want something from the kitchen. If you like less common sushi like uni, they almost always have it in stock.I highly recommend their crunchy shrimp roll, salmon skin handroll, shimeiji butter mushrooms, chirashi, and anything that involves salmon or toro. Their tempura udon is worth a try in the colder months or if you want something not sushi. The Dixieland roll is great if you don't care about your heart and want to really splurge on fried roll goodness. Be sure to try their fried ice cream, mochi, or green tea cheesecake if they have it in!If you're on a budget, be careful with what you order. It's not hard for the bill to get up to 30 or 40 bucks a person."], ["Mink M.", "Japanese owned sushi joint. It's actually pretty good considering it's Nashville.I admit that I am a bit if a sushi snob but with the limited choices here in TN, this is a true gem to find.Parking sucks, it's either street or lots that charge about $10-15. Atmosphere is super casual, nothing fancy.The back where the ladies restroom is, that hallway is disgusting though cause there's a bunch of shoes lying around like it's someones house instead of business.Service is not exactly the best but it's not horribly bad either but definitely could be better.As long as you keep your expectations low than its fine. If you know sushi and love it you will not be blown away but you won't be disappointed either."], ["Ed W.", "Came here on a recommendation. It was late and about 49 minutes before closing.  I was treated as I was the first person of the day.  The sushi and sashimi was very well made and very fresh.  I highly recommend this place for lunch or dinner."], ["Kevin R.", "I had lunch here with a Co-Worker today.  It wasn't very good.   Walking in the place was mostly empty at lunch time so that should have been my first clue.  I ordered some sushi and it was average at best.   The interesting thing was the Soy sauce was terrible.  I tried the low sodium one first and it was so salty it was hard to swallow.  Then I tried the regular and realized it was the same stuff in 2 different bottles.  It wasn't even the good stuff... it was some generic crap that was down right awful. I  am shocked that the yelp reviews are not worse."], ["Robert S.", "I had high expectations when I arrived downtown to eat here.  After all, you Yelpers have made this the highest-rated sushi bar in Nashville!  The interior was dim, the mood peaceful, and polite chit chat could be heard over the background muzak.  What about the food, you ask?  The food was good in a way that reminded me of places other than Nashville.  For sushi, that is a good thing.  The service was polite and non-intrusive.  I did not eat at the sushi bar but I will make it a point to eat at the bar the next time I am here."], ["Rachel S.", "I was so excited to see a highly rated sushi bar a block from my new apartment. However after dining here... I was extremely underwhelmed. As a sushi snob who just moved to Nashville last month, I have been searching for something comparable to what I'm used to in Los Angeles. I'm still searching. Ichiban didn't have real crab- but instead told us the white fish imitation krab was \"real\"."], ["Mai H.", "Within downtown area, definitely no other sushi place can beat Ichiban. They put serious effort into making Ichiban as authentic as possible. Love their rolls, and the ramen was very decent. I will definitely come back for their sashimi and hotpot!"], ["Terri H.", "Great sushi!The Japanese atmosphere is wonderful.  Our waitress brought us a warm towel before we got started.  I know very little about Japanese culture so I assumed it was something they did and washed my hands with the towel.We started with tempura vegetables and they were delicious.  I then ordered a California roll and a spicy crawfish roll.  I try to order one that I know I like and one I've never eaten when I eat sushi.  Adventurous with a backup plan is how I play.  Both were delicious and I can't wait to return to try more house special rolls."], ["Jessica S.", "I recently moved to the Nashville area and wanted to find some decent sushi place - and I found it! Ichiban has a fine selection of sushi and the service was awesome! Great atmosphere as well."], ["Michael C.", "In Japanese, \"Ichiban\" means \"Number 1\" or \"The Best,\" and this place is. My wife and I overnight in Nashville regularly on our way to points north. We have dinner here on nearly every visit and have never had a single problem. The food is fabulous and the service is as good as you're going to get from Japanese sushi chefs and wait staff. We have eaten in (literally) a couple hundred sushi joints over the years and would rank Ichiban in the top three.If you really want to know that you're in a top-flight sushi restaurant, it's not the stars on Yelp that make it so -- it is when you look around the restaurant and see that at least a couple tables are occupied by Japanese people -- not Japanese Americans speaking English, but Japanese expats who come for a taste of home and a place where they aren't required to speak English. Ichiban is one of those places."], ["Jim L.", "It's good to see Ichiban has overall good reviews, as it is one of my favorite places to eat in Nashville.  It has become a tradition for us to go here before almost all Nashville Predators games and other downtown events, so needless to say, we have been here a lot over the years, probably more that just about anyone.So it's a little disturbing to see reviews that complain of inconsistency in the food and poor service.  I have never experienced either at Ichiban.  It is consistently excellent on all fronts, in our experience.  Both the sushi and cooked items have never been a disappointment.Admittedly, there have been maybe two times over the years, when the restaurant was significantly busier than normal, so it took a few minutes longer to get drinks, etc., but this is far from their normal level of excellent service, so we understood.I will go here to eat at every opportunity when I'm downtown for the evening.  I love this place."], ["George F.", "I am always cautious about sushi unless I know people who have gone, but the reviews gave me confidence. I had the chicken and beef teriyaki meal which comes with both + miso soup (fantastic), salad (good), 5 pieces of sushi (great) and a california roll (what you would expect). All was fresh, hot, quick and a friendly face and sushi maker at the bar. Also, it's a great quiet respite from the flashing neon and blaring music of Broadway."], ["Sean T.", "Quality and service have both declined significantly in the past six months.  We have take this one off our list."], ["Elijah A.", "Unfortunately, my business partner and I went there tonight to interview a candidate. It seems that the restaurant is permanently closed."], ["Terri W.", "The service is terrible.  This was not a one time occurrence.  They are impatient and try to hustle you out.  The food is wonderful and the only reason I go back.  The tempura chicken and box lunch is incredible."], ["Yoie L.", "I went with my boyfriend while we were vacationing in Nashville. I am pretty picky when it comes to sushi. We got different types of sushi. They were ok, not super fresh, but I didn't get a stomach ache afterward. Like other yelpers said, the waitress seriously looks like she was a drug addict back in the days. I wouldn't want to go back if we were to visit Nashville again...but we might have to if the bf decides to go to school there in a couple of years. yikes."], ["Ryan P.", "This is the best straight-up sushi downtown.  They have a great selection of rolls, but there's something about their hotate nigiri (scallop sushi) that stands out.  It melts in your mouth and is almost sweet enough to be classified as a dessert.  The prices are reasonable considering the quality of the food, and they often have cuts of tuna that lesser places sushi restaurants in Nashville can't get.  The staff is knowledgable and helpful."], ["Benjamin S.", "My fiance and I had been wanting to try this place out for some time now. We had intended the trip to be a gathering of many of our MTAC friends for dinner before the evening's activities. However, approximately half our party bailed on us at the last minute (literally) and there was no time to call the restaurant before we got there. They were not happy we did not give them a heads up, but eh... what could you do.Anyway the menu here is vast and in both Japanese and English. I had the miso soup and shrimp tempura soba. It was really good and tasted very fresh. Our server was very patient with us, as none of the people in my group, myself included, had ever been to Ichiban. I hope to return soon and truly put them to the test by trying their sushi, which I have heard good things about.Overall it was a great experience and walking into the restaurant you felt like you were actually stepping into an establishment in Japan, thus adding to the authenticity.My only complaint is that the menu made no mention of spinach being in the soba... which I had to fish out. While I won't dock them for this, it is still a bit upsetting as spinach is not a common ingredient in Japanese cooking."], ["B L.", "Sushi in a land locked city such as Nashville can be a tricky proposition, but Ichiban does a nice job of offering a variety of tasty options.They have a variety of different rolls from which to choose, and you can order any Nigiri as Sashimi, but they don't really have a sashimi menu.  The rolls were well done and the fish was probably about as good as you are going to get in Nashville. (I think Ken's is just as good).   I stuck with the more traditional rolls - if you like the mega-cream cheese filled- deep fried rolls, this probably isn't your place.   We asked about an omakase, but they were a little unhelpful on this.  Our waitress told us to just pick a price.  Despite us asking several times what price range she would recommend, she could not tell us.   I would go back if I were downtown, but I think Ken's is just as good.   Cork fee was only $10!"], ["Mark S.", "I have no doubts this is as close to real Japanese food as can be found in Nashville in the sense that there is sooooo much more to eat in Japan than just sushi.  I seemed to have missed writing a review from my previous visit a year ago.  Perhaps that original visit can best be summed up as saying that I ate lunch here on Friday, followed by dinner on both Saturday & Sunday during my visit to Nashville on Halloween weekend.For the Friday lunch I ordered Katsu Curry Rice along with a side of Horenso no Goma-Ae (steamed spinach with semi-sweet sesame sauce) and chicken liver yakitori.  Little did I know when adding those side items to a lunch entree that came with a salad and side dish that they would be serving me a \"Bubba-sized\" portion of tonkatsu pork cutlet with the curry rice.  It was huge, like what would be served for a whole family in Japan.  It was also very delicious, both for lunch and then also the rest of it that I had wrapped up to go for dinner later that night.  All the lunch portions I received were bigger than expected, so definitely a great value, and all were to my liking too.  If I worked in this downtown area you would likely find me here eating lunch almost every day!Having eaten here previously I already knew about the \"osusume-ryoui\" specials menu that is only available in Japanese.  I mostly ordered from this menu for both dinner nights, but my recollection of everything I ordered is a bit shaky now.  Perhaps from drinking too much sake.  Several of the items that stick out are Geso Karaage; whole squid tentacles fried in a very light tempura batter. These are highly recommended as long as you are not squeamish about eating 6\" long tentacled squid legs.  These are waaaay better than fried calamari IMO.; much better tasting and less batter.Tai Sakamushi - snapper head and collar steamed in sake.  Fantastic tender snapper meat that is well worth picking and sucking out from all the head bones and plates.  When eaten properly all you have left at the end is a pile of loose, stripped bones.  Don't forget to eat the best part, the eyeball!Tororro Natto - slimy tororro (grated mountain yam) and sticky natto (fermented soybeans) together in the same dish.  This hardcore Japanese health food that even even many Japanese people may not care for.  Only recommended for the most adventurous international cuisine junkies, but I love this dish."], ["Elisha M.", "I love the atmosphere here. It's the perfect place for a date because of the ambient lighting. It's also a good place to load up before a night crawling on 2nd Ave.The food is delicious, the people are friendly, and they have a nice selection of sake, beers, and plum wine in addition to more domestic offerings."], ["Travis A.", "I find it interesting that Ichiban is listed in most Airline's in-flight magazines as one of the best sushi bars in the country. I definitely think of it as one of Nashville's best. I've been coming here for as long as I've lived in Nashville and I have never had a bad experience. The food has been consistent and the service has been good. They have the best Spider roll that I've ever eaten anywhere, including both coasts. The Sushi pizza is one of my favorite sushi creations, ever. It takes a #2 next to the Kerry Roll at Brothers Sushi in Woodland Hills, CA. Go there if you're in town. yelp.com/biz/brothers-su… I'm glad this place is still going strong... just wish I had better luck parking downtown. Aside from that, the only real criticism I have is that they need to redo their menus. They can be confusing for those not used to them... in fact I don't think they've changed in 20 years."], ["Virginia L.", "I don't know why I was eating sushi in Nashville, but it seemed like a good idea at the time.  Turned out to be a good choice."], ["Natalya S.", "Absolutely love the sushi at this place!  I am extremely picky when it comes to my sushi, and I haven't had a bad roll and have ordered most of their specials and probably had almost every type of fish they serve. The service is also really good and the price is great considering the quality and flavor of their rolls.  If you are in the mood for sushi, I highly recommend this place!  The restaurant is not particularly large and decor is fairly standard, makes it nice to go to with a small group of friends or co-workers."], ["Zeb M.", "We had Ichiban for an early dinner yesterday and it was great! Our server was nice and very attentive (I don't like my glass to be empty), and you can taste how fresh the rolls are! Parking can be a hassle downtown, but I would definitely come back again!"], ["Jerome O.", "Been there twice, loved it twice! Nice service & very good food - authentic Japanese, you can even find Natto there... :-)I really liked the the broiled squid & scallop sashimi... Among many other things!"], ["Erin J.", "Any time we go downtown for a concert, or to entertain out-of-towners on 2nd/Lower Broad, we stop by Ichiban.  We joke that it feels like a bento-box inside - lots of little compartments on the ceiling, and the booths are sort of like little compartments or cubbies.The sushi is always good; nothing too creative but it's all solid.  BEST veggie tempura in town.  We hit up the early bird special sometimes, can't remember the times but I believe I remember a shrimp tempura dish.  We always get great service here too!"], ["Mike M.", "very good service. Excellent sushi. Also had the tempura fried ice cream which was also good.  Authentic as it gets. More Japanese people here than any other nationality, so proof enough for me. If you like sushi and authentic Japanese it is a must visit in Nashville."], ["Will M.", "This review is for the sushi.  You are in Tennessee, a landlocked state, so your fish is going to be frozen.  Best in Nashville, but I haven't tried Virago.  The salmon was real high quality fish with nice veins of fat.  A lot of reviews for non-sushi items were subpar, so I won't even waste my money.So, for non sushi items, I'd probably check out the Cool Springs area for Japanese restaurants like Shoguns, because Nissan HQ is there.  There's also AYA sushi in M'boro.  Sonobana is also decent off white bridge rd."], ["Melissa L.", "Maybe it's because they were my first sushi place even though that was a DISASTER, but this is still my favorite place and still one of the best in town and consistent in quality.That first attempt, well I was about as ignorant about sushi as they come yet our boss wanted us to take him to Ichiban for Boss' Day so we did, even the two of us that had never had sushi.  We made the mistake of saying we had never had sushi so they suggested an assortment BIG MISTAKE.  Thank goodness the other girl and I had agreed that one of us would order sushi and the other would order something more normal.  The assortment was nigiri with mackerel, tuna, salmon and who knows what else.  All I know is the mackerel nearly did me in and it was a good thing we had the bento box which was wonderful recognizable food.I kept going back with coworkers ordering the bento box trying all the different offerings they had for it.  Eventually I tried a California roll and started eating them.  Then crunchy shrimp and spider rolls.  Finally someone made me try his roll with eel and I liked it though the roll was about twice as big around as the typical maki rolls so it was hard to eat.While I have grown in my taste and acceptance of all kinds of sushi, mackerel nigiri is still NOT in my diet.The ladies here are nice and efficient.  The food isn't cheap but it's seafood, we are in Nashville, and their seafood is always fresh and good.  Everything I have had is good.  The only dish I am not crazy about is the kushikatsu.  I still love the Bento boxes because I can get a taste of everything and they will substitute a roll for one of the two entrees.  Yakiniku is a stir fry of beef and onions in a ginger sauce - wonderful and full of flavor.  And I am a sucker for good tempura and their tempura is some of the best I have had anywhere.  On the bento box you get two tempura shrimp and I would say about six pieces of vegetable tempura.   The bento box comes with two entrees, rice, their version of potato salad, a few pieces of steamed broccoli with mayo, half an orange, miso soup and salad with ginger dressing.  As you probably figure, I like it with the yakiniku and tempura but the negamaki which is a piece of thinly sliced beef rolled around scallions and then grilled and sliced thinly is also very good.  The goyza dumplings are good. and the shougayaki is sort of the pork version of yakiniku.The calamari and fried soft shell crab are also very good as are any of the noodle bowls.  I haven't tried it but they have a curry dish on their lunch menu that I have heard rave reviews about from a coworker.All in all, this is still one of the most consistenly reliable places to get good sushi and Japanese food in the Nashville area."]], "Nomzilla! Sushi Et Cetera": [], "Wild Wasabi": [["Josh C.", "This place was great!  We started with a tempura appetizer, which was pleasantly priced at $3.50.  We were able to get an advocado roll and a chicked skewer appetizer for my daughter for $6.00 total, and she loved it.The combination of rolls offered was impressive.  They really like to integrate fruit into a variety of the rolls to make things different.  My wife had one that included Mango and coconut.  She loved it.I had the fireball roll, which was kind of a deconstructed group of Krab and tempurashrimp, mixed with a spicy mayo and green onion slaw, on top of a roll.  It was quite good.  My one worry was that the rolls didnt' have listing prices, and I was expecting our bill to be quite large.  We have four rolls and two appetizers.  Instead, everying came back for $41 and no roll was over $8.50.We loved the quality, the variety and the prices were quite good.  We WILL be returning.  We consider this a great find."], ["Jonathan B.", "Atmosphere:If you don't get parking on the street there is a lot. Lunch rush can sometimes cause a line but it moves fairly quick.Service:I typically come here for the lunch buffet but I have, on occasion, come here for dinner.I've never had an issue with their service. Everything comes out fairly quick.Food:Lunch Buffet wise - they don't offer anything amazing Sushi wise but... you can't really complain about the quality of the rolls they do have out. I have to find anything comparable in Nashville.They offer hot items but I don't really get any of those.They also offer a Hibachi grill as well so there's that as well!Dinner wise I typically stick to the sushi or Udon noodles. You can't go wrong with either one.Overall:I've never had a bad experience here. If you have a sushi kick then this is a must try!"], ["Kristie A.", "I love this place especially their lunch buffet!Oddly enough, I don't come to their lunch buffet for the sushi but for their noodles and fried rice. They are so good. They have got to use sushi rice for their fried rice because it's delicious. Sushi roll wise, don't expect anything grand. One good thing tho is they have sashimi! That's a deal for a buffet. My fiancé loves this place just for that. Their lunch buffet also had hibachi. So you can have your meat and fried rice cooked fresh.It's a family owned restaurant so you always have the same servers and they're all really nice.I also come here to get nabeyaki udon. Soooo good! Best in Nashville. You definitely need to check this place out. They validate your parking across the street for $1 so it's not bad!"], ["Billy H.", "So, this is the story. I had a colonoscopy today and when I got out I was HUNGRY. I had seen that this place and a sushi buffet. I went with a mission to do some damage. My review is based on the lunch buffet on a Monday at 12:45pm. The lunch buffet is from 11am-2pm (Monday thru Friday) and is $11.50. The lunch buffet consists of \"appetizers, fresh sushi Nigiri, sushi rolls, hibachi grill, specialty entrees and desserts\". So, working from the beginning of the buffet, you have the hot entree items. They had spring rolls, sugar donuts, chow mien noodles, some kind of spicy chicken that tasted more Mexican than asian but was good, fried rice that was a little dry, beans, a teriyaki chicken and mushroom dish that was good, and some tempura veggies. They didn't have labels for the names of the dishes, but they seemed pretty self explanatory, well all but the Mexican looking chicken. Moving down to the Nigiri, they had red snapper, salmon, and shrimp. Next to the Nigiri was the sushi rolls. They were as follows, crunchy crab, crab cream cheese egg roll, tempura roll, chicken tempura roll, spicy salmon roll, California roll, spicy crab, and then special roll 1, 2, and 3. I kind of wished they had write in names for the special rolls, but I still ate them.Next to the sushi is the lettuce bowl, you're able to make a little salad with ginger dressing. They've also got bowls with mushrooms & chives & you're able to have a little bowl of soup. At the end of the buffet is the hibachi grill. The grill is a little confusing if it's your first time. There isn't any toppings or meats to pick out on the plate like some places. The man working the grill wasn't too friendly at all. I walked up to the grill & he said \"what do you need?\" very sternly. I asked what the meat they had & he said \"shrimp or steak\". I picked steak & he didn't acknowledge that I'd said steak so I stood there for about 30 seconds then walked back to my table. About 5 minutes later he started to bang a bell, the kind they use at a hotel front desk. I walked up & got my plate. It was all very odd. The desserts. I didn't see any desserts at all, unless you're classifying the sugar donuts as dessert. Overall, I really liked the experience. The servers were very sweet & attentive. The hot food was pretty good for buffet food, asides from the dry-ish fried rice. I liked the sushi they had. It wasn't the best ever but was good for a buffet. I've been to Sushi Train a few times & I think this place has better sushi, mainly because it tastes a little fresher & more variety. Sushi Train is about 3 bucks less though. The steak & shrimp hibachi was good, not great. I wished I'd gotten a little dessert. FYI - Around 1:30pm the sushi options begin to clear out."], ["Columbia J.", "The whole experience was average. Nothing really stood out. The price was fair and the sushi menu was decent."], ["David L.", "So I wanted to try all the sushi places in Nashville because I'm obsessed with it. And this was my 3rd sushi restaurant and it is my favorite so far. I had pretty bad Asian food here in Nashville so my expectations were low. I was pleasantly surprised by this place. The staff was very welcoming and it wasn't too busy at lunch time on a Saturday. I ordered the No. 9 and a Sakura roll. I took one bite of the No. 9 and I was in heaven. The salmon was fresh and the tempura inside was seasoned to my taste. I was just so surprised that the fish was so fresh. Then I had the Sakura roll which had crab and strawberries. It was interesting but I wasn't really a big fan of it. Maybe if the strawberries were sweeter cause they were too sour for me. But I had an overall great experience at this restaurant. Omg I love how everywhere in Nashville they split the checks it makes going with friends so much easier. This place was amazing and I am from CA and I've been to Japan but they don't have these kinds of rolls over there."], ["Rany O.", "Don't go here for dinner! The sushi is really good and fresh, but if you are hungry and looking for a fast and yummy dinner, please find another place. The waiter took forever to get the orders and later the food (about 45 mins) and the place wasnt even crowded. I truly recommend their lunch buffet, and their food is delicious. But maybe a friendlier ( and more) waiter."], ["Bobbi N.", "Soooooo good! Husband and I went for lunch, did not disappoint. We got a strawberry roll, godzilla, and I can't remember the other. It was a spicy roll qith ftied shrimp on top. But so delish! The staff was super nice, and it wasn't too busy. Don't pass it up, try it if you like sushi."], ["Ryan H.", "I love this place. Best Sushi in town. It is within walking distance from busy, downtown Broadway yet not crowded or overly saturated with the typical party goers. My first date with my girlfriend was a visit to Wild Wasabi and we have made it a point to visit this fantastic sushi spot at least once a month. Wide selection and great customer service."], ["Rachel S.", "Yum! Had a great time here last night. Love the spicy scallop nigiri. This is one of the best spots for Sushi in Nashville."], ["Loren B.", "Food: AWESOME!!!  Service: AMAZING!!!  Sweet people, delicious food.  I plan to be back!!!"], ["Luisa C.", "Um, lunch here was so amazing. So glad we made the stop while on our roadtrip. The place was really clean, I literally saw various staff members doing a walk through of the restaurant and wiping down surfaces/picking little crumbs off the floor. They put a lot of effort into it and it shows. I'm not a germaphobe, but it feels good to eat at an establishment that is clean and well-maintained. Other pros:The food is yummy. There is crack in those little springrolls. Baby friendly. My 13 month old ate 2 california rolls, some udon, and string beans. He even brushed his hair with the chopsticks and nobody flinched. ha. They validate parking for $1 but only for 90 minutes.Tip to locals: I saw people doing take out off the lunch buffet. The tempura veggies and items are meh. Kind of chewy. The batter was probably over mixed or something. Not sure. They should replace that item with something else. If you're expecting rows upon rows of food options..with random things like pizza and french fries...this is not it.This place has good sushi, with a couple other options. Don't come here expecting a greasy, pop a button off my pants, MEGA CHINA STAR BUFFET. This place is much nicer than that."], ["Mia F.", "Best weekday lunch place for sushi. I've been going here for years! Fresh and prompt. Buffett is great, but you must eat everything on your plate :-)"], ["Micheal P.", "Listen, everyone and their mom knows the best sushi place in Nashville is Ginza. But if we're talking value, Wild Wasabi wins the the award for largest quantity of quality sushi for lowest price, hands down. I'm only talking about the buffet. $11 for as much sushi as you can fit into your face? Come on! That sounds like a challenge to me!When I was new to the buffet and naive, I made classic noob mistakes, like putting everything I saw on to my plate. That's the number 1 buffet trap! Don't fall victim to it. We all know what we're here for: the salmon nigiri. That's right my friends, they serve fatty delicious slabs of unadulterated salmon on little beds of rice at this place. You know how I know that the salmon nigiri is the prize item on the buffet? A full plate of 20 is gone in 3 minutes flat. Hopefully you can get a table near the front so you can be the first in line when the chefs refill it. That's what we call playing to win, my friend.if you've got some sort of salmon allergy, the rest of the buffet is good as well. I've been known to grab some tempura veggies here and there. Don't leave any sushi on your plate, or they'll charge you 50 cents a pop. I told you this was a challenge!Make sure you get your parking validated!"], ["Nancy V.", "Yum- pleasantly surprised.  Really great prices- 4 sashimi piece appetizer for $4.95 and most special rolls are $11.95.  Service was quick and friendly.  Food was good but not the best I have had BUT I will say it may be best in the area.  I am just comparing it to sushi I've had in CA and in Hawaii.  Really clean space and spacious."], ["Kaitlin V.", "Let me start by saying the food is to die for. The sushi is amazing.  This, however, does not make it worth the credit card theft.After talking with my credit card representative this morning about getting my fraudulent charges taken care of, and talking to my coworkers, we narrowed it down to Wild Wasabi.  There was one place we all all charged our cards together on the same day: Wild Wasabi. They had our credit cards FOREVER in the back, and then *magically* several us had similar fraudulent charges days later (flights to China, etc). I can't say I don't recommend the sushi, but if you choose to go, make sure you pay with cash."], ["Jordan F.", "This is the best sushi I have had in Nashville so far. Everything down to the fried rice was authentic. The staff was friendly and the dining area was clean. I had 4 different rolls of sushi, all of which I had no complaints. Everything was fresh and tasty! Wonderful experience! They were sold out of green tea mochi while I was there but they made up for it with the green tea ice cream!"], ["Charles T.", "The Wild Wasabi is worth the money! I tried the Godzilla and wasnt let down. Oh and they do validate your parking as well."], ["Kip D.", "This place has a really good lunch buffet, that I thought was really good.  I like the fact that it's in Cummins Station which is unique spot in Nashville. The sushi was great for me."], ["Jeff C.", "Great place.  A family owned and managed sushi buffet with hibachi grill.  This is one of the best places for sushi, at any price.  They can be VERY busy at rush hour, so keep that in mind.  Free parking under 90 minutes.  I judge every piece of sushi I eat-and that's alot-against Wild Wasabi."]], "Sakura Japanese Cuisine": [["Enka W.", "I love this place and the people are so nice. I think it's the best sushi in Nashville, and this is coming from someone who grew up on the beach eating seafood! Try the sumo!! So good! I eat here once a week!"], ["Leighton B.", "Sakura is your average Japanese restaurant and the food is just fine. I went for lunch on a weekday and the restaurant was pretty sleepy. Despite the low numbers of customers, the service was a little slow, although our large group might have had something to do with the slow service.They have AWESOME lunch specials. 2 rolls for $8, 3 rolls for $10, and Bento Boxes under $10. I got the shrimp Bento Box, which was $9. It came with shrimp, snow crab sushi, vegetable tempura, salad, fried rice, and miso soup. I liked the sushi and the miso soup the best. The shrimp didn't taste very fresh and they really skimped out on the add-ins in the fried rice. When the waitress brought it out, I thought they had messed up my order and given me plain rice because it was so plain looking. But for the amount of food I got for only $9, I can't complain."], ["Josh C.", "This is our go to sushi place, and there are so many things to love. First, they have affordable prices for almost all their roles. I do wish they had a happy hour or a 1/2 off day, but it's affordable with the menu as it is. The sushi is good and fresh. I've been happy with the sushi and sashimi fishes I've had. The rolls are also done well, with a wide variety options.Their non-sushi options are very good. My wife loves the udon soups. Their tempura is extremely good. It's a light batter that has more fine crumb to it than other tempuras.  My favorite are the bento boxes. The sheer amount of food that comes for 15 dollars is crazy and it's great. The different meet options are very good, from teriyaki chicken or salmon to chicken or pork katsu (very good). They also have a sushi or sashimi option for s dollar or two more. It comes with shrimp and vege tempura, soup, salad, 3 goyoza, fried rice (my favorite I've ever had), a California roll and the main entree. I actually eat the hot entrees and keep the chilled stuff for lunch the next day. Besides this, they really appreciate you as a customer and work to be part of the community. We are very happy customers."], ["Kerri J.", "The ownership must have changed in the last few years because the staff seems to be a much friendlier crew. Now about the food. Every roll we ordered was delicious and fresh. The food is displayed on a large screen so that you know what you're getting. It's hard to believe you can find great sushi in a little corner of a shopping plaza in Bellevue. Don't bother with the other ones around town. This one is the only one worth going to."], ["Deborah F.", "Sakura has wonderful food, excellent atmosphere, friendly staff and is just an overall sweet place to come and enjoy a tasty meal!"], ["Cassie S.", "Sakura has good sushi.  And not just good for Bellevue (or Nashville), but actually good!  They have a really large selection of rolls, very creative and everything I've tried has been delicious.  The fish tastes really fresh (especially as compared to other sushi spots in Nashville)..  Prices are reasonable for the amount of food you get (and seriously, if you get a bento box, it is SO MUCH FOOD!!).  Whether you dine in or carry out, service is quick and friendly.  We are lucky that Sakura is our neighborhood sushi place, but I'd travel for it, it's that good!"], ["Judy Y.", "My son and I got excellent service there tonight. All the food was extremely fresh and tasted great. When I found out I was allergic to one of the ingredients, they went out of the way to get me a new dish that I wasn't allergic to. That (Beef and Udon soup) was excellent. They are very kind and attentive there. Will visit again!"], ["Barry M.", "Nice place.  Well lit. Friendly and informative staff.  Great shashimi, nigiri, and creative rolls.  All the fish is fresh.  And to top it off they gave us fried banana for dessert.  We both loved it.  Yum!!!"], ["Janice A.", "Best Sushi around.   Fresh, fresh, fresh.  Owner is awesome.  Love this place eat here two to three times a week."], ["Hailey B.", "This is literally the best sushi you could eat anywhere around the area! I won't go anywhere else for sushi now, and they have beyond enough sushi roll choices! Service is great and the atmosphere is great!"], ["Bill P.", "I love this place. I go down to Bellevue plaza roughly once a week to eat. Once this place opened I figured I'd try it out. First time there had a bento box, pretty good but not really my thing. Second time I went was for dinner and I saw they had hibachi on the menu.That was the end of my decision making. Now I go pretty much once a week, get the steak, shrimp, and scallops hibachi, and enjoy some sake. The staff is very friendly and treat you like an old friend, not just another customer. Food's great and the hibachi is top notch. Can't recommend this place enough, love their food."], ["Whitney G.", "Great for traveling close to the interstate john roll is on point! Owner is really niceBathrooms are a lil smelly"], ["Mahya E.", "This is a restaurant definitely worth eating at. The staff was super sweet, which goes a long way towards my dining experience. They were funny too! The sushi was quite good. I've had better, but there was nothing to complain about. I guess I'm a bit spoiled because I'm used to living closer to the ocean. Sakura is in my new neighborhood, though, so super convenient. If you love sushi, you may not be amazed here, but you won't be disappointed either.I left pretty impressed and very happy and full! Also, they gave the hubby & I our miso soup on the house for pretty much no reason! They are really sweet people!"], ["Marissa F.", "Amazing sushi. Pictures show what the rolls are. They are scrolling on a tv and also receive a hand out with names and color pictures!!! This is helpful for those new sushi diners.  Will be coming back again and again. Best kept secret in Bellevue!!!"], ["Katie M.", "Amazing Sushi, soups and appetizers! The staff is equally amazing! A great selection of rolls and accommodating to special requests! I eat here once a week now!"], ["Greg L.", "Publicity Restaurant was closed at 5 pm on a Monday, so we tried this place nearby. Very nice first time experience at this Sakura. Houston Roll was inventive and tasty with sirloin, shrimp, and crab. Gyoza dumplings were perfectly seared. Great to see such a restaurant in the area. Server was unfamiliar with Kirin being a Japanese beer, but they did have it when I requested it. It tends to be a bit noisier than most Japanese restaurants, but the great food and fast service are well worth the visit."], ["Hallie H.", "I ordered the spider roll and miso soup for carry-out. Everyone was very friendly and the service was quick - I just didn't really care for the roll or soup. Not my favorite."], ["Tart L.", "Sushi here at Sakura is equal to some of the sushi rolls at nearby Lemongrass, also in Bellevue. But, as expected, it does not rival the excellent sushi at traditional Ninki or Zumi. The waitress was prompt which was appreciated, but the atmosphere is relatively nondescript. I don't recommend the hibachi selections since the grill is in the kitchen. Part of the joy of hibachi is watching the chef perform his sizzling magic, so we just stuck with the sushi. The California roll was best, generous in size and fair in price."], ["Batia K.", "About time there was a good sushi place in Bellevue. Each roll was fantastic and the house salad to die for."], ["Epsilon K.", "Went with a group and ordered about 8 rolls. All were fantastic! Probably the second or third best sushi I've had in Nashville, and best in the Bellevue/bellemeade area. The presentation was above and beyond and the service was attentive, knowledgable, and very happy to serve. We went during lunch, with only a few people there, feels like an undiscovered joint for sure. We will all be coming back for more!"]], "O'Sake Japanese restaurant": [["Stephanie L.", "I have eaten at a lot of sushi places in Nashville and this one is definitely my favorite! Mostly because they have Fruit Sushi! I always love sushi rolls with fruit in them and they have a variety of them! My favorite roll is the Triple Roll. It has kiwi, strawberry and mango on top of the rolls. Inside the roll is shrimp and cream cheese (but I get the shrimp switched out for crab) and it has eel sauce drizzled on top! YUM!I have also had their miso soup, salad and teriyaki chicken, which was all amazing as well. If you like sweet wine, I suggest you try the plum wine. It is so good. I couldn't decide between the plum wine or plum sake and the waitress was nice enough to give my friend and I a sample of both. I chose the wine, but both were good."], ["Kaleena 'Kala' H.", "My fiance and I had a sushi craving and decided to try this place for lunch after a friend of ours recommended it to us. The environment was very relaxing and not busy at all. We were also able to find a parking spot in the back lot area (for free!). The staff was nice and very welcoming.I decided to have some of my favorites, the gyoza and the California Roll/Crunchy Crab roll combo with salad. The salad was delicious and I loved the creaminess of the dressing. The gyoza was cooked just right and tasted great. The sushi was fresh and yummy! I enjoyed every minute of my meal...I even tried some of the squid tempura that my fiance ordered and loved it.I can't wait to go back here and try some of their other food! :)"], ["Libby B.", "I hadn't really done much sampling of local sushi since I got here, I had an old favorite and I stuck with it, until a couple weeks back when a picture in a daily deals app caught my eye.Well, needless to say, I've found my new favorite sushi place, hands down. I might have even developed a sushi addiction - I've already been here enough times in two weeks for the owners (who are super, super sweet) to recognize me when I walk through the door! The place is tiny, you could miss it if you aren't looking for it, but I have yet to see it really crowded. As far as prices go, it isn't bad - two people can usually make it out under $30, and they have several deals going on with their rolls - 2 for $10 or $15, including a salad or soup. Their sushi is always fresh and excellent, and always arrives so beautifully made and artfully arranged, I almost feel guilty about eating it...almost! My personal favorites so far have got to be their Lobster Roll and their Volcano Roll, both super delicious. I do know that one of their specialties is their Bay Scallop Roll, which I'm anxiously looking forward to trying next time I go in, which, let's face it, will probably be soon - I can hardly stay away!So, all ardent sushi lovers should absolutely give this place a try; just don't blame me if you can't stop coming back!"], ["Keonmyeong L.", "The thing is, everyone usually talks about the sushi in O'Sake. I feel that what really differentiates O'Sake from Samurai across the street is that it actually serves warm food beyond appetizers. I really enjoyed the pork cutlet and I would eat it really often before the menu got changed and it got removed :(. I also tried the yaki udon, the ramen, and the bulgogi (yes, I know, it's not Japanese food, but still..) and I moderately enjoyed all three items. If you're someone who lives near the place (like me), this is THE place to get quality warm Japanese or Korean food."], ["Grace A.", "O'Sake is one of the most underrated, best-kept secrets of the Nashville sushi scene. Every time I go it is half empty, but this just makes the servers more attentive, the food come out quicker and more thoroughly prepared, and the ambiance calmer. The food is fresh, the rolls fun, and everything well priced. When I feel like American-izing my sushi I go straight for the deep fried California roll, but otherwise classics like salmon, veggie, and the Alaska roll are great too!I don't understand how Samurai does so well being right across the street from O'Sake...maybe people just haven't tried both? Try O'Sake for yourself and tell your friends too (but not too many, the quiet adds to its charm!)"], ["Will Y.", "I found O'Sake to be meh, overall.  It's a bit cramped, but they do have a decent sushi bar.  The service was very friendly, but the large, bright TV ruined any semblance of proper ambiance.  The place screams Japanese sports bar.On to the food.  They do have a decent deal going on where you can choose two rolls for either $10 or $15 (depending on the type), which includes soup or salad.  Drinks are extra and are $2 for a can of soda.  The sushi was not really creative, my eel was slimy and old-tasting, the rolls were not tight and lacked flavor.  It's a good deal, I suppose, but I felt that the value was not spectacular at all."], ["Benjamin S.", "My fiance and I heard about this place from the same person who told us about Arigato Sayonara. According to him, the people who originally ran Arigatos, sold the place and opened O'Sake.Like Arigato's the menu has lots of options, but is not overwhelming. That being said, my fiance and I started with the gyoza and squid tempura which were perfectly cooked and delicious! As for the sushi it was very flavorful and fresh, but unlike their across the street competition, not overpriced. Moreover, they have a huge variety of combos which for me is almost unheard of to find, and the only other place with that amount of variety is Arigatos (Surprise). Also, the interior was far nicer than that of Samurai and did not feel as crowded.This is definitely a place I will take my sushi fiend friends when they come visit later this year from out of town. It is especially nice as there is FREE parking in the back unlike Samurai across the street where you are lucky if you can find a spot on the street, and even then you have to pay a parking meter to go have sushi that while just as good, is far more expensive than O'Sake."], ["Liz F.", "I love Osake so much! I'm a recent sushi convert and Osake has been my starting place. They have great service, a nice ambience (much less crowded than the other sushi restaurant on Elliston) and a menu with good variety. I love their gyoza, edamame, Dragon roll as well as anything with eel. Their miso could be better and I don't love that they only serve you soft drinks out of cans (and you only get 2). They have great teriyaki and soba too! I've never had bad service and they're rarely crowded when I come in so you get one on one attention from the server & chef. Love it!"], ["Steven S.", "Great sushi, great prices.  The server will help you to get the best deal based on what you're ordering.  The sushi is always fresh and extremely tasty.  We drive up from Murfreesboro whenever we can to enjoy a nice fresh roll.  The staff is very friendly.  Parking is fine.  Usually not crowded and that's a shame.  This place is better than what I've heard about the place across the street."], ["Harold D.", "Omg since the main sushi chef left I've had 2 bad experiences here! And tonight was my last straw! The miso soup was Horrible to the 10th power! I can't wait till the old chef opens his new bar downtown!"], ["Jessica T.", "Like most people on a budget, I love deals, especially easily attainable ones. So when I had a deal on my Scout Mob app for 50% off of O'Sake, of course I walked over and wanted to take part in some sushi!Looking at the menu, I decided on the two for $9.99. I read the menu thoroughly to see if any where it noted it wouldn't be included in a discounted price, but I couldn't find it (I could be wrong). The server asked if I wanted soup or salad, and I told her to surprise me and she brought me out both! I was happy with that (she didn't charge me extra either). I ordered a crunchy crab and california roll; i figured something a little different and something basic. I was not pleased at all with the california roll. I wish i could note why, but I'm not quite sure what it was. The crunchy crab roll was SO DELICIOUS!! I want to go back and order it again and try the crunchy shrimp.When it came time to get my check, I showed her my Scout Mob and of course, the deal didn't work towards it. I was kinda bummed I didn't know prior, since I wasn't happy with half my order, but the service was really good from the server, and the crunchy crab was so yummy, that I really didn't care.Can't wait to try that crunchy shrimp!!"], ["Mark H.", "Miso was OK. Nowhere near incredible. The sushi was okay, the fish was obviously previously frozen. The rolls were decent I give it 2 stars but give it a shot, it's sushi in Nashville..lol"], ["Mia C.", "This is my favorite sushi restaurant in Nashville!  I went to Vanderbilt and lived a block away so I came here pretty often.  It is definitely a hole in the wall and I believe they only have about 3 people working and cooking there so if you're looking for a fast meal, do not come here.  Because of the lack of staff, the service is actually pretty terrible in the sense that it takes a long time to get your food or anything for that matter.  However, they are VERY nice and the food is excellent.  I usually get the Bay Salmon roll or the Playboy roll.  And this older Japanese man makes all of the sushi by hand.  He is a very nice man and you can tell he takes pride in his work.  It is worth the wait!  They also have good soup, salad, and teriyaki so pretty much whatever you order is going to be good.  I usually picked it up to go and ate it at home.  Now, every time I go to Nashville I have to stop here for lunch or dinner before I leave.  I highly recommend it to everyone."], ["H S.", "Some of the worst sushi I've had in Nashville, including the refrigerated grocery store variety. Really, it was that bad. I went during lunch and maybe this just isn't the time to go, but the rice seemed stale and was not seasoned properly. Most of the \"special\" rolls seemed to rely a bit too much on fried ingredients and overpowering sauces. A friend ordered a special spicy soft-shell crab roll that was actually covered in lumps of fried tempura batter and shredded surimi (AKA fake crab). It was by far one of the nastiest looking rolls I've encountered and may have been responsible for my friend's post-lunch stomachache.The name O'Sake should have been a tip off not to go, you're not going to find amazing and authentic sushi at a place that thinks sushi and sake make a good pair, but I'm the kind of sometime sushi snob that can appreciate overwrought nouveau-sushi when it tastes good. This did not taste good."], ["Patrick G.", "I absolutely love this place! I discovered it soon after I returned to Nashville from an extended stay in Japan. It originally attracted me because it bills itself as an izakaya (a sort of melding of a bar and a restaurant). Inside it reminded me of many of the joints I'd hung out at in Matsuyama, Japan. Since then I've been many times.The sashimi is usually very good and the rolls are excellent. I'd recommend the Cherry Blossom roll most definitely. The Caterpillar roll is also a great one to check out. Wash all of that down with one of their sakes or (my favorite) one of their large bottles of Orion beer. The atmosphere of the place is very intimate. The chef, Jae, will often chat you up, and the waitress is very sweet.I guess I have to put at least one complaint in here... I guess it would be that I wish they seasoned their rice a bit better. Then again, I've been to very few places in America that season their rice well, so c'est la vie."], ["Matt D.", "Good stuff .. Where did this place come from?  Great service, green tea was exceptional, miso soup was good, yellowtail & scallion was good .. I'll be back.  If they could just turn down the annoying Japanese pop music .."], ["Valerie W.", "Delicious Sushi!!! I loved it and will DEFINATELY be back soon:)"], ["Elliott C.", "This was some of the best sushi I am sure you can have in Nashville. I used to be in love with Sams however tonight we stopped by O'Sake and was Jay ever nice, and the sushi was amazing. The decor is perfect and you almost felt like you were eating sushi in japan. Must go and definitely try the Arigato Rolls amazing!"], ["Karyn J.", "What a great spot! My girlfriend & I went to enjoy a late lunch & this was the first time either of us had been here. The place is clean & we were immediately greeted when we walked in. Our waitress was very nice & our order arrived quickly. They gave us so much food for such a great price! The food was hot & fresh & I enjoyed every bite! I look forward to going back."], ["Peter C.", "Decent place, a bit quiet for the lunch crowd.  Nabe noodle soup generous in portion, though the broth a bit light.  Both rainbow/dragon rolls were delicious.  Will grow on me, I am sure."]]}