{"Fuji Chen": [["Bill P.", "Ever since I was little I've had a poorer than average sense of taste and smell.  It has it's blessings and curses, but with food typically means I prefer food that is stronger than tasting than most.  So take the flavor review here with a grain of salt (or pepper), but textures are super important to me.Today I had the pepper chicken, and some crab rangoons.  The chicken had (for me) just the right amount of spice to it.  It was very subtle, but I could taste it.  It's likely spicier than I realize, but I spoke with the owner and he said it's not the spiciest item on the menu.  The chicken was battered and fried, and this was done well.  The outside had a nice crunch to it, and the chicken on the inside was still moist.I've heard the crab rangoons here are amazing, and today got to try them.  They definitely do not skimp on the filling!!!  Again, a great crunch combined with the creamy filling is really all you can ask for.  I definitely recommend them.There are multiple options for Asian Cuisine in the Providence Place Mall food court, if you're looking for that - stop here."], ["Kendra N.", "Quick stop for lunch while at the mall and the sesame chicken was good but cold and the lo mein was just fried spaghetti basically, veggies were ok.  I am comparing this to a Panda Express and it is disappointing"], ["Warren A.", "This place has some awesome items I have never seen before and run of the mill Chinese places.  The pepper chicken is like spicy crack. Seriously. So much flavor in a dry entry, they do something to get the flavoring into it with out loading it up on sauce. You gotta try it, the flavor is subtle but builds as you eat it. Reminds me of some of the real Chinese food I get in California.  Must be an OG behind the scenes!  BBQ pork was also pretty damn boss, no fat, and crispy edges."], ["Hildegarde A.", "I actually hated this food. It is like generic American Chinese food. Frozen food is better. Mine plate had the low mein, which as others noted is spaghetti with some grated carrot and onion. Just not anything worthy of mentioning, My two friends agreed, this was bad but we were starving."], ["James H.", "I wanted something quick to hold me over until a nicer dinner so after orbiting the food court a couple times I settled here. I will say that the food isn't horrible. It's what I would consider default Americanized Chinese food. After all they actually have \"buffalo chicken\" in one of their steam trays. I had the BBQ pork and the sesame chicken. Like I said for mall food, not bad. I also got a fountain diet coke. Trying to watch my figure and such which sadly was very watered down. That being said, if your hungry. This place won't kill you, it's very default, and I probably wouldn't come back. That being said I'm very much looking forward to dinner at one of the real restaurants around here later tonight."], ["Steve r.", "First off the pic is true. It is fake lo mien, though mine didn't even look as good. It was spaghetti! The bourbon chicken tasted ok but better elsewhere. The vegetable side was also an ok. I don't plan to go back. I should stick what I know. I was had.....spaghetti ...come on!"], ["David D.", "The food here is Lousy...box Italian pasta for Lo Mein ...if u go for lunch you'll get left over from past day...I had chicken ...that was 2 different colors ..."], ["EGG L.", "In summary it's good food at a good price.  I've tried the other restaurants in the food court and this one definitely gives you the best bang for the buck.  The portions are large so some of you might have to pack some home which means 2 meals for the price of 1 ! .. well in my case it's really a meal now and a snack later but I'll gladly heat it up and enjoy it later.  All the choices I've tried are good but I especially enjoy the Mushroom chicken.  The side order of crab rangoon is good too.  It was crispy and the meat inside was very tasty.  The downside is the paid parking  .. If I was in the mall already and shopping this would be my top choice but having to pay for parking otherwise is a turnoff."], ["Ed L.", "4 or 5 stars?  NEVER! This is mediocre Chinese food at best. I am being generous giving them 2 stars.The sesame chicken was just ok. It wasn't bad but not one of those things I've got to have again. As for the wonton soup, it was disgusting. Dirty dish water would have probably tasted better."], ["Mike M.", "BEST sesame chicken I've ever had in my life. I'm not joking. My girlfriend used to live in rhode island and when I would visit I would find every excuse possible to go to the mall so I could have the sesame chicken at fuji chen. I now live in California and dream about this chicken every night."], ["Orlando R.", "Formerly known as Cathay Cathay, this new Chinese place has great food for a great low price. I was lurred into this food court fiasco by one of the workers offering me a free sample of their Sesame Chicken, which surprisingly, was good. I decided to check this place out for real. I ordered a Super Combo which gave me a choice of three items with either lo mein or fried rice for $6.99, not a bad deal if you ask me. I ordered the Sesame Chicken, Mushroom Chicken (fresh mushrooms to boot!), lo mein, and an order of Crab Rangoon. Next time I'll be sure to order a smaller combo because, like Cathay Cathay once did, they give you A LOT of food. I finished half and took the rest with me. Now if only they had General Tso and Orange Chicken...they didn't have much of a selection when I went there a few days ago. They just opened so I guess that counts for something. Reguardless, they earn four stars, but I still think Cathay Cathay was the best. I miss it."], ["Alex R.", "Honestly in all of Providence I find Fugi Chen to be top notch. Unlike most mall food, Fugi Chen tastes like authentic American-Chinese food every time. I recommend their Sesame Chicken with half fried rice and half low mein noodles.  They charge the perfect amount for a heaping pile of whatever you order too.  One time I was at the mall when it was just about to open and I waited for them to put out the Sesame Chicken.  It was worth the wait, for when I finally got my hands on those warm, savory pieces of chicken, I was satisfied."], ["Yaocheng L.", "It's great for the fresh Chinese student to have food here:) Especially after a very tied registration process and orientation, it's so good to have a home feel food here."], ["Cabernet S.", "These guys are like crack dealers. They ambush you with pieces of toothpick pierced pieces of warm, sticky, sweet and sour tasting chicken. A perfect balance of tang and sweetness. One bite and you're hooked. How can you say no? Its an offer you cant refuse.Choose your side, rice or noodles. Then choose from the array of meat/vegetable entrees. I usually go for something with chicken and vegetables. It's everything a food court meal should be. Greasy, warm, salty and just a tad bit sweet. Oh yeah, and the servings are generous. You're guaranteed to be eating for at least two days if you get the two entree meal.Make no mistake, you're probably consuming tons of msg, sodium, cornstarch, fat and food additives. But it tastes great and you'll be satisfied. Sometimes, that's all that matters."]], "Khoo Kitchen": [], "Taste of China": [], "Apsara Palace": [["Zaarah A.", "Food is fantastic and worth the clutter. place is always crowded. Wish there was more space for sitting and getting take out is chaos."], ["Travis W.", "I'm personally, a HUGE fan of house made steamed Pork buns. I have spent MONTHS trying to fill a void Boston had for me from one place I went to living in Dorchester. After coming here, I can say my search has finally come to an end. Extra large, piping hot, freshly made. BEST I have EVER had. Rhode Island has a serious shortage of solid Chinese Food places depending on where you live. After my girlfriend and I moved to Pawtucket, we decided to stop in and give this place a go. We've been 2 times so far and are absolutely obsessed. The fried rice is flavorful and spiced well. The Duck is finger licking good. The Crab Rangoon's are some of the best in the area. Service here is friendly and attentive. We will definitely be back again. Note about eating in: If you are planning on going in on a Friday night, go directly from work, do not wait. The wait can range from 10-45 minutes after 6:30. It's a small place that's very popular."], ["Ron B.", "See video review here.youtu.be/Ux9pyPxO_Z8"], ["Gabriella G.", "I don't go here nearly enough. What's wrong with me? Anyway, the portions are huge and it's always delicious! Not to mention, you really can't beat the prices at this place. Totally worth whatever wait you may encounter."], ["Cathy L.", "BYOB! Small parking lot shared w/ other businesses, but plenty of street parking on surrounding streets. The food has always been delicious. Friendly waitstaff."], ["Emily D.", "Apsara has gone so far down hill. I come here often for mostly takeout, but tonight, I came here to sit down with a friend.  We ordered some Nime Chow and two entree sized soups. The appetizer came out quickly, as did one of the two soups. I waited 15 minutes without my soup, without any acknowledgment of the outrageous wait time, while my friend had nearly finished. I had to get out of my seat to ask about my food since, God forbid, our server actually check on the table. More time passes until the server comes over and utters one word, \"sorry\".  Excuse me? Sorry your restaurant will never have my business again. Try Den Den instead. It's right up the street, the food is better, and service actually exists."], ["Paul M.", "After reading the other reviews here, I decided to give this place a try, since I've limited my dining adventures to whatever is on Atwells Ave, where my hotel is located.  I intended on getting something entirely different after perusing the menu online.  But when I got to the restaurant I looked at their expanded menu and decided on kaing kai soup (very similar to tom kha gai) and something called crispy chicken with mango sauce.Imagine my surprise when I saw the server with a huge bowl, which was supposed to be my \"cup\" of soup.  Apparently, the Fred Flintstone size is the only option.  Accompanied by the mango chicken dish it made for quite a hearty and filling meal.  I was unable to finish it all, although I tried.The soup was excellent.  I would definitely order it again.  The chicken was very similar to a sweet and sour style, and it was also quite good.  The only criticism that I have is that it could have been a bit more tender.  However, both items were quite flavorful.  And I would not hesitate to recommend trying either.It is not a large place, but there was a small group of college students there enjoying a late dinner.  It would probably be suitable for groups of up to 10."], ["Jef S.", "Thai basil: that most essential ingredient to flavor Vietnamese and Cambodian cuisine. There was none of it last night. Not in the Beebong, not in the Nime Chow, not in the Banh Hoi. The result was bland, greasy food. What gives?On the flip side, service has improved markedly here over the years. But good service doesn't matter if the food ain't no good. I'm striking The Palace off my go-to list. Really disappointing."], ["Anna E.", "Oh how I miss the days where I used to walk to Apsara to grab lunch or dinner, takeout or dine in, when I lived in a cute little apartment on 10th street.  Those were the days.  We came back earlier in the week and got the fantastic nime chow which was better than any roll like that I'd ever had in Connecticut (where I now live).  Ever.  Nothing has come close. The lemongrass wings which were recommended by a friend were amazing, the chinese broccoli was good, the pepper squid was ok and could've benefited from being less saucy - probably a dry stir-fry with white pepper would've been tastier.  The Thai iced tea was good as well.We came at an odd time, a late lunch, and the restaurants tiny parking lot was completely full (no surprise there) but we didn't have to wait.  Service was slow but friendly."], ["Polin J.", "place Always packs! everything here is so good and delicious.! I had so much of everything and couldnt get enough. I highly recommend to try this place! will be back sometimes!"], ["Shari W.", "We used to love this place, but last time we were there I panned it. It was down right terrible. On a whim today we went back after more than 6 months, and they are back on track! The menu has changed and now includes pictures! Today we had drunken noodles which were really fantastic! We also had sauteed bok choy with ginger and garlic. LOTS of fresh ginger. We were so happy. Not as cheap as it used to be, and the same diner booths and paper table clothes, but the food is why you go and if you haven't been in a while, it is time to go back."], ["Suellen R.", "I used to love this place but it's awful now. I went in today for lunch, waited 20 minutes to place our order but people who came in after us were already eating. Noticed my teacup had lipstick on it, so asked for a clean cup. Gross. Our waitress brought us the wrong appetizer. The dumplings were worse than the Frozen ones I get from Trader Joes. Terrible service and terrible food, and unsanitary conditions. Go at your own risk."], ["Emily C.", "Apsara's has now become a tradition when my mom and I visit Rhode Island. It's our refuge, where we can go to get some delicious food in a comfy family-style setting. Since returning to this restaurant a few more times, I have become confident in the quality of their food, particularly their Thai and Cambodian noodle dishes.For the appetizer, we just had to order their Nime Chow, which is my mother's favorite. We love their Nime Chow so much that we ordered THREE of them - one order for my mom, my sister, and me!We became a little more adventurous with our ordering of entrees. Normally, we always get the Pad Thai and Bee Bong because they are delicious! However, after getting the same thing so many times, we decided that it was time for change. I could not have been happier with this decision!We settled on the Drunken Noodles and Chicken Curry Soup with Rice Noodles. What I love about Apsara's is two things:1. they cook their meat and/or seafood well, and 2. their sauces and broths are so light but flavorful!For me, these two qualities often separate the \"meh\" restaurants from the greats.In conclusion, we decided to go for some new items on the Apsara menu and were not disappointed! On the contrary, I think I have some new favorites. :) Thanks, Apsara, for another great meal!"], ["Feidude N.", "Chowing through my combination platter I got through take-out this evening.   I am thinking to myself, something is missing.    What is missing?   Beer?  No.   Hot sauce?  No.    I was wondering what is missing.   After biting into my Nime Chow again, I finally realized the Nime Chow has no shrimp.   WTF?     It is my own fault that I didn't read all of the reviews before I placed my order tonight.   Bad choice of combination platter appetizer - the Nime Chow, the f..king Nime Chow, the stable of any respectable Thai, Cambodian, Vietnamese place, was missing shrimps.  The amount of Thai basil was so little I couldn't taste them.   Then things went downhill,  the chicken fingers were inedible, the outside was hard and the inside were chewy. (threw them out), the spare ribs were mostly bones and the meat that were on them, tasteless.     I am so pissed that I was cheated out of shrimp in my Nime Chow that I haven't even touched my entree and decided to pen this review.  Add salt to the wounds, seeing these photos posted by other yelpers of the Nime Chow they got with some big f..king shrimps.   Not very happy right now, hence the 2 stars.    Summary - The service was good, but the f--ked up Nime Chow and lackluster combination platter are enough to make me think twice about coming back.   Definitely won't go out of my way to come here."], ["RJ R.", "3rd time trying to give this specific locations take out a chance and for the 3rd time I was disappointed. I'm all set. I'd rather drive to their South Side location to get food."], ["Linda A.", "I've eaten here many, many, many times. There is not one instance where the food has not been beyond my expectations. Some of my favorite dishes:--Cambodian rice noodle soup--Lemongrass chicken wings--Drunken noodle (with beef)--Beef teriyaki (delicious slaw on the side)--Crab rangoon--Scallion pancakes--Steamed brown rice (unlike any other!)--Salt and pepper shrimpSo, the list could go on and on, but I'll stop here for now... Aside from the delicious food, it's super affordable. Aside from THAT, the service is great! The girl at the counter is so friendly and courteous; the waitstaff is quick and happy to answer questions. It's been a solid 7 years or so that I've been in love with Apsara and it hasn't faltered yet! Oh! Annnnnd it's BYOB!"], ["William K.", "Great food and good prices.  Always VERY VERY BUSY.I don't think there has ever been a time where I haven't had to wait 30 minutes to eat there.You know the saying, \"good things come to those who wait\"?  So true.The pad dishes are all perfect.  One of my absolute favorites that I get EVERY time I go is the spicy pork ribs app.  A word of warning, it might make something catch on fire after you eat it.  They are seasoned with red chilis.  No biggie for me, I like spicy.They say pain is weakness leaving the body...  Therefore, the ribs make you STRONGER!"], ["Angela I.", "Apsara is a panacea for all things terrible.  Had a rough day at work? Call Apsara.  You can smell the egg rolls, fried up delicately and filled with spiced pork, from two blocks away.  Over the crunch of that golden egg roll wrapper, you can hardly hear your boss taking you to the woodshed anymore.Broke?  Apsara.  The pad Thai will feed you for four meals if you do it right. Get it with tofu or chicken and that lean protein and fiber will fill you right up.Bad break-up?  Apsara.  It's BYOB, which means no giant tab for you to get rid of those sorrows! Crack open that bottle of pinot grigio and chat it up with the friendliest group of hosts and servers on the East Side. No idea what to do with your life?  Well, maybe don't go looking for the answers in your fortune cookie. But hey, whatever works!  Go on, get everything you want out of life - and if you can't, sit down and eat a crab Rangoon."], ["Olivia P.", "I never actually sat down here. Just lots of take-out. Lots of vegan options. They have curries and amazing tofu & rice. Tasty tasty! Flip out some Netflix and Apsara and you're bound to have a solid night!"], ["Blake B.", "Very cheap, large portions, an good food whats not to like.I recommend the garlic lime fried chicken with lo mein or fried rice."]], "Shanghai": [["Shantael C.", "It's a Friday night. I get it. We were prepared to wait. The hostess was incredibly rude and told us it would be 40 mins and denied us access to the bar. It ended up being only 15 mins. Thank Goodness!The server ( with lots of tattoos) was absolutely awesome! She saved our night because we were pretty soured by the hostess.   Her knowledge of the menu and ingredients were great and she made excellent recommendations that morn only saved us money but kept us from ordering something we would never eat. Thank you'The scorpion bowl was really good, we had 2... It definitely bite us! Lol! The chicken pad Thai was some of the best I've had in awhile. So was the shrimp tempora. My date enjoyed his suishi. Very fresh was his remark. Felt a bit rushed, which is why it lost a star. Felt like a sense of urgency in the atmosphere. Wish the mood was lighter. It was get in, eat and get out. Which is why I avoid Thayer street on the weekends. I'm not in a rush to get back there."], ["Lizz W.", "There arent many good chinese places that deliver in Providence... Buuuut I like Shanghai and they deliver pretty far from Thayer!We get it delivered to the office for lunch from time to time. Their seafood lo mein is awesome and I am not one to stray from the usual pork fried rice or veggie lo mein, but glad I did. My co-worker loves the lemongrass shrimp meal. Worth a try especially if youre getting delivery."], ["Matt L.", "Shanghai is pretty great.I would strongly recommend people use the pickup option instead of the dine at the restaurant option, but it is up to you how you want to dine.For the most part, the prices for the food are okay. Keep in mind that ordering the same thing for take out will be much cheaper than the sit down option, because they charge you a premium if you want to sit down and have dinner. That said, I think it's a much better idea in general to do take out if you want food from here.The food is all pretty good- in particular, the noodles are quite good here. The kung pao on the other hand is only quite average, so anyone looking to go here I recommend to stick to the noodle dishes. The sushi is pretty novel as well, as they have quite a few cool options. However, people who are really big sushi fans may be taken aback, as the sushi is not really authentic, and this might not jive well with people who are purists."], ["Bivek R.", "Even one star is more than they deserve... Food and service was alright. I didn't look at my check and just gave my credit card but when i was about to sign the bill I realized they put more than 30% i.e $18 for $63.72 tip by themselves. I don't mind tipping for good service but they tried to take advantage by adding tip to my check by themselves. And when i complained about it she told me instead of 18% she put $18. She just signed my bill and wrote $12 where that initial$18 was and told me i will get my refund after 2 to3 days. This happened during lunch hour on monday april 6th 2015."], ["Chessie C.", "I don't live here anymore but I can't believe this place only has 3 stars! I grew up on the east side of Providence and I wouldn't order Chinese food or Japanese delivery (there ARE better places for takeout Japanese but leaving my house? come on lbr) from any other place. Their sesame chicken is amazing, their noodles are yummy and they were always on time for delivery. I live in SF now, right next to Chinatown and I still haven't found a place with a comparable selection and quality to Shanghai."], ["Alyssa C.", "HORRIBLE SERVICE!!!! I spilled my water by accident and it spilled on my boyfriends chicken and she came over to the table and said \"I'll take back the chicken but you need to be careful next time.\" Um excuse me?!?! I obviously did not mean to spill my water! She then brought over the new chicken and said \"please be more careful next time\" I couldNot believe she had the audacity to say it a second time!!! I was mortified and I gave her a horrible tip because of her attitude.... I will not be back for sure"], ["Jay G.", "We picked up a take out order, the service was fast and friendly and the price was reasonable. The hot and sour soup was very good, the spring rolls were okay and my wife seemed to enjoy her Chicken Lo Mein. The Kung Pao Chicken was awful and Vegetable Fried Rice was even worse, the taste of burnt oil overwhelmed the food. This place is not for me."], ["Joanna X.", "Worst experience in Boston (I was visiting from San Diego). First of all, I have to admit the food was pretty decent. But the service, the SERVICE!!! The waitress held an attitude when taking away our dishes & didn't ask if we were finished. We signed our check & another waitress took the signed paper and looked at the tips before we left the diner!!! And she talked to the other waitresses and they came over to our table and asked us for 15% tip (we signed 10%). We told them that we were not happy about the attitude nicely & the waitress who took our dishes came to argue with us LOUDLY and YELLED at us for not giving enough tips!!!! BTW we had lunch, not sure about Boston but in sd its 10-15% tips for lunch. Very unpleasant experience and I would give 0 star if there's an option."], ["Laurie S.", "I'm a stickler for customer service and had two great experiences with it tonight:  ordered food via Grubhub.  (I just found out we could order via Yelp! Cool!- next time!) Expected food when then said... Didn't arrive.  Boo.  Contacted Grubhub: they knew who I was, (I've called credit cards, insurance companies etc where I enter all kinds of info and they \"still have to look me up in the system- boo) where I ordered from and took care of it ASAP. Gave me some options then called me right back.  Not only did our food then show up right away (and hot!), but both Grubhub and the Shanghai gave us credits.  NICE WORK!  I get that things go wrong sometimes, just fix it.  They did, I like that and like to acknowledge it.  And the food was yummy too- 1st time order.  Good stuff all around. More on the food- spicy lo mein, really good and a nice spice.  Wonton soup very good and the wok salt/pepper shrimp were delicious.  Wasn't excited by the chicken with ginger and scallions but not bad.Again super customer service and the delivery guy was super friendly too.  Will I order from this restaurant again,  in a heartbeat.  Yummy, great customer service.  Well done!"], ["H C.", "NEVER get take-out delivered. They will ALWAYS arrive late, no matter if they're busy or not. Waited over 2 hours for a delivery, only to call and find out that it the food hadn't even left the restaurant and it would take another 45 minutes. Not the first time this has happened either. Last time I got delivery, they took 1.5 hours and forgot an item in my order (which took another 45 minutes to get delivered).I gave 2 stars because they do have the best crab rangoon and their food hits the spot for greasy American-Chinese food. Be warned: expect your delivery to be at least 30 minutes late."], ["Thomas F.", "I used to love this place. Good food. Good drinks. Good price. The other night I was in there after a family party. I was dressed up and was wearing a brand new scaly cap. 5 minutes after sitting (at the bar) I was informed there was a no hat policy. The lady was very rude. People were wearing sweatpants and sandles and tshirts. It's not a club. There is no jacket policy. Let me eat my sushi in piece instead of worrying about a hat. A nice tasteful hat, not a giant yellow flatbrim. I won't be going back. I heard moomoos was just as good if not better. They lost a regular."], ["Tena D.", "Love this place! the Volcano roll is to die for! You really have to know what to order here or it will be a hit or miss. I enjoy it everytime. The sushi and sashimi is medicore, but honestly their special rolls aren't bad at all and their drinks. The atmosphere is really cool with the influenced of Tradditonal Shanghai meets the modern."], ["Qian Z.", "Americanized Chinese food (nothing wrong with it, but don't expect Authentic). Overpriced for my taste but not outrageous. Food is average, at best, when compared to other Americanized Chinese Food. Reason for two stars is customer service. Service is often rushed, and the staff does not feel warm at all. One time I walked in, and the delivery man and cashier were arguing and yelling while I was trying to place my order. Made me feel uncomfortable. In short, I never feel welcome and comfortable going to Shanghai, which makes me want to take my business elsewhere."], ["Laurie B.", "I absolutely love the sushi at Shanghai! My boyfriend and I have been here at least a dozen times now. We've been mostly for dinner after 6pm. Lunch is very quiet which can be pleasant too.We always share a bowl of miso soup and then a bunch of sushi when we go and eat the same roll of sushi to make it even. Every time we get a:-(cooked) Spicy Scallop Roll (DELICIOUS, MY FAVORITE BY FAR),-an (fried) Oceans 11 Roll (yellowtail, shrimp, asparagus, eel sauce, spicy mayo, AMAZING),-a Dice K Roll (spicy tuna, cucumber, asparagus, tempura flakes and on the outside tuna, spicy mayo, eel sauce, chili sauce. ALWAYS TASTES FRESH)and then the fourth roll we change each time (Lobster Bomb, Rising Sun, Red Dragon and Fuji Roll) or get another spicy scallop roll.Sometimes we get an appetizer of Spicy Tuna Guacamole or an Avocado Salad.The staff are all super nice and are great on filling up waters. You have to give it a try. I can't say much about their chinese food or other japanese food but the sushi is delicious and reasonably priced.They also just refinished the inside of the restaurant and put it new booths and hanging lanterns. The bar is usually packed and they do not allow hats inside. The waiting lines usually starts around 7:30 on Thurs-Sun so if you're on a schedule I'd make reservations or come earlier."], ["William F.", "This place is wonderful! I usually judge Asian cuisine by the size of the beef teriyaki and this place wins! It's like a hunk of cow that just doesn't stop. Everything I have had here keeps me coming back. The fried rice is to die for and the spicy dumplings make my ears vibrate with happiness. Also a note on their sauces. I could say their ginger sauce could be substituted for my bath water but that would be wasteful. All I can do is enjoy it little by little without going too crazy. The staff is wonderful because they let me dance like a white boy while waiting for takeout while still providing excellent service. Thank you for reading and happy dining."], ["Sandy F.", "Their food is pretty good (aside from their chicken chow mien.. (they use wide greasy noodles?) The boneless spare ribs are also disappointing.. very dry and tons of fat. Their menu changes frequently in the price department! Beware.. I have 3 menus that all look the same except the prices go up on them. Delivery is hit or miss.. I often end up with spilled food and lack of condiments. I used to really enjoy their food but with the prices going up and the delivery fees it is just not worth it for delivery and pick up is crazy due to parking. Nothing outstanding but decent food. Inside is very small and not good for a lot of people at once."], ["Miles S.", "No to this place! It was $40 for 3 things! And 30 for 3 rolls of sushi -- which were marked as $5 each on their website. Also, we ordered 2 small wonton soups and paid for them! And we ordered a large rice! And when we called them to clarify, they checked our order, AND we asked if we actually did ask for these things and they just HUNG UP! Even worse, we ordered Chow Mein, which is usually noodles covered in rich sauce and mixed with vegetables, but they gave us fucking soggylettuce. Too expensive for ok food"], ["Mike P.", "An awesome location, terrific food, great service and 80s music playing. The dumplings were fantastic as were the lettuce wraps for apps. Kung pao chicken was very filling and perfectly cooked. Drinks were large and potent. Very easy to become a regular here."], ["Ed L.", "I came here for the first time last week and had a scorpion bowl and some sushi. The bartender took my order but later discovered the kitchen had closed. They still made my order but I had to take it to go. That was not a big deal. They even issued me a gift card for the confusion. Very nice of them! Now for my review. The restaurant is very nice inside. The ambiance is great! Dark lighting with candles, Chinese lanterns in the dining room. Quite trendy! There is some pop/rock music playing. Just the perfect volume. The overall appearance was clean. A place I would frequent!The food and drinks were superb. Both times I visited, I ordered sushi. They were fabulous. The sushi was neatly rolled and presented. I had enough wasabi and pickled ginger to accompany my order. The drinks were good. Not watered down or loaded with too much ice. It was perfect.Finally, the staff, very accommodating and friendly! If your in the mood for some Chinese food, sushi, or Chinese cocktails, check out Shanghai."], ["Elizabeth G.", "This place is fun and delicious. It's right in the heart of Thayer street; so, you have that bustling energy all around you. All of the food is delicious. Whether you are picky about calories and fat or ready to eat a lot, this place has a wide variety of offerings. I once indulged in their insane scorpion bowl with a friend before leaving for grad svchool. These guys know how to please their customers; just please do what we did and have a designated driver because that stuff is strong. Always god times at Shanghai, though... Always."]], "Four Seasons Restaurant": [["Olivia C.", "My friend and I came on a Friday afternoon. It wasn't too busy, so there's really no reason for our service to have been as bad as it was. We waited 10 minutes before we got our water and tea (which was super strong) then we got our order taken. The food came out on time, but we weren't checked on and the check came but they never came back to take our money. I wish I could say it was worth it, but the food here was just as good as the food you'd find at any other average Cambodian restaurant. We both got the nime chow and the pho."], ["Winky C.", "I love their beef stew noodle. It's great and beef is soft... Spicy chicken wings is also a must u should order when you eat here"], ["Anonymous A.", "Dishes don't come with rice? Seriously? Never ate Asian food that u have to buy rice separate specially if the plate is $10"], ["Pam R.", "This place is by far my favorite place for pho. Anytime I'm in Providence this is exactly where I go for a big bowl of pho. Always great after a hangover!"], ["Kris B.", "Even though this restaurant is listed as Vietnamese, Thai, and Chinese, the food here is authentic Cambodian.  We were warmly greeted, seated, and orders were promptly taken.  The spring rolls were incredibly fresh, palate-pleasing appetizers with a not to sweet peanut sauce.  Not sure what the true difference is between these and Vietnamese spring rolls, but these are absolutely better.  Following the appetizer, we shared beef delicate soup and the crispy chicken wings.  The soup blended amazing flavors including tamarind, lemon grass, curry, chili, and other spices I can't recognize.  The baby eggplant are a great touch, and definitely add beef tripe as it adds more body and richness to the soup.  The crispy chicken wings almost taste twice fried with a rice flour batter, making the outside extra crunchy with the fried jalapenos and spices flavored deeply throughout the meat.Wish we had room for dessert, but there simply was no room, but I would return here in a heartbeat.  Four Seasons, don't ever change."], ["Linda L.", "First time here and loved it. The waiter was very nice. He kept checking on us. The food was pretty good too."], ["S Nicole M.", "Tried take-out here tonight based on some reviews that I'd read about Four Seasons' crispy wings. I was driving about in the neighborhood doing some errands and just called in an order (continuing my love affair with my yelp app - SO handy).  Didn't have a menu but knew I wanted the crispy wings and nime chow...so that summed up the phone order.I was headed over that way and found myself walking in their door a couple minutes later to do a quick menu once-over.  Added an order of delicate soup with beef and strolled next door to Job Lot to wait the twenty minutes for my order.The order was done in the time promised and I brought my goodies home to share with my husband.  The verdict:Everything was freshly prepared which means the wings were crispy and hot, the nime chow was tender and moist and the soup was steaming. We loved the nime chow loaded with small, but snappy shrimp.  There was a just-right mix of sprouts, thai basil and noodles. And it was rolled up neatly - seems like a given, but lately I've happened upon some untidy nime chow and it kinda drives me crrraazzzy.  These rolls were tidy AND tasty.The wings were coated with a crispy, light batter that had the faintest hint of lemongrass.  They were tossed with red spicy peppers, scallions and jalapeno rings.  I enjoyed a couple of the jalapeno rings at the start - nice flavor, sautéed with some garlic, not much heat until THE FIVE ALARM FIRE WENT OFF in me mouth.  Whew...the heat sneaks up.  Use caution ( and do not rip a Fresca out of the 12 pack of soda next to you hoping to quench the flames...bubbles make it worse. Living and learning). I was a little bummed that a couple of the \"flats\" had shattered bones.  Sticks and stones (and knives) can break chicken bones, but the word is \"never choke on 'em\".Ok - so the delicate soup.  The seasoning and broths were a little too heavy for me in their version of my tasty favorite.  I am not looking for a watered down broth but I just thought it was a bit overpowering.  I did add the beef which was a huge disappointment.  I am no stranger to gristle and fat having grown up on a steady diet of schnitzel and ox tails, but I would expect meat in my delicate soup to be tender and not a lot of work to eat.  Every single piece of meat was flavorful, but took a few too many chews in the end to be enjoyable.  Not a menu item I would order again.I wish there were half stars.  I think three is too generous, two stars too little.  Since it's take-out and not a real sit down meal, I'm rounding up.  All the flavors and making of a good meal are there.  Just a little rough around the edges.I would try the food here again...service was friendly and prompt, interior looked clean and the menu promising.  The white board featured some yummy - sounding adult bevvies from their small bar. It's got potential."], ["Lee J.", "Throughout many years it is consistently great food.  I've had everything on the menu.  Best nime chow you will find.  Bee Bong is significantly better than other restaurants and you will not find lemon grass wings as good as these anywhere.  We like to mix it up between Viet Namese, Chinese and Thai.  All really good.  Decor is tired, service is just okay, but the food makes up for everything else.  It is sort of the gold standard for Asian fusion minus the sushi.  If you can gather a group and sit at one of the big tables with a lazy susan for sharing, it's the way to go!  Taste a little of everything. Honestly good."], ["dennis b.", "When I rate restaurants with a 5 stars.  It is a FOUR prong approach.FOOD, QUALITY, SERVICE and VALUEFood is banging.  Crispy Wings (damn I'm salivating writing this)Classic chicken: My Favpea pod stems: A nice dose of veggieshot and sour soup(the one with the pineapples)Riceand there you have an excellent meal.  My go to restaurant when I am in RIThe best part about this is the meal is around $40.00Can feed about 4 people.I leave this place satisfied every time."], ["Gavin R.", "It was a cold and bitter day....but the asian food was hot and spicy, and as spicy as you want it. Nice little place in a strip center in an out of the way place near the zoo. My little animals needed feeding time.....they were quieted."], ["Karen R.", "Good food, good service.I have a family of 5 and we usually get a pu pu platter, large vegetable fried rice and a broccoli with oyster sauce and that feeds us all to the brim and with leftovers ! We always get the fried ice cream, my favorite is the green tea.  Everything is great here and you will not break your bank either. Oh and not to mention the waiters are hot!"], ["Jeff R.", "Eating in Lowell has spoiled me for great Cambodian/SE Asian food, but this place is right up there.  An extensive menu offers something for everyone.  I ordered the lemongrass chicken, traditional Cambodian style pork, Yang Chow fried rice, and special combination vermicelli noodles.  The chicken was tasty with the aromatic and pungent lemongrass kroeung seasoning.  The pork dish was spicy (!) minced meat with veggies served with tomato slices.  Really good.  The rice and noodle dishes could've used more meats and veggies.  Pretty good value, too.  Well worth going out of my way for when I'm around Providence."], ["Nicole R.", "Sadly i had my first (and last) experience with Four Seasons on Christmas Day when (to my shagrin) Apsara south side was closed. I had ordered the crab rangoons to start. These arrived to the table cold with a watery taste and and had a sweet but fishy taste to the filling with chunks of what may or may not have been crab. It almost tasted like the cream cheese went bad?  I was unable to get down more than one and this is typically one of my favorite dishes at most places so this was a big let down. For my entree i ordered the lemon grass chicken. When this arrived to the table it was also cold and was made with dark meat chicken. The dish was very greasy and flavorless. I was really disappointed with the meal i got here and will definitely not be returning."], ["Chris W.", "Even though I've move to SoCal, I make a point to eat here every time I'm back in town.  Consistently good food.  Our favorites are the clams with black bean sauce, nime chow, crispy wings, pea pod leaves with beef and fried shrimp with the heads still on.  Amazing!  :-)Plenty of parking in the lot out front.  Near the Calart Tower."], ["Misha C.", "I tried 4 Seasons today and wasn't a fan. The meal didn't come anything like it was described on the menu and the service was pretty bad. Also, upon entering we had to wait while no one acknowledged us and they stood at the front desk talking to eachother."], ["Dee T.", "Great food, great service always. Waiters will help you navigate the menu or make suggestions if you want to try new things. It's very reasonably priced. I feed a family of 5 for about $30 and we chow down here. Give it a shot, you won't be sorry."], ["D J.", "Had the Nime Chow and it was AMAZING!!!!!! Also had the lemongrass wings which were awesome. Combination Pad Thai for me, it was good not great. Hubster had the sweet and sour shrimp, it was heavily breaded and not that great."], ["Anton A.", "Very good vietnamese restaurant. We also came here for hot and sour soup and onion pancakes. Spicy chicken wings are also delicious! It would be 5 out of 5, but service ruins everything."], ["Ami G.", "At my suggestion, my husband and I decided to recently go to one of my childhood favorites- a place called Four Seasons in nearby Cranston, Rhode Island.My history with Four Seasons goes back a long way. When I was in middle and high school, my dad would pick me up from school and take me out on father/daughter lunch dates at least once a week. More often than not, we would end up at Four Seasons, where I always ordered the same thing- nime chow, homestyle bean curd, and white rice. About six years ago, I took my husband to Four Seasons so I could share with him this place that has such a special place in my heart. He loved the food, but unfortunately we didn't go back until now. Shortly after we visited, Four Seasons experienced a fire, shutting down the restaurant for quite a while.Silly me, I thought Four Seasons never reopened! However, last week, when I was discussing good Asian restaurants with my co-worker, I brought up Four Seasons and lamented how it closed down. He then informed me that it definitely was open- in fact, he said he went there last week!And lo and behold, when I called ahead last Saturday to make sure they were open, they were!Four Seasons is more of a Pan-Asian restaurant, offering lots of cuisines from Southeast Asia as well as standard Chinese favorites.When we sat down, we were happy to see green tea brought to the table without even having to ask!My husband and I started with orders of vegetarian nime chow, or spring rolls.  Stuffed with rice noodles, mint, and some veggies and doused with peanut sauce- these nime chow are definitely some of the best in the state.  The rice paper wrapping was nice and chewy without being sticky or greasy.For dinner, I ordered brown rice and vegetables in a lemongrass sauce, to which I added steamed tofu and peanuts.  The serving size was huge- I could barely eat one-third of my meal!  The dish was amazing- the veggies were fresh, the sauce was bursting with flavor, and the addition of tofu and peanuts were a nice protein punch that gave the dish some lasting power!A special word on their lemongrass sauce- I could really just eat a bucket of this sauce all by itself!  What a perfect way to sop up the rice!Thank goodness I found out that Four Seasons is back in action post-fire.  The food is so tasty, and it is worth mentioning that the service is out of this world.  The staff was so smiley and attentive and super willing to accommodate special requests."], ["Linna C.", "This restaurant is too good . Just came here for the first time in like 5 years ! I usually get the seafood lad na , or aka mee kah thung . Theyre nime chow are so yummy ! And so are the scallion pancakes ! Mm mm mmmm ."]], "Lucky Kitchen": [], "Gourmet House Restaurant": [], "Jacky's Waterplace": [["Alison T.", "I came to Jacky's as a party of 4 for my birthday. Having had much history with Jacky's Waterplace, I knew that their great food, awesome service, and classy ambiance was what I wanted to experience on my birthday.Food: We had several appetizers and I had the Sushi & Sashimi Regular. As always, everything was perfect.Service: Sara is an angel; plain and simple. She's so fast, so accurate, and so sweet. Albert (Manager/Husband) and Karen(Hostess/Wife) are just the two kindest people in the world. They knew it was my birthday so they assured that everything was perfect, as always. Karen has this beaming smile that can put anyone in a good mood. If you choose to go to Jacky's, make sure to introduce yourself to Al and Karen. They'll remember you forever!Ambiance: Sitting by the water? Doesn't get any better. All of the interior decor is gorgeous too.Overall, perfect experience!"], ["Nic Y.", "Sushi was fresh and they have a great variety. The special rolls were very good and unique and I appreciate that they still had raw options. The view was great and the atmosphere inviting. We would return for sushi again."], ["Kristen D.", "This is by far one of my favorite restaurants in Providence. The sushi is amazing and the servers are so friendly and attentive. Great ambiance as well!"], ["Dayna M.", "We dined here Friday night for my birthday dinner, during Restaurant Week. The selection on the 3 course menu was excellent - 5-6 choices for each vs other restaurants where there are 2-3. Every single thing we ate was excellent! We ordered an extra appetizer of Crab Rangoon that was delicious! The Coconut shrimp was excellent. I had the Beef with Asian broccoli - delicious! We had a lychee martini, a frozen \"swedish fish\" drink and cosmo. All were excellent. I had been wanting to go here for a while and I am so glad we did! The service was excellent and I can't say enough good things about our experience!"], ["Olivia B.", "Fancy and large venue for typical Chinese Japanese restaurant. Good for large groups. Looked like they even have a private dinning area. There food is fresh and presented clean. Sushi is more if fusion style. Besides Chinese and Sushi they also have Tai food as well. If you want to relax in a comfortable venue and enjoy clean fresh food, I recommend this place. P.S. They have valet parking too!"], ["Dave B.", "So I just went into Jackie's Galaxy and I am very disappointed with the service!!! I have frequented the place many times and was treated like I was nobody... The manager was rude the waitress was rude...  I can't believe people can get away with running a business like this. The night started out as a disaster and we landed at Nami on Federal Hill. The owner, waitress and manager treated us completely opposite without evening knowing about our experience... Needless to say the food and service is 100 times better. Good bye Jackie's Galaxy hello Nami."], ["Mango J.", "ive dined there with great experiences several times.But I wont ever ever make the mistake of ordering from them again.They were late & didn't give me chopsticks, fork, nor eating utensils or napkin.I think that is so messed up because it was a $70 order.. to my hotel. If Im in a hotel.. Im obviously gonna definitely need a utensil, preferably chopsticks but damn!! Nothing?Thats really frigging tacky Jacky!I tipped the delivery boy well...& wtf? Am I supposed to eat with my hands..I called the number of the biz that called me to confirm Id be paying cash & he didnt answer .And basicly...YOURE REALLY TACKY JACKY! No more deliveries with youThe quality of the food was scrumdiddliumptous as usual.  So delicious!But its clear you can only be reliable for in person dining- not else."], ["Nick G.", "My wife and I love this place. The location and valet parking is convenient. The ambiance and decor is fantastic; very classy and modern without being stuffy or sterile. The drinks are tasty. I'm not a big sushi guy, but they various types of tempura sushi which is awesome.The portions are pretty good and the food itself is delicious. The staff is attentive and helpful. Between drinks, sushi, and entrées, you're definitely gonna drop some cash, never mind if you decide to get apps or dessert; but you get what you pay for.Overall, this is one of our favorite spots, especially in Providence."], ["Tif C.", "Amazing food!  Everything is incredibly fresh and well priced. I had the Mr. Lonely roll and the Sweet hart roll for my entree and we started with the oysters.  The oysters we had were the \"smaller\" ones...by small they mean Palm size!  The wait staff is very friendly.  They explain the menu and food accurately and offer great suggestions if you are on the fence.  This restaurant offers valet parking which can either enhance or ruin your night.  Luckily the valet they have partnered with are very professional and courteous.  I would recommend this restaurant to anyone!"], ["Jeffrey B.", "We went to Jackys with our family this evening and left with mixed feelings. The restaurant is very attractive and the view is special. Our table was ready upon arrival and the hostesses and valets were all very welcoming. The food is still very good however our disappointment was with the number of mistakes with our order. Three of the five orders were incorrect. The server noticed mine was wrong right before my first bite and she brought the correct maki rolls. Our daughter in law was brought a tempura dish which is not what she ordered. The waitress pleasantly took it back. Our son was served the incorrect sushi however he opted to eat it rather than make a change. I also was surprised that on three occasions I walked by a large group of severs and not once did I receive a friendly greeting from any of them. I made a point to say hello. I got the feeling none of them enjoyed their job."], ["Sora C.", "Decent menu perhaps the great location that connects to the condo and waterfire place. I've tried couple dishes from Jacky's DT and satisfied. I recommend to try fresh summer rolls as a starter. Its like a vietnamese style, fresh veggies and shrimp wrapped with a moist rice paper. Liked a lot.."], ["Jackie M.", "Awesome food and service which is sometimes difficult to get when you bring kids. Mine are well behaved and do love sushi. The sushi was fantastic and so was the ambiance we went prior to a lighting last year for my husband's birthday."], ["Jeremiah J.", "If quality customer service or pure human decency is important to you, this is absolutely not the place to dine.  The absolute worse establishment I've ever had the opportunity to visit.  I am a Senior Federal Executive who travels often and as a consequence, I dine out frequently and have never been treated as poorly as I was when I visited Jacky's today (12/19/14).   We had a reservation for three at 630PM, so to keep us within the vicinity of Jacky's, we decided to arrive early to catch the waterfire. It was 36 degrees outside there were no restrooms available for us to use, so I decided to visit Jacky's to use its facilities.  Politely, I walked to the host counter and asked if I could use the facilities.  I didn't believe I needed to share that I had reservation since no signs posted stating for customers only.  Also, out of basic human decency, no person should need a reservation to use a facility, particularly since some might have medical matters that may require frequent restroom stops.  This is my case, since I am service disabled military vet who does have medical issues that require frequent urination.Standing behind the host counter was the Manager, Albert and two female hostesses according to the card he handed me.  After I asked if I could use the restroom, the two ladies paused and looked towards Albert.  After a brief pause, he told me that I couldn't use the restroom because it was for customers only.  I said, OK, so I am not allowed to use the restroom because it's for customers only.  I went on to say that it just so happens that I have a 630 PM reservation.  He then stated, oh you have a reservation, which I interrupted stating that I had a reservation, with an emphasis on had.  I then stated that I refuse to eat at an establishment that would treat a prospective customer as you have.  He nonchalantly stated \"OK.\"I am hesitant to believe that Albert's decision was fueled by my race, I am an African American, or the fact that I wasn't in my usual suit and tie or that he's simply unfit to lead within Jacky.  Regardless of the reasoning, this type of decision-making is (or should be) unacceptable.  What further frustrates me was the pause - if this was truly a policy that was universally applied, why did the young ladies look up at him or why did Marcus pause before he answered?  This to me suggests that the decision was based upon who I was or what I looked like and not an actual company policy, which spells discrimination of some sort.  Either way, this customer service experience alone should give anyone concerns for dining at this business.  We simply canceled our reservation after such a horrible experience and found a much more intimate and considerate establishment.Regards,Jeremiah"], ["Rose B.", "I had a great time when I went there, the drinks was nice, I had the lobster which was good and they gave s huge portion. It's gorgeous in that place. We was s big party so we was seated it on one of the seller rooms with the window view of the fire place I loved it. My meal was $75 which is crazy but I'll go back"], ["Amy D.", "Went on a weekend with some girlfriends. We didn't have a reservation and didn't have to wait. That's the only reason they get 3 stars though. I guess you're paying for location/atmosphere but overall I thought the food, drinks and service should have been at a much lower price point."], ["Clinton T.", "Food is always good and service is quick they offer it your way and go out of there way"], ["Justin L.", "Absolutely fantastic dinner!!!!!The food was perfection. Try the sweet and sour chicken. Service was good. Food was amazing!!!"], ["C D.", "We enjoyed a late nite dinner on the balcony. Staff was friendly and efficient. All of our food was well prepared and presented."], ["Gil V.", "really good food, great service, a bit expensive but very good"], ["Bevy L.", "What a Beautiful Place.From the movement you walk in you are greeted by very pretty smiling people.Oops it  starts with valet parking doors open for you.Very Nice.once inside ,Jessica what a doll took us too our seats.I was in awe how beautiful it is.Comfortable seating.As you look around you notice how nicely it is decorated and very clean.Jessica was very informative and helpful.We were waited on by Kenny.So kind and very effiicient and patient because there were so many wonderful choices.The crabRagoons &Coconut shrimp were Deelish!!!o my the Mango sushi to die for.So fresh  tasting.The cream cheese was so so svelte and taste of scallions,Yum.Our Entrees were also Deelish.From steak,salmon.chicken  and veggies so so Good.5 Stars all day long.cant wait to return.Your rite above the waterfire ,what a view..Sunday they offer choices of 1 of each apps,entree& dessert for $25.I am  already making a Ressie to go again!!!What a great Birthday Dinner(Feb.28) I enjoyed with My Husband and Very Special Friends..Kudos Jacky's."], ["Kailyn C.", "My boyfriend and I decided to treat our good friend for her Birthday and made reservations to Jacky's Waterplace this past weekend. Neither of us had been before and I had read they were voted best sushi in RI by RI Monthly.The reservation process was super easy as I just visited the website and used Open table. The complimentary valet is the way to go, as I can't imagine finding good parking in that location, especially in January when there is snow everywhere.The restaurant itself is something to be seen and has a really nice atmosphere to it. We were seated in a smaller round table right near a window. I was a bit worried about drafts from the cold temps outside but luckily didn't experience any. We ordered sushi, entrees, and a fried ice cream dessert. Along with 2 volcanoes, basically scorpion bowls with the 151 lit on fire in the middle! I was surprised that I was more impressed by my entrée than the sushi. I ordered a General Tso's chicken breast & shrimp entrée, the serving was large and the shrimp huge and delicious. Everyone else at the table seemed to enjoy their meals as well. Our waiter Justin was great, knew what to recommend, and even put a candle in the fried ice cream for our friend!Overall a pleasant experience! I'm sure we will return."], ["Corey A.", "I wanted to give Jacky's a better review. The location is great, and for Water Fire, you really can't do better than a patio spot here. The atmosphere is also excellent, with clean, elegant styling lending a lot to the overall Asian fusion experience. I have even had excellent food and cocktails here on occasion. However, during my last visit in November, the service was only average and the food was unfortunately not very good. My friend and I each ordered a couple of Jacky's sushi dishes, and the quality underwhelmed. The texture of the fish was not great, and seasonings were all over-done. I ordered a roll I had previously enjoyed here, and it came to the table drowning in sauces with limp, old garnishes. For now, I will write this off as a one-time fluke, but I will certainly be watching for an improvement the next time. Jacky's is too expensive to tolerate slipping food quality. Because the restaurant is normally quite good, I am giving Jacky's a cautious 3 stars- for now."], ["Darcey L.", "Lovely location- fun to be able to walk over the water from the conference center. The interior is very impressive, but the food is kind of ordinary. We got the Udon lunch special and the Pad Thai special. The prices were reasonable for a downtown lunch, the portions were large, competently rendered but there was nothing special about the preparation. Service was friendly."], ["Nicole A.", "Jackie's Waterplace is my go to sushi spot In providence. It is the perfect place to go for date nights and special occasions. The decor is nothing short of amazing, and in my opinion, one of the best in Providence- clean and modern. The food is always consistent and delivery is fast. Favorite dishes: nime chow, hot and sour soup, general tso chicken, French Crunchy roll, spicy tuna maki."], ["Michelle G.", "Always in search of good outside dining I decided to give Jacky's a try because I heard they had a nice patio. It did not disappoint.  The view from the patio is fantastic! The Providence skyline may not be huge but it made the perfect backdrop for our dinner. I am not sure how it would compare in the daytime but the buildings lit up against the night sky was beautiful. Though we did not take advantage of it this visit the patio also offers a counter surrounding the edge that would be the perfect spot for an appetizer and a drink. The waitress was friendly and attentive and offered great suggestions.We went during restaurant week and my husband and I ordered off of the special restaurant week menu which was a great deal. The coconut shrimp with mango sauce appetizer, which is also on the regular menu, was delicious. The shrimp tempura was OK, but a little bland. We both ordered a sushi plate for dinner which was well prepared and very filling.  Unable to decide on desert we ordered 2 and shared. One chocolate mousse cake and one mango sorbet. so happy with these choices because they mixed with each other beautifully.The couple dining with us ordered from the regular menu (which is extensive!) and were also pleased. I snuck a bite of their chicken lettuce wrap and it was delicious. But my favorite thing may have been the pear martini. All three of them Everyone in our party of four had a great time with no complaints. We will definitely be back."], ["Jeffrey H.", "I'd been meaning to try Jacky's for a long time, and finally made it over there this past weekend with my girlfriend. We had an awesome time, will definitely be returning, and if you're thinking of going, you should go. First of all, the complimentary valet parking is a nice touch, and from the moment you pull into the driveway/courtyard you can tell you're in for a treat. The ambiance and decor are fantastic, between the fish tanks, modern design, and glass walls letting you see the river outsde. The hostess was extremely hospitable, showed us right to our table by the window overlooking waterplace park (which by the way would be an awesome date idea for waterfire, though this was just a regular night). Now here's where it gets good. We sit down, my girlfriend mentions she's a little chilly (wearing basically a sleeveless shirt and shorts) and I suggest that I grab her sweater from the car. She says not to, she's fine. The hostess overheard this, and about 15 seconds later the waiter comes over with some hot tea to warm her up. Now THAT is good service. For the rest of the evening, the service was arguably the best I've ever seen. The food was awesome as far as taste and presentation, and there were so many things on the menu that we'll have to go back to try some others. We had a sushi roll that had the name Tiger in it (don't remember the rest of the name), the crab rangoons, and a \"wet\" style noodle and chicken dish. Now, there are two things that I would say were not ideal. First, as others mention, this place is more expensive than your typical pan-asian/sushi restaurant. Honestly, though, you get what you pay for, and if you don't want to pay fine dining prices then you're not going to get this kind of quality anywhere. Second, it was loud. To be clear, this was not the fault of the restaurant or design, but more bad luck/timing. We had a very loud group of 4 behind us, and two birthday parties nearby, and many of the people in those groups had clearly been doing a bit of drinking and were not afraid to yell. We were there from like 9:30-10:45, though, so I think if we had gone earlier we could have avoided that."], ["Jaki G.", "This place is beautiful inside with a great view. I went as part of restaurant week with a group of 17 ppl. They didn't seem very prepared for a group of 17 as our lunch went over 2 hours. I think you should leave the kids at home for this restaurant, seems better for a more mature bunch going for lunch or night out.If you go with a big group just be prepared that it might take awhile. But I'd say the food is worth it."], ["Jack D.", "We had dinner early on a Sunday night. The atmosphere and setting is very up scale.The food is very good Pan Asian. Service was prompt and efficient. The menu is big and you can find things to suit every appetite."], ["Joie S.", "This is one of the nicest restaurants I've ever been to in Providence. I love sushi and I have tried it all over the city and Jacky's is amazing!I went with a group of four and everyone really loved their food. I had the miso soup, the lobster nim chow and two sushi rolls, everything was perfect. The atmosphere is also really nice. The decor is beautiful and there is a great view, we had a window table.  We didn't make a reservation and there wasn't a wait but it was early on a Thursday night. Service was prompt, but the place is pricey. We had a group of four, we had appetizers, entrees and two bottles of wine and our bill was around $250. Totally worth every penny!"], ["Steven C.", "Over priced and over rated.  If you're easily impressed with a nice location and glitzy decor, perhaps you can overlook the mediocre food.The sushi chefs are more focused on presentation (which is outstanding) than putting together a well balanced and innovative selection.  I began with the Jalapeño Hamachi.  This may have been one of the better dishes.  Good presentation but not very inspired.  A small rolled piece of fish with a slice of jalapeño, sprouts and flower. Very pretty but not enough hamachi to offset the strong sauce that they paired it with.  Followed by Tako, Eel and Toro which was unremarkable.I'm not sure when it became fashionable to pair uni with an overpowering green but it seems driven by aesthetics.  Tony Bourdain calls sea urchin the best thing that I've ever put in my mouth.  I tend to agree with him but this green totally overwhelms the subtle flavor of the fish. Finished with ocha which surprisingly came as a tea bag.  With these prices, you could probably afford to brew a nice batch of green tea and serve it in a kettle.If you looking for overpriced, overhyped and a underwhelming experience, Jacky's is your place."], ["Sarah C.", "I really enjoyed my night here. The food was awesome; my friend and I went during restaurant week and were super impressed at the portion sizes. The ambiance was fabulous, definitely great for a date and I can only imagine what it's like to sit outside there during a Waterfire. I would definitely go back!"], ["Jimmy R.", "Decent food. Great atmosphere and good service. This place is a good example of a fancy markups. I can get better food in Boston china town for way less, but definitely won't find the same atmosphere and presentation there. Other than the price, it is a decent place to go after all."], ["Tai N.", "Took my kids to Jackie's the other night for first time. Decor is well done and views are amazing, best in the city dining scene. Sushi pricing was reasonable for down city location. Very well prepared and tasty rolls abound.  Waiter overheard us mention a birthday and brought special desert cake, was a nice surprise. I would definitely recommend this place for both food and atmosphere."], ["Barbara M.", "Jacky's never disappoints!!!"], ["Rebecca H.", "The jury's still out as to whether Jacky's Waterplace is: a.) An over-the-top pan-Asian dream home b.) The main dining room and bar of a Carnival cruise ship run aground in downtown Providence c.) A restaurant serving food that's actually pretty decent in an environment that is totally unique (Hint: the answer is \"c.\" But perhaps there should also be an option \"d.) All of the above.\")I first went to Jacky's during their initial week or two in operation. At that time, our meal was decidedly mezza mezza: I recall that our group of four was pleased with exactly 50% of the dishes we ordered, and unsold on the other half. In particular, the lettuce wraps couldn't then, and can't now, hold a candle to those served at PF Chang's - and I'm truly sorry to say that, because I feel strongly about supporting a local business over a national chain, whenever possible.  We ate at a table by the large picture windows overlooking the Providence River basin. While it was not quite yet a culinary triumph, it was certainly visually astonishing. The décor then, as now, struck me as totally bombastic: almost bordello-like in its brash mix of strong competing colors, lush fabrics, a massive circular bar upon entry and boudoir-style lighting throughout.  Not my thing, but that's totally subjective--and really, the proof points that a restaurant should rest on are its great food and service. I've since returned a couple of times to Jacky's, and the food has improved so that it's now universally very good. The sushi, noodle dishes and desserts are all tasty, and the hot sake has a bottomless quality of near Biblical proportions. Mark my words; you'll still be pouring long after you expect the narrow ceramic carafe to run dry. If you're prone to getting queasy around loud interior design, this shouldn't be your first choice. Personally, if I was designing an Asian restaurant, I'd go for a look that reads \"dim and damask.\" But if you're in the mood for a show (indeed, even the patrons are on display with Jacky's open floor plan), or simply fancy a celebratory party atmosphere served up with your fried rice, Jacky's fits the bill."], ["Andre V.", "The food here is pretty stellar! Always a little cautious about fusion(y) places but I really enjoyed this place. The sushi was very well prepared and delicious. The Rangoon was good and the same can be said for the spring rolls. The stand outs however, had to be the lobster and sirloin steak tips. Both were amazingly delicious and tender. The flavor was just absolutely spot on. If I had any room left I would have loved to try even more."], ["Benjamin J.", "I have mixed feelings about this place after my first visit.If I were rating solely on atmosphere, this place would get a 10 star review. They clearly spared no expense on decorations and the environment. Its worth a trip here just to look around and be in the amazing restaurant they've created (not to mention the view is great as well). I came here for apps and drinks, so don't have too much to say about their food except that I thoroughly enjoyed it. Drinks on the other hand... This leads me into the one issue I had with Jackys. Our bartender. We sat at the bar so we dealt with the same person for our food and drinks. He \"forgot\" our food when it was ready, so it did not come out piping hot as expected. Understandable. When my lemon drop martini was delivered is where I had an issue. It was pink. My friend and I were commenting on how we've never had/seen a pink lemon drop martini, and figured they had used pink lemonade/pink lemonade vodka. Another bartender overheard our comments and approached us. She told us they did not carry pink lemonade, nor pink lemonade vodka. She then proceeded to tell us that our first bartender is not a good bartender, and that we should've sat at her side of the bar. This is all nice and fun, but why didn't she correct the issue? She clearly knew we did not get what we ordered, and showed no sign of hospitality around the issue. The drink itself was good, so I didn't raise a stink about it. The rest of our stay our bartender chatted with guests that I'm assuming tip him well/are regulars; because we rarely saw him the rest of the evening. It wasnt until he gave us our bill that he was nice/friendly to us. Might have just been an off night for him, or perhaps this is a regular occurence. Still a pretty decent place to check out, and perhaps on another visit, my review will change."], ["Julie A.", "Fantastic place! Most RI-ers know of Jackie's Galaxy which has multiple locations around the state, but this is their \"high end\" location downtown. The short of it all is the service is impeccable, the decor is classy, there's a bar, sushi bar, and a dining area (as well as party area), and the food is fantastic! I've been here twice already and want to go back. I can't say which dish is the best, but everything I've had here (about 4 appetizers and several entrees) has been to die for!Great place for a date or a family/friends event!"], ["Jean F.", "I've been to Jacky's Waterplace a few times and have mixed feelings but over gave a strong review.  The ambiance is over the top, fun, clean and 'spiffy'.  The sushi is good and I feel they should play that up a bit more ... I'm not a huge fan of the Chinese food.One of my experiences I went with a gang and the table had rave reviews, it just didn't do it for me. It seemed like normal 'ehhhh' Chinese food. The kind of Chinese you can have on your couch on a Sunday night, wearing PJs.  It didn't seem like the food fit the decor.I do give a lot of credit to the ambiance and service, which totally pulled a lot of weight in my 4-star review."], ["Darline T.", "I've only been to Jacky's once but boy did they leave a lasting impression. I'm always very cautious when trying new places because my veganism tends to put a damper on my sporadic outings but Jacky's delivered without a hiccup. Our waitress was freaking amazing. She was so attentive to my dietary restrictions and explained everything that was in my meal just so that I had that piece of mind (no one ever does and I didn't even ask!) so it made my entire visit that much more pleasant. It is situated in Down City and clearly captivates the Downtown high-class theme. I won't talk price, well because once you experience it, it's not something that really stays in your head but Jacky's is a definite must-try. World-class service, yummy food for us vegans and the ambiance is top-notch."]], "Chef Ho's": [], "Yama Fuji": [], "Chengdu Taste": [], "New Wing Kee Barbeque & Poultry": [], "Apsara Restaurant": [["Ray S.", "Today on a Saturday at 1pm  I went there to grab a quick bite and the food came out faster then before. The waiters are still polite and nice as usual. Bought two whole plate of LoMein, can feed up to 4 people, and 3 cokes. The bill came up to $21 for three people to eat!!Kind service and a good meal at an affordable price.I posted my latest pic of my meal #84 in the photo collection for Aspara in my recent post."], ["Lee G.", "First--this is NOT Apsara Palace on the Eastside of Providence. Apsara Restaurant is by far one of the top Asian restaurants in Rhode Island. Ive been coming here since I was about 6 (I'm 36 now) and I've only had a couple complaints.Some of my favorites are the Loat Noodles, the Beef Satay noodles, the Bee Bong, and of course the Stew.You've got to eat in to get the whole experience but it's gotten so busy that unless you are going at an odd hour you're better off with take-out.Remember, this is NOT Apsara Palace."], ["Lyd M.", "This is my first time dining in in about 10 years and we had a great time. First of all, it's a much nicer space than I remember...it looks like it was updated recently and it's very clean and nicely decorated. All the tables have colorful tablecloths and a nice assortment of condiments in place. The service is very friendly and efficient and the food comes out very fast. And there's a pot of tea when you sit down, which on a chilly October night like tonight was very welcome.I'd definitely recommend eating there rather than takeout. The food is delicious no matter what, but getting it hot from the kitchen, seeing the nice presentations, and having the dishes with the delicious accompanying garnishes is worth it. What I absolutely love:Hae Kainge...my FAVORITE! It's a steamed then fried bean curd wrap with ground pork, onion, scallion, and cilantro. I get it every time. So crispy and satisfying. When you get it for takeout, you don't get the garnish of a carrot and cucumber salad, which is such a nice contrast. If I could only get one thing, this would be it. Nime chowScallion pancakeSteamed Peking ravioliCrab rangoonLortSteamed pork bunTom yum soupCambodian beef stew: had it for the first time tonight and it was awesome. Flavorful but delicate broth with big chunks of vegetable and beef tendon and brisket. If you don't like eating cartilage, don't order this soup. If you do, you'll be in heaven. $10 and it's a massive portion.Vietnamese bee boongThe Singapore noodles: rice vermicelli noodle with curry, carrot, beansprout, cabbage, scallion, and your choice of meat.Any of the eggplant and garlic dishesThe crispy duck with the baby bok choy and ginger sauceThe portion sizes are about double what you'd expect for the price. A truly delicious bargain.****P.S. don't waste your time at Apsara Palace on the eastside because you'll be disappointed. It's the designer knock-off of the Public Street location.****"], ["Virginia Y.", "When your home girl is Cambodian and she recommends this place you listen to her. I happily allowed Apsara to pop my Cambodian food cherry.The Cambodian beef stew tasted very homemade, like something a grandmother would make. Excellent flavors and hearty broth, quite similar to borscht soup.  The nime chow looks like Vietnamese summer rolls but the flavors are slightly different because of the sauce they use here. Natang was pretty unique, it was a big crispy rice cracker? It was an interesting mix of flavors and texture with the natang and meat sauce. Portions are pretty big so its bang for buck, one of the reasons why I like small towns in the good ol' USA. If you're looking to try something different or to explore further from the typical Chinese and Japanese cuisine, Apsara is your girl."], ["Jason W.", "Apsara certainly did a great job of seducing my taste buds with their super flavorful dishes. Their thick and elongated nime chow was delectable. It reminded me of Vietnamese summer rolls but with a different twist thanks to the unique dipping sauce. The natang brought me back down memory lane as I had grown up eating more than my fair share of crispy rice cakes. The portion for this was pretty big and I was surprised it's listed as an appetizer! The Cambodian beef stew was the real star of the show, as the soup was amazing and filled to the brim with lots of meat and vegetables. It was a light homemade broth, almost like something your grandmother would make. The soup tasted like borscht soup but on crack for me. It was exploding with flavors. Portions are massive and I had to take some home for supper later that day. Definitely worth a swing by if you're in Providence!!"], ["Cristin S.", "You want a plate licking meal? Oh cheap too? Yeah and good portions? Look no further. This place is great. The servers are funny. They have good food. You can bring your own booze. Seriously what is not to like? I recommend: Singapore Noodles, Mongolian Beef, Coconut Soup, Nime Chow***must***So come one come all...but don't take my table."], ["Xiao Z.", "I had another opportunity to try out this place and found the service to be much improved, and we ordered a slew of additional dishes including duck, eggplants, pork buns, squid and lort noodles. I really fell in love with the small, bean sprout appearing lort noodles and the texture was perfect, tender, chewy, just the way I like it. The squid was decent, but there were so few squid pieces that I felt like I was just eating a plate of green beans with some squid on the side. The pork buns was a bit of a surprise with eggs, Chinese sausage and pork enveloped by a very sweet bun. Overall, this was a much more enjoyable experience and our meal came out dirt cheap!"], ["Rebecca V.", "I love the vegetarian dishes at Apsara. Like many other cheap, pan-Asian restaurants, Apsara seems to use very processed chicken. If this doesn't bother you, you'll be in heaven! If it does, go for the tofu!The nime chow is always fresh and amazing. I'm a huge fan of the Bee Bong, a cold noodle dish with coconut milk, cucumbers, and veggies that is super refreshing in the summer. I also love the green curry sauce. Huge portions are totally worth the low low prices. And it's BYOB!"], ["Richie S.", "This place might be a dump in a tough area of Providence but the food here is by far some of the best you will find anywhere. I was first turned on to this place years ago when I worked a few streets over but I've found myself still coming back because the food is just that good. Make sure to try the black pepper chicken wings which are so crispy and delicious especially with the vinegar sauce.  It's not a bad idea to come here for lunch but my recommendation is to order take out. I hope you enjoy!"], ["Alexandria C.", "Crispy black pepper chicken wings. And pad Thai. BYOB and quick service. This is a weekly spot for me!!"], ["Jen S.", "Ordered a drunken noodle tofu dish to go, and when I got home it looked like there was some kind of meat in the dish. I called the restaurant and asked if there was meat that was typically included in the dish or was there another ingredient that I could be mistaking for meat? The girl who answered told me she didn't know and was really busy...the end. I completely understand being busy, but seeing as I now have a dish that I paid for and can't eat because of a mistake on their end should at least yield some kind of response, and in a good business- an apology and an offer to replace the dish!Totally unprofessional and unacceptable- would not recommend!!"], ["RJ R.", "It really saddens me to have to leave a negative review!!! I use to really love this place. The last 3 visits here have been disappointing! The food has not been up to par and the customer service was extremely crappy! Our waiter is one of the waiters from the Hope street location. He was extremely rude and took forever to take our order, bring our food and to give us the bill. It wasn't a busy night either. We waited 25 mins before just getting up and paying for our food at the desk. Unfortunately this will be our last time coming here."], ["Katy G.", "Great food & BYOB.  Not the best section of town but that probably keeps it from being crazy busy."], ["Anna E.", "Almost a week later and I am still dreaming about the perfect pad thai and the flavor bomb that is the lemongrass wings.  Soooo good.  We also ordered the chicken basil lunch special and a Chinese vegetable with tofu and both were good.  The nime chow is as amazing here as it is at Hope St. location.  Chive dumplings were actually better cold than they were hot, but I wouldn't order them again."], ["Lizz W.", "I love this place. The restaurant is ugly and weird but the food is amazing!!!!!Everything is delicious, literally. Their menu is huge, almost as huge as their portions. I couldn't even tell you what I like most because I usually order things I couldn't begin to spell. But trust me, you want thai/vietnamese food... go here!Also, this location is better than the East Side one in my opinion. Just FYI don't be scared of the neighborhood, you poon!"], ["Eb A.", "great service excellent food and flavor"], ["Matt L.", "Apsara is popular and gets crowded, even on weekdays.  Parking can be very difficult.  The many customers limit server efficiency.  Make a reservation or order carry-out if you don't want to wait.  The food is delicious, the portions are large, and the leftovers will likely suffice for another meal.  BYOB.The chicken-on-a-stick (satay) appetizer consists of 6 large, lightly fried white meat pieces.  The Drunken Noodles were drier and less spicy than many other restaurant's.  The squid with ginger could have been more aptly named onions with squid.  The eggplant with garlic sauce was well prepared."], ["Evan V.", "Appealing to yupsters and hoodies alike, it is Apsara's quality and selection that keeps its dining room packed. An eclectic and expansive menu ranges from authentic Vietnamese offerings, such as Vegetable and Tofu Bee Bong, to more traditional \"Chinese\" faves. A Florida room with large foldout windows allows diners to soak in exclusively Elmwood-ian happenings and presents a refreshing warm-season alternative to the stuffy, pastel and neon decor of competing es- tablishments. Although it shares the namesake of another Hope Street chow-house, the ownership is not (shared)."], ["Rick B.", "Went to the Fall River location and it was excellent. A true foodie paradise, decorwas meager but the food was outrageously good. No good Asian food on Aquidneck island except for Sunrise which is closed on Sunday. Definitely worth the short drive to Fall River. Got the beef salad, YUMMY."], ["Abby C.", "Whenever I crave spicy noodles, I know I need to go to Apsara. I usually enjoy the curry noodles or the spicy beef satay noodles with Chinese broccoli. It's delicious and enough for both dinner and lunch the next day. I always make sure to load up on Cambodian spring rolls and nime chow. We probably order take-out from Apsara more than we should, but it's so damn good."]], "Mandarin Garden": [], "Gold Stone": [["Jeff R.", "Given the dearth of above average Chinese in RI, this place is a real find. It's a tiny hole-in-the-wall joint on Allens Ave, with about 5 small tables. It looks like it caters to the chicken wing and pork fried rice crowd, but if you look hard-and ask, there are some interesting menu options. I ordered a spicy chicken dish, and told them I wanted \"ma la\". I got \"ma la\" (other restaurants often don't take me seriously or don't know what I'm talking about). I also tried cumin chicken and Shanghai noodles. I asked the owner and another Asian gentleman at the counter for any other recommendations, and I got a beef and potato dish, that was almost black in color, along with some special fried rice with pickled Chinese vegetables. Everything was well-prepared and flavorful. The cumin chicken was good but maybe a notch below some of the Sichuan places in MA. The beef/potato dish was unusual but very good. I think there was a good amount of black vinegar used. The rice was a nice twist I hadn't seen before and the noodles were decent, too. The menu isn't that extensive, but I wonder if there are more authentic dishes that are prepared for Chinese customers. Portions were large, and prices were reasonable. Well worth a trip for anyone who craves something more exciting that meat and celery in brown sauce. I hope they do well."]], "Noodles 102": [["Gabriella G.", "It's getting colder which means passing Noodles 102 on the street is like a dream sequence in a movie. To me, it's the greatest comfort food around. I always get the Singapore Noodles with tofu. I want to branch out, really, but it's tough when it's just so good every time. Thanks for all the warm nights, Noodles!PS: I've mentioned cold and comfort and warmth so much that I forgot to tell you this restaurant is GREAT all year round."], ["Eric C.", "Noodles 102 is a tiny little unassuming restaurant located on the east side of Providence on the same street as Tallulah's and Bee's. It's probably a place you have driven by many times without knowing it because it doesn't look like much on the outside. On the inside it's a cute little restaurant designed to look a little older and to give a very homey type feeling. They have a menu with quite a few combination choices. Basically you can choose your carb, your sauce and then your protein to add to it. They have a large selection of noodles and rice dishes. I opted for the clay pot curry chicken dish which was certainly satisfying but not authentic Asian at all. Certainly had elements of Asian influence but do not come here thinking you'll get something straight out of Asia.With that being said, it is still a great place to bring people who do not like traditional Asian food. They have a large selection to fit a lot of people's tastes including those who are vegetarian or vegan. Parking on the street and reservations are not necessary!"], ["Jorge R.", "Great food experience again. Scallion pancake...Yum!Vietnamese soup...Yum!Jasmine rice with Ginger basil scallion...super yum!Drunken noodles...yum.Ambiance...hellish. :-(The kids and I had to sit next to a large party of zoo animals posing as humans.The waitress apologized but it left all of with headaches due to a couple of baboons who used profanity to punctuate every sentence they screamed across the entire block.When said baboons left to go to there car, for God knows what, suddenly I could hear myself think.Our check came with chocolate lava cake with salted caramel gelato...Yum!Will return for good food and super affordable price, but if I see the \"regulars\" in there I will run for the hills.Salud!"], ["Liz R.", "Love Noodles 102.  I've been a few times now and I'm still impressed.  Delicious simple menu, friendly service, very clean, BYOB!  My kind of place.  Check it out, I don't think you'll be disappointed!!"], ["Steven C.", "Since I returned from Tokyo, I've been on a complete noodle fetish.  Got back to PVD from a brief trip and googled \"Providence Noodles Asian\".  Hmmm, didn't start with Yelp but impressed with the reviews.I started with spring rolls.  They were tasty, crunchy and an overall crowd pleaser.  For a main course, I went with the drunken noodles.  It was a tasty dish and the udon was a nice change from the traditional flat noodles.  I can't wait to come back and try the spicy miso, red curry, etc.My only downside was the fact they don't take AMEX.  The website says they take all major credit cards and I'm thinking that's one of them.  If I'm on an expense qualifying meal, my employer requires I use it.  I understand it comes with higher fees but it will limit the frequency at which I visit."], ["Karen W.", "We discovered this place during a visit to Brown. It is a perfect place for a light, delicious meal( big or small as you prefer). The soups were very tasty and filled with fresh veggies, protein( meat or tofu) and noodles. If you need a dose of Asian style comfort food, this is the place to go. Also it's BYOB which helps keep prices very reasonable."], ["Jessica S.", "We were here yesterday for dinner. All of the food was very good. We got the nime chow, Asian cucumbers, beef soup with egg noodles and vegetable broth, and pad thai with chicken. The food is very fresh and I especially loved the soup broth. The service is very nice and sincere. The man working was very active in speaking with the guests. I love that it is BYOB. The décor is very simple and nice. I love the hanging lights. We will definitely returnThey do need to update their website as the menu is not accurate and I wish there were more info on it. People like to know about the food and the owners, especially with small neighborhood places.In response to the managers comments, yes I did first hear about you on Yelp. It has long been on my list of places to try"], ["Ingred S.", "Before we get into the food business , Homegirl want to know what happened to noodles 101.  This is \"102\" so what kind of monkey business did noodles 101 get in and out of real quick?  Homegirls ponderings may never be satisfied.If there is one thing about Homegirl that may surprise you, it would be this: though homegirl is easily the life of any *good* party, homegirl is no night owl .  So when my groupies chauffeured me through the streets of Providence, at such a late hour (7:30pm) homegirl felt like a young coyote in unfamiliar surroundings, in need of rest and terribly irritable.  Upon arrival of noodles and oodles 592 I wanted to shovel some food into the mouth and hit the road.  Reservation had been made and good thing because it was packed.  Homegirl could practically pinpoint the hour of which the man next to me last shaved, due to the fact that I was within chopstick reach of his stubble.  Due to the lack of elbow room it was quite noisy and often hard to carry a conversation.  The waiter was very casual  as his choice of denim and old navy polo made him look like a diner rather than a server.  He looked like his name could have been Ken.  Ken brought out the appy of spring rolls first.  (which to homegirls disappointment were fried).  I held a grudge against Ken because of those crispy rolls.  Homegirl had to remove herself from the situation and relieve the animosity  I was storing up against Ken.  I let the heels of my sky high leathers send the message that homegirl was not to be contended with as I walked into the restroom.  Homegirl was bout to collapse with the discovery that I was expected to do my business with 7 square feet of space.  I don't know how, but homegirl managed to do so in a lady like manner.  Walking back to the seat Homegirl noticed her meal had arrived.  A rice - vegetable -chicken dish with a mushroom sauce. It was like the song of a harpist: delicately strummings of familiarity with notes of pure radiance and mystery sprinkled in between.  Mhm.  Let the sit with your soul.  Eat that mushroom sauced dish and try and tell me there's no radiance and mystery a'strummin.  This dish saved my Friday night.  I was a wreck on heels until that first kernal of rice hit my luscious lips."], ["Dave L.", "I frequent Noodles a decent amount because I live next door. I am incredibly thankful that not only do I live next to a restaurant but it is as delicious a place as Noodles is. They have a great lunch special when you dine in that has a salad, dumplings and a dish for a low price. The dumplings come either steamed or fried and are super good (I prefer fried with the crispy texture). I tend to get the Pad Thai frequently, sometimes it's good to ask for a little extra sauce on it. The flavor is great. I recently tried their clay pot baked rice which was good, had a nice mix of veggies and an egg on top ( I prefer the noodle dish though). I plan to explore the menu on upcoming visits but have had trouble as I feel like I will regret not getting the Pad Thai...The appetizers are good as well, the Asian Cucumbers are a favorite. Cucumber slices marinated with red pepper flakes to give them some nice heat with the vinegar flavor that is just a step away from being considered a pickle. Definitely worth a try if you have never had before.The spring rolls are good as well.I highly recommend Noodles for an out of the ordinary meal!"], ["Kris D.", "Fantastic service and delicious noodles! This is BYOB which is fine, I am not one for bringing my own but see how a lot can benefit from it. This is a cute restaurant in the middle of a neighborhood and easy to miss. I usually order the Singapore Noodles and can't ever get bored of them, a rice noodle and lighter than most they serve them dryer, not too spicy with veggies and your choice of protein. I have also ordered the rice bowl, served in a clay pot, great presentation and also a nice tasty favorite! I have not had a wait, I think I have just been lucky. I picked up take out and was ready in 15 minutes and wicked hot!"], ["Kyle S.", "For a few years now, Noodles 102 has been one of my go to BYOB restaurants. Aside from the fact that you can bring in your favorite bottle or 6 pack to enjoy with dinner, the ambiance, delicious food and friendly service are definitely what keep me coming back.Whenever I come here the dish I always opt for and crave is the spicy bean thread. I have had the chance to sample bites of different friends dishes which are all quite tasty, but the spicy bean thread is where it's at. I love how the noodles themselves come from green beans and the dish is made with a sauce / broth that has a little spicy kick and plenty of fresh veggies mixed in (I ask for a double dose of veggies). Also, I have to mention that if you are going to get an appetizer, definitely order the scallion pancake...it's savory, flakey / crispy and comes with an awesome side dipping sauce.There are definitely a good amount of noodle, soup and rice dishes to choose from here...the menu isn't huge but doesn't need to be. The space inside isn't all that big so if coming with a group or even on a date night I suggest making a reservation. The wait staff is also very helpful / friendly and I appreciate the prompt service. Overall, if you are looking for a good noodle joint or BYOB place, then Noodles 102 is the place to check out."], ["Holly L.", "Yum yum yum! That is all I can say. Any place that allows you to build your own soup is where I belong. The choice of sized bowl would be an advantage, in case you aren't terribly hungry but want a taste of that liquid gold. The other noodle dishes other then broathed ones are also delicious. I suggest stopping by and tasting for yourself."], ["Mary B.", "Wish I'd found this sooner.  Absolutely delightful.  The staff is so kind and the food was delicious.  A charming keeper."], ["Jean F.", "What a dive - I'm in love!  We met a few friends here and we were far from disappointed! Super friendly (a little slow) service and a cozy warm atmosphere, coupled with great food and we've got a winner - pho sure! We split the name chow, pork dumpling and garlic edamame appetizers. All super fresh and full of flavor! The rest of the menu is a mix of pick your own soup, noodle or rice combination.  Lots of options but the servers are super helpful if you're unsure.  I got the bean thread noodle chicken soup and it was 'basic' but delicious.  I'll definitely be a bit more adventurous next time maybe with the coconut milk or Vietnamese soup!...and how could I forget to mention it's BYOB, so don't forget to bring your drinks!!"], ["Caroline M.", "Meh. I wanted to love it so much more.  It has all the things that hole-in-the-wall dreams are made of - the location, the cozy vibe.  But the food just wasn't that great. Totally unremarkable, in fact.  It's wonderful for the niche it serves the neighborhood, but if you're truly looking for delectable Asian food, look elsewhere. I recommend Sawadee, Apsara, etc."], ["Leah L.", "The best!! I come here weekly and never get tired of it!! So many favorites: soup, lo mein, pad Thai... All awesome!!!"], ["Volkan G.", "Places like these make Providence one of the best cities to eat out. Noodles 102 was one of the restaurants that I've heard of but never had a chance to go. It's a love at first sight. Noodles 102 has a cozy atmosphere where you can have tasty noodle dishes and soups . You can create your own meal by picking from the variety of noodles: udon, rice noodles, wheat, veggie noodles etc. then protein (chicken, shrimp etc.) and finally the veggies.  Great concept and perfect for those who are picky eaters. They do have some signature dishes with rice or noodles on the menu as well, plus the noodle soups.My favorite dish was the one they substituted noodles with cabbage and stir fried veggies with chicken. The waiter/owner called it the mushy ( not on the menu yet). He also mentioned of a new dish, \"spring roll salad\". It is not on the menu yet, but soon to be part of the menu. I went there with 4 friends and I had a chance to try 5 different dishes. I enjoyed all of them.It is hard to call this place a typical Asian restaurant. The dishes contain less oil, probably less MSG and other unhealthy stuff that a typical Americanized Asian food would contain. If you are a Asian buffet lover, Noodle 102 is too healthy for you. The best way to describe their food is; simple, refined, Asian, home made, fresh, creative, flavorful and healthy. Place is well decorated and cozy. Even though it's not big, tables are not too close to each other. The waiter/owner is extremely nice and he will tailor the food as you like. Definitely ask for his opinion and listen to his suggestions. It's a BYOB!!! This place is a gem and will be at the top of my healthy food place to eat out list.Food:5Drinks:BYOBAmbiance:5Service:5"], ["Jonathan W.", "Just one of my favorite places. Period. I love Noodles - the food, the service, the atmosphere, the everything. It's a fantastic place to come and get some DELICIOUS food, BYOB, sit back, and just have a great time with friends/family. I came here with several friend on each of our birthdays, all three times the management brought us  out free dessert. You just don't find many places like this anymore. It's a true delight."], ["Pearl J.", "Service was great. Food was so-so. We ordered their bestsellers like the pad thai and they weren't very good. Their pad thai is nowhere near as good as the ones I've had in Thailand and other places in Southeast Asia."], ["Fo D.", "Totally recommend this place. Come here at least once a week. Everything is always fresh and delicious! Can't go wrong with the lunch special either which includes small side salad, 3 dumplings (pork or veg), and choice of noodle. Definitely recommend the Singapore noodles, pineapple fried rice, or the lemongrass curry. It's pretty small inside and can get busy, but service is always great."], ["Michael B.", "Food was really good and fresh. Plus its BYOB."], ["Bill C.", "This place is awesome. I usually start with the quality but I'm going to start with service. The service was amazing. Best service in a long time. When we showed up - there were no tables. We decided to wait. They could not have been nicer or more accommodating while we wait. The chef greeted us with two chairs and a cold glass for our beer. Oh by the way - this place is BYOB which is the greatest value add any restaurant can have. I love bringing the good craft beer you can't get in any restaurant. Anyways - then the owner brought us edamame for our wait. No charge. Our table was ready in 15 minutes. Food was great. I had the stir fry. Also had nime chow that came with a nice peanut sauce. Can't wait to go back and try the ramen and bbq rice dish. Okay update - we went back and got the pho and the clay pot rice dish. Loved the pho but the rice dish is the SHOW STOPPER. I thought it was perfect    I had the Thai sauce with it. Loved it. Shrimp. Veggies. And no onions. I love the no onions part. I can deal with onion but most places overdue it. Not here. Noodles 102 and Den den are my two favorite places in providence"], ["Phil Z.", "The absolute best noodles and dumpings!!!! I love this place. Last time I came for the lunch special I left here and all I could think about for 3/4 of the ride back to Woonsocket was how friggin delicious the food I just ate was. I can't say enough about how good the food is here and great service!"], ["Nicole W.", "I have a soft spot for noodles and Noodles 102 is good for when you need a little variety in your dining rotation. Their spicy miso soup is flavorful and delicious and their singapore noodles are great for when you just want a heaping pile of curried carbs to shove in your mouth. You get good sized portions for a good price. I like the mix and match nature of the menu. I like the cozy hole-in-the-wall atmosphere.I don't care for the service. The food always comes out quick and hot. That's not the issue. The issue is getting someone to actually come over and take your order or, even worse, take care of your check when the meal is over and you're sitting around waiting to leave. It seems to be a constant struggle with them and results in lukewarm feelings towards a place that I would otherwise love."], ["Aia T.", "Best Chinese food in RI! Noodles are not MSG flavored, food is not salty, and not oily for sure. Service is prompt! Went here twice, one to pick up and one to dine in. Their noodles are the best esp during winter time. I look forward to having it again once the weather gets cold! Highly recommended!!"], ["Michael K.", "This is a perfect small restaurant.  I have eaten here about 10 times, both during casual midweek lunches and during the busiest weekend nights.  Each meal was equally perfect.  Most of the times, especially at lunch the owner/chef was there to personally greet us.  He makes a point to learn names very quickly for repeat customers.  The food is perfect.  The lunch specials are excellent with a very fair price for a combo of soup or noodle dish and appetizer.  The garlic salt edamame is fantastic and the lettuce wrap appetizers are the best in town.  The dumplings are all excellent fried or steamed.  The menu concept allowing infinite variations of flavors, noodle styles and soup or stirfry combos works very successfully and is easy to grasp.   This is the sort of restaurant I show off to friends, feel comfortable eating alone with, or have a wonderful romantic mid-day date with my wife.  It just works every time. Don't miss this place!"], ["Joshua J.", "From the outside this place is very inconspicuous. Once you get on the inside and smell whats cooking you wouldn't forgive yourself for the million times you drove by and didn't stop in. Their stir fried drunken noodles are phenomenal, along with the coconut broth. Their noodles are freshly made and the best that I have found in the city so far!"], ["Jessica D.", "I had been wanting to try this place for awhile. So, decided to order takeout on a Friday night after work. I placed my order around 8PM and was told 30 minutes for just a bowl of noodles with tofu and shrimp with broth!When I got home and unwrapped everything what looked good was a bit of a disappointment. There were only 2 shrimp in the entire bowl (and there is an extra charge for shrimp). The coconut curry broth was tasty, but it needed more protein and veggies to make it a meal. With so many great restaurants around, I'm not in a hurry to go back for a second try."], ["Kisha T.", "I'd consider myself a soup expert with a focus on noodles. Seriously. After exploring many, if not all, soup/noodle places in the Providence area, I was surprised to see that Noodles 102 had managed to not be on my list. On a chilly Monday evening, Ryan and I decided to check out what noodly goodness this place had to offer. The place is cozy and rather small. It could be romantic date location OR a fun place for girl's night. One thing to note: this place is BYOB. JACKPOT.Here's why I gave it only 3 stars:- The service, while pleasant, was really slow. It took us a long time to get our soups after some rather mediocre Nime Chow. - Portions are ok but for $10 a bowl, I expect to be able to swim in my bowl of soup especially when many pho places around Providence make a solid bowl of soup for under $8.Overall, I think the place is a good place for variety but the price point is a little much. Maybe I'm a little spoiled with getting killer nime chow for $3 and a giant bowl on Cambodian Rice Noodle Soup from a place the rhymes with Hapsara for $5. :)Not a bad place but not nothing too memorable."], ["Nathan A.", "If I lived closer to this place, I'd go every few days. Fairly priced. Great food. Wonderful staff. Cute vibe. The selections of noodle soups are awesome. They cater very well to vegan and vegetarians. Their stone pot dishes are great...and very hot in temperature. Great apps. Love the nime chow. Only 2 negative thoughts: 1-the chicken is usually dry and can tell it was frozen. I opt for veggies instead. 2-they randomly close for vacations and such without a lot of notice."], ["Andrew D.", "I love this place, house special stir fry is always fresh and healthy. I also enjoy the dumplings, fried or steamed both ways are superb. Also I usually order chicken fried rice which is also excellent. You really can't go wrong at this place, high quality fresh food at a great price."], ["R. B.", "Having been a server for some 30 years it's a very rare occasion that I am impressed with the service anywhere never mind a small Asian cafe. Feeling very under the weather today with a bad cold.  I was yearning for a good bowl of hot soup. I made this known to my server  Erica as I walked in.  I asked to be seated away from the other diners, she was accommodating right from the get go. I asked if the soup had garlic and ginger,  she said it had garlic but she could add ginger if I wanted. Erica immediately asked if I  would like a hot tea. the soup I  had, it was the house special soup,  I had it with chicken and shrimp.  It was piping hot, filled with vermecelli noodles, pineapple chunks, fresh tomato,  most importantly it wasn't greasy at all.  EXCELLENT! !When the check came Erica brought me a container of fresh ginger tea to take with me.  She did this on her own. I left feeling better about my cold and mankind in general.  You can't teach what Erica brings to her server job at Noodles 102, she was above and beyond the entire meal.Erica, thanks for restoring my faith that there are still servers out there are willing to please the customer at modest check averages."], ["Joe C.", "This place is incredible, 5 stars all day. Very vegan friendly and cheap! Will be back soon!"], ["Lauren A.", "Noodles 102 is starting to become a regular for us on date night. You can bring your own bottle of wine (or beer) and they don't charge an uncorking fee! Don't be thrown by the shyness of the wait staff- they are incredibly nice and helpful! Once! When i was taking the rest of my soup to go, the server asked what kind of broth I had picked, and put some extra broth into my leftover to go cup. How nice is that?!?I recommend the pork dumplings as an appetizer. They are crispy on the outside, a little doughy, and stuffed with the most delicious spiced meat- my mouth is watering just thinking about them! Eat them as soon as they plop down on the table when they are still super crispy. I'm writing this weeks after my last visit, so i can't remember which noodle bowl is my favorite- let's just say i've never been disappointed with anything i've ordered."], ["Doug C.", "This is the kind of place I wish I could give 6 stars to. While easy to miss, and not overly appealing from the curb, this place could easily define \"hidden gem\". Yelp has continually been a source in my search for good Pho, and with positive reviews from a large group of foodies, Noodles was my next stop.  I made it in just before their lunchtime closing (they run 11-3 then 5-9 during the week). We were greeted at the door by a younger man in a white chefs coat who saw us to our table, filled our waters, explained their menu and brought us out a small plate of \"Asian style cucumbers\" that were absolutely delicious. We were then greeted... Not by an Asian man or woman (that has been the case in nearly every Pho place I have been to), but an older, French gentleman (who may have been the owner as I heard another employee call him \"boss\"). He also went over the menu, told us about a handful of specials and brought us over a small plate of fried rice. As always, we went fairly simple with the order. With about 10 noodle types, several broths & a selection of \"add ins\" it was a great opportunity to sample something new.  I went with the wide rice noodle (listed as freshly made) in chicken broth with chicken and made spicy (they have a spicy miso option I may try next time as well). The kids went with thin rice noodles, and the wife had a coconut chicken clay pot. We also (of course) got an order of fried pork dumplings. The dumplings came out -not pan fried - but deep fried, which I loved. Normally I prefer steamed, but the extra crisp of these was great and the filling was very tasty. Our meals came out soon after (actually some of the fastest service at a noodle place I've had). The large, tilted bowl was full to the top of hot, steaming goodness. The clay pot smelled fantastic, and the kids soup was nicely split into two bowls. Plain and simple... It was all fantastic. I absolutely destroyed my noodles. So much to the point that for the first time at a noodle/pho place, I drank the entire bowl of broth as well. The wide rice noodles were reminiscent of the \"drunken noodles\" at Thai Excursion that I love (that is a wok dish, not a soup) and super fresh. The veggies in the kids noodles were non-traditional corn and carrots which they loved (of course my son slathered on their chili paste for the extra kick he loves).  I also grabbed a few forks full of the jasmine rice/coconut chicken clay pot. It was very flavorful and a nice big portion. We were sent on our way with some Ferrero Rocher candies and a handshake. Bottom line - though there are chopsticks and Asian inspired dishes, this isn't a typical Pho experience. That being said, it has defiantly become my favorite spot for a warm bowl of goodness. There are many options to try. While they don't have different size options for the bowls (I'm an XL eater for life), you can see the pride in their food, from presentation to taste. The server/owner was comical, soft spoken, and very pleasant. He had a great rapport with some other customers who appeared to be regulars. We were actually craving more later in the night and will definitely be returning soon. Fantastic job!!"], ["Jean C.", "This cute little East Side hide-away is fabulous! The food is outstanding and the service is wonderful. I always order so many delicious appetizers that when the main dish comes out I'm rather stuffed, but the good news is I always have plenty to take home for my midnight snack! You can't miss with this place! Owner is almost always there and he is such a friendly and accommodating guy! I highly recommend NOODLES 102!!!!"], ["Harris R.", "Not bad but felt overrated especially for providence. Prices was fair and atmosphere was cosy. They recommend reservations because they have a small number if tables.The Singapore noodles were good. Not as spicy as I personally like them."], ["Erman K.", "Noodles 102 is one of those restaurant that makes you enjoy dinning out. Cozy place, really good and health menu and great atmosphere. They have one of those menus that you could try anything every single time. It's really hard to have a favorite dish here since everything is so good. Glad to have them in this city and glad they keep doing what they do..."], ["Karen G.", "This place looks very unassuming and maybe even not attractive at all from the outside. But it is so worth not judging a book by its cover here. The food is so very delicious. Lettuce wraps were yum with great portions   Hot and sour soup was amazing. Cannot wait to go back and try everything else. Inside is small and intimate. Owners are a delight. bYOB!"], ["Desiree B.", "We had a great lunch.  Loved the gluten free options. The service was great.  Food was fresh."]], "Lili Wok": [], "MuMu Cuisine": [], "Yan's Cuisine": [["Qian Z.", "As someone who frequents Thayer Street, I'm frequently disappointed by poor customer service and small portions for exorbitant prices.Yan's absolutely kills it at both.I walked into Yan's, and told the front desk man I couldn't decide if I wanted their beef noodle soup or tomato noodle soup. He asked the cooks, why not both, and they threw in a few sliced tomatoes with the beef.Usually, a cashier might slyly tack on an extra buck or so onto your order. Nope! Same exact price.Also gave me a free cup of ice water while waiting, which some places don't do. Customer service is amazing -- they bend over to make you happy here, and in a genuine, respectful manner.So when I got the food, I was thinking -- knowing Thayer Street, $9 doesn't get you much; probably the beef portions are skimpy or something. But nope. Gigantic beef portions, generous slices of tomato, and the broth was killer. As someone who's visited China multiple times, very high on the 'authentic' scale, especially at that price.This place bucks the trend for restaurants around Brown / RISD -- BEST customer service, most bang for your buck, and tasty."], ["Robert S.", "Got delivery for the first time last night.The online menu is great.    Easy and efficient.     Got several dishes and this is my feedback (I ordered everything low salt/low oil):Boneless pork ribs - Dry.tasted old - This is a shame, because Char Siu is one of my favorite things to get from a Chinese restaurant.   Loved the ones that are moist and tender in the center, just nice and crispy on the edges. Pork Lo Mein - Best of the things we ordered.   Nice noodles, tasty.   The pork was not fresh, it tasted old.   Maybe not many people around order the BBQ pork dishes.  General Tso's Chicken - It was good but not great.   The broccoli was overcooked and tasteless.   Ginger beef with Sting beans - Little beef, string beans were overcooked.No the best around, but they will do in a pinch when delivery is needed and we don't have time to run to China Fun in Cranston.    They deliver within a 3 mile radius.   Their menu is very extensive and they have a section of authentic Chinese dishes with exotic choices that you don't see in Americanized Chinese restaurants...that is a promising sign."], ["Damon S.", "As a brown student, Yan's has been my regular lunch or dinner spot. I ate here at least once a day and the food and service was just what I needed most of the time.The restaurant is clean and quit unique. It has two stories as the first floor is more like a cafe environment  and the second floor is more upscaled dinning settings. Their menu is quit large because they do both Americanized and traditional Chinese cuisine. It gets really busy at times especially during lunch time, I usually avoid their peak time because I once did wait for 40 minutes to get my food after placed my order with the waitress.I pretty much tried all their combo plates and rice platters as well as their noodle soups, nothing really disappointed me and 8 dollars and change could take care of everything! I'm eating here again and then will be heading home for the break. The owner told me they are working on several things to give Yan's a new look both on the restaurant and the menu when school starts again. I hope they do well during the summer and looking forward to see the change when I come back!"], ["Ziye W.", "Great food at reasonable price! Especially recommend the spicy fish, tremendously delicious"], ["Janelle M.", "I've ordered a few times and haven't been happy with anything yet.. I'll move on to a different one now. Chicken is always dry and hard, food is greasy and bland."], ["Anica G.", "I love Yan's. Best Chinese food in easy walking distance of campus in my opinion. I really want a T-shirt that says \"I stand with Yan's\""], ["Eva A.", "If you're looking for good Asian for a good price with a speedy, friendly delivery, this is a good option. I eat a lot of Asian, and Yan's is not the best I've had, but tasty nonetheless. I ordered the Nime Chow with no shrimp. The size was bigger than most, but mostly because it was filled with more noodles, and had very little of the good stuff like bean sprouts, lettuce and basil. I also ordered the Home Style Tofu and Baby Bok Choy with mushrooms. Both good, and the portions were big enough to last more than one meal. Overall, if I were stuck at home again and uninspired to cook, I'd order delivery from Yan's again."], ["David Z.", "Good service, solid food with good quantity and constantly improving quality makes this place a frequent lunch and dinner spot for me"], ["Ayan T.", "It's been a lunch and dinner spot for me ever since I got to Brown. For reasonable price you can get quite a big meal. Most of the entries I've tried have been mad delicious, although sometimes I'm not very delighted by certain food they serve. Just make sure to ask if you're not sure what to order."], ["Tara D.", "If you have read my reviews, you will notice how I complain about mediocre to down right nasty Americanized Chinese food in Rhode Island.  I will welcome you now to one of the most authentic menus in Rhode Island.  Note, if you still order scorpion bowls and general taos, then don't stray from those dishes...  Try this Szechwan restaurant if you crave authentic Chinese...  If this is a new experience for you, do not believe the reviews, ask the wait staff for ideas.  Shu is an amazing ambassador to lead you down this wonderful food journey to properly experience traditional Szechuan cuisine.  The dishes I love are salt and pepper calamari and shrimp, and the super spicy chicken with authentic dried whole chilies.  The baby bok chow with fresh shiitake mushroom is amazing.  The food is fresh and tasty.  If you are looking for frozen rehydrated cheap food, do not come here.  They do not recycle their food.  Fresh and made to order.  They do not disappoint."], ["Cathy Z.", "As a student, I love this place.  As a wannabe connoisseur of Chinese food, I'm a little disappointed. The portions are giant and the prices are great.  There's a huge selection of combo plates for $6-7 at weekday lunch and $7-8 at dinner.  These come with pork fried rice and either crab rangoon or an egg roll.  The rice platters are a little worse of a value, but offer more interesting entree options like eggplant with garlic sauce or a fried chicken quarter.I had mapo tofu, and it was a little bland.  There wasn't any ground pork on top, and the sauce was more starchy than chili-oily like I'm used to.  The ingredients seemed fresh, though--there were lots of scallions mixed in, which added a nice crunch. Also, for a restaurant that I'm sure does a lot of takeout business, the inside is attractive and well maintained.  I was hoping for even more authentic flavor, but I definitely want to come back and try more dishes."], ["Dominic W.", "I was hoping for better food than the previous restaurant here. I walk in and it seems pretty similar to the previous. The menu is revamped and prices a little lower. I was so hopeful that I finally had a good Chinese place in providence without going to cranston. Unfortunately I was let down again. We tried a lot of dishes - general tso, stir fried veggies, dumplings, sweet and sour chicken... The wrappers on the dumplings were so thick you could barely taste the stuffing. The batter in the sweet and sour chicken was also so thick and doughy I ended up cutting off all the outside. It just tasted so mealy! The atmosphere - jam packed and felt quite uncomfortable. I almost hit my head on a TV because our table was right under a TV set...Most combos come with a side and rice. Vegetable combos for some reason do not come with the side and any rice - why do they charge similar price to a meat dish for simple vegetables, yet not provide any rice to go with it?"], ["Andre V.", "I've had good chonese food before and this is not good Chinese food.  $11.50 for undercooked,  tasteless veggies and no rice?  You cannot be serious.  The struggle is real at this place.  Save your wallet and taste buds from the insult and go elsewhere."], ["George B.", "This is the best place in Providence to get authentic Chinese food as far as I know. It's very nice to have a place where close by I can get real ma po tofu. And their string beans with pork in black bean sauce is to die for. Their sautéed broccoli with garlic is also excellent. There are two downsides sometimes. One is that there seems to be one cook who is particularly lazy (though he or she doesn't seem to be there most of the time), not taking the time needed to make these dishes perfect. The other is that it can be a bit on the expensive side, but the portion sizes are pretty good. All in all, it's still my restaurant of choice, and probably my favorite one in Rhode Island right now. I miss the old Dragon 2000 that closed."], ["Andrew L.", "Finally an authentic Chinese restaurant has come back to Providence. I went here a few days ago because I saw that it had recently opened and I was pleasantly surprised.  The main draw here is definitely the good. The decor and service are both fine, but I was mainly after some good Chinese food. We had the Chengdu spicy dumplings, Chongqing style dry chili chicken and three pepper chicken. They were all very tasty and different than what one would expect to find at a typical Chinese-American restaurant. I can't wait to go back and try some of the other items on the menu. I definitely suggest you stop in if you're in the area and want some real Chinese food."], ["Judy K.", "Three Stars: Bad food, but still worth a second try.The restaurant was easy to find. It has a nice and clean decor, the menu selection is appealing, and the service was appreciable. The waiter explained that the restaurant had only been open for 3-weeks, & he didn't know much about the dishes. I didn't mind so much, & ordered according to what seemed appealing. My order included Chengdu Spicy Dumplings, Beef Stew Noodle Soup, and Beef Curry Rice platter. Dumplings were a huge disappointment. It was as if they had run out of filling, and thought a pea-sized clump was sufficient and appropriate to use (pic included). The noodle dish was boring as the beef was dry and difficult to chew. The noodles were still clumped together at the bottom of the bowl. The only redeeming dish was the Curry Beef with potatoes. Overall, while the food was not impressive, I would still give this restaurant second visit just because I am still hopeful and appreciate authentic Chinese food."], ["Marty S.", "This place is GREAT.  I have no idea how authentic it is and depending on what you are looking for it might not be what you are looking for.  But if you are looking for something GREAT - look no further.For just like 8 bucks you can get a combination meal that comes with rice and crab rangoons or spring rolls.  They're effing amazing.I usually get the sweet and sour chicken, which comes with pineapple.  I think some people might say they've got too much batter, but if you can free your mind from those sorts of expectations, you'll realize that it's DELICIOUS.I know this review sounds like I'm joking but I really love this place and have been a supporter since it opened.  I will be back often."], ["Bonnie H.", "After waiting the hour I was told my order would take,  I had no food nor contact from Yan's. I called GrubHub to check on the order.  Their system reflected the order should have been delivered.  Yan's wad contacted and reported the order was backed up because of the rain.  I asked if they would recook the order and was given fluff about how difficult it would be and no promises could be made.   Well,  I hope Yan and his staff are hungry because I canceled the order. I would be willing to bet that Yan would expect his money of the good was delivered and not accept an excuse about rain preventing me from getting to the ATM.  At least call the customers so the orders can be canceled"], ["Josh B.", "I don't give one-star ratings unless the restaurant is truly terrible. That said, my dining experiences with Yan's Cuisine have been far from satisfactory. I typically order a lunch or dinner special: nothing fancy, just some classic American Chinese food. Typically General Tso's chicken or sesame chicken. The pork fried rice is fluffy and not overly salted, actually quite good, and their egg rolls are large and tasty. However, their chicken consistently disappoints me. Some of the most tasteless chicken I've ever tasted, even for low-scale chinese take-out places. The sauce is inconsistently applied so either the chicken is dry and chewy or overly sauced and too sweet.I've also had poor experiences with waiting time on food, often waiting long after it was supposed to be finished for small orders, both for take-out and dine in. My girlfriend once ordered a dumpling lunch special and waited at least 30 min before asking them where it was, they assured it was almost ready, then brought out some room temperature dumplings 5 minutes later. I suspect the food was just sitting on the counter in the kitchen and no one brought it out.However, the staff are polite, the restaurant is clean and attractive, and the prices are reasonable. The location is also great for living around Brown's campus, but the quality of the food has let me down too many times now. I will stick to ordering delivery from Goldstone or Khoo Kitchen."], ["August G.", "You know I would walk by this place every day on my way back from work and be like damn that entire restaurant is full of East Asian (most likely Chinese) people, I've also seen some of my Chinese colleagues speed past me to go in there. So I was like this place must be pretty good!One day I finally felt like ordering some Chinese delivery. I get on the phone and ask if they have gan chao nu he and jiao yan pai gu (not sure what these are in English but I think it might be chow fun and salt and pepper pork), they do that's awesome. My partner also wants the orange chicken dinner with lo mein and an egg roll. So you know, we did both things, Chinese Chinese food and Americanized Chinese food. (was kind of funny I was talking on the phone to the guy in Mandarin and when he repeated my order back to me it was also in Mandarin except for \"orange chicken\")It got here in about 30 minutes which is pretty good for delivery times. However the food was tragic. The salt and pepper pork was overly battered and the gan chao nu he was so bland. Both MuMu (now Gangnam Flavor I believe) and Golden Stone have way better salt and pepper pork, Golden Stone doesn't have gan chao nu he but that's alright. My partner said the orange chicken was ok but she's had better. At least the lo mein was good...Don't think I would order from here again. It was cheap which was nice but I think Golden Stone is just as cheap and tastes better. MuMu is even better than both of those but they're also more expensive so it's a tradeoff. Definitely not Yan's again though."]]}