{"Hope Street Pizza & Family Restaurant": [], "Efendi's Med Grill & Bar": [], "Mediterranean Grill & Pizzeria": [["Michael B.", "I think this used to be a Burger King. The great news is they are now serving a very good burger. Burgers were good, service was good, and the price was low. French fries were also very good. Burgers are far more than a regular person can eat and the bacon on top was cooked perfectly. There was so much bacon I had to take some off. The decor is even pretty good even after they recycled some of the BK items."], ["Kristen A.", "Pretty good little joint. Menu is huge...and a big overwhelming.Food was pretty good. Portuguese calamari was very flavorful, but a bit soggy. Fried pickles were good. My fellow diners enjoyed their meals much more than I did, but I did just get a wrap. We split a dessert...that was great!I saw a few tables near me that ordered pizzas...boy, did they smell great. Would go back just to try it!It was a very muggy day when we went. They put us in a section of the restaurant that was surrounded by glass. Let's just say, it was pretty humid in there. And service was a tad on the slow side. But, the waitress was very friendly.Will be back with the kiddos to try the pizza"], ["Maria P.", "Consistent great food makes this Italian foodie coming here on a regular basis! Obsessed with their chicken and spinach salad. Their specials never disappoint either. Only complaint is sometimes service can be inconsistent. Go and enjoy the food, you won't be sorry!"], ["Jen V.", "Krystal was the best bartender ever! She greeted us and offered us all of the specials of the evening. My boyfriend took up her offer on the Delish seasonal cheesecake martini! We ALWAYS get the crab cakes because of all the restaurants we've come to they are the best priced with the BEST taste. While we have an app and a cocktail at the bar we order our dinner to go. Once we got home our experience continued to be great! Awesome time..."], ["Dominic B.", "This place does pizza right with the steak Alfredo and buffalo chicken being my favorites. Haven't explored much of the rest of the menu though."], ["Matt E.", "I've been up all night with food poisoning.  Never again!  It turns out I know someone else who had the same thing as me (steak tip salad) and also was sick."], ["Chris l.", "A little disappointed at my experience here lately. I came here every so often but today I got takeout on the phone I asked if the buffalo chicken wrap was grilled chicken or fried the girl on the other end said \"I don't know@ what is wrong with that? So I specifically told her I wanted fried chicken, didn't come that way. And the portion size on the desserts the past two times I've been here are pathetic, I could eat this cheesecake in two bites. Very dissatisfied you lost a regular customer"], ["Erin N.", "Overall our experience here was mes-a-mes. It was a typical weekend and we wanted something different so we stopped in to this Mediterranean Grill. come as soon as we walked in I was fairly sure this wasn't going to be the favorite of my places.From the outside it seemed as if it was going to be really fancy but when we got in it almost reminded me of an old Pizza HutThe prices were far beyond what the food you actually getting was. and the waitresses seemed as if you were a burden to them. she had a smug look on her face the entire time we were there. Her tone of voice stayed monotone the entire time.The physical food itself was very  good. But for two adults and one young child, $70 for lunch is ridiculous."], ["Michael F.", "The food was good....not enough help at lunch. Will go again !"], ["Bob C.", "I did have a gyro but in a burger form. The piece of lamb was huge. I think it should have been in strips in the buns. Still had the tzatziki sauce, tomatoes and onions. It did have slice of cheese on top which I didn't quite understand. Gyros usually don't have cheese in them. Overall it was a good burger but I would go back to the original gyro."], ["Ed S.", "Great food, large menu, friendly staff, death by cheesecake, lol!!!   Try the hummus w pita bread for starters!!"], ["Linda A.", "I was pleasantly surprised by this place! I visited for lunch with a couple lady friends, and we all enjoyed our meals. We started with perfectly crispy fried pickle spears and some of the most delicious Portuguese calamari I've ever had. My lamb gyro was super yummy with plenty of meat, a super soft and fresh pita, and some really delicious tzatziki sauce. One person at the table ordered the lunch portion of baked stuffed scrod, which looked wonderful, and the other had a veggie wrap. We even tried dessert -- the bananas foster cheesecake. It was tasty, but for some reason, I was anticipating actual caramelized bananas on the dish, so I was slightly disappointed. It was super rich and sweet, so I'm glad I was sharing. All in all, a great experience -- can't wait to go back!"], ["Mike P.", "Second time I've tried this place and second time it's been a TOTAL disappointment. The food here is poor quality. My chicken Marsala  was a two small, low grade pieces that was bland, and in water masquerading as masala sauce. The French fries must be the cheapest kind they could get from a distributor. The chicken Alfredo wasn't any better. Previously I tried their pizza which was like the crappy Mama Celeste. There's too many similar style restaurants that offer a better quality and take time with recipes, ingredients and quality cuts. #FAIL"], ["Amelia S.", "There are not a lot of options where I work...and sometimes you just want to have a good lunch and chat with a friend.It's consistent, the menu is huge (could be good or bad), and the prices are reasonable.Is it the most amazing lunch you've ever had? No. But I wasn't expecting that either. Yummy salads and sandwiches. Bonus points for drive thru if you're picking up!!"], ["Sarah E.", "Whether for lunch, dinner or a drink, the Mediterranean Grille is a real nice spot in an area that lacks options.The food is always good. And the service has always been fantastic. I highly recommend the salads (Greek is a personal fave). I also have loved every special I've tried. They are huge. Don't hesitate ordering the small. I do not believe I have ever finished it. And I love that the salad is loaded with all the extras (black olives, cucs, onion, tomatoes, feta cheese). It's a perfect combination.The sangria is a house specialty. Seasonal and huge!!And I love their pickup window. It's easy to swing by if you've got kids in the car, are rushing in for a lunch break or on your way home."], ["Carol G.", "Sat at our table for atleast 30 minutes before walking out. The mother's day menu looked good unfortunately we never got waited on. They should have taken our drink order instead of wishing me a Happy mother's day on my way out the door without eating....two thumbs down!  Worse part is that the place wasn't even busy...empty tables and the  waitstaff just circled the room avoiding eye contact. Not the type of service they've given us in the past. Extremely disappointed."], ["Mike D.", "Great food and great service. Our waitress, Justine, was very friendly and understanding. We had both the Bianca pizza and a Greek salad both of which were delicious. Great place and we will come back again."], ["Chris M.", "Good value priced lunch options. Good choice for a quick business lunch. Great dessert options avaiabme all the time"], ["Lisa L.", "Family favorite! Everything on the menu is great! Portuguese calamari is so tasty!!  Kids love it!"], ["Kevin l.", "This place is REALLY good... I've had a number of their dishes and hav enjoyed them all very much! Definitely try the Portuguese Calamari & Greek salad!"]], "Oasis Grill & Market": [["Camille M.", "This was my second visit to Oasis, (I've been dying to come back from the moment I left the first time!) and my friends and I were not disappointed. We started with an appetizer \"combo platter\" with hummos, tabouli, and baba ganoush that was served with fresh pita bread, and an order of stuffed grape leaves. All were delicious, and the portions were generous. Be sure to try this appetizer, it is the best in the area. It is a nice introduction to both Mid-Eastern food, and any dinner or sandwich that you might order. We tried a house smoolthie drink, which was a blend of yogurt, banana, and mango. It was excellent, though really thick in texture! For dinner, we each ordered sandwiches, including a falafel, a kafta, and a veggie burger. They were delicious and included hummos, tomatoes, lettuce, pickles, and tahini dressing rolled up in a large freshly baked pita bread. Really filling and yummy.... We actually ended up taking home leftovers. The service is excellent....really friendly and attentive. The owner and other workers are really nice also. Ventured into the bakery/store, and can't wait to visit again. The prices are excellent and the quality of food is outstanding. The restaurant is also spacious is really clean.Was this review helpful? Yes | No"], ["S. R.", "This place is one of the very few places that offer authentic arabic food. There is the regular menu with tradition middle eastern fair (like kababs, hummus, etc). However, they have a special menu with authentic food (e.g., kabsa, bamia, etc). The food is yummy, prices are reasonable and they have nice relaxed setting."], ["Cabernet S.", "This place is a shining example of something being good, but not great. Mediterranean and mid east food has always been one of my favorite lunch cuisines. Gyros, kebabs, bring it on. It's all here.The problem is that there is very little to set the food here apart from anything else. The beef kebabs were nice but nothing unique. They felt devoid of spice or any special kind of flavor. Maybe a spice infusion is necessary? Also, the complementary fillings like lettuce and white sauce left a little to be desired. What I loved however was the grilled eggplant sandwich, which had just the right amount of breading and char and tasted great. Worth a trip if you find yourself in the area."], ["Russel B.", "Oasis Grill & Market is AWFUL...just AWFUL.Let's start with their SCAM they call a \"groupon.\"   The groupon stated that we had to spend over 40 dollars in order to receive the 50% discount.  The groupon that we purchased was technically intended to be for a group of four people. We had a party of 3.  HOWEVER, we ordered two large pizzas and two gyros that would be more than enough food for four people to eat from.  The total price came out to 45 bucks which was well over what the groupon stated! The manger absolutely would not accept this groupon when it came time to pay simply because we did not have a fourth person sitting beside us.  The amount of nasty food we ordered was more than sufficient to satisfy the groupon.  We explained that he will lose our business if he didn't honor his groupon, but he didn't care.  His apathy toward us was shocking to see because he clearly doesn't want to satisfied customers. So we left and we will NEVER go back there.Let's move on to service, or the LACK of.  Our waitress never came back to our table to check up on us.  In fact, she was LITERALLY smoking hookah with some of her customers.  God forbid she do her job!  We were afraid to ask her for extra napkins or a refill on a coke because we thought we'd disrupt her social life.  It also took her a good 30 minutes to bring us our check.  LITERALLY, 30 minutes. Cleanliness.  The place was pretty dirty.  I made the mistake of going to use their restroom.  There was random junk on the floor in the hallway leading to their nasty bathroom.  The floors were sticky and wet.  I don't recommended this place as they're not very friendly and they don't honor their promotions out advertisements."], ["Jessica S.", "Ordered a delivery recently. Hummus and salad were both very good. The chicken skewer was good but the rice that came with it was inedible. It had a strong spice in it that I've never had before from a place like this. My friend and I both did not eat it. Falafel was ok but I have had better in Boston"], ["Tawana B.", "I had a bite of chicken swarma from this place 2 years ago, it was yummy.  Lately, I have been ordering from this place since April or so.  I love the food, its fresh, delicious and you can either go healthy or  deep fried death.    Finally, fresh tasting chicken wings, so they obviously change their fryer oil,  they're salads, wraps, stuffed grape leaves everything is great.  The shop is an excellent and smart adddition for the neighborhood and they are extremely helpful, good service and getting better with deliver times (I live in a weird part of the west side).  I highly reccomend it."], ["A. A.", "So I don't understand all the reviews speaking of fresh taste and this is a horrible introduction into Middle Eastern food. The food is bland, lacks spice, lacks salt, and is overall very greasy. If you're here for a sandwich or a wrap, do yourself a favor and head over to East Side Pockets on Thayer. Service is down the drain as well, they'll try to serve you pre-made warps and roll their eyes if you have to change an order...overall I've experienced better."], ["Kat F.", "Today was my first visit to this market, and it was promising. All the prepared foods at the market looked fresh and smelled amazing - and I had no idea they delivered! The selection of Middle Eastern groceries and spices was pretty extensive. I own a hookah and have been looking for a place close to downtown Providence that sells tobacco and charcoal for reasonable (read: not Thayer St.) prices, and they have Al Fakher for $13.99/250 grams and Nakhla for $6.99/250 grams, with a decent selection of flavors. I will definitely be back soon."], ["Kim S.", "I wasn't a fan of this place, maybe I didn't order the right stuff, but I could hardly eat what I ordered, which I remember being dry and lacking flavor. Needless to say I shall not return. The environment wasn't terribly inviting either."], ["E C.", "Was visiting Providence and found Oasis on yelp... It was great to eat dinner and smoke hookah at the same place. Food was good, service was speedy and friendly."], ["Paul M.", "This is a local Palestinian owned business that is half restaurant and half market. The market is very well stocked with both general supplies and more specialty items from various Middle Eastern countries. The food is absolutely superb and is fairly cheap (10 dollars can buy you a delicious wrap + fries + soda). The hummus has olive oil in it and is absolutely delicious along with all their other food, it is also vegetarian friendly. The waitstaff are quick, accurate, kind and helpful and the fact that there are different specials each day as well as a wide-ranging menu doesn't hurt (including \"American eats\" for those who are afraid of trying middle eastern food - great for kids i would imagine).  The atmosphere and decor also add a level of enjoyment to ones email as well - overall Oasis Grill is a fantastic, and inexpensive Middle Eastern eatery and market locating on the West Side."], ["Arley Rose T.", "man, these guys have the BEST falafels in Providence... (well, since the greek guy in the Arcade - but he's closed now...) I suppose I've been spoiled by really great falafels in New York City, but these guys do an amazing job! They're huge and delicious! And their market has a lot of really colorful items to explore. Nice people! Definitely check it out!"], ["Aaron S.", "This is the worst falafel I've ever had.  I threw my sandwich away. The falafel had the texture of a hairball, one that had been sitting under the couch for a few weeks."], ["Ryan B.", "I LOVE Oasis Grill. I work not far away and it is our go-to for lunch and has been since we discovered it. Honestly, it doesn't look like much on the outside, but on the inside, it's very nice. It is both a market and a restaurant. And you can eat in the dining room with a waiter/waitress, or just pick up your food as take out, grab a drink from the market and sit in this low key cafe area. The falafels are great, so are any of the kabob platters (there's a lunch size portion of this that is still pretty big). But even if you just need a quick chicken caesar salad, etc., you can count on Sami and his crew to do it right. Definitely worth checking out!"], ["Emily H.", "The oasis grill was surprising jem over in one of the tougher neighborhoods in providence.  But there's parking right on broad and a parking lot.  My friends I had done for the falafel event of the decade and it certainly did not disappoint.  The food was all delicious and the quantities huge.  The table next to us ordered the specials and I'm going to try one of those the next time I go.  They looked even better than what I had."], ["Vanessa C.", "great spot for lunch or dinner on the west side. came in for a quick bite with a friend. we split the appetizer platter which came with hummus, baba ganoush, tabbouleh, pitas and some pickles. all the items were pretty standard, good but not exceptional, but its worth noting that the portions were HUGE! great value and perfect for sharing. he ordered some grape leaves, which came with some cucumber tzaziki. I sampled one and it was plump with ground meat and not too oily, as dolma can sometimes be. I got a side of fattoush and it came with what can only be described as fried pita cruton things. I dont know about this, I was looking for a healthy salad option and out comes this mess of chopped fried pita bits. it wasnt bad, but they were mixed through the salad and impossible to pick out - not great for those of us counting our carbs! so I was a bit disappointed there.prices were reasonable given the portion sizes and everything seemed very fresh.  I noticed they do have a variety of shisha, which is exciting since the laws in massachusetts prohibit food from being served in any smoking environment, so I will be sure to come back and try some double apple shisha with my meal next time. until then,  3 stars."]], "Athenian Deli & Restaurant": [["Marlena V.", "Very much agreed with the previous reviewer.  Don't judge by outside appearances!  If you can look past their ghettotastic exterior and actually make it through the door, you're in for a treat.  This used to be one of my favourite places to stop for a quick dinner weekday evenings.  Great subs, salads and plenty of yummy toppings to play with.  Their traditional deli products are also an A+, I love their stuffed cherry peppers and cheese filled potato cakes.  Everything is always piping hot, well packed and ready to go.The interior is definitely a little dated while customer service is always helpful and quick (I've never had to wait longer than five minutes for my order even with a line out the door).  While there are a couple seats in a small indoor area, during peak times you're better to make a run for it and chow down in the car.Delicious food, great service and a classic, timeless addition to the Cranston area.  With the poor economy and general lack of funds all around, it's important to support our local businesses when possible especially in cases where their prices are extremely reasonable, food delicious and service great!  Where else can you get authentic, traditional deli foods at slammin prices?"], ["Nicole A.", "Great deli, not just Greek foods but they make the Greek food well. The souvlakia are the best you can get in Rhode Island. The gyros are good too, and the other options are plenty. Dessert is also a must-do... especially the baklava. Delicious food, and an awesome staff."], ["Oignucs I.", "Since stopping here and having my first spinach pie , 5 years ago , i have never been able to eat a regular dough cover pie . They use feta cheese and flaky pastry dough, and it is my favorite thing on the menu . The appearance of the place is a bit shabby in 1970's looking , however please look past that and try the food . This is very busy especially from 11:30 am to 1 pm so try to visit another time . they have a wide selection of hot ready to eat food and even more made to order specials . the food is fresh and reasonable . worth your time and your stomach will thank you ."], ["Tom P.", "We ordered take out Gyros from here and they were incredible! I would say the best I have ever eaten. I haven't had any other menu items but we definitely plan on going back."]], "The Continental": [], "Terrazza": [], "North Side Pockets": [], "Pick Pockets": [], "Sonia's Near East Market & Deli": [["David V.", "A great little deli/grocery store, it has a small section for eating-in. Really solid on all the basics - hummus, Jerusalem salad, zaatar bread, falafel, etc. I had the appetizer sampler, wife had the chicken/falafel wrap. We both agreed that it was great. The guys were really friendly. Wish I lived closer."], ["Allie B.", "What a find -- a Middle Eastern oasis in Cranston! Who knew? This abundantly-stocked deli & market serves wonderful, affordable delicacies imported from Armenia, Greece, Syria, Russia, and Turkey. The deli is packed with delish Mediterranean sandwiches but you can get a tuna or roast beef as well! Great prices at about $7.00 each.The market is packed to the gills (herring too!) with bulk feta, Armenian string cheese, greek-style hard cheeses and other cheeses with sheep, goat or cow's milk. The Greek olive bar is $4.99 per lb. as opposed to Whole Foods' $11.99. There are jams, candies, Za'atar, homemade pita chips, luscious dates, dried legumes (about 1/4 of the price of WF), yogurt, grape leaves, and even caviar.I know where I'm going when I have to host the 12 folks in book group next! (The Armenian owner told me he has 2 separate bookgroups who have their meetings there every month.)I can't believe I've driven by this gem so many times on the way to The Artist's Exchange and never stopped in! Plan to make up for lost time....."], ["Nicole P.", "Love love the food here.  I work down the street and love to order pick up from here.  Its hard to choose because everything sounds so good!"]], "Capri": [], "Andreas Restaurant": [["Greg E.", "Walking around Thayer street with my friend we wanted to find a nice place to grab some lunch after walking up and down the street a few times we settled on Andreas's restaurant. Now my friend has been here before and she mentioned the food is to die for. If she wouldn't have mentioned that I prob wouldn't have gone there. Well the weather was nice so we decided to sit outside. Now here's the part that explains why I am giving this place a 3/5 star rating. They gave us menus and sat us down outside. Now were talking and having a good time and 30 mins goes by so we pop inside and ask if someone was gonna see us. So that got me mad because they forgot about us outside for 30 mins. But other than the bad service that we received. The food and the prices were above perfect and because of the good food and reasonable prices I will be sure to return to this restaurant and maybe next time my review will go from a 3 star rating to a 5 star rating which I tend to give a lot."], ["Cassandra D.", "Yum! Amazing food/service/everything. I highly recommend coming here. Everything is reasonably priced and tastes spectacular. They even accommodated with my vegan diet. My friend who isn't vegan thought the food was great too. We sat at the bar and the bartender was extremely pleasant. Swing by, you won't be disappointed!"], ["Gordon B.", "Fishermans' stew special 6/5. Was told it was great -savory sauce, lots of clams and scallops (let's not forget the lobster in the center), and great veggies - cooked al dente, which is a feat in itself."], ["Vanessa O.", "*Sighs in relief*Oh Andrea's. Between your phenomenal service and authentic Greek music playing in the background in midst all of the chaos that comes with Thayer St. You don't disappoint.My usual (yes I have a usual) is the broiled haddock with the veggie of the day and Andrea's Fries. For an appetizer the Shrimp Santorini with warm pita bread! Can you get enough? The vegetarian grapes leaves are magnificent too!I haven't tried much else besides the haddock sandwich which is delish. And the half chicken (yes they give you half or a whole chicken) which is seasoned perfect and roasted to yumminess.All in all, if I'm on Thayer and can't decide, I go with Andrea's.. Every time."], ["Elizabeth D.", "My fiancé and I love this place and come here a lot. Their gyro sandwiches are so good, as are their burgers and apps. Usually it takes a miracle to get me to order a side salad over fries, but I always do at Andreas. Their side salad has this creamy dressing, lots of fresh greens and a perfect sprinkle of feta. It's perfect. Yes, I know I'm talking about a side salad here...It's also got a great atmosphere that's very different than the rest of Thayer Street. We love it. Highly recommend."], ["Erica L.", "I'm a fan of this place - especially the Sangria!! It's a bit dark in here but sometimes that's the atmosphere i'm looking for. I like the bar area and there seems to be veterans that come often. The good thing about this bar is not it's not geared towards the college kids. Food is good too! I've had quite a few items and i've never been disappointed!"], ["Linda L.", "Came here with my roommate who knows the owner of this restaurant which is a professor at Jwu. I had the runaway something martini it was delicious and sweet. And for app we got the octopus which was delicious and the two dip with pita which was not bad. And for entree I gt the lamb chops with mash which was delicious I wish there was a sauce and my friends got braised lamb too much saucy of tomatoes which I don't really like tomatoes sauce. And other friend got the haddock special which she was not happy with it had a fishy taste and it bother my friendZ and dessert we got bread pudding some traditional and Creme brûlée it was all okay. Good experience tho and first time having Greek good at a restaurant"], ["Jennifer G.", "Enjoyed our meal there last night. Food, Service & atmosphere were excellent. The owner came over to our table to make sure we were pleased with everything. Highly recommend!!!!"], ["Emmy M.", "So I know this is a weird thing to rave about, but what is my favorite item at Andreas? THE SIDE SALAD. I don't know what they do to make it so delicious. I don't even usually consider myself a salad person. But the salad at Andreas (which comes with a lot of the meals) has the most delicious dressing ever, and wonderful crumblings of good quality feta cheese. Perfection.I also really like the ambiance here. You never feel like you're being rushed.Since I like to save money I usually go for something under the Greek Sandwiches heading on the menu (where you will find all the souvlaki). Chicken souvlaki is delicious and $7.99.Another favorite item of mine here is the Avolgemono soup. So flavorful, so comforting- perfect appetizer during fall and winter.The only thing that has disappointed me so far is the house cocktail- I'm a big fan of St. Germain, and I ordered the drink for the reason that St. Germain was a prominent ingredient in the description. Well, the drink barely tasted like St. Germain at all and was quite watered down. I think I'd order a different cocktail next time."], ["Jason G.", "If you're looking for some excellent Greek food then look no further. I have never been disappointed in this place. Very reasonable price for what you get. Top quality and authentic Greek cuisine you really can't go wrong. The baklava will send you into a diabetic coma but man is it worth it."], ["Michelle S.", "I've been coming here for years, Ok seen Buddy C in here when he was still mayor, yeah that long. Never had a bad meal here. Love sitting at the windows and people watch along Thayer St. Always try to get here when I'm in the city."], ["Ana W.", "My friend and I went to eat there on Thursday, April 2, 2015 around 5:30pm. The whole experience was a great experience and the food was amazing, real, fresh authentic Greek food that was delicious. However the reason I give this restaurant a 4 star rating is because service was a little lax, and not as attentive as my friend and I would of liked. The waiter, Darren was nice in the beginning, and knew the menu by heart when we asked him questions, but as the night went on and the restaurant got busier, he seemed to forgot our table, and instead the busser ended up serving us our desserts, and giving us our checks. It seemed the waiter could not multi task that easily. However the food was amazing especially the Greek salad, pasta, lamb souvlaki. We could tell the food was fresh, not prepared like a lot of other restaurants in the area. The location is a perfect spot, and the price range was very reasonable for being in a prime location and on Thayer street, where the restaurant scene is just huge. My friend and I would defiantly come back for a second time and try even more on the menu, because the menu was diverse, with both Greek food, and American food, for people that did not want to venture out and try something new. The bar was beautiful, and the drink list was even presented on a iPad, which neither one of us has ever seen. The décor was to die for, and made you feel like you were in Greece. The portion size was perfect too, not too small or not too big. I would recommended Andreas's cheese fries, as they were perfection. This place is defiantly on one of my top places in Providence."], ["Althea M.", "I got the garden burger and it was one of the best meat-free burgers I've ever had the chance to enjoy! Great, original flavor. My parents were more adventurous and got some Greek dishes that they said were delicious and definitely authentically Greek. The ambiance is cozy and the dishes are HUGE. Even though it was very busy, the wait staff were all very friendly and helpful. Would recommend for anyone in town, it was the perfect end to a pleasant day of checking out the Brown University campus."], ["Sarah C.", "My fiance and I really like Andreas, although we tend to order the same thing every time (Beef Souvlaki and Lamb Burger). The last time we went we brought along 4 other friends and arrived around 5 PM on a Saturday. Because we didn't have a reservation we were told we'd have to wait about 20 minutes, but that quickly turned into us sitting at the bar for an hour and constantly checking in with the hostess. This keeps happening to me at most restaurants I go to in the Providence area, so I'm starting to realize perhaps a reservation everywhere is just something you have to do on a Friday or Saturday, even if you plan on arriving at 5 PM. The food was still delicious though, so we'd keep coming back (but with a reservation!)."], ["Alec R.", "Affordable pricing, and the food is great. I have eaten their steak, salad mix, burgers, and chowder. Great experience every time. A customer since three years ago."], ["Michelle D.", "When it once on a whim and have gone back. The food is good and the prices are great. Had the brushetta has an app, the tomatoes were so fresh. Each visit we had here the food was always as it's best. My first time was surf and turf cooked to perfection while my friend had the gryo. Great place for a light lunch or for the very hungry. All the staff is very friendly and don't forget dessert."], ["Reese A.", "I will never come back. The service is the only thing I liked about the place. I have had a lot of Greek food experiences and I usually like it, but I didn't enjoy it here. It didn't help at all that the prices were over the top. Nothing worse than paying a lot for food that you didn't like. :-/"], ["Melissa J.", "Servers were not attentive whatsoever and cold food was served by people who had to check every table around before figuring out where it belonged. Such a shame for having such a gorgeous location."], ["Nathan L.", "Celebrated here recently, It was busy like it always is but the service was fantastic. Love the environment and the menu had a lot to offer. My fiance had the salmon which was cooked perfectly and i had mousakka which was delicious. Would certainly recommend it! Cant wait to go back."], ["Bill H.", "Andreas is a so-so Greek restaurant on Thayer Street. There are definitely better restaurants nearby (in particular, East Side Pockets).My most recent trip was on a Sunday morning for brunch. I ordered a lox bagel. The salmon wasn't particularly tasty, the cream cheese came in its own separate container and was a pain in the butt to slip on the salmon (or maybe I was supposed to put it under the salmon and on the bagel? I dunno. The bagel itself was nothing to write home about.I have friends that swear by Andreas, so I'll probably be back. Reluctantly."]], "Opa The Phoenician": [], "Livi's Pockets": [["Mark P.", "Chicken & Falafel Wrap, I want to eat you--every day, twice a day. And that's not weird after you taste it. Huge, fresh, filling. It cannot be replicated. Yes, I am ruined. The staff is friendly, too. Great Arcade setting though the lunch rush is kinda gross with typical downtown Providence business people who do not have it in their DNA to not talk REALLY LOUDLY."], ["Christina P.", "As with love, it's often difficult to find a restaurant with the total package. Sometimes the places that have the tastiest food know that they're hot stuff and don't feel the need to bend over backwards service-wise. Similarly, there are some family owned joints where the staff is just too cute for words, but you worry for them because sadly their food just isn't that great. Livi's is a perfect example of a restaurant that's simultaneously bodacious and charming. Tucked away at one end of the Arcade in downtown Providence, it's the absolute perfect spot for a quick lunch while working or shopping in the area. I ordered the Livi's Pocket, as my theory is that you usually can't go wrong with a place's signature item. I wasn't disappointed: the eggplant, high quality fresh mozzarella, and red peppers all melded together perfectly in my tasty wrap. At the end of our meal the nice lady behind the counter offered us a free sample of their baklava. That's probably the smartest business move they could make because that stuff is so tasty there's no way you won't buy some to go or on your next visit after experiencing it. It was love at first bite for me at Livi's... pay a visit yourself and prepare to fall hard!"], ["Amanda P.", "Fresh, quick, cheap, and filling. Great addition to the Arcade."], ["Cristina W.", "Call me picky but I don't understand why the wraps are not closed on the ends here - leaving the ends open and just rolling a wrap up makes for a messy wrap that is going to drip non stop and eventually the ingredients fall out. Maybe that is the difference between a wrap and a pocket?? You can try and re-wrap it yourself but it's tough when your hungry and aggravated.  Also the diy wraps are lame, we ordered one with 3 ingredients due to dietary restrictions and there was hardly anything in it. Kind of expensive for what you get...The line moved fast which I appreciate."], ["Kristen K.", "Eat here today, just do it!  I just had the most delicious Greek salad with grilled chicken.  It was perfect, delicious kalamatas, onion, tomato, roasted red peppers, and the chicken!!!  Absolutely delicious!  My lunch companion had a chicken falafel wrap that was big enough for two meals and was also declared delicious!  Highly recommend!"], ["Christina V.", "I liked, didn't love yet... it's become a personal mission to try all gyros I find. I'm greek. It's necessary. So this place is new and cool in the Arcade. It's a welcome addition and clearly, as evidenced by the massive line at lunch time,  embraced by down city employees.  We need fresh new sustenance! ! My gyro was decent.  It was big, but I'm glad because it was $8 so I would've felt gipped if it wasn't.  I'm not cheap... I just wish I could find a healthy sandwich for $5 or less downtown but I digress... it tasted ok. Nothing to write to Yiayia about. I also got one grape leaf to try. To be fair each culture makes them different.  These were a little greasy to me and they forgot to give me tzaziki which could have offset it? I do want to go back and try the falafel everyone is raving about though!! An update on this review is in my future."], ["Samantha V.", "So I have always been a fan of middle eastern cuisine but I think Livi's does a great job of connecting traditional flavor with modern food ideas. I always enjoy the Chicken club, which is great because it has all the savory flavors in the chicken but then when you add the bacon, lettuce, mayo, it becomes an american staple.I am always pleased with the service, its like being a part of the family when you walk in and smell the fresh cooked pita chips, homemade rice pudding, and daily soups, its everything worth walking through the city to get. Make sure you try it, you might catch me in the line. say hey!"], ["Lauren M.", "This place is great for lunch.  Everything is super fresh and the service is quick.  Prices tend to be about $8-9 for a wrap or pocket, but portions are pretty large.  A couple of notes:1) The italiano, chicken and mozzarella, and gyro were all very good.  2) There's plenty of seating and the place is pretty clean.3) Everything can get messy!  This is not a great first-date place.  I usually go here by myself because I would be embarrassed if my colleagues saw me stuffing my face and then having the balsamic or tzatziki dripping down!4) If you want to get Livi's Pocket with eggplant, get there early!  Twice now I have arrived at 1-2 pm and they were out of eggplant!  One day, Livi's Pocket, one day..."], ["James Y.", "Wow the chicken falafel was outstanding. Easily enough for two people with a suggested side of tabouli. The line moves quickly and they have plenty of seating."], ["Eric C.", "I'm not going to get all fancy with my review but bottom line is the people are super friendly and everything I've had has been phenomenal"], ["Danielle C.", "Excellent Falafel and excellent customer service. Staff is very friendly and personable.  They always make it a point to ask me how work is going. I come here every time I need my falafel fix!! I highly recommend Livi's, you will not leave hungry."], ["Allison R.", "I like Livi's!Yes, I agree its an awkward entrance as I literally got into the Arcade and felt a bit foolish when I jet about passed it craning to look for it!  So as other reported, there was an employee sitting talking on the phone, the gentleman that entered before me, and myself sort of stood there hearing some banging in the back assuming maybe someone knew customers had come in. He was awesome and friendly when he finally emerged from the back, asking our orders so that they could be placed on the grill and and got to assembling the other items for our wraps. The boy in front of me got chicken bacon, with tziki and lettuce and tomato and they were happy to oblige. I went with The Works wrap, which is their vegetarian falafel wrap. I debated asking for pickles and banana peppers....but didn't want to turn this into a clone of the wrap I get from East Side pockets...at least not on my first time. My wrap did have to endure my walk back to federal hill, but it was still pleasantly warm when I dug in. Their falafel, oh my. Theirs is probably my favorite around hands down. I'm not sure why, but it was lacking any bitter or sharp tastes that I've encountered elsewhere and while a bit crumbly was not grain/gross in the mouth. I will be back, oh yes I will!"], ["Ror G.", "Disgusting. There was a fly circling my wrap that had just been doused in mayo when I asked for \"a tiny bit\". The turkey looked veiny, the staff was rude, and the woman making my sandwich didn't even know what was supposed to be in it. Ended up walking out, but I'm positive the taste would not have changed my opinion."], ["Hilary H.", "I'm totally updating my review of Livi's and I'm totally going to relish it. Livi's, you are so completely and totally 5-stars of delicious, fresh, wonderful, hospitable, friendly goodness that I want to shout it from the rooftops. Simply put, I LOVE LIVI'S!!!Now that they've been open for nearly a year and now that I've been there several times, I have my order down, my timing down and my actual eating down. I am partial to the Falafel Pocket with a few added extras (no charge! Get the tzatziki!!!) and I like to go post-lunch rush so I can chat with the wonderful staff and then have a seat in their little dining area so I can eat it while it's nice and fresh. The ingredients are key. While chatting with one of the owners, George, I learned that since they don't have a ton of storage or refrigeration, everything is prepared fresh that morning -- nothing sits overnight or for days or even weeks. It's all fresh and it certainly taste that way. Also, prior to owning and operating Livi's, this family made pita bread that has been used at the most popular Middle Eastern eating establishments in the area. Interesting, huh? So they certainly know what they're doing and how to do it, which results in stellar food. They've also gotten their portion sizes right. The first time I had a Livi's pocket, it was enormous and I felt like I wasted what could have fed a Third World Country. Now, their very manageable and just the right size for a hungry gal who wants something healthy and relatively quickly. The staff is incredibly friendly, warm and helpful, the space is clean and charming, and the food is wonderful. Like I said, I love Livi's. You will, too."], ["Richard P.", "Livi's Pockets and Livi's Gourmet is a must try if you are in downtown Providence. Not only are they both located in the Arcade, America's oldest indoor shopping mall, but the food is fantastic! The owners and workers are always so friendly and will go out of their way to make your experience the best it can be. I live in downtown Providence and probably go to Livi's Pockets at least once a week. I always get the chicken and falafel. The ingredients are super fresh, and the falafel is out of this world. I can't say enough good things. If you are visiting from out of town, please try them for lunch. I promise that you won't be disappointed!"], ["Lizz W.", "Very good, very fresh. Relatively small menu, but HUGE pockets, awesome pita chips ( I don't like that you don't automatically get hummus though), cute place, nice people. I think its the best place to get a sandwich downtown if you're looking for something exciting."], ["Kel S.", "It seems everyone is a fan of Livi's. I thought it was fair. Not amazing. The veggie sandwich I shared was enough for two people, and reasonably priced. The falafel is never my favorite thing, but the other ingredients inside made it more palatable. However, it was very messy. Liquid was POURING out as we ate. If you have a hankering for a messy sandwich and you are downtime, I guess you could stop here, but I probably won't go out of my way."], ["Jessica R.", "Friendly workers. I had a mozzarella chicken wrap which was very simple & delicious. The food is fresh and the portions are great, very filling. Similar to East side pockets with more menu options. Will go again & try something different"], ["Krystal M.", "I stopped in this afternoon at the recommendation of a number of people in the downtown area. I ordered the chicken wrap with the balsamic dressing, mozzerella, red peppers, and lettuce. IT WAS AMAZING! So healthy and they made the chicken right on the spot. The wrap that everything was rolled up in was fresh - not from a package! I will definitely check this spot out again."], ["Ryan D.", "What a great place in the new redone Arcade Mall. Livi's has traditional Middle Eastern fare like Falafel and Grape Leaves. However they also include American classics like Chicken Clubs and Chicken Caesars in a wrap. They also have some of their own touches on wrap sandwiches. Like The Livingston which isTurkey Breast, Lettuce, Tomatoes, Honey Mustard & Mayonaise. Simple, yet delicious. They have a nice big space on the end of the Arcade, and just like the rest of the shops within the Mall, very inviting.A nice touch too is on Square (which they use) Livi's has a rewards program!"]], "Angelo's Pizza": [["Keith M.", "I've dined in and their meals are very good. Service is good too. But I mostly order pizzas for take out ... tired of Dominos down the street. I'd recommend the pizzas anytime and they're always loaded with toppings."], ["Jessica S.", "This place has the best pizza. Been here twice and tried the hawaiin and the fenway. Love it. They have good staff too, including management. They accidentally overcooked our chicken and caught it before even bringing it out. They then remade it and took it off the bill without us even asking. We had 2 pasta dishes another time that were great and I love the bread. The baklava is good, a nice small dessert. Caprese salad is good though maybly slightly too much vinegar. will go back for sure."], ["Brendan K.", "I love Angelo's especially their Greek dishes. If you want to order a can't miss dish, do the eggplant rollatini appetizer. Good food, good service and nice people."], ["Geralyn D.", "The pasta was great.  The sauce was tasty, and the penne was cooked correctly (not mushy).  The eggplant parmesan, however, was greasy and thin; I couldn't taste any eggplant.  It was all bread and oil.  Also, the garlic bread was nothing to talk about.  I think you could do better with a nicer choice of bread.  When I have left-over rolls at home, I throw some garlic and cheese on them and toast them.  That's what this bread was like...left over rolls rather than nice fresh Italian bread.  I would give it another try again, however."], ["Sarah M.", "Angelo's is one of my favorite places to order pizza from.  Whenever my friends and I do a girl's night we order from Angelo's and they are always quick with the delivery and the pizza is consistantly amazing.I've also gone into the restaurant for a sit down meal with my boyfriend and his parents, being old school Portuguese they tend not to like food that is outside of their culture but this place is always a crowd pleaser. I highly recommend giving them a try, you won't be disappointed."], ["Robert B.", "I stopped here on a Friday for drinks with a friend. Bartenders are friendly and make great drinks. Great atmosphere. Perfect service. Make sure you ask for Cassondra if you plan on dining in. She'll take great care of you.Enjoy!"], ["Tim G.", "I went here tonight with some family members and a good friend of the family who is on vacation from California. We had reservations at 5:30 being as I had never been to this place before I went on the Yelp app on my iPhone. and I read some reviews mainly good a few two or one star but overall not bad, the Spaghetti and Marinara w/ Meataballs is DAMN RIGHT EXCELLENT!!! You have to try that & this place.The only thing with the meatballs they taste great but if you're someone like me who likes to cut them up before eating them you might have a hard time because they are somewhat hard but not bad. The service was EXCELLENT the people are nice and friendly and love to joke around with you and when you walk in you feel like you are in an Italian restaurant in Italy! I would definitely come back to try the pizza I WOULD RECCOMEND THIS PLACE 100% 5 STARS!!!"], ["Celeste M.", "My parents have taken me to Angelo's a few times and it is always packed whether we are taking food to go or eating there.  I would have to agree with others that the food is a bit inconsistent.  I've gotten grilled chicken parmesan three times and it's been prepared differently every time.  The food is okay but I'm from Jersey so I have high standards for Italian food.  I think that it is a good idea to do the drive up line but considering the orders take a long time, it doesn't really work out as imagined."], ["Danny B.", "Food is ok, but my reveiw is based on the horrible service. I will keep it short, they messed up my order over and over again. I had a simple request with my pizza delivery that was silverware, plates and napkins. I get none.The kid said he will be back with it, he never returns even after i tipped him.A week later I order again and let the girl on phone know what happened last time and again I requested plates nakings and silverware, guess what again did not get it.I am done with this place, and besides everytime I call I get put on hold you would think they would get the order right, but I think maybe the teenage girls are texting their boyfriends while taking orders."], ["John D.", "Some of the BEST chicken or veal parm you will ever have.  Great apps!  Great service!"], ["Chase S.", "This place has certainly grown up. I remember coming to this joint on my bicycle with my friends and grabbing a slice of pizza when our parents would refuse to feed us between meals. We didn't want to stunt our growths, you see. The ritual was to come here, buy a grinder or pizza and then loiter outside by the door eating and drinking a bottle of soda while talking about some video game or one-upping on exploits.I was visiting the area recently and came by to visit the bar that used to be next door, but Angelo's ate it !!! It wasn't there !!! And Angelo's was now a giant restaurant that looked like it belonged alongside a shopping mall parking lot. Complete with stylized light up sign!!! Omgz!!!I strolled in because I needed a drink now more than ever, and hit the bar area (thank goodness) for a jameson on the rocks. I had my drink among the crowd of couples and families waiting for seats or for take-out orders. I couldn't believe it was as busy as it was. The inside of the place looked exactly as what I would have expected from the exterior. Lots of wood, plants and seating with booths and tables gave the whole place a very relaxed atmosphere. I ordered a couple more drinks and a buffalo chicken pizza. The bartender was nice enough to bring a thing of rolls for me to snack on and to buffer my BAC. The couple sitting next to me started chatting me up, so I drank and talked with them while I waited. It was going well until the girl asked where I was from and the guy became noticably much less talkative...and then I was SAVED by my pizza coming out! Awesome, awesome pizza. Stuffing my face was a valid excuse for no more chatting and I certainly enjoyed what I was having so it was a double-win! The entire pizza was cheese, buffalo sauce, and chicken and piping hot. Most of the other food around me looked like stereotypical italian menu items so nothing eye-catching, but I would defintely recommend the pizza."], ["Joe L.", "Delicious buffalo chicken pizza."], ["Cliff M.", "My delivery of my pizza with extra cheese was all on the side, and the meat lovers pizza has not been fully cooked. This was a Monday"], ["rowland m.", "WHAT A TREAT TO FIND A RESTAURANT THAT SERVES DELICIOUS FOOD AT A REASONABLE PRICE. no entree is over $13.95. the menu is extensive with greek,italian, and items from a full dinner (salad included to pizzas,calzones,sandwiches.my salmon was served with fresh greens and a great honey balsamic glaze, your choice pasta or f.f. and side salad.the sauce on the pasta was  just a little thin but that is the only thing that could have been better, do yourself a favor stop in at angelos on mendon road in cumberland ,you will be pleasantly surprised"], ["Ashley H.", "Great food as everyone else has mentioned. It's good to note that on Monday and Tuesday you can get dinner for 2 that includes a soup or salad appetizer, 2 entrees, a choice of dessert and a bottle of wine or a pitcher of sangria for $29.99. It was an outstanding deal as the sangria pitcher is huge and the portions were not scaled down at all."], ["Mindy B.", "I have been to this place once. It was very nice inside, not what I was expecting at all. I got the Greek calzone which was delightful and my boyfriend got the, I think it was call, Hercules burger. He said it was one of the best burgers he's had. We went on a Saturday afternoon and decided to stop for lunch and go someplace neither one of us had been to before. The waitstaff was attentive but not overly annoying and with the exception of the pasta dishes the prices were very resonable. They have outdoor seating which I would love to try the next time we decide to go there for dinner or lunch."], ["Jesse Y.", "According to my mom this place has been open since she was a kid and it has improved drastically from a hole in the wall pizza place to an amazing restaurant! They have great food! I'm a big fan of the Cowboy Burger and calzones there. Definitely check it out for some good eats! Nice Staff, nice place, and great food!"], ["Naomi A.", "Went there tonight, great food but most importantly great service! If you go there definitely ask to sit in Simone's section. She was really knowledgable about the menu and was able to help us make a dinner choice. She is friendly and upbeat, attentive and quick. We will definitely be comin back to see her!"], ["Nicole W.", "Love this place. We are frequent customers here. The food is great, the prices are good, and the service is excellent! We always end up leaving a 25-30% tip when we dine in. Take out service is great. Delivery is fast, and the drivethru is very convenient. Take-out portions are noticably smaller than dine in, but still a good size. Full bar is comfortable, and the bartenders are always smiling, and fast."], ["Patrick L.", "Great place, one of the best pizzas around and a small calzone is enough to feed at least two people. Great value and very nice staff."]], "Filippou's Twisted Pizza": [], "East Side Pockets": [["Travis W.", "This place is seriously top notch. Best wraps in the city hands down. If you are visiting or new to the area, this is a must go. Enough said."], ["Justin K.", "A lot has been said already about this place that I 100% agree with. It's good, it's fast and it's cheap. It is also a lot of food. I got the falafel wrap and got everything on it...when I say everything, I mean everything...pickles, hots, hummus, and a bunch of other stuff that I don't even know what it was. I was shocked they could even get that wrap closed! There will be a wait here but the good news is the lines move pretty quickly. I highly recommend stopping in here for a refueling, you will definitely get your money's worth!!"], ["Kris D.", "Fast , fresh & good. The lines move quickly my last visit I was in a line that wrapped but in less than 10 minutes I was ordering. The location is prime, parking a pain, eating in is limited. I take mine to travel most times. The folks that take your order are very friendly. The chicken wrap, gyro and falafel wrap are some favorites of my family. The hummus is delicious! We like our wraps simple not a fan of hot sauce or most toppings. The prices are average for Thayer, not expensive and plenty of food for your buck."], ["Friar D.", "I have literally being going here since high school in the 90's. You can't beat it, chicken or lamb is on point. The grape leaves are phenomenal, the lentils are cooked perfectly. All of the toppings are always fresh as can be. Come to think of it, might be the only place I have never had a bad experience at. Throw a few bucks in the tips jar and it usually gets you a sweet treat ;)"], ["JonSteph R.", "Loved it! Ordered the falafel pocket and the falafel plate. It was huge and cheap and the got baklava as sweet and cost 16$. Great price and great food so tasty. Not spicy which is a plus for those sensitive."], ["Helen Z.", "\"Dude, guys, I have to tell you about an amazing place called East Side Pockets\" was the first thing I said to my friends when I met up with them in Providence. Of course, they being Brown alum knew all about it, and found it hilarious that I was raving about this place as if it were a newfound treasure. I ordered the combo pocket with two meats, which turned out to be only $8 bucks and was HUGE. The chicken breast was good, yes, but the falafel was mindblowing. It had the perfect crunch on the outside and the smoothest texture on the inside. Because East Side Pockets makes its falafel in the shape of a donut, the crunch to interior ratio is perfect. Also, do yourself a favor and get the pocket instead of the salad. There's something inherently satisfying about the way the wrap comes together with all flavors of the classic Greek spreads (tzatiki, hot sauce, and tahini) and the crunch of select vegetables (pickles, lettuce, tomato). Plus, the falafel, while fried, doesn't taste oily at all and the deliciousness makes it entirely worth it. If you really want a \"healthier\" option, choose the whole wheat wrap. Save the salad for another day - pockets are definitely the way to go here!"], ["Erin M.", "Excellent selection of Middle Eastern/Mediterranean foods. The prices are good and even if the line is long, it always moves quickly. I was new to Middle Eastern foods due to my nut allergy but they were very accommodating and I was able to enjoy their food."], ["Marty R.", "I have had Israeli falafel and the falafel at East Side Pockets are just as authentic! Warm, moist and crispy. I also love the hummus. It's not the thick hummus that you get at Stop & Shop to dip your carrots in. It's authentic Middle Eastern hummus that is basically a sauce you can put on anything to make it taste better. I loved dipping the chips into the hummus. Definitely worth a try."], ["Bridget P.", "Oh why haven't I stopped here before?  My husband and I have our favorites for lunch and dinner when we visit Providence , but we made a point of going to East Side Pockets for lunch on our last visit.  We ordered the falafel appetizer to share and a gyro with everything.  Fabulous!  The falafel was enough to share with three or four friends.  Six large, crunchy pieces with Syrian bread and two dipping sauces.  I can see why everyone in line ahead of us was ordering the falafel pocket.  Our gyro -- again shared -- was filled with tender, succulent pieces of gyro meat.  By itself, it was wonderfully seasoned!  The Syrian bread wrapped itself around lettuce, hummus, onions, peppers, pickles, and tahini.  Oh, yum!  Lunch filled us up for the rest of  the day.  What a deal for a little more than $10.00,My advice -- deal with the crowd and the college students.  Get in line.  Eat in a nearby park if you have to.  This is a GREAT place for lunch or dinner.  Try it.  You won't be disappointed."], ["Marie C.", "Great falafel pita wraps. Nice selection of toppings for your wrap, as well. This a popular spot for a quick bite to eat on Thayer street, open late too which is convenient. Lines move quickly, so don't let that scare you away."], ["Mina M.", "Amazing people, amazing food. Staff is very friendly and the food is cooked well and comes out quickly. Would recommend this for a quick meal or sit and eat anytime."], ["ken z.", "This is definitely my first lunch choice in the area. Reasonably priced, good quality food served fast. However, even though the servers are fast, the place gets busy at lunchtime, with the line often reaching the door. Try to go a bit early or late."], ["Andrew L.", "Just going to pile on the love fest for ESP. Been going here for 10+ years and quality has been consistently great.The chicken falafel wrap is one of the best things I have ever put in my mouth. Service is efficient and impersonal which is the way I like it. When hungry  on Thayer street don't think and just go."], ["Victoria G.", "The people I was with loved this place, and I have to admit it was pretty good too. I'm not really into Greek food , but the wrap I received was really good. The chicken was perfectly grilled and spiced and the wrap was fresh. The servers there were really nice and gave us free samples of falafel. The place itself is a bit cramped, but has a good feel to it. There are a couple tables and a counter with chairs. All in all, good place and good food.P.s. They also serve other food besides Greek such as fries , chicken tenders etc."], ["Holly E.", "East Side Pockets is one of my favorite places. I feel like I could live on the falafel pocket and I love all of the other Middle Eastern choices. The pockets are huge and a great deal. Sometimes they'll give a free piece of baklava, too! Don't let the line scare you, it moves quickly, the staff is great and it's so worth it!"], ["Christina S.", "I have been wanting to try a falafel so bad for the longest time and my friend loves them. So we decided to go here today around 2! Oh boy was I pleased!!!! Delicious food and fast service!! I will be back. We ordered the falafel Greek salad with the works(expect pickles). HIGHLY recommend it & you can get it with chicken!"], ["Colleen M.", "I was lucky enough to be near Thayer just before noon and was hungry for lunch so of course I headed right for East Side Pockets. I have to admit that the location keeps me from going more often and it's been awhile since I've been back. This time I found parking right across the street and since it was before noon it was nearly empty. It was just like I remembered. I placed my order and paid the very friendly cashier for my lunch. $8 for the best falafel pocket and a water is an absolute steal! My friend got grape leaves which I tried and they were very good. We also went back for the baklava. So good!! It was light and buttery, just delicious. This place is a gem and I should go more often."], ["Laurie B.", "We took out dinner from East Side Pockets. The line moves fast. They don't have much of a variety in my opinion. It's either this, this, or this in a pocket or a plate.I got the chicken Caesar salad pocket. It was good but I wish they cut the chicken up smaller because every bite was chicken and not much lettuce. But the flavor of the chicken was ok and it was moist.My boyfriend had the beef steak kabob pocket. He said it was tasty and that he liked the mixture of flavors.Overall, it was good but it's not what I was looking for but I would definitely recommend it for those who like Mediterranean food."], ["J D.", "Love their food.  So Fresh!  Everything is made in front of you.  Their yogurt drink AYRAN is delicious with a pita bread sandwich with gyros or falafels."], ["Niki K.", "Great food, fresh ingredients, decent prices. Like every Middle Eastern restaurant I have been to, really kind of rude service, but whatever. Best falafel, hummus, etc in RI."], ["Jackie P.", "Awesome Falafel.One of our must haves when we visit Rhode Island every year."], ["Karen R.", "For starters this restaurant sort of has a convenience store vibe to it but with a twist.  Super casual with middle eastern music playing on the televisions.  Prices were affordable, 1 Greek wrap and a chicken wrap with 2 sodas for $14?  Can I get a hallelujah?!My wrap was amazing! The veggies were fresh, crunchy and the condiments tangy and flavorful.  The portions were filling, I was ready to take a nap after, Zzzz lol.I deducted a star because the falafel was not the best I have tasted.  Sadly,  It was really heavy and lacked that falafel flavor I was looking for.All in all I would come back for the wraps and other foods but not the falafel."], ["Allison R.", "So fresh, so clean, so fast paced, so crowded. I am an East Side Pockets fanatic, though my proximity isn't as great as to Northside, so I don't frequent here as much. The food is prepared to order and arranged artfully. Ask for a salad and watch how particular they are with how they prepare and present the salad in the to-go container. I usually get the 2 item salad, with falafel and dolmas, and all the fixings. My other go to is a falafel wrap with everything on it,  especially hot sauce. I have never had anything like their hot sauce, its think and has a nice kick but isn't a thin mess.They heat up/ cook the falafel in batches so you're not getting something sitting in a warming dish half the day. When making your items if they drop something into another item (say a pepper into the onions or tomatoes) it is immediately cleaned up.Usually if you ask for something like hot sauce on the side, they would just rather not charge you for it. PS! If you leave a tip they will insist on giving you the perfect little tube of baklava as a thank you."], ["George P.", "Two thumbs up. Owners are really nice and the food is very filling. Falafel was great!"], ["Diana K.", "In Providence for a conference on a Thursday afternoon in search of a quick lunch before we start. Yelped restaurants near the convention center and decided to try East Side based on the reviews.  Upon entering, there was a line of about 8-10 people in front of us waiting to order. We got in line which moved at a moderate pace.  Each order is partially assembled in front of you as you place your order, then any grilled items are placed on top as you pay and either stand or sit to wait.  Seating is self serve.  It took less than 10 minutes for our two pockets to be ready.  Hubby and I ordered the grilled chicken kabob pocket with lettuce, tomato, onion, tziki (sp?) sauce, hummus (no pickles, hot peppers or yogurt sauce) in a bread pocket which appeared to be a pita.  The chicken was tender and flavorful, condiments fresh; however, the bread was a bit disappointing ... not as soft as we would have preferred.  Overall, a good experience and if in the area again, we would return and try a different pocket.  Very reasonably priced, service was also very good."], ["Allison M.", "I challenge you to find a better pocket on this side of town, or anywhere else in the Providence area, frankly. ESP is a long-standing neighborhood favorite, and I cannot imagine Thayer Street without it. Everything I've ever had has tasted fresh and authentic. The staff is tremendously kind and accommodating, and seem genuinely happy to be there. Sometimes they give me a complimentary piece of baklava, too! So nice.At lunchtime it's insanely busy with lines that easily trail out the door. I've discovered that just before noon is the perfect time to get in line, as the grill is screaming hot with delicious meats and they are ready to get customers in and out of there to make room for the lunch rush.This is a grab-extra-napkins kind of eatery. The wraps are enormous and deliciously messy. Roll up your sleeves, tie back your hair and get into it."], ["Natasha D.", "Visiting Providence for the extended weekend I found myself nearby and hungry, I checked Yelp for some guidance on some cheap good eats, and it delivered. I got the Middle Eastern Platter for $8 and the price did not dictate the quality. It was really good. I especially liked the falafel, amusingly shaped like donuts.Not only is it inexpensive and tasty but they have great service. They run like a machine. Everything is so organized and quick it's actually pretty impressive. Their stations are flawless; while one guy is taking your order another guy will clean the debris from the last order if there's anything out of place. While I sat and ate my food I noticed that as soon as a group sitting at a booth left, someone came out to wipe down the table. I absolutely love that kind of attention to detail. If that much care is put towards keeping these ostensibly low-key things clean and tidy then I feel at ease with how they conduct their practices where I can't see what's going on. This isn't a Michelin star restaurant, an interior decorator didn't spend months delivering a top-notch unique dining experience, but East Side Pockets works with what they've got and they are the best at it. Would definitely recommend."], ["Shweta R.", "Amazing taste of falafel and hummus. I ordered the platter. I was craving hummus and this place just made it right. Loved the food"], ["Chanceny K.", "order a combo chicken falafel wrap. Yea... you're welcome!! its amazing. parking is tricky but I don't mind the walk."], ["Myron C.", "Eastside Pockets is hands down the best Mediterranean food in Providence and perhaps the whole US. The wraps here are big, delicious, and reasonably priced. They always keep the food fresh and hot and that's what makes them one of the best. The seasonings in their falafel are the bomb diggity, The Chicken is also seasoned well and grilled to perfection. My typical go to is a chicken and falafel wrap. The sauces they mix together are just fantastic! This is where East Side really hits the mark and puts themselves ahead of the competition. A lot of Mediterranean places have good spices and fresh food, but it can become dry when put into a wrap without the proper sauce. Other places might have a sauce, but it just doesn't add anything to the flavor. East Side Pockets does not have either of these problems. The sauces they use are delicious and balance out a great blend of veggies and meats in the wrap. I wish i could take the Hot Sauce they use home with me! I always get extra hot sauce cuz it's just that damn good!The restaurant itself is on the smaller side with not a lot of seating during busy times, but it is a mainstay on thayer street and has outlasted a lot of other places that have come and gone over the years. If you like good Mediterranean, actually, if you like good food you should do yourself a favor and go check out East Side Pockets!"], ["A C.", "Best falafel I have ever had.  Ever."], ["Anne C.", "It's not easy to find falafel in Rhode Island but not only do they have it here, it's delicious. The falafel plate comes with rice with lentils, pita, and salad. You get 5 mini donut falafels. Great value for the $8. Worth the drive to providence!"], ["Yaz D.", "I'm of Middle Eastern descent, and have tried food from Middle Eastern restaurants far and wide, and let me tell you - this place is a gem. Paul and his crew serve up big, delicious pockets with big hearts and friendly smiles! The value and quality you get here just can't be beat. Aside from what's already been mentioned (falafel sandwiches and wraps are amazing), if you're feeling adventurous, give the kibbeh a go. You won't be sorry."], ["Olivia P.", "I eat vegan.You can get a freaking good falafel as a vegan here. Yum. I might go get a falafel again tonight."], ["Jacqui G.", "This place is an institution.  Always packed and for good reason.  The guys who run it have speed and service on lock down.  If you're looking for a perfect falafal wrap at a great price, come here."], ["Josh W.", "Consistently great food fast for as long as I can remember. It is BY FAR the BEST Felafel joint in New England at least. IMO. (I'm not saying middle eastern or Lebanese or Syrian. Im Saying felafel joint.) The felafel is crispy and perfectly seasoned. Meats are marinated wonderfully. Veggies are fresh. They gotta be with how fast they blow thru them. They get great grape leaves. The condiments are good. The hummus can be a touch bitter but that's ok by me because the pita chips are a bit sweet. And the baklava is ethereal. The prices have not changed to much in recent years which is great when I think about where they are located. I love east side pockets. I hope they remain forever and are not eaten by corporate jackholes."], ["Brianna M.", "This place was delicious! My family and I were visiting Brown for the day, and I found this gem and decided to have lunch there. It is a very tiny restaurant with not much seating. The line was long as well, but from other Yelp reviews I wasn't surprised when we got up to the front quickly. I got the combo pocket with the chicken and falafel. It was super yummy, inexpensive and filling. We also got the falafel appetizer. I thought it was yummy, but my family didn't really care for it. I would come here again!"], ["Michael V.", "Grilled chicken falafel wrap.  Done and done.  Ive been going for years.  The 2 dozen or so times ive been this.place has never dissapointed me. The reviews dont lie!"], ["Emma W.", "Oh how I miss my quick and tasty meals from East Side Pockets.  With my Celiac diagnosis and my subsequent removal of gluten from my diet, I am no longer able to eat at my former favorite falafel joint.I was always a fan of the gyro with lots of yummy tzaziki and pickles! The possibilities are endless with their menu.  You can have a wrap, a salad, a plate, or any combination of the like.  The servers' hands move quickly to serve you with your meal in no time, despite the often long lines.  Nothing special with regard to ambiance, but it's nice to know that this place has changed very little in all the years it's been open, despite Thayer Street morphing around it.  And I mean that in the best way possible!There is no other place I would recommend for a quick falafel meal in Providence!"], ["Dirk D.", "When I say \"Great\" you say \"Food\".  GREAT........"]], "Skewers Restaurant": []}