{"Flavours": [], "Masala Indian Cuisine": [["Mandy D.", "I love, love, LOVE Masala!They just recently updated their dining room so there's more tables and new carpet. They're now better equipped to take on larger groups of people and they have a bigger buffet line with more lunch options available.The buffet lunch is awesome and a really good deal. Of course when food sits out for awhile it's not as fresh... that happens at every buffet! But it is priced accordingly for what you get. I love to do buffet lunch takeout and I load up my container with a little of everything. I have no complaints about the buffet, but some people are overly picky. If you want fresher, better food that is more spicy, order off of the menu! Duh.Masala has some of the most amazing, tender lamb that I have ever had. I love the lamb korma and the lamb saag. And like I said before, they have amazing vegetarian offerings like the malie kofta (fresh veggie fritters) and the saag paneer. I also love the vegetable pakora and get them almost every time I go. I'm a regular so they know exactly how spicy I like my food, and it's perfect every time. Everything is fresh and customized for each customer, so they will make almost anything exactly to your liking. Do not pass up this gem!"], ["Jen R.", "This place is our favorite!!!!!! We always get lentils and chicken tikka masala and garlic naan. It is absolutely delicious. The customer service is great as well.  We have never dined-in, we usually get takeout.  I'd like to,try the lunch buffet. I'm sure all their food is great! We are never disappointed with Masala."], ["Christian V.", "If you are a lover of Indian food, like myself, Masala Cuisine will easily become your new favorite place. Situated on the busy Mineral Spring, in a plaza next to a Work Out World no less, Masala is a beautiful gem surrounded by the strip mall atmosphere of Mineral Spring Ave. The inside is nothing spectacular, with TVs and a somewhat uninspired decor. But don't think that is me bashing the place. It's just that I don't go to Indian restaurants for the decor or to watch Bollywood movies and music videos. I go for the food.And oh the food! The wondrous, delicious, magical food! I can tell you that the food is delicious. That's what you really want to hear right? Well, it is. I had the Chicken Tikka Makhani and the Chicken Korma. I requested the heat be turned all the way up and was pleased by the ratio of flavor and burn in both dishes. Served over a bed of basmati rice or with a dippable, scoopable  naan, the dishes were amazing! I will be returning there. One caveat: they offer delivery but don't order anything until dinner service because that's the only time they have a delivery person available to them."], ["Barry N.", "The waitstaff are typically very friendly and will actually talk to the group. The food is made to order--they will word things in different ways to help you order something exactly spiced how you like it! If they had another bathroom, it would be a five-star restaurant."], ["Jeff M.", "Nothing has changed but I did want to report on my experience today since it has caused a little controversy when talking it over with my friends.I've been going back as often as I can, I'm only in RI one or two days a week.  This last visit, the waiter immediately recognized me as a prior Yelp reviewer and customer.  THIS HAS NEVER EVER EVER HAPPENED TO BE BEFORE!  I was slightly taken aback when he said it, he even confirmed my suspicions that based on my prior (5 star) review, the only thing I had knocked was the tandoori chicken on the buffet.  This time, I was offered the freshest tandoori possible and it was sssoooo much better than what is normally on the buffet drying out.I appreciate the service and as I had said in my first review, the attention these guys pay to their customers is AWESOME!  However, I am a little worried I was given preferential treatment because of what I wrote so I just hope that going forward, the tandoori chicken is freshened often in the buffet line so it doesn't dry out for everyone else, including me.  Kudos guys for going above and beyond, even if it isn't always necessary."], ["Steven P.", "Tried this place for the first time tonight. No wait to be seated. The service was outstanding! So many choices on the menu, it was hard to decide. The food came to the table quickly. Everything was cooked to order and the ingredients were fresh. I loved every minute of my experience. Try it!"], ["Daniel D.", "Ordered the lamb saag and chicken vindaloo take out. We asked for it extra spicy and they delivered. The food was excellent. The naan however was a bit of a disappointment.  Staff was friendly and considerate."], ["paula c.", "Love the naan, curries, tandoori dishes, and paneers   The biryani however was disappointing.  Not bad, but it was more like spiced chicken with saffron rice.  Did not have the complex blend of aromatic spices I'm accustomed to with the best biryanis. Super friendly and fast service made up for that."], ["Robert S.", "Went there for dinner and there was not a single customer in the dining area.   Odd for a Thursday night.    The waiter was welcoming and attentive.     He seemed a bit rush, but that might be a cultural quality.   I ordered the fish tandoori and it was good.   About 4-5 filets of fish made in a nice hot tandoori oven.  Nicely seasoned and well made.   They came on top of a bed of raw onions (I wish they would had been sauteed or grilled for softer taste).   My friend Diego ordered a goat dish that was very tasty and robust.Overall a nice dining experience."], ["Ahmed A.", "Mediocre, bland tasting Indian foodI grew up on Indian food, so I know my stuff.  The owner was veery nice, but I think they have definitely catered the spicing of the food to non Indian customers. Also the chicken tikka tasted old and dry."], ["Colleen N.", "We try to be adventurous when eating at ethnic restaurants.  We've done that here and we've not had a single dish that we wouldn't order again.They have a daily lunch buffet that is definitely worth your time and money.  Short money.They have several gluten free options, too!Wait staff is super friendly and willing to take the time to explain dishes to you.Our 'GO TO' Indian/Pakistani restuarant!!"], ["Jp C.", "Masala is near and dear to my heart. Amazingly just down the road in fairly suburban North Providence, but producing IMHO the best Indian food in Rhode Island.I've eaten in and taken out from masala probably 30 times now, and never have had a complaint. The spicing and flavors on all of the food is fantastic, from the naans to the paneer to the meat (try the goat!) and vegetarian dishes - you pretty much can't go wrong.Only word of advice is their spiciness is legit, so if you're not a spicy food fan just go with mild (they offer medium mild and spicy)My favorites: samosa chaat, malie kofta, shahi paneer, chili naan, and the goat saag"], ["Keith W.", "Amazing authentic halal cusine! Most things are on the spicy side,  but they will cook to your taste level. All the food is priced way below rhe average Indian prices. Small but cozy and clean. We had the chicken curry ordered extra spicy (what a rush), the shrimp tandoori, keep a Naan, Chana masala, and the mixed appetizer. Everything was great, the waiter (V) was friendly helpful and personable. We found this on restaurant. Com bit we will be back with friends for full price food and the daily buffet! BYOB in full efect!"], ["Ed E.", "I love this place, friendly staff and awesome food. I love their chicken curry and shrimp Marsala. Their lunch buffet is an awesome deal. You MUST try their mango ice cream and keher (cold rice with milk dessert). I love their desserts!!!"], ["Kristine R.", "So I was recommended by a co-worker to try this place out for its good affordable eats. To be honest, I have driven by this place a number of times without a second glance. In fact, I would have overlooked this place all together had I not recently joined the adjacent gym in the plaza.One day, I decided it would be a good place to grab take-out. I received a styrofoam box and went crazy in the buffet line. They had a flat rate of ~$8.50pp dining in or out of the buffet. Which was great so I didn't have to worry about being conservative with the weighing scale. The food was delicious, flavorful and the curry was ranging (perfectly) from mild to medium. Some of the dishes were on the \"liquid-y\" side and ended up getting mixed together. Which was partly due to the fact that I may or may not have overfilled my take-out box. Their warm garlic nann, tender tandoori chicken and sweet kheer were AMAZING. They definitely left me wanting more when I finished it. I foresee many a visits here. Next time I will be dining in for sure!"], ["Jenny M.", "Ordered the chicken tikka masala, chicken samosas, and garlic nann to go this evening . Food was hot and excellent. Staff was friendly and the inside of the restaurant was clean and neat."], ["A G.", "Authentic Pakistani food.  Love the boneless chicken Karahi and pakora keri is best I have had outside Pakistan.Their tandoori roti is really good as well."], ["David C.", "Handily the best restaurant in North Providence and probably the best Indian food in Rhode Island. Have ordered from here 25 times or more and it always been very good. Service is excellent! Anyone who gives this place a bad review (Cabernet) is a steaming sack of poop. As a long time resident of this dump of a town, it is great to have a place of this quality!"], ["Jo P.", "Five Star Food, all day every date. Phenomenal value for legitimately fresh food, lovingly crafted with pride.I have not had a single less-than-great meal or experience here. The staff is outstanding. Vipul in particular knows what's up. I have stopped looking at the menu, Vipul just makes it happen, and never disappoints.The great thing about Masala is that the crew who owns and runs this awesome establishment takes serious pride in the ingredients that go into each dish. Never frozen ingredients, all fresh and unprocessed; sauces and all are made from scratch. The Pakistani and Indian menu items are all incredible (that I have tried). I have brought numerous friends to dine here, and all have shared a similar experience.Lunch Buffet is a killer deal. Great variety at a VERY good price. My only complaint was having to deal with Mineral Spring traffic to get my Masala-fix, however as of yet it has not deterred me. Give this place a try, it is all about the food, and the food is excellent."], ["Nessy M.", "Absolutely love the food here. Have always been searching for authentic Indian food similar to coriander in sharon, ma and I finally found it ! Love the free convenient parking. The lunch buffet is awesome too. I just wish they had a combo where I can get both a meat and paneer with rice. I can't wait to keep going back and trying more stuff on their menu . Very affordable pricing too !"]], "Man-O-Salwa Kabab & Grill": [["Marie M.", "We're from CA where there is a wide variety of excellent Pakistani restaurants to choose from, but we've been missing out since moving to RI 7 years ago. That said, I was ecstatic when we discovered this restaurant! I LOVE Pakistani food for the complex yet harmonious combination of so many spices and flavours. My favorite dish is the Chicken Karahi. Their Nihari (slow cooked beef stew) was very tender and flavorful. We also liked the Pakistani style chicken tikka (which was dry and grilled without the creamy sauce). The fresh Naan was tasty and fluffy the way I usually like it. The rice--colorful, appetizing. The unsweetened milky chai was spiced just right. They have artificial sweeteners, which I prefer instead of sugar. Regular menu offers reasonable prices and generous portions. Each entree is enough for 2. Buffets on weekends from 3:00 to closing.  $16.99 for adults, $9.99 for kids. Includes chai and dessert. Excellent selection. Sufficient variety of unlabeled dishes, but each member of our party found something he/she loved. The atmosphere has an authentic, \"old school\" vibe, which makes me feel at home-- warm, cozy, very casual. It might be a bit awkward to newbies at first, though. The available dishes are highlighted on the menu, which may change from day to day. Friendly customer service. Credit cards accepted. Free ample parking. This has personally been a special experience for me in RI. Been waiting a long time for this. So grateful!"], ["Abhishek S.", "This is by far the best Pakistani food, very authentic & flavorful. I was so surprised to find the flavors in RI of all places, highly recommended. The Kababs & Chicken Tikka are by far to die for..!!!"], ["Pat C.", "We ordered chicken karai, naan and chicken legs. Food was very delicious. Will definitely come back."], ["Ramesh A.", "Food is great. All stars are for food only.Poor customer service. Heating is poor. Had to wait half an hour even before ordering. Name of the restaurant is not replaced."], ["Amad R.", "Our Bestest ever!!"], ["Vijaya L.", "We discovered this place very recently. We couldn't reach them on yelp listed phone number 401-231-4249. Their voice mail box is always full! The manager provided an alternate number 401-231-4219.Once we arrived, we were a little skeptical since there were very few people for a Saturday afternoon. Soon, we realized we were in for a treat once they started serving our food!We ordered chole, paneer palak, chicken biryani, lassi, butter naan(Indian bread) and some mutter pulao.The naans were so soft and tasty!Chole tasted like amritsari chole(traditional homemade preparation) and paneer palak tasted like authentic saag(though the paneer was some kind of cheese and not what you would expect). We were very happy.Chicken biryani was mild and delicious.The quantities were huge. Each order will easily serve 2 and the prices are very reasonable. Service was nice and quick.After eating often at restaurants like rasoi, kabob&curry, this was very refreshing food.They were not serving all items on their menu supposedly because they are still testing how they'll perform in the next few months.(just been 4 months since they opened their branch here). As a vegetarian, I had very few options. But if you eat meat, there's still a great choice.If you are in Rhode island, go, savor the food. Rest assured you won't regret :-)"], ["Xavier W.", "This place does a lot of catering for local Indian & Pakistani communities. That is what they are BEST at. The quality of their food is superb and comes very close to the real deal if not it IS the real deal. I had an experience in the beginning and it wasn't great. Personal experiences are a hit or miss but catering is without a doubt DELISH!! I highly recommend it. For anyone saying this isn't the closest thing to Indo/Pak food either had a \"miss\" experience and are not familiar with their catering. Anyway, give it a try. It's definitely worth it."], ["Christina C.", "Pleasantly pleased!!! Kind of a hidden gem. Close enough to providence and easy to get to.  Food was super delish and the staff was very sweet and patient to explain and make certain recommendations.  Super excited to find this place. Yay."], ["Divyesh P.", "Best non-veg desi food around in New England area! A treat for halal food lovers. Must try Chicken Tikka, Mutton Kadhai, Chicken Biryani.. Large Quantities.Review based on food only, never had food in the restaurant seating area, pick u only."], ["Rajaganesh R.", "I am having Kabab for the first time in US Wooow superb taste... Excellent service... I had one chicken Biriyani and two chicken Kabab... On seeing others ordering for various dish... Planning to visit next time... Good smell, taste, quality and quantity"], ["Omar K.", "Grand opening! This is the sister location of the highly popular original in Somerville. Chicken Tikka, chicken karahi, and haleem were all fantastic. Naans were fresh and soft, and the chutney was perfect. Highly recommended for catering as well."], ["Akbar M.", "Recently I went to visit a friend in Massachusetts on a very short notice. At dinner he served some chicken seekh kebabs, goat karahi and nihari. Each and every dish was delicious and mouth watering. I was told this meal was ordered from Man-O-Salwa. Upon my return home the next day I stopped at this restaurant and picked up the same dishes to take home. They serve halal food. Those of you who crave for the real Pakistani food this is the place for you. Please note the Johnston location will be closed for a week starting August 25, 2015."], ["Clayton W.", "I consider this as one of the worst places to eat Indian food. I had a fish kabob which had gone bad, the briyani didn't have any flavor and was served without raitha.They don't even have the name board on except for a banner which all the more confuses the people who are coming for the first time. I would never go again nor recommend this yo a friend."], ["Alice J.", "We ordered the briyani and it had no taste whatsoever. Tasted like plain rice. Also, who serves briyani without raita?"], ["Bikram S.", "If you are keen on tasting something authentic,  this is the place.  Great for folks that enjoy  if you like Northern Indian/Pakistani food."], ["Shalini S.", "This place does not even deserve a single star! Had to give 1 to able to post the comment! Most pathetic veg dishes!!! Palak paneer had melted mozzarella cheese instead of paneer. It's shameful that they mention indian cuisine coz there is no indian flavor to any of their food. Naan, someone please show them how naan is made. I can do a better job than what I had from this awfully horrible restaurant. My honest request call urself as Pakistani/Indian cuisine  at its worst restaurant!"], ["Hamid Z.", "Great place for some authentic Pakistani food, God knows w needed a place like this. Great food and service 5 out of 5"], ["Saba T.", "If you want the taste of original pakistani lahori food , this is the right spot. We have tried almost all indian and pakistani restaurants in RI n MASS but most places have changed the authenticity and taste according to their local market which could be working for their local non indian customers but not for families like us because we want to taste authentic food. This place is more than u expect"], ["John M.", "Way fabulous! Best Pakistani/Indian restaurant around. Huge portions! Limited menu- don't let that be a barrier. Would have preferred appetizers and more veggie choices. Man-O-Salwa is doing things their way. Food is out of this world good. Can't wait to go back. Eggplant excellent. Chick peas not a style I loved- I prefer saucy- theirs came as starchy without sauce. Naan excellent. Service attentive. Butter chicken to die for. Place packed with American/Pakistanis. My brother said it all: \"Manna from Heaven!\""]], "India Restaurant Bar & Lounge": [["Melissa H.", "I came here on a weekday for dinner service. I was greeted immediately. Service was very good. I ordered the papri chaat appetizer and the shrimp masala with two types of naan (garlic was delicious) for the main course. Everything tasted really good. My only complaint is that the shrimp were a tad overcooked for my liking. There was enough food for two to split. I had a groupon so the meal wasn't too expensive. Overall, I'm a fan!"], ["Amanda C.", "Good food and environment. Our waitress was nice and the atmosphere was calm and relaxing."], ["Alison O.", "The food never disappoints. There is a patio out back with swings at the tables that I just love!  Parking can be difficult, but prices are reasonable and the owner is super sweet and attentive."], ["Valerie T.", "Although I love the food and been here a couple times I had 3 bad experiences with staff. I was treated pretty rude by the same person.  The first time e ate in and I had to keep calling him over to get condiments,  water etc...but I noticed he did help other guest.  The second time I had a pick up order and I stood by the door while he chatted with someone that was obvious his friends. The final time I had a take out order and he left the food charged my  credit card and walked away...I was done. But the food is good."], ["Richard P.", "Love this place!  The veggie vindaloo is fantastic and so is most everything I have had there.  Great friendly servers and they always hook you up with a 20 percent off card."], ["Amy V.", "I've been to India several times both for after work dinner and drinks and a more intimate date experience.  The food is always delicious and prepared in a healthier manner which I appreciate.  The servers are always very helpful and accommodating.  During the summer months, it's nice to sit out front or in the back garden patio area on the swings! I would highly recommend this place to others."], ["Sarah Jean R.", "pros: -the decor is kind of nice-the drink was great (mango colada)-the service was greatcons:-the samosas (I only eat these once or twice a year so I would prefer they were not the baked version - I appreciate idea behind the healthy twist on these, but the mushy texture both inside and out was not enjoyed)-The naan was flat and not very flavorful.-My vegetarian entree was not good (the roasted vegetables tasted a little chemical-y and the tofu was really mushy and unflavored). I dislike when tofu is on the menu just to have it as an option. There are specific ways to cook tofu where it turns out wonderful, but if you aren't going to make the effort, just skip putting it on the menu.-The management was having a really loud brainstorming session near the bar - it was annoying and made the owner/manager(?) sound WAAAY more focused on marketing than food. It made the whole place feel gimmicky after overhearing this.I won't be back - I'm sure there is more authentic Indian food around. Above all, I really look forward to eating naan when I get Indian food and this is just not worth it to me."], ["Jaime S.", "I was impressed at the decor here; it's very lovely. Low-light, romantic, exotic. The staff was polite and professional, but I wouldn't say friendly.On to the food. Considering how Indian food is known for being aromatic, flavorful, and spicy... my lamb biryani was quite bland. Nothing was terrible, just a bit disappointing. Needed more spices and more flavor! Also, seeing American style wraps and salads on the menu was a bit strange. Where are all the authentic dishes?While \"India\" wasn't exactly a negative experience for me, I think I'll return to Rasoi up the road instead!"], ["Jen V.", "I went last night and it was one of the best meals I've ever had. We got the duck and lamb chops which both melted in our mouths. We also decided to try something we had never heard of as an appetizer and it was to die for. Highly recommend! Great flavor and presentation"], ["Elizabeth G.", "the online ordering process for take-out is a bit confusing, but the staff is accommodating. They accepted a takeout order at about 10:30-10:45pm even though they were closing at 11.  good staffing"], ["Patti G.", "Food was fabulous as always, they put great care in the food they serve as well as their customer service, thanks AJ."], ["Shar A.", "Tuesday's half price! This place is one of my favorite Indian restaurants in Providence. The service is great and so is the food. Ambiance is nice as well. You can sit at the bar or in one of three different areas, 2 being a bit more private. Everything I have tried here has been excellent. The rice is not sticky, the portions are not small, and the price is right. You can get the chicken masala with a kale salad instead of rice, so don't be afraid to ask for alterations (kale salad is great, btw). The yogurt sauce is a must esp if you are ordering a spicy dish. They include pineapple or mango in the sauce, but you can ask for this to be eliminated (i always do). The naan (bread) comes in white or wheat form and both are great.I wanted to list some of the dished I have had, but their site seems to be down..."], ["Kiki M.", "Great location, great ambience, great food. Hands down my favorite Indian restaurant in Providence. I can't find anything wrong with the place. The prices are reasonable, and the food is delish!"], ["Josh K.", "I love India Restaurant! Indian cuisine is my fave, and I've been enjoying their delicious food since I moved to Providence in 1997. The atmosphere is beautiful, and the staff is welcoming and attentive. Notes:The back patio is incredible!They show Bollywood movies!"], ["Maria S.", "Went for 50% off entree Tuesday night.  SO WORTH IT! Got chicken tikka masala. It was delicious! Will definitely be back. Staff and service excellent."], ["Ted P.", "Service was great. Very attentive and very polite. Food was sub-par, especially for the prices. I was surprised not to see tandoori chicken on the menu. The naan bread was good, but my dish, a variety of kabobs, wasn't very seasoned. Everyone else at the table was greatly disappointed as well."], ["Joy L.", "Our server was one of the sweetest!   Had dinner here on a Saturday evening around 7:30.  We made reservations on Yelp/OpenTable 1/2 hour before arrival.  As a tip, reserve 1/2 before arrival & there will most likely be a table ready for you when you arrive.  In our example, the restaurant was filled when we arrived where there was about 4-5 parties waiting to be seated.  Be Smaht, reserve a table! Nonetheless, we were immediately seated in one of the rooms near the bar area.  It was a quaint and romantic area.  Our server quickly came over.  He was rather busy but informed us he was running behind.  When he did come over, he was truly great!  We ordered the Aloo Tiki, Samosas, Mango Frozen ALCOHOLIC drinks & garlic Nan for starters.   This would have suffice as for our meals but we were living on the edge & decided to order an entree to share.   Our tab was about $60..rather cheap for the amount of food and drinks! On saturdays there is a dancer to entertain & work the crowds.  Don't forget to mention the big screen that plays Bollywood movies!  Check out the murals in the bathroom!  Overall, if you like Indian food or spicy food, this will surely make you happy. This place is just magical!  Huge fan of the Mango drinks!!!  After 2-3 carafes, you'll be feeling magical alright.  If you're thinking of bringing a date here, ask to be seated in the rooms near the bar, as it is very intimate & sexy!!Don't listen to the bad reviews on here, they are having a bad day! Enjoy!!!"], ["Scott B.", "Never been here before, not sure when I'll be back to Providence, an old friendof mine who comes to Providence these days very often recommended IndiaVERY HIGHLY, and he did not steer us wrong. I like to think I know good Indian food from years of at least going to the better places in Manhattan, Queens, L.I., whatever, and as far as that goes, I can safely say that India beats most or all of ANY of those joints that I've  been to the past 25 years in NY, LI, or NJ.  Actually there's one place in North Bergen NJ area that rivals this, but still, I think India is superior in many ways to even that place.  Even the loose leaf Darjeeling cup of tea I ordered with my meal (I know it's sacrilege supposed to wait till end of meal but bollocks to that I wanted my tea first!) was EXCELLENT.  I can even tell youwhere to go in Queens NYC to get the best Halal food, but obviously,that's a whole other thing, and NOTHING of that nature comes remotelyclose to the delicious fare on offer here at India.We ordered basic entrees of like coconut chicken etc. and I had a basic plate of Chicken Masala and some rice (I was told to cut carbs and pasta bigtime by the fabulous MD of mine down on LI so I had SOME rice! Not100000 pounds of it) and feck me it was all quite wonderful.  Not over or under-cooked, rice just right, sauce balanced and delicious, all quitefantastic.  The parking around here really SUCKED (no dedicatedparking lots for this place or anything else locally) however, so beware of that,but otherwise, the restaurant itself has an inviting character all its own,the staff are invariably happy and friendly, accommodating, and low-key.We got a nice big huge comfy booth table inside.  Prices absurdly reasonable.  What's to complain about? Meanwhile I have to drive all the way to Hicksville L.I. (or NYC) for a halfway decent Indian meal down in NY, and NOTHING I've seen lately compares to India.Nothing.  So NYC and LI joints need some reality/quality checks. My fave NYC Indian joint used to be Milon in the East Village offSt. Marks Place on corner on 1st Ave.....but then it went downhill years ago.Which bummed me out to a major degree.  This is why I keep sayingyou can rave about NYC all you like, esp. these days, and it has itscharms even now, (less of them though) but you can't find a place this consistently great down there now.  I do not think.  If you do, please let me know.  And most of those Manhattan 6th Streetjoints DON'T CUT IT ANYMORE.  I know, I've been back therethe past few years and I was sorely disappointed by most.   Let me tell you: even if this were back in 1989, India up here would STILL have been the superior restaurant.  I think that's enoughrecommendation for anybody who knows and loves great Indiancuisine.  If you've been TO India, ok, fine.....I'm sure you've had better, but otherwise, this place rocks and rolls like all get out!As for these snobs whining about utter authenticity: look, save that nonsense for your Zagats Guide crowd.  This food was fantasticand the place is great!!  If you're a Food Curator Expert then lookelsewhere, I guess.  Or fly to Mumbai, whatever you wanna do."], ["Akshat G.", "Great decor, I would say its the best Indian restaurant decor I have seen in the US. Friendly staff and good service.Belly dance and free henna service were a delight.Food can be improved to improve the experience...Overall 4 out of 5 stars!!"], ["Ben J.", "Been here three times and every time the food is consistently bland and inauthentic tasting. Personally feel that the atmosphere is nice but the restaurant feels overdone and kitschy. It takes away from the meal, which altogether may not be a bad thing. I always get the Indian restaurant's Saag dish and like to compare. India's Saag was tasteless, lacking spices, and had none of the bright taste one can usually find in Saag, all of which mirrored many of the other dishes I have tasted consistently over the three times I have gone. The last time was the last."]], "Not Just Snacks": [], "Bombay Club": [], "Apna Punjab": [["Carolyn R.", "Excellent food, great prices, friendly staff. We are never disappointed at Apna Punjab. They will ask how spicy you want your food and comply with your wishes. Delicious! Ask for coconut naan. A special treat!"], ["Elle S.", "The service is tight and the atmosphere is beautiful.  I can dress up or down to dine there, and as a chick,  that room for versatility is much appreciated. The food is delectable (to say the least), really capturing the cuisine with perfection.   Apna will remain THE absolute favorite of mine as long as we all shall live.  Go Apna! May you maintain prosperously."], ["Peelamedu B.", "I live in RI and usually travel to Minerva or other restaurants in MAS, to have Indian food. And the experience was not anything to write about. This, kind of tempered my expectations from Indian restaurants in general. And so visited Apna Punjab for lunch on a Saturday, with little expectation. I choose the buffet option as it was inviting. The food tasted nice and above all didn't, appear to be from 2 days old preparation. The tandoori chicken was dry and burnt for most parts, but the other dishes were very nice. The restaurant had a nice ambience and was not cramped as others. The tables were well placed and didn't give the feeling of next table folks speaking in to your ears.Quite a welcome change from other places. There's a reason why I stopped shirt of giving this a 5 starts. I had gone with my two kids aged 4 and 1 and I was charged for 2 kids meals at 8 USD each.  I was returned 7 USD after I pointed the billing mistake. However charging for 4 year old's appetite is not something that's digestible'.Hope Apna Punjab revisits its kids meal pricing.In general a very fulfilling dining experience."], ["Susan S.", "The ONLY reason I'm not giving it 5 stars is because It was SOOOO cold in there! Other than that, I put my coat on and enjoyed their TASTY selections! Owner and waiter are sweet and attentive. Indy MTV is cool... but there should really be only ONE channel on all the tv's, a little distracting. First time so maybe they don't do that all the time. (Can't STAND a tv on while I'm dining anyway...so any venue that has one on will never be my favorite).. we're close, they deliver. Cool! LOVE THE food! (It's warmer at my house... ;)  and we can listen to music while we eat...."], ["Michael D.", "My future-fiance is a huge fan of Indian food. She loves spicy food. Eats Habanero peppers raw as a snack. When she saw this place a couple miles from my home, she absolutely had to give it a try, to compare it to the Indian places near her home in Needham. So, we went last evening for supper.We arrived at 6:15pm. The dining-room section of the restaurant it laid out like a huge cafeteria with four rows of booths/seats, with the center row being adjacent to one another so a panel in the middle can be removed for large parties. There was only one other party there, which sat in the center-aisle booth. Definitely a \"cavernous\" feel to the establishment. There is a small \"sports bar\" section off to the side, separate, but we did not sit there. We were immediately brought water and papadum with onion and tamarind chutney. For an appetizer, we both opted to have the tomato garlic soup (my girlfriend is a pescetarian, and while I'm a carnivore , I usually stick with her diet because it is healthier than mine generally is.) For our main dishes, she opted to have the Saag Paneer and I the Chicken Manchurian. We also ordered a side of Jeera rice to accompany our meals.When ordering, my girlfriend informed our waiter she wanted her Saag \"very spicy\". I asked the waiter if he could make my chicken dish a \"little spicy\" (to give it a little 'kick' without overwhelming the flavor) but he said I should opt to have it 'as is'.The tomato soup was excellent. Actually, some of the best tomato soup I have ever had. Creamy, delicious. I could have just eaten a half-gallon of the soup and have been satiated.The Saag was excellent, but was not at all hot or spicy. Since this was our first time at this establishment, she did not reiterate strongly that she \"really, honestly, truly\" wanted the saag spicy hot (looking at my girlfriend you'd think she's a teenaged lightweight, but she drinks ghost-pepper salsa like its bud-light... god I adore this woman!) I suppose the waitstaff is probably instructed to err on the side of caution with newbie customers.My Chicken Manchurian was excellent, but a little disappointing. To be honest, I'm not a huge eater of indian food, so some of this probably shone through on what I ordered. What I ended up with was something more akin to General Gaos Chicken rather than what I expected. The sauce was sticky and sweet, the chicken seem battered/fried. It was quite delicious. I wanted to lick my plate clean it was so delicious. However, it was incredibly unhealthy compared to what I expected based on the description. I had to do an extra 45 minutes on the elliptical to work off the calories.The jeera rice was well cooked. Perfect.Several times during our meal, the ?owner? (older gentleman who was not our server) came over and asked us how everything was, if we wanted anything else, more rice, paan, etc. The portions were perfect sized -- I was quite full after eating my dish with approximately half the rice and my tomato soup. My girlfriend took about 1/2 of her saag home for today's leftovers at lunch. Our the door, with tip, $50. Somewhat pricey, we did not have any alcohol or drinks with our meal, just water. Will definitely return in the future for additional dishes... plan to strongly inform the waitstaff we want our food quite hot, and not 'dumbed down'."], ["Paul B.", "Without question the finest curries I've ever experienced......try this restaurant and you won't be disappointed"], ["Chris M.", "I'm lucky to drive by this place on my way home from work so I get takeout quite often. I'll gladly give this place five stars for the friendly service and consistently great indian food (and they have Mayflower on tap!)."], ["Shaun M.", "Great food but terrible customer service and delivery time. I still am waiting on my order to be delivered and it has been over 3 hours. I called and they said the roads were bad although the snow is not forecasted to start for another two hours and I only live 3 miles away. I would have gladly picked up if I knew it would take this long. Ridiculous!!!I just called again and canceled my order and told them why and all they said ok. Absolutely terrible customer service. They didn't even off free food or a discount the next time. Now, I will not be going back to them EVER!!This was on 3/1/2015."], ["Steven G.", "Food is never the same. One time too spicy next not enough.Watch your check tend to overcharge ."], ["Melo-Raja S.", "Love this place! Food is delicious & the staff is great! My wife & I are always received with a smile, and always made to feel like we're visiting with family. Love their Gobhi Manchurian! We've enjoyed their buffet for lunch and other dishes for dinner. My wife seems to really enjoy the Channa Masala. Definitley would recommend to anyone who enjoys good Indian Food and hospitality!"], ["Lizzie s.", "We called ahead for takeout, having driven past the unassuming location a number of times.  I can honestly say it may be the best Indian food I have ever eaten.  It is  authentic and complex.  We had chicken Vindaloo, saag paneer, raita, and a very nice cucumber salad. The heat in each dish was perfect.  A new favorite restaurant."], ["Katie V.", "Tikki chicken Marsala and naan were very good. Atmosphere and appearance within is ok, doesn't smell as good as the food tastes. The free chip and dip was not tasty to us."], ["Connie B.", "Was somewhat disappointed that the buffet isn't at dinner. .. BUT... let me say it was amazing.  Got the lamb biryani, butter chicken and chaat aloo. Stuffed with some leftover for lunch tomorrow, as the portions were larger than we'd get in California.  If you want Chai, order at the beginning of the meal and it will be perfectly steeped by dessert! So.. This is our new go to Indian food!"], ["Mark M.", "4 stars for food, 1 for attitude.  Called to order dinner for my fiancee and I tonight.  Everything was fine.  Naan was a little meh (probably about as good as Trader Joe's frozen naan), but our dishes were quite tasty.  Didn't order anything crazy, but gotta give credit where it's due.  Now, why two stars you ask?  Because when I went to pick up dinner, whoever was in charge of the (extremely empty) restaurant at the time's second question (first was 'what's the name?') was \"Isn't this a big order for one person to eat?\"  Well let me elaborate.  I have what some would call a little bit of a \"weight problem.\"  Read that in your best Chris Farley voice.  Well, call me crazy, but last i heard, two entrees and a couple orders of naan for two people probably isn't enough to be considered a gluttonous feast.  Didn't want to make a big deal about it at the time, but that's not something you say to one of your (very few) paying customers on a given day.Won't be back out of the principle of the matter.  Whoever that guy is is kind of a douche, and just know that his words cost the restaurant future business.  Don't go here if you don't like being insulted at restaurants."], ["Michael S.", "The highest standard of Indian food in RI and nearby Mass. The chicken Tikka Masala is the best that I ever had. Great appetizers as well. Cannot go wrong here."], ["Phil R.", "Can't argue with the food.  The first time I went here was for a lunchtime buffet, and the Indian-food snob in me gave a grunt of approval.  The owner was there, and was really nice.But do not go on Valentine's Day - for sit-down or for take-out.  We did the latter on V-Day in 2012, and were waiting 20+ minutes longer than we were supposed to.  I wouldn't have cared if they said so, but they led us to think the food would be leaving the kitchen any minute.  So we were waiting around in the two chairs that, I suppose, were put there for that purpose.  Wouldn't have been so bad if they had some partitions, so that we had something to look at besides other people chowing down.  The food was great once we finally got it, but the least they could have done is throw in some free pakoras or something.  Sure, Valentine's Day is always busy...but for take-out?  And isn't that why a restaurant owner might want to few more hands on-deck than usual?Stick with the off-hours and off-days if you can.  If you get your food in a timely fashion, you won't be disappointed.  3.5 stars."], ["Katy A.", "Enjoyed our first meal at Apna Punjab last night. Customer service was outstanding, we were seated immediately, made to feel extremely welcome and enjoyed some fantastic food and drinks. I loved my spicy mojito, which had the distinct taste of Indian chilies....yum!We told Jay to order for us and he brought us some wonderful garlic naan, paneer masala and a special lamb dish that's not on the menu. It was all so delicious and fresh. I was most impressed to learn that Apna Punjab has no freezer, so everything you eat is extremely fresh and well prepared. It tasted like it!The reviews on here complaining about bad service on major dining out holidays are ridiculous. Go anywhere on Easter, Valentine's Day, Father's Day, Mother's Day and service is hectic and slower than usual. DUH! Bottom line: We will be back again and again!!"], ["David S.", "I met my friend at Apna. He never met a buffet he didn't like. He absolutely loves AP. Me, well, I'll give a star for courteous and helpful staff and a friendly owner. And another for a nice selection including vegan. However the added sodium/salt(As in all/most buffets) was simply overpowering. When I find an Indian buffet where I can taste the food, not the salt, I will rate it 6 star."], ["Heather A.", "The food and service are always outstanding. The owner,  Jay is very kind and funny. Whenever I go there the atmosphere is very homey and welcoming.  Definitely one of my favorite places. It's great that they cater to vegetarian/vegan/gluten free,  also!"], ["Marcela D.", "This restaurant is a hidden gem. My fiancé and I just moved to this area and love Indian food. We drove past this place and decided to get take out a few times. This week we decided to switch it up and eat in the restaurant. Jay, the manager/owner/waiter/bartender took care of us, we wanted something we haven't had there yet. Jay and the chef came up with three dishes for us, we still have no idea what we were eating but WOW! It was delicious. The chef is phenomenal.The take out is great, but do yourself a favor and eat in. It is such a different experience and food fresh out of the kitchen is hard to beat. This place is one of the best around. Talk to Jay, he will hook you up :)-M&M"]], "Taste of India": [["Alexander B.", "As a student, this was my favorite restaurant within walking distance from Brown's campus. I preferred it over Kabob and Curry on Thayer, but in part it helped that Taste of India tended to be less crowded than the former. The food was always great; their mango lamb was my go to dish. Great selection of appetizers as well. So why the three stars? I recently returned to Providence (Nov. 2012), and decided to go to my once favorite restaurant, but unfortunately the quality seemed to have gone down. Maybe it was just a bad day for the staff, but it took the waiter a considerable amount of time to take our order, even though it was not a busy evening at the moment. When we finally did get our food, it was cold. The mango lamb was certainly not as I remembered it. However, the appetizers were good and the only positive of our dinner."], ["Shradha A.", "This was the 3rd of the Indian restaurants we went to this weekend (other two being Gourmet India and Bombay Club) and found this to be average. Their service was just off and the girl just had a smirk on her face throughout. The other man was just sarcastic every time asked a simple question. We ordered vegetarian biryani - which was too spicy, paneer kulcha - which didn't have much paneer in it, bhindi (okra) - which was decent, gulab jamun - which was stale, and some raita - which was the only good thing here!They also have all those stupid minimum order per person charges as well as sharing charges!!"], ["Greg H.", "My wife and I went to Taste of India for the first time last night and loved it!  I used a Living Social coupon, which prompted our first visit. The service was very good, attentive but not overly attentive, and very friendly.  My wife really liked the interior decor, especially for such a small place on Wickenden St. We started with vegetable samosas, which were fantastic, I could eat those things every day! My wife ordered the Chicken Tikka Saag, which didn't look like the most appetizing meal but tasted absolutely amazing. In my efforts to start eating a vegan diet, I ordered the Sabzi Kohlapuri, which is a vegetable curry, and it was also great - very flavorful and not overly spiced. One large plate of rice was served for us to share, and we also ordered nan bread. The portions were generous and we definitely ate our fill!  Can't wait to go back to try another dish, and introduce my kids to real Indian food!"], ["Ashley L.", "I've been here a few times before and always get a great meal. During my most recent visit, I went during the lunch buffet but wasn't impressed with the selection so I ordered off the regular menu instead. The food was fantastic and there was enough for me to take leftovers home. I also ordered a pitcher of sangria which came out in a very small pitcher (as opposed to the ones I get at other restaurants) and it tasted very bland, we drank it, but weren't impressed. I'll definitely go back but skip the sangria."], ["Ken T.", "I've been a fan of Indian food for over 30 years, and have eaten it in the homes of Indian friends and in truly outstanding restaurants in the UK (not surprisingly, home to some of the best indian cuisine outside of India itself).  I have actually had food from Taste of India at Providence's WaterFire events, and while I never thought it was terribly good, it was good enough considering the challenges of cooking huge batches of food outdoors with very limited equipment.  So when I found myself near the restaurant recently, I decided to give it a try.Let me just say that the food at Taste of India does not taste of India.What it tastes of is \"curry.\"  You know, like the powder you get in the spice section at Stop & Shop... only even at that, they fail to add enough to give a flavorful experience.  Everything tends to be spiced more or less the same (poorly).  It's as though they are cooking to an audience that they assume knows nothing about the rich and varied cuisine of India.  This is \"lowest common denominator\" Indian.If you want to really get a sense of the variety and sophistication of this incredible culinary culture, head up the hill to Rasoi on Hope St near the Pawtucket line.  That's as good an Indian restaurant as I've been to anywhere in the world.I'm giving this two stars because the place was clean and tidy (even if the decor is non-existent), and unlike other reviewers I found the service to be adequate."], ["Brian S.", "AlittleboofayNot the most attractive looking place, inside or out, but the boofay is pretty good.  Not as many dishes as some of the larger Indian restaurants in major cities, but the food was good and the price reasonable.Not a whole lot of Indian food in Rhode island and Taste of India is convenient, quiet and the employees are very nice.  A cool place for a good, cheap lunch when prowling around the area."], ["Food C.", "I really enjoy Taste of India. I am not sure why others have been so critical of the establishment, * Food is reasonably priced, and the quality is fine. * The layout is very cozy.* Location easily accessible from the highway.* Parking never is a problem. - My only criticism is the portions which should be larger."], ["Laura M.", "I for one think that the $10 lunch buffet is quite a good deal. I mean, where else can you eat as much good food as you want? And by good, I mean not the processed, canned/frozen food at buffets like HomeTown or Country Buffet. It is essential however to go at just the right time- if you go after 1:30-2pm the pickings are slimmer, and the quality isn't as fresh.As for people commenting on the blandness of the food in general, when you order off of the menu, you can ask for it to be prepared mild, medium, or spicy. I'm pretty sure that with all of the complaints and send backs from the average American, they have decided to prepare most dishes on the mild side, to suit most Americans palates.But the portions are small compared to the price point.The service is fine- no one is very friendly, but I haven't found them to be rude either."], ["Olivia U.", "It wasn't bad. It wasn't great. I don't even remember what I ordered. Some kind of veggie curry? Eh.The service was good, and while it wasn't too expensive I'd really rather just pay more for Kabob & Curry."], ["Julie S.", "I don't know why it took me so long to try this place, but I'm glad I finally did.  (And I'm kicking myself for lost time!)  I'm vegan by choice, gluten-free by necessity, and I was thrilled with the menu here.  As with several other Providence-area Indian restaurants, the gluten-free and vegan options were clearly marked on the menu, making ordering a delight.  What's really nice, though, is that there were even more gluten-free and vegan choices on this menu than what I have seen at other places. On top of that, though, this is the first of the Providence-area Indian restaurants I've visited that had an actual bread option for the gluten-free eater!  It was made with corn, and it was delicious.  No, it's not at all like a piece of naan, but no matter!  It was just nice to be able to have a piece of bread with my meal - something I've missed ever since my Celiac disease diagnosis!The prices were good.  The restaurant is nice, with low lighting (but not low enough to concern you about the food) and good service.  My dish was spicy, and they kept my water glass filled adequately.I had the corn bread, bhindi masala, and a cauliflower appetizer made with lentil flour rather than wheat flour.  I was quite happy with my food, as was my boyfriend with his.  (He had the non-vegetarian thali, and said it was very good.)I wish more restaurants had clearly marked menus like this, and had the same number of options.  Until that day comes, I will be happy to return here whenever I want to eat Indian food."], ["Justin M.", "Indians would be ashamed to learn that the food presented here serves as a \"Taste of India\". I do not consider $9 for a buffet of merely 3 curry choices worth the price.  What's worse, the chicken curry was overcooked, dry and stringy, on top of being nearly flavorless.  Indian foods get their spicy reputation from being, well, spicy.  This curry was like eating chicken that had been boiled in a pan for two days.I'd seriously question any positive reviews of this place.  I thought, perhaps, my experience may have been a statistical outlier, but realized that at least one positive review was driven by a 10% discount for mentioning Yelp - conflict of interest."], ["Nick R.", "Outstanding! My dad comes here at least 3 times a week. As soon as we walk in they kno what we re gonna order. Im a huge fan of the chicken tikka with tandori sauce. If you like spicy i would recommend the curry (just tell them how hot you would like it). Service is great, food is excellent! Try it out."], ["Raphaël B.", "The food was alright but not great. The owner was very nice and accommodating, but the staff was rude and rushed us out of the door."], ["Sarah R.", "Tried the vegetarian thali - came with mulligatawny soup, whole wheat roti (or nan), samosa, pakora, palak paneer, chana masala, rice and rice pudding for dessert. Good sampling & lots of food (with enough to take home).Friendly waiter and quick service."], ["Andy G.", "I would be remiss to not comment on Taste of India although I have since left Providence. They have an excellent lunch buffet which includes my favorite Chicken Tikka Masala in Providence as well as delightful yogurt pudding. That's really all that needs to be said."], ["Mark S.", "I had Chicken Tikka Masala which is my favorite Indian dish.  The chicken was overcooked and kind of chewy.  The sauce was decent and rice just ok.  I probably would not go here again but might give em another shot...."], ["Ellen P.", "This is only based off of one lunch experience. (I went here a couple times in 2008, but can't really remember that well.) The main thing preventing me from going here more often -- it's about a half mile, if that, from where I live! -- is the price. Main dishes tend to run at or above $10, even those without meat. Then add tax and tip... I guess this is pretty normal pricing (seems analogous to Kabob and Curry down the street) but that doesn't mean it's completely affordable.But. Come at lunch and you can either partake of the buffet or the lunch specials. I'll probably try the buffet soon, but today I went for the channa masala lunch special. You are served papadums with the usual condiments and water to begin. I still don't know what the green sauce is, despite its ubiquity at Indian places, but it's delicious. As it was a lunch serving, I didn't expect much of the serving size, but it was big! I actually stopped halfway through with the intention of getting a take-out box for the rest (but my eyes, nose and stomach beat the waitress and I finished it off. Very, very full now.) With tip, my bill came to $9. Given the inclusion of the small appetizer and the fact that the channa masala could/should have carried into my dinner hour, not bad.As far as the quality of the food, I'm not completely sure what to say. It wasn't terrible, it wasn't terrific. The masala wasn't super spicy (the way I usually like it) and wasn't overwhelmingly flavorful either, but it wasn't bad. I feel like this is something that's both difficult to perfect and difficult to screw up... So perhaps it's not the best single dish on which to judge their quality. Basically, not life-altering, but will take care of your Indian craving."], ["Cheshire S.", "We were in Rhode Island, and I insisted we go for Indian food. Of course, we had to drive over half an hour to get it, but when we got to Taste of India, I was glad we did.  The service was prompt and the restaurant clean and cool.  We ordered an assortment of appetizers and then had the Chicken Korma and Chicken Saag.  All in all, the food was pretty good.  My bf had a Mango shake that has inspired him to make them at home (yum!), and I was pretty happy with the food as well.  Will I go here again?  Probably not.  Did it satisfy my craving for Indian food?  You betcha."], ["Vince M.", "Best indian Buffett in RI"], ["Adele G.", "Really good if you need some standard, utilitarian Indian food.  This place turned out better than expected.  The tikka masala was one of the best I've had, the naan hot and fresh, and the chicken madras nice and spicy without knocking me out.  Service was polite and efficient and the prices good, too."]], "Kabob and Curry": [["Red S.", "This is a hard review for me to write. My family and I have been going to Kabob and Curry since my teenagers were babies. Their first taste of Indian food came from this place. Owner Sanjiv Dhar was always very welcoming when we would see him and the food was the best around. I say \"was\" because our last visit (or to better emphasize our LAST visit) was one of the worst restaurant experiences we have ever experienced. We were seated upstairs and waited about 15 minutes for the server to recognize us. Once he did, after our flagging him over, he took our drink and apps order. A runner gave our drinks to the wrong table and when they refused he started back down the stairs until I caught him and told him they were OUR drinks. We wait another 30 minutes and no appetizers so I ask our useless waiter where they are, oh they are coming soon he says and then tells the runner to go put the order in. The staff turnover is the root cause of all of these problems by the way. The competent staff of years past are all gone and you now have untrained, unfriendly and patronizing employees to deal with. Back to the service. We get our meals and at the first bite the manager comes and asks us if we can move over 3 tables so a party of 20 college kids can come take the table. We oblige and are moved into the corner. If you think we were ignored before you should see how long it took us to get a server after the college kid party arrived. Finally I grab the arm of a passing server (not ours) and tell him to get our check. It took so long for him to return that I went down to the front desk to pay. On the way out I saw the manager and told him we had been patrons for over 15 years and this was the last time we would visit this place. He apologized and then handed me a blank gift card and said please come back. I don't know what the contents are on the gift card and will never know since I wont be back.Sanjiv Dhar is a good man and it is hard to run a food business. You can tell he cares about his restaurant and while we won't be back I am editing my earlier rating because he does deserve the business."], ["Diya S.", "As a forewarning, I am of Indian heritage so I am pretty picky when I go out for indian food.  However, I found that the appetizers (pappadums and some chutneys) were really good, and the food is pretty tasty.  I have had  a variety of the veggie curries, and I would say that the spices they use and the presentation is definitely up to par.  Do not miss out on the garlic naan!The reason I knock this place is because it's pretty expensive for Indian food located on Thayer.  Traditionally, you would want to try a few different curries at a time, but each curry is $12 at dinner, leaving you with maybe one curry.  The 2 for $5 appetizers are a really good deal though!"], ["Mitchell S.", "First time there & we had a wonderful time. Shrinee was delightful to talk to and very charming. Their new craft beers was a great way to start. The chicken tikka app was delish, tandori chicken amazing & their honey & ginger naan (a first for us) was also a nice surprise! Affordable!  Highly recommend"], ["Dima G.", "Very nice place. Not very spicy for indian food tho. Decor is pretty cool and service is very attentive."], ["Jessica K.", "Best Indian food in Providence. We keep trying other places and end up wishing we had just gone to Kabob and Curry instead. The food is amazing and the prices can't be beat. The combo plates are perfect for trying new things. I recently got a cauliflower dish off the vegetarian menu and I literally dream about getting it again."], ["Shen B.", "Loved the food. It was aromatic, rich, spicy. Most indian restaurants customize their dishes for the American palate (which often becomes an excuse to under season the food), hence I refrain myself from eating at such places. Kabob and Curry was a pleasant surprise- it was authentic! If you'd like it spicer just let them know. We got samosa chat (spicy), black dal, basmati rice,vegetable korma. I loved everything, but my favorite has to be the aromatic, long grain basmati, with just the right amount of clove. My apartment smelled heavenly. I highly recommend them. Will order again. Their online ordering was hassle free, fast delivery, courteous and well mannered staff. What's not to love?!"], ["Lisa R.", "I had the Saturday Thali in which you get three choices of curries/entrees, rice, and naan for 10 dollars. The flavors were all there, but I must say that my meal was more rice and naan then anything else. There must have been 1/4 a cup of curry in each of three tiny bowls that comes with the thali. With the mango chicken I ordered, I had two tiny slivers of chicken. Point is..the portion sizes are very small with the Thali and I think next time I would just order off the regular menu. Overall, Kabob and Curry is a staple on Thayer street and even though it may not be my favorite place to eat, I still find myself back here from time to time."], ["Kiho S.", "My friend and I went to this place a lot to eat during the summer. Staffs are friendly and they remember us. Chicken Tikka Masala is definitely way to go, even though there are other good food."], ["Sarah F.", "Kabob and curry is absolutely delicious Indian food. Only to be equalled by the owner's other Indian restaurant, Rasoi, in Pawtucket. It is very vegetarian friendly and both the naan and samosa are amazing! The staff is always attentive and very friendly. Not to mention, the location is perfect; Right on Thayer street, it's the perfect spot to grab a bite before going to the Avon for a movie."], ["Peter M.", "I just had this Chili Chicken with rice a few minutes ago. The mixture flavor of spicy and sweet is really good! The sweetness kinda soothed the aggressive spicy flavor and the rice was tasty too."], ["J A.", "Food: Indian food is definitely some of my favorite food to have when I am eating out and Kabob and Curry has always been my go-to spot for both dine-in and take-out. I usually order the Chicken Tikka Masala entree with some sides (various Naan breads, samosas, or pakoras) and it never fails to deliver that intoxicating and aromatic blend of flavors that I crave. Their buffet is also to die for as they do not appear to lower the quality of their food during buffets like other restaurants may do. Ambiance: There are two levels of seating and both are nice. If you are looking for more intimate seating, see if you can get a spot above away from the kitchen and entrance. Service: No problems with service. The staff are very friendly and efficient.Overall: It's one of my favorite restaurants in all of RI. Highly recommend."], ["Jeffrey M.", "Just had an amazing lunch there today. Having lived in this area for the past 15 years, I could just kick myself for not coming here sooner.The spicy coconut mushroom soup was a great way to start. Have a great bread selection. The entrées were fresh with rich flavors.I was just in India two months ago. These flavors took me back.Nice casual atmosphere.  Happy space. A good place to meet up with others.The air-conditioning was on full blast. Plan accordingly if you going on a hot day. Enjoy."], ["Andria T.", "I don't have a lot of opinions or knowledge of Indian food.  It either tastes good to me or it doesn't, and I'm not going to get bogged down in a discussion about authenticity.  So, if you're like me and you just want to know if a place makes good food rather than hemming and hawing about details, let me tell you, Kabob and Curry makes good Indian food.I've been here half a dozen times, and it's never not good.  Service is always prompt, and they never keep you waiting for the bill.  More restaurants should be like Kabob and Curry in terms of their service.  They don't rush you, but you don't fell like you're ever going to be stranded at a table yearning for drink or the bill so you can get on with your life.I've liked everything I've tried here, and the restaurant itself is broken up into many small sections so you don't feel like you're eating in a cafeteria.  It also makes it easier to find your server, though honestly, he usually knows when you need something before you do so that's a bit of a non-issue."], ["Amy K.", "I've yet to find an Indian restaurant I love as much as Kabob & Curry since leaving Providence. Their lamb curry, their naan, their Sunday brunch - I miss it all so much. I can't wait to visit Providence to eat here again. (Given the crowds during Brown's reunion weekend, etc, I'd say I'm not the only one who feels this way!)I should mention that parking is a nightmare, (wasn't an issue for me at the time,) and it isn't great when it comes to accessibility for wheelchairs or the disabled.  There are steps up to the door, and the interior is quite cramped."], ["Steve W.", "The food is very good. I especially like the tandoori chicken and the chicken shashlik. I also like the samosas and the potato dosa. I come to Kabob and Curry a lot and I have never found problems with the food. The food is never too spicy for me and has a lot of flavor. However the service is inconsistent. Also the tables are cramped."], ["Leela S.", "Conveniently located on Thayer Street to serve the student denizens, Kabob and Curry is a quick, easy stop if you're looking for Indian food in the area. Their lunch prices are very reasonable, and you receive a fairly filling portion for under $10. Furthermore, if you are a student, you can flash your ID to receive an additional discount--this policy isn't advertised, though. I personally am not the biggest fan of most of their dishes as many are westernised versions of the original, but their saag paneer is probably my favourite. Be warned that service is very hit or miss, though--it honestly depends on how frequent a customer you are, and which side of the bed your server woke up on."], ["Jennifer N.", "The Nans amazing!!!! Chicken tika masala is amazing! Amazing place!  The waiter is friendly as well. It feels welcoming, love the atmosphere. Staff is extremely nice and helpful."], ["Marie M.", "The food here is very good, however the service varies on every visit. The lamb samosas are always delicious as well as their Tamarind margaritas. The reason I will never return here is for the following reasons1. several waiters stood near the bar area and persisted to peek at me for my entire meal2. my waiter closed my account before I could order another drink, and brought me my check within 4 minutes of serving my food while repeatedly saying to me\"we're not rushing you, we're not rushing you\", but you are rushing me."], ["Amanda W.", "I stopped by to order lunch to-go after finding this place - and it's gluten-free options - on Yelp. My lamb saag was ready in less than 10 minutes. Delicious and quick, what's not to love?"], ["Bryce A.", "A Brunonian favorite, when in doubt my friends and I always eat here. The staff are incredibly friendly and remember most of our names.The food is good, mostly curries with rice or naan. I like their dosas, which are like crispy Indian crepes filled with curried potatoes. None of the food is spicy, but it is not at all bland. The prices are very GOOD for lunch during the week and BAD for lunch on the weekend or dinner on any day of the week. Basically the price and portion are doubled for dinner and weekends, which is not a good thing since meals go from perfect sized portions at under ten bucks to monster portions at twenty bucks.The catering is also quite good. It is everyone's favorite in the Brown CS department, often drawing crowds of students to tech talks and whatnot. In short, if you are on Thayer St, Kabob is a good bet. If you are there at dinner time, bring a friend and split the meal.UPDATE 05/12/14:---------------------I forgot to mention that if you are a student, give your server your student ID with the bill. You'll get 10% off!"]], "Rasoi Restaurant": [["Jamie B.", "Oh Rasoi, how you make my heart swoon.The decor is fun, the servers are always very nice, and the food... sigh... so good! They have an incredible selection for vegans and vegetarians. The last couple times I've gone I ordered the Satvic Thali. This order consists of 7 small portions of their classic vegetarian options. Cauliflower 65 - fried spicy goodness, with the texture of chicken nuggets, but without all the guilt. Vegetable Mango Curry - a mouth watering delicious mixture of sweet and spicy with the most perfect creamy texture. This stuff pares super well with the cauliflower. Saag Paneer - creamy spinach, not too spicy, and compliments the rice and fluffy naan very well. The house lentil - which was not merely just lentils, it was filled with yummy fresh veggies. The dessert of the day was served cool next to the other dishes, so my first bite of it I was caught off guard expecting a hot spicy dish. Once I realized it was the dessert, I couldn't get enough of it! After the hot and spicy Thali, the cool and sweet tapioca (pudding?) was absolutely what I needed.The only complaint I can give was that a couple of the times I came the tap water tasted dirty. I know it's free, so I shouldn't really complain, especially knowing they're located in Pawtucket (I used to live there, so no disrespect intended). But after asking for a different glass of water once I found that the new one tasted exactly the same. So, either the waiter went into the kitchen and back out with my same glass, or it's just the water. But really, this isn't enough for me to bump my review down any stars. Rasoi deserves all five. My recommendation? Go for lunch! They have rewards for frequent lunch customers, and the prices are ridiculously reasonable. We're talking between $6-$8 for vegetarian/vegan meals that cost $12-$14 during dinner. And the portions are so filling that you'll probably have to ditch dinner anyway. Which, if you're as lazy as I am, that's a good thing."], ["Michelle W.", "We love Rasoi! Amazing experience (once again) the other night with Erics waiting on us. Impressive, attentive, wonderful service. Hostess is sweet and welcoming. Drinks were ice cold and the food was piping hot and absolutely delicious!I'll be requesting Erics every time we go in. Thank you Rasoi!"], ["Christian V.", "This place is my absolutely favourite Indian restaurant here in Rhode Island. Here's why!Their Sunday buffet brunches will make you believe in God!....I'm serious. For $15 ($14 for the Saturday Vegetarian Buffet Brunch) you get to choose from some of the best food you will ever taste. Every week is different, offering new tastes of different meat and veggie dishes.Their servers will make you feel like royalty. They are very attentive and considerate. They will sometimes engage you in conversation but, it feels like, they're laser-focused on ensuring your experience with their food is incredible!It should note that they are not cheap. Not even in the slightest. My favourite entree to order (and one I HIGHLY recommend), the Chicken Tikka Lababdar, costs $16 before tax. However, you do get a sizeable amount of food for your money.When I'm hankering for Indian food, it's Rasoi or nothing."], ["Annabel T.", "Came here last night (a Saturday) at 9.45pm, on the way back to New Haven. My friend said the food here was good, and she wasn't kidding! Service at 9.45 happens to be really speedy because they close the kitchen at 10.15pm. Our waiter was quite polite and catered to us in a timely and unrushed manner during our 45 minute meal. I know thalis are always a hit or miss, but I ordered a vegetable thali in haste, which was a mistake on my part. My thali did not come with yogurt, so I had to ask for it separately (maybe they forgot?). There was also a vegetable curry that contained mango chutney, which I didn't really care for. However, the saving graces of the thali were the naan, which was by far one of the best naans I've eaten outside of India, and the suji dessert. I enjoyed those things very much. The thali cost $13.99, which is a reasonable price. My friends ordered the potato and egg curry ($12.99) and the Hyderabadi chicken korma ($14.99), which were DELICIOUS. I was like, \"ugh, me and my thali ambitions.\" In any case, this was a tasty albeit brief dinner in Pawtucket. If ever I'm around again, I'll be back!"], ["Gordon B.", "Cooking Demo on 24 AugustChef/Owner Sanjiv Dhar held another class on Monday. The highlights, for me, were the root vegetable soup and the potato/egg balchao. The soup is easily prepared, can be served warm or chilled, and takes into consideration seasonal vegetables. This will become one of my go-to recipes.As usual, all questions about preparation/substitutions/suppliers were answered with a wonderful sense of humor and grace.."], ["Erica N.", "Being gluten free and vegan, the Saturday buffet is my favorite place to eat!  I can have everything on the spread, which is very rare anywhere else I go.  I love the Saag Tofu and the Aloo Gobi!"], ["dennis b.", "I don't get it. How does this place have 4.5 stars.  I love Indian food and must eat Indian at least twice a week.  I literally go to every Indian restaurant I can find.  I was really disappointed when I came here.  The Sunday buffet was very lacking.  The selection was very weak.  One chicken dish and one lamb dish.  Where were the standards! !!!!  Chicken curry? Machni? Tikka? Vindalo? Atleast one!!!   And the lamb... was ground lamb... the kind u buy for hamburgers.  Where was the actual lamb or goat curries!!!!  I was really dissapointed.  I guess people of east side do not know what they are missing when it comes to Indian food."], ["Toby H.", "If Kabob and Curry had a brother.....wait a minute.Yup so K&B does have a brother, only this one is a little older and therefore doesn't hang out with all the frat boys & college kids.Rasoi is another \"so close to the east side, yet stuck in the bucket\" businesses . And as such they join the company of The Garden Grille, Wildflour and that Chinese restaurant that appears to never have anyone in it. Rasoi is always busy the food is always fresh and scrumptious and the service is always fast and friendly.  I would say to truly enjoy Rasoi, check out their deals such as a meal for two with a bottle of wine for under $50 ( Tuesday I think). The cocktails a fun and reasonably priced. Sunday brunch is a must, for under $20 you can enjoy so yummy food.Eat well Providence"], ["Amber R.", "Ordered from here tonight for the first time  & it was awesome! The lamb vindaloo had the perfect amount of spice and the samosas were delicious. Probably some of the best Indian food I've ever had. Incredibly fresh, can't wait to try more from Rasoi."], ["Megan V.", "Before Rasoi, I cant remember the last time I actually audibly \"nom\"'d while eating my food. What a YUMMY restaurant. At first I was a bit hesitant with the menu. There was a lot of dishes I was not familiar with, some using some interesting ingredients. I was torn between two vegan dishes and the hyderabadi chicken.The meal began with papdum with 2 sauces for dipping. The brown one is sweet and savory at the same time. Very yummy! For an appetizer I had a potato and paneer samosa which was very nice. It wasn't super hot on the inside but warm enough for my taste.We ordered the spring onion and garlic naan which I ate along with the hyderabadi chicken. Oh gosh was it all so amazing! The chicken was so perfectly cooked and there was a ton of it! The sauce was perfectly warm with spice, nothing crazy hot. While I enjoy checking out new restaurants in the cities I venture to, I definitely will try to visit Rasoi again!"], ["Sarah B.", "This is one of my go-to restaurants in Providence/Pawtucket.  I have never had a meal from here that has not surpassed my expectations. I've lived in India, and I find that they have food here that is authentic enough to meet my cravings but also many choices that are more low-key as to not inspire fear in my friends and family with limited or meek palates.  There is an option for everyone- gluten, dairy, animal-product free options are not only bountiful, but delicious. The Cauliflower 65 and the Idli are my two favorite appetizers. I have too many favorite entrees to count. However, the crowning jewel of this places for me is their South Indian cuisine.  It's less popular in general, but so very tasty, and at Rasoi, they do not disappoint with their offerings. Dosas are crisp and gigantic (as they should be), coconut and tomato chutneys are creamy and on point.  My only complaint is that they don't add more options for the fillings, but the ones they have are wonderful.  The buffets on the weekend are great values for their offerings. The ambiance is nice, as you can dress up or down and not feel out of place. I love that they have Bollywood music videos on display but not so loud that you can't have a good conversation. It's family friendly.  The staff is EXTREMELY friendly and unless truly slammed, are always refilling your water or making sure everything is ok before you ask first. The prices are a little high given its location, but it's easy to overlook when the food and services you receive are pretty much perfect."], ["Heather G.", "This place is AMAZING. I haven't stopped thinking about it since my first take out experience last week.I trusted my fellow Yelpers and came in on a Wednesday night for take out. I ordered the Cauliflower 65 and the Chicken Korma to split with a friend.The Cauliflower 65 was delicious. The Cauliflower was fried with a spicy sauce... it tasted almost like buffalo. I loved these and will be ordering them every time I go.The Chicken Korma was the best I've ever had. I am picky about Indian food and usually will grab take out from my favorite spot in Cambridge... but Rasoi rivals the best Indian restaurants in Boston. ABSOLUTELY the best Indian spot in Rhode Island. To make matters even better there is a PARKING LOT. I would parallel park for you, Rasoi,  but this makes you so much more convenient.My new favorite take out spot. I'm hoping to try for the second time tonight!"], ["Nora R.", "Ordered paneer extra spicy.Extra tasty . Everything from service, to the mango lassi and my entree were expected and very well."], ["Barry N.", "I've never been disappointed by Rasoi! Good food, good beverages, good service, and great atmosphere.There's enough variety on the menu to justify several repeat visits and the prices are valued to justify frequent dining.Vegan? Gluten free? Gluten freegan? (Is that a thing? My spell check seems to think it is.) They have plenty for you!"], ["nicole f.", "Another great meal at Rasoi!This place delivers consistently tasty food, in good-sized portions, delivered with efficient & courteous service. I felt tonight that the chicken tikka masala we shared tonight was the best I've ever had, with a rich & spicy sauce & chicken chunks you can tell had been cooking for awhile. Thanks guys!"], ["Francisca W.", "i wanted to like this place, really. GF hub has been here and speaks highly of it, so despite there were other places i have researched and wanted to try, we came here upon his suggestion instead.arrived a few minutes before 3pm on a Sat; saw the posted sign about buffet ending soon, but they still served (ie. not closed in between hours). sat down, ordered drinks and apps, then thought about entree choices as the staff put away buffet tables in the background.when putting in our orders, the only non-Indian looking waiter in the house regrettably informed us that \"lunch time was over\", so we had to go with the dinner pricing of the same food. thinking we would have a larger portion? doesn't seem like it (as evident by the dishes that arrived later), but the price of each just went up $4-8 on you because you arrived 5 minutes too late for lunch. oh well.asked about our serving of that cracker stuff (sorry i didn't get the name; they serve that here instead of bread), our waiter once again regrettably told us that they were just finished with the last batch, but he would check on it and bring us some when the next batch came out.except that he never came back for the rest of our meal. another waiter served us food, the manager-looking gentleman came to ask how our meal was, but no one told us where our waiter went... until the end of our meal as we went to use the restroom, we found him sitting in the back taking his break. i'm not saying he didn't earn his break, but he could've followed up on our orders and maybe explained why he'd be gone, instead of just going MIA on us. or the restaurant could have had someone else serve us to begin with, if he were to go on his break that soon. not sure how that system works...forgot to ask hub to check if his name (which we never caught, btw) was on our tab, or if the establishment goes by a communal tip system. coz if he were to get tips from this meal, he really didn't deserve a lot. not very happy with the forced \"upselling\", either -- now i'm starting to wonder if it was a universal house rule, or he was telling us that only to jack up the bill for his own benefit.food is good, don't get me wrong, and i do appreciate how they list every dish clearly whether it is gluten-free, dairy-free, or both (think they specify vegetarian/vegan dishes too). but the fact that we had to overspend for what didn't look like a bigger portion of food--plus no crackers!--that's just kind of messed up. yes we could've asked for the crackers but when we realized we were not getting ours while those who came after us did (and our main courses were coming), it was kinda past the point...hope the next visit would be a better experience."], ["Lisa O.", "I have been to Rasoi a few times now. The food is always good and the service decent. I gave 4 stars based upon my past few experiences with the tasty cuisine.Tonight, I ordered the potato naan, which I found disappointing. When I have ordered it from other places in the past, it had been deliciously seasoned potato and peas inside naan. Rasoi's was simply a thin layer of unseasoned potato. Essentially, pointless carbs that added no flavor. I also ordered the mango chicken and veggies which was delicious. The meat was plentiful and moist. I often find that Indian restaurants over cook meat and give tiny portions of meat. That problem does not exist at Rasoi. They have the option of brwn rice rather than basamti rice. I figured when I ordered it that the brown rice would also have some seasoning. However, it was just slightly over cooked brown  rice. I'll be stocking too the basamti in the future.The service is relatively quick and the servers friendly enough, but it is nothing to write home about."], ["Sarah Jean R.", "Rasoi is the best. I finally visited after living here a few years and am already planning my next visit. I had the saag tofu and it was perfect. I noticed they do a vegan buffet on Saturday afternoons. The drinks looked good and I'll try one next time. Also, 5 star service and great naan."], ["Jennifer B.", "Rasoi constantly has great food. We ordered the vegan menu items and are never disappointed. The use of fresh ingredients and spices is great. I prefer this location over Kabob and Curry. You must get the cauliflower 65 and naan!"], ["Xiao Z.", "Here I thought I was going to write an updated review on Rasoi, not knowing that I never wrote an official review after my last brunch extravaganza. I guess this will be a 2-for-1 review.Brunch: This place is great. I came here during Father's Day weekend last year and we were very impressed by both the variety and quality of the dishes. My father loved all of the meat dishes and I especially loved the almond dessert. The price is a little bit on the higher side, but you cannot deny that Rasoi is one of the best deals for Indian brunch buffet in RI.Dinner: Years later, I came here with my GF to enjoy a nice dinner and we decided to splurge a bit, with two mango lassi (tall glass, but lots of ice), a specialty dates and coconut nan, a 4-dish specialty and fried okra. I looooved the okra dish, omg, I could eat it all day and they were definitely crunchy, but maintained the soggy, chewy nature that I have come to love from okras. The multi-dish, in which I totally forgot the name was good as well, although the lamb was a bit overcooked and sparsely populated the little dish. The lentils were decent, and it also came with two well seasoned shrimp as well. We didn't try any of the other appetizers, but you can't have it all the first time, right?My personal recommendation, get the okra dish. Having only tried goat biryani at Not Just Snacks, I was hesitant to get it here, but maybe that'll be my next adventure.Food: 4-5 starsPrice: 4-5 starsService: 4-5 stars, everyone was very attentive and friendlyAmbiance: 4 starsGot to save 20% by checking into Yelp = 5 stars"], ["Chintan M.", "Once again another Indian restaurant attempting to cook everything India has to offer for its culinary experience! Couple of items might be good (lamb appetizer), but otherwise food appears to be bland and not so interesting."], ["Sid S.", "Been there twice. First time i found the food was just ok. But second time I went it was really good. I ordered paneer makhani and channe. The nans were yummy and soft. Good parking and excellent service"], ["Larry C.", "My favorite place for Indian food! Great vegan options including a buffet.  My favorite is the Cauliflower 65 appetizer.   I don't like cauliflower, but it tastes great somehow! In fact, it was so good, that I started eating the Cauliflower Manchurian, which is also awesome!"], ["Stephanie M.", "In here recently at the behest of a friend who loves them, and I have to update because it was just such an improvement. I have the same food allergy, asked the same questions - and yes, I know it's dumb to go for Indian with a cardamom allergy, but every other Indian place has handled it before, and now it seems Rasoi will too!I had a delicious cauliflower curry dish with perfectly done cauliflower that still had just that perfect bit of tooth, crunchy peppers, ideal carrots, and a delicately spicy yellow curry sauce that burned and burned like a slow flame in the heart of winter.Their drinks menu has also expanded, wonderfully, and included a spiked hot cider that paired magically with the food. I'm SO EXCITED to be able to go here again."], ["Josh W.", "Love. Period. I love the food. Cauliflower 65. Heavenly. Naan. Date and coconut. Knee weakening. Weekend buffets let you get a great overview of the styles of Indian cooking and many of their menu items. Saag with Paneer and tofu. Mutton Masala. Any of the curries. You really can't go wrong. I've even done whole vegetarian meals here. And loved it. Me? Yup. And the drinks are inspired. Lots of berries, coconut water.... My favorite Indian in RI. By far."], ["Ray Y.", "After visiting twice and I feel justified to give this place 5 Star Yelpage. No doubt the best Indian restaurant.  Interesting drinks and the Sangria is quite good.  We love that they designate vegan and vegetarian options and there are plenty of them.  Rave reviews.  When starting your dinner the Cauliflower 65 is a must.  Everyone raves about this but the Masala Uttapam was also outstanding.  I'd pass on the Lamb Galouti next time.  Dinners were exceptional in flavor with lots of fresh veggies if you choose to get them but many of the meat dishes are just that - spicy meat.  The Mango Chicken and Chicken Lababdar were very good as was the Lamb Vindaloo.  My vegan daughter loved the Avial.  The service is very good and the only blunder we've experienced was an omission submitting my Chili Chicken - making for a 10 minute wait.  I could give a star off but they were upfront and I'll give them one mulligan.  The had a deal this Tuesday - one appetizer, two entrees and a bottle of wine for $40.  You can't beat that.  Rasio's has entered our power rotation."], ["Bethany R.", "LOVE LOVE LOVE Rasoi. The only thing else I could ask for is better outdoor seating. Amazing food and fantastic staff!!!!"], ["Stephany H.", "One of the best restaurants in RI and one I'll happily make the trek for. Love the moilee and the rosemary naan. The Sunday brunch is wonderful and a great way to try a lot of things. Plus their Bloody Mary is out of this world filled with fresh ginger. Never had anything bad here. Wonderful staff and service. Also recommend one of the cooking classes. Such a great time and lovely value. If this isn't on your regular restaurant rotation in the area it should be. Oh and get the casmir cocktail. Delicious!"], ["Kasey L.", "Rasoi is absolutely my favorite Indian restaurant. The naan is delicious (seriously though ... I wish I could eat 3 baskets by myself). The mango chicken is amazing. The masala potatoes are incredible. The peach white sangria is fantastic. The service is great. I can't think of a single complaint. Highly recommended."], ["Allison M.", "As just a beginner with Indian food, I was looking forward to sampling what my friends have told me is 'the' place to get it in the area. For days I've had a hankering for chicken tikka masala, and I needed a fix.For the record, we each ordered the chicken alongside some Trinity IPA's. We were offered the option of basmati or brown rice, and lentils or vegetables. Loved that! It was so nice to have a choice, and we took advantage - he had the basmati and lentils, I tried the other two. All of it was great.The food was tremendous - served piping hot and full of wildly aromatic and interesting spices. It was so good, we ordered extra naan to take home with our leftover sauce. I've been to two other Indian restaurants in the area: Taste of India on Wickenden Street and India on Hope (a mere stones throw from Rasoi's doorstep). I think Rasoi embodies the best qualities among the three. For example, parking is easy as pie. The ambiance is bright and friendly, but also quite classy. The waitstaff is professional, warm and accommodating. The food is elegantly plated and tasted exactly as beautiful as it looked. For the price, I honestly can't complain. I got what I paid for and then some."], ["Cristina M.", "Love Rasoi. I always order takeout, and it's usually ready within 15 minutes. Really delicious food (and I used to live in India) and it's quite affordable -- every dish comes with a rice or potato side, and a choice of lentils or veggies, too. We usually spend $40 and then end up getting 4+ meals out of our order.The creative naan selections are great. Our favorite dishes are the bone-in lamb and okra."], ["DanniAnne A.", "I already love this restaurant, but now being a part of a rewards program just made me the happiest costumer ever. This business knows how to make and keep costumers happy."], ["Michael M.", "As good as it gets! Never a disappointment, Impecable service, always with a smile.  I just can't say enough about how good this place is.  I suggest if you havn't been here before tell the wait staff, ask them for recommendations Indian food is for all of the senses to enjoy the fragrances the visual appeal and the flavors are all spot on. Oh and the bar does a fine job as well!Keep up the good work!!!"], ["Andria T.", "Wow, Rasoi makes some seriously good food.I kind of don't even know how to review this place because I'm drooling a bit just thinking about it and what can you say about a restaurant that seems basically perfect?  I guess my only complaint is that whenever I go here, I never have leftovers and leave completely stuffed and a bit ashamed of my greed.  But it tastes so good!The menu is diverse and everything I've tried has been excellent.  Honestly, I'm in a bit of a rut with Indian food and usually just get Muttar Paneer almost every time (I love it so), Rasoi got me out of my comfort one and has me eating all kinds of noms!  The service is consistently good and, as others have mentioned, the place is spotless.  what else is there to say but GO THERE!"], ["Jaclyn P.", "I am ALWAYS in the mood for Rasoi. Whether it's a warm summer evening or a blizzardy Sunday afternoon in the middle of January, Rasoi is always the best choice.The buffets on Saturday and Sunday are great. I abstain from eating land animals so I prefer the Vegan buffet on Saturdays. And it's also an excellent option for those who are gluten-free.My first true love is the Mattar Paneer but the ginger naan and Cauliflower 65 are close contenders for first place.Prices are good and service is always friendly. Rasoi is great for a date night for two, or a big dinner out with friends. The decor is festive and they always have some funny Indian music videos playing.I highly recommend you watch the episode of WGBH's Neighborhood Kitchens which features Rasoi. It's a great little peek behind the scenes at this wonderful restaurant.wgbh.org/programs/Neighb…"], ["Laura B.", "Rasoi is my favorite restaurant in RI. The food is reasonably priced for the quality, and is consistently amazing. I have not encountered a single unfriendly staff person in my many years of patronage. The delicious drinks are a fun bonus!"], ["Kameron S.", "I have found my new go-to spot for Indian cusine! The food is great and the drinks are awesome too. I love the veggie samosas, lamb korma,and  garlic and spring onion nan. Round it out with a mango lassie or a specialty cocktail and it is a great meal. I also love that they have smaller portions for lunch."], ["Naushaba A.", "I would give it a 3 star but I am giving it a 3.5 star because of the lack of good quality Indian food around this area.  Had chicken tikka masala - decentchili chicken - ok. different than what you definitely get at a Chinese place or a indo-Chinese place.goat biryani - decent but bit soggy (tasted more like another rice dish named khichra than biryani)naan - goodatmosphere - nice and pleasant.  would not take many kids there. can hear everyone's converstation.all in all, I would recommend as a once in a while eat."], ["Paul D.", "My wife & I dined at Rasoi again Tuesday evening. We've been coming here consistently - at least once per month - for the past 3 years. This remains one of my favorite RI restaurants. The food is consistently fresh, and the service is consistently welcoming & attentive. We almost always go for the vegetarian dishes (my wife is vegetarian) but I have also enjoyed the chicken & lamb dishes included in their Sunday buffet (Saturday's buffet is vegan). Their Saag Paneer remains one of my favorite dishes."], ["Lou G.", "This place was really good.  The service was good, the food was tasty, the ambiance wasn't that bad either.  General cleanliness level was also excellent (at least in the dining room).  I will go back again, soon."]]}