{"Capriccio": [["Martha Y.", "Face it, Providence has a plethora of terrific Italian restaurants, but none is as iconic of the Good Fellas era than Capriccio. When out-of-town guests request upscale Italian, this is my go-to venue. In addition to a very large menu, extensive wine list, impeccably dressed waiters (mostly men, of a certain generation, which further adds to the ambiance), Capriccio's restaurant decor and atmosphere is so on point! In short, enjoy the food but come for the EXPERIENCE. My out-of-towner foodie guests no doubt rave about everything after each visit so it's hard not to come back time and again for those special occasions."], ["Patrick W.", "Capriccio is a higher end Italian restaurant in downtown Providence. It provides a very nice atmosphere to have dinner. I ordered the Boeuf Wellington. It was actually the first time I ever ate a Boeuf Wellington. The entrée was well cooked and I definitely enjoyed it as I devoured all of it. Of course, it is pricey. If you are just passing by Providence, I would definitely recommend the other restaurants instead. Nevertheless, Capriccio is a great choice if you want something that is higher end. I would definitely go there for a business related dinner.If you are passing by Providence and looking for recommendations, please see rookerville.com/2015/09/…"], ["Jay G.", "I enjoyed another great night out at Capriccio's last evening. We had a party of five and could not have been more satisfied with the quality of food and extraordinary service.Capriccio's is at the same time a great steak, seafood and Italian restaurant with an ambiance unique to itself. Looking forward to returning soon."], ["Jenn M.", "The best meal we've had in a long time. The service was top notch. Matt, our server, made sure we were well taken care of. I had a baked stuff lobster and my husband had beef Wellington. Both were excellent."], ["Ahmed A.", "We coincidently ended up here during restaurant week. The service is not good here. They were more concerned with trying to turn the table over than offering a good dining experience. We felt so rushed. The waiter was literally pulling my plate away while I was still eating. Actually I felt like the wait staff were sort of jerksDon't come here for the service.On to the food...."], ["Kay P.", "I had to update this review based on my visit today. I was sorely disappointed last time as you can clearly see from my last review. Yeesh, sorry I was a little harsh but hey I was let down. This time was a pleasure. Less is more but I spoke to someone on yelp who turned the whole situation around. He took a negative experience and made it a positive! I had the car valet parked and got the classic door opening and greeting then off to a nice table (not in the dark) and our server Larry was great. He was really friendly and funny. He gave us the regular menu and the restaurant menu (without judgment), then told us over 5 different appetizer and dinner specials, I have no idea how he remembered all that, I know I didn't...We all decided to not go with the restaurant week menu because there were so many other good choices. My mom and I ordered the salmon with apple cider-maple glaze, just enough sweetness, it came with polenta cake, (I traded those in for whipped potatoes.....amazing) and a side of asparagus with all the sharp crunchy parts removed, how nice...and really good. Gail tried the haddock which was served over a tomato and fish fumet, (which is a fancy word for broth), with spinach and caramelized onion goodness. Of course I had the vanilla crème brulee (my favorite dessert in the universe), which was served in a deeper bowl than I have had before and not all flat like they normally come, it is officially the best one I have had. Perfect. I was full but I still ate the whole thing. My mom tried the chocolate mousse, it was literally the most chocolaty thing I have had in a long, long time, awesome, I should have got that with a glass of port. :)Anyways, I thought it was only fair to rewrite my review because I finally gave this place a second chance and had the experience that I had originally hoped for. I am glad that yelp exists, it is a great outlet for expressing ones opinions about local places, getting info, and getting feedback. I write very few negative reviews and I am so glad that I can say Capriccios is not on that list."], ["Andrew W.", "This place is amazing! Huge thanks to Nick! You mad our night amazing with the excellent suggestions throughout the night!  Hands down one of the top restaurants in Providence!"], ["Allison D.", "It seems that providence had lots of expensive restaurants with good food, but not all of them have service that matches. We went for a celebratory dinner here on Friday night and not only was the food amazing, but our cocktails were perfect and the service was 5 star. The waiter takes care of you from the moment you sit down until you leave. They actually know the liquor the bar carries, they know the specials perfectly, the apps are brought to you at a perfect time so you're actually able to have time to eat them before your entrée. It's really just a fantastic place all around and you don't mind spending the extra money when you feel it's well spent!"], ["Portia J.", "Im not going to lie. Before I walked in I thought this place was going to be a stuffy little tightly squeezed tight quartered establishment with stiff white linens but it is quite the opposite. I walked in with a friend of mines, we were 20minites early for our reservations (it was snowing outside and gross, so we decided to leave a little earlier) and was immediately greeted by a lovely host awho guided us to the bar so we could wait for our table. The bar was awesome. I think its my favorite thing about this place. It felt like a private den where you could smoke cigars and drink some cognac, in their plush cozy seats. The bartender was extremely nice. I chugged my Reisling and headed to my table.The lighting is intimate and cozy. The bread and butter was really good. I had trouble picking an entree and the maitre d was extremely helpful. I finally settled on the Zuppa Di Pesce. The broth/sauce was really good, the capellini was even better, grated parm was spot on. The seafood was a disaster. It was completely over cooked and rubbery. I wish it werent. The best dish on the table was certainly my boys dish. He got the duck cooked in Grand Marnier. It was absolutely the best thing ive ever bitten into in my entire life.I would certainly go back because the entire experience was awesome. But im coming for that duck."], ["Aimee Z.", "I loved the entire experience! The restaurant is so pretty! The service was the best! The food!!!! I am definitely going back! The escargot was so tender! The buratta was amazing! And steak diane was perfectly flavored & cooked table side. The pasta & sauce was also very good! The coat room attendant was a very sweet woman, very pretty and very well dressed! Even she was a delight! I would have visited sooner but several times I arrived too early in the day and they weren't open yet. Once I went on New Year's Day and they were closed for the holiday. I'm grateful I finally was able to enjoy this experience with my husband"], ["Marcos F.", "I took my mother to Capriccio's for her 40th birthday given the fine reputation of this establishment. She enjoyed it, but I found it not so pleasing. The servers wore tuxedos which helped the presentation of the restaurant but our sever was quite snobby. I personally did not enjoy my entree (Veal Oscar) it was bland and overpriced. I did not feel welcome by the staff and was disappointed given all the good things I've heard about this place."], ["Amy O.", "Service was absolutely horrible.  This used to be my mother's favorite restaurant but it's gone downhill.  Arrived for dinner at 730 and didn't leave til nearly 11 as our waiter was no where to be seen for 45 minutes at a time.  The place wasn't busy at all so who knows what he was doing.  Not to mention the waiter thought he was being funny as he insulted my guests and I throughout the evening through his \"witty\" comments.  Two stars because the food was decent. Three of us had fettuccini Alfredo which they liked mainly because they prepare it table side. Though they left my mother's plate on the serving table after it was prepared and never served it to her (my boyfriend got up and grabbed the plate for her while the two of us waited 5 minutes for our plates as the others food got cold).  They brought a cake out to us but at that point we just wanted the bill.  Wish it was better but everyone of us was grumpy from the lack of service by the end of the night."], ["Dominic L.", "Great dinner as always, love this place. I probably should change it up a little and have something other than Beef Wellington but it is the best."], ["Brent R.", "Fancy schmancy, but the prices are very reasonable."], ["Lori A.", "We decided to give Capriccio a try after looking at their menu on-line.  Well, the prices on-line were much lower than the actual menu.  Also, they showed a wonderful prix fixe meal that we were very much interested in.  We arrived at 5:30 to a beautiful restaurant, with 3 tables full.  We were seated.  We asked about the Prix FIxe meal and told we were not allowed to have that because we were not attending a show.  That policy is ridiculous.   With only 3 tables full, I believe on a Sunday evening the restaurant could have been more accommodating.  We really should have left at that point, just because of the the lack of flexibility and gone across the street to a much warmer service restaurant, but we stayed.  The service was just fair.  The food was good.  I enjoy my food at a hot temperature, and it was."], ["A.J. B.", "When I am in Rhode Island I go here for one reason, Beef Wellington."], ["Robert S.", "We heard from a friend that Capriccio was his favorite Italian restaurant in Providence, so my BF and I decided to give it a try.     Right now, until Labor Day, they offer their 3-course meal - a la Restaurant Week style for $34.95.    The choices were abundant...APPETIZERSFresh Soup of the DayCaesar SaladRoasted Beet & Frisée SaladArancini di RisoCarpaccioSeafood CakeMussels ZuppaMAIN COURSES TO CHOOSE FROM....Atlantic SalmonPorcini-Dusted Sea ScallopsVeal ParmigianaPork Loin ValdostanaChicken CapriccioLobster Fra DiavoloRigatoni BologneseEggplant SorrentinaDESSERTSChocolate Mousse          Tiramisu             Vanilla Panna CottaI ordered the seafood cake as an appetizer, a 1.25 lb lobster with linguini and the tiramisu.   Everything was very good.    The linguini was a bit overcooked, but overall, the meal was very good.   My BF got the veal parmigiana and it was one of the best I have had in a long while.    The breading was made with good quality bread crumbs, cheese, spices and other complex flavors that made every crispy bite, just delicious.    The gnocchi that came with the veal was delightful.A nice dining experience."], ["Joe S.", "5 star: atmosphere, experience, service and food! You really can't go wrong with your choice. Just get here."], ["Sarah S.", "Capriccio is hailed as one of the best restaurants in Providence, and it certainly looks the part. The dining room is beautifully decorated, all the servers are in tuxedos, and the dishes (served on white linen-ed, candle-lit tables) cost a pretty penny. Sadly, for all its elegance and charm, the food simply does not go the distance. My party of 9 came for my brother's graduation meal on a bustling Saturday night. We were well-taken care of throughout, despite the server's nonchalance. Traditional Italian restaurants are not always known for their friendly servers, so that was no surprise. We ended up waiting awhile between courses, but that was to be expected as well (given that every out-of-town family in Providence was celebrating at the restaurant that night). My main disappointment was the food. I ordered the Beef Carpaccio and Oysters to start. The carpaccio was actually excellent, probably the best dish I tasted that night. The oysters were fine as well, and well-prepared, but nothing special. For my main course I ordered the Pappardelle with Duck Ragu and Pistachios  (because how amazing does THAT sound???). Duck ragu should be rich and flavorful, but the meat was dry and sadly, flavor-less. The pistachios added a nice crunch, but with the addition of burst tomatoes (which got soggy under the pasta) it turned what should have been an incredible dish into one that was profoundly mediocre. Everyone else seemed to have a similar experience: the fish dishes ordered were over-fried (killing the flavor), vegetables soggy, pasta overdressed. It could have been an off night for Capriccio, but reading some of the other reviews it seems my experience wasn't too far off the mark of the average meal. It's a beautiful restaurant and certainly an elegant ambiance for a special occasion, but I won't be rushing back."], ["Donna J.", "I have been here many times and service has always been great! We travel down from MA and it is well worth the drive for a fine dining experience. Very romantic place and the service is top notch."], ["James And Gina S.", "Where else can you find flambé, steak Diane, or Dover sole served table side with exceptional service? The prices are perfectly in line for the quality of food, portions (not many restaurants believe in giving you a salad and side of pasta anymore) and attention to detail. We dined as a party of 9. The waiter was nice enough to visit all sides of the table to list specials and answer questions without yelling and disturbing other guests. Every course came out at once, even the table side options were timed perfectly. My only complaint was that one guest and I ordered the beef Wellington med/rare and it came out well done for both of our servings.  If you like rare stick with the Diane. This restaurant really is a gem in prov."], ["Alisa C.", "Came here last month for my birthday with another couple. Hadn't been in years...my first choice was Café Nuovo which is their sister restaurant and my favorite but they were closed (!?) on the Saturday night I wanted to go(it was also my husband's bday we were celebrating). We hadn't been in a few years because the last few times it had been a so-so experience but this night made up for it for sure and we will be back. We started with some drinks at the bar. They have a really nice bar - just wish it were larger and they used to have entertainment but I don't think they do that any more. We were sat on time for our reservation. Service was very good. Food was good although they seemed to have switched the temps of my husbands and my meat where he got veal medium rare and I got steak well done. The waiter was quick to remedy the situation. And brought out all new sides as well. It was worth the wait. In addition we must have mentioned it was our bday and he brought out a small cake for the table and bought us a round of drinks for the inconvenience. Very classy Capriccios, thanks for the memories and we will surely be back."], ["Jessica D.", "My boyfriend and I had a great experience last night going out for my birthday. Everything was great from the dimmed lighting and look of the restaurant to the food and service we received. Initially we were going to just order off of the restaurant week pre fixe menu but after hearing the specials we thought otherwise. I had a blackened squid ink pasta with an tomato arabiata sauce with clams, mussels, bay scallops and squid. It was amazing the sauce wasn't as spicy as expected but all the flavors we're excellent. Although I think I may have liked my boyfriend's dish better which was lamb sliced into 3 tender pieces in a blueberry port wine sauce and mashed potatoes. Phenomenal. I definitely enjoyed the large variety of wine available to us as well. All the servers we're very pleasant and attentive to us, a very professional look to the service. To top of the night we both had martinis the Chocolate Cupcake and the White Chocolatini. So sweet and very well made. We had these alongside our desert which was crepes made tableside and flambe'd, it's a nice touch that you don't see at many restaurants. It is a pricey restaurant but everything is worth it, if you are going to go out somewhere special Cappriccios is a great choice."], ["Terry L.", "This is our 2nd time going here and will certainly not be our last. They offer free valet parking which makes it very easy and we love not having to worry about where we will park. You have to walk down stairs into the restaurant. The service is impeccable. Men wear tuxedos and really know there stuff. We sat not far from a fireplace which was nice. The atmosphere is very nice. We loved the food....our friend got the shrimp Flambe which they make by your table and that was impressive. The gnochi is the best I've ever had and the sauce is by far the best I've tasted. My husband got surf and turf and loved it and other friend got steak of some sort which he enjoyed. A nice night out!"], ["Norma O.", "What a disappointmentWhere do I begin to address what was wrong with my dining experience at Capriccio.  I am a RI native now living in DC but visiting the area with a friend who wanted to experience some authentic Italian cuisine.  Capriccio was always a wonderful choice for that.  I have dined all over the world at some of the best restaurants and was excited to show off a home town favorite.  We arrived for our reservation on time and were seated in the corner which surprised me since the restaurant was mostly empty.   Our waiter arrived as soon as we sat down and the first words out of his mouth were \"do you need me to take that away from you\".  This was addressed to my dining partner who had her phone in her hand but was not on the phone.  She was somewhat confused by his comment and then he followed with, \"you don't want to get my second reminder\" He then gave us menus and walked away. The tone of the evening was set.  My dining partner, a surgeon who had checked on a patient while we valet parked the car, was completely taken aback by the rudeness of our waiter.  She was not on her phone, there was no talking to disrupt the other diners,  she simply had the phone in her hand and was putting it away. The rest of the evening was no different. Our waiter rushed though the specials barely returned to the table to ask if we were enjoying our meal and forget about refilling our glasses with our $100+ bottle of wine.  The only enjoyable part of the evening was the food. It was delicious but in no way made up for the atmosphere our waiter created.  Our waiter was condescending, abrupt and his behavior was completely unacceptable. Maybe our waiter thought that since we were two women dining together he didn't have to put in any effort. Clearly we know he could since we both witnessed him showering the nearby tables with attention. An embarrassing representation of dining at a highly rated RI restaurant."], ["H.j. J.", "I would rate it lower if there is an option for that. The place is way overrated the waiting staff are old hard of hearing wayyyyyy too slow. I went with bunch of friends and none of us liked their food that's how bad this place is. It's just an average restaurant all the hype is for nothing."], ["Cris L.", "Enjoyed dinner there last night for the first time. My husband had the Lamb Wellington special and I had their Bay Scallops with Risotto special. It was amazing. Incredible food, great atmosphere, and impeccable service. This is our new \"fancy\" restaurant."], ["Jessica B.", "I went with my husband on a Friday night. The place is very romantic and beautiful inside. The food was good not amazing but I'm more disappointed in the service part of it. I didn't expect to have such an un-attentive waiter. Observing the restaurant, every waiter just looked as though they were on point, enthusiastic about the menu and all about servicing their customers. We went early so we were probably the youngest couple in there at the time around 6:30ish. I'm not sure if it was done on purpose because we are young and they don't think we go out much but we got the newer waiter. He had trouble reciting the menu which is fine, I wasn't upset about that but he seemed to start to disappear from the middle of the dinner. The Burrata cheese appetizer was melt in your mouth good it came with a roasted pear and was just so delicious. My husband got the Beef Wellington which he loved and ate everything although the waiter forgot about his side dish. I got the Truffle Veal dish which I was happy with but not blown away. My side of pasta came as I was finishing my meal and by then I was all set. The worst part of it was he asked if we wanted dessert and I said yes so he hands me the menu and I'm pretty sure he is supposed come out with a tray of what they have or at least a description. Well he never came back. We waited 15 minutes and he was nowhere in sight so we asked another waited to find him and he said he'd be right over.Another 15 minutes later he finally comes over and we ask for the check, mind you no apologies for disappearing or what's worse not even mentioning anything about me wanting dessert! I did notice he coincidentally waited on the other 2 young couples in the restaurant which I think proves my point. It was just sad because it was MY first time eating there and I thought I was going to be wowed by service especially when all around me the waiters seemed so passionate about the food there. Oh well back to the Hill we go I suppose."], ["Sarah C.", "Delicious Italian food and romantical atmosphere. Also, their 3-course, $15.95 lunch cannot be beat. Perfect for a date night!"], ["Candy C.", "Baby Arugula Salad with a hint of Truffle Oil- the best salad I've had since I don't know when.  Calamari Frits with Italian Pepper is also quite good. House Chianti is really a perfect match for the steak- I think it was a sirloin."], ["Michelle E.", "I've been going to Capprico's for years now and I was disappointed to have to only give it 1 star for this past Friday nights dinner.Night started off with a bug in my husbands drink, then small bugs flying around while we all tried to eat our appetizers.  The drink was fixed no problem but the flying bugs nothing we could do.I ordered the Lobster and Pasta dish and my lobster tasted like ammonia, when I googled it said that the lobster had been dead to long and shouldn't be eaten at that point.  So the rest of the night I worried being 4 months pregnant that I had eaten bad shell fish and worried I was going to be sick...thankfully I didn't!  Better luck next time...which wont be for a while, sorry Cappricio's"], ["Hilary H.", "I'm confused. Perhaps I got ahead of myself when I was picturing Pauly Walnuts and Chris-tu-fuh in a super-elegant Italian joint, but, well... I was. This IS Providence and this IS Capriccio, after all. I did see a few ladies in glittery dresses and ill-fitting soes, and I did see a few big guys with thick accents, and I did have my vino poured by a charming man from Sorrento, but did I feel the magic? Not so much. Our waiter was new, and seemed very nervous. There were a ton of specials in addition to the massive 50,000-page menu, which was slightly overwhelming. I decided to play it safe and go with the Black Angus strip steak. It was presented beautifully, but it was a tad over-cooked and tasted heavily of char. The accompanying mashed taters were scrumps, and the sauce was perfect. What I really loved about Capriccio was the building - really beautiful, charming and old city PVD. The restaurant is in the lower level, and the exposed brick floors have a thick glaze over them that ads such elegance. All of the waiters (no waitresses, please note) are dressed in sharp tuxedos and look as neat as a pin. They even come flambe certain items table-side, which is so old-school I can't even stand it. I wish I had ordered the shrimp, as the man at the table next to me did, so that I could get a fron-row seat and what smelled like a divine meal. Next time!"], ["Melanie M.", "I had gone to Capriccio years ago and have never been back. My husband and I used to go there often to listen to jazz music downstairs and enjoy appetizers, etc. A few years later my husband surprised me with dinner there and later a show. I ordered a filet mignon. I ordered it medium rare. It was very well done. It was so awful I had to drown it in steak sauce just to eat the small amount I ate. A $50 piece of steak was ruined and I never went back. Too bad because I love great steak but sadly I have no desire to eat there again."], ["Bryan H.", "If you like being harassed by wait staff this is the place for you. took my gf here after work both in suits, and was told by the wait staff to remove my beanie I was wearing since it is winter and all. The place was empty and this completely ruined my dinner. I asked for the check immediately and I will never be returning. I will make sure this place is not an option for our clients and future business gatherings after this experience."], ["Brian D.", "Capriccio is both the most expensive and best fine dining experience I have had. I was in Providence for a work conference and was invited with a group to dinner at this fine restaurant. From arriving at the eatery, I was blown away by the ambiance and class of the place. You definitely need to dress it up. After a few drinks at the bar, our group was brought to a private room. The room was elegant and the waiters were fantastic with an eye for top service. Our group (20 of us) ordered one of every appetizer so I got to sample all of them. I especially liked the smoked salmon and mushrooms. For dinner, I went with the recommendation of our driver which was the Osso Bucco. It was fantastic and maybe the best piece of veal I have ever eaten. The wine list was extensive and all the one's I sampled were excellent. I was happy that I was not paying the check.I definitely recommend Capriccio for a fine dining experience. It is pricey but well worth the money in my book. I will definitely visit again the next time I am in Providence."], ["Anne W.", "I did not believe it myself.  Why would all the good Italian restaurants be in Providence?  I thought Boston had the North End which is supposed to blow my mind but yet I keep trying the places there and endlessly dissapointed.  My fav Italian spot is actually in Fenway.. okay, this is besides the point...We came in here after the beach looking less than appropriate for a place where the waiters wear bow ties.  I loved the decor.. it's in the basement.  It's date appropriate.. definitely.Free valet.. you just need to tip them.  I found parking down the street but I was also there at 9 pm.I actually really loved the food.  We ended up eating at the bar.. and had two appetizers and a main course which they split graciously for us without asking.  Great service.On to the food...1.  Clams with white wine sauce.. not my favorite but they were decent.  There are a lot of onions in this dish so if you're not an onion lover.. you will not like this.  They were littleneck clams though which are delicious.  None of the clams were empty of meat or completely closed... so it was good.2.  Risotto rice balls.. also not the best I have ever had.. but the mushrooms stuffed in them was sooo good.  I didn't like the brown gravy sauce.. I am a fan of the red sauce.3.  Lobster with angel hair.. that was really really REALLY good.  Chunks of lobster with a creamy tomato sauce.  Loved it!"], ["Angel L.", "I have been to Capriccio with my boyfriend two times in the past two years.Honestly, if I were rating the food alone, it would probably be three or four stars. It's one of the classier restaurants in Providence. The food is solid, but nothing spectacular, especially for the price. I'd much prefer spending a little more and getting something truly special in NYC. The horrible part about Capriccio is its consistently condescending service each and every time. Maybe it's because we're young, 20 year olds, who are not necessarily in a suit (but we do dress appropriate for the occasion). But it doesn't matter. No matter who walks into your restaurant is your customer, and each should be treated properly.  At the end of the evening, we are still paying as anyone else in the restaurant, and you're providing a service to me. If Robuchon in Paris, Caprice in Hong Kong, and Le Bernardin in NYC can provide personable and respectful service to us young college students, I'd expect Capriccio to as well. But no. On Valentine's Day last year, we made a reservation well in advance. When we got there, we were told that our table is not ready (which is fine, considering it's probably one of the busiest nights of the year), and for us to take a seat at the bar. Sure. That's until when I see multiple parties (of 2 as well) who walk in after us get seated immediately while I'm relegated to the bar with zero attention for AN HOUR. Not to mention, once we're seated after many complaints, our server seemed to think it's fine to ignore us as well. This week, thinking that last time was just a one-off thing, we decided to give Capriccio another shot given the Restaurant Week deal. We called in an hour ahead to ask if there's space for lunch, and they said yes and we left our name. Sounds to me like a reservation. When we showed up, the extremely rude maitre d promptly told us that he doesn't see our name and that there's nothing he could do about since they're full at the moment. Not a single apology, even after I started getting pissed off and telling him this is absolutely unprofessional. With that, I will never visit Capriccio again. Truly, who do you think you are? I'm a paying customer at the end of the day and I don't need your arrogance and condescension. Plus, the food isn't anything special."], ["Lars L.", "This is by far one of my favorite Italian restaurants.The price is on the high side, so be ready to pay.  However, it is worth every penny.The service is top-notch.  Great place for a date or special occasion.  Also, I good place to go with old friends and hang out in a relaxed, non-rushed environment.EVERYTHING on the menu is incredible.  Osso Bucco USED to be my favorite, but they discontinued it.  I am sure the desserts are great, but we never have room because the serving sizes are so large.Call ahead and make a reservation."], ["Kris D.", "A NYE tradition, dinner at Capriccio's! We have been delighted by many dinners here and we always have a fantastic experience every time. The service is impeccable, our server even went the extra step & offered to take a picture of us after dinner near a holiday decorated area to remember our evening. I try to order something new even if it is just a special appetizer. Last night I treated myself to the Foie gras appetizer. It lived up to the hype. The 4 complex levels of each savory bite started my dinner off with extremely high expectations.  Of course with every visit at least one person in our party will order the Flambe not only because the taste is out of this world but we look forward to seeing Enzo the flambe chef, he completes the night with his expertise and interesting table talk.  He told us last night he had been Capriccio's flambe chef for 40 yrs! In a city that is filled with what seems to be trendy fine dinning establishments Capriccio's still stands out as a indulgent classic dinning experience."], ["Matthew R.", "I guess its time to leave Urbanspoon and join Yelp like everyone else! Here goes.I haven't been to Capriccio's in a long time. We had a $100 gift certificate so decided to go this past Wednesday. It was nearly empty when we arrived at 6:30 (had booked through open table) and it remained dreadfully slow the whole evening.First the good news, the food! And really, that's what is all about. We ordered the special cheese app with some beets and prosciutto. It was tasty but nothing spectacular. I ordered the beef wellington and my girlfriend ordered the scallops and risotto. Both were delicious. The meat was cooked well and the wellington was accompanied with some flavorful potatoes. We ordered a nice bottle of Venetian wine and that was also fantastic. Too full for dessert.The ambiance of the place hasn't changed in years and is certainly not for everyone as it can seem a bit impersonal and stuffy. However, those things are non-issues for me. They still do some table side service, which can be a nice touch when going out for an expensive meal. One of the waiters cut my wellington into perfect portions.Our problem, was not with the service (per se) or the food. About 5 minutes after our wine was poured and before we ordered any food, the valet came to our table to inform us that our car had been hit in the parking lot. There was no major damage, but we were outside dealing with police and the other driver for 45 minutes or so. When we returned it was as if nothing happened, with our wine still on the table. I had informed our waiter of the situation before we had gone outside. Ok, so we eat and enjoy our dinner. Now recall, our car was hit in their lot after their valet parked my car.  I really anticipated a comp of some sort. Nothing major, a free app, free dessert. Anything more would have been appreciated, but unnecessary. Nothing. No mention of it.  We were totally put off by their lack of interest in our predicament. We never mentioned it again at dinner to our waiter. I guess being more vocal would have probably worked for us, but I would like to think that a situation like this would have garnered a little \"old fashioned\" customer service on their part."]], "Andino's": [["Marie H.", "Great place for a traditional Italian lunch! The restaurant is in a great location on Atwells Ave and nicely decorated inside. I stopped by for a late lunch and got the linguini and clams in white wine sauce - it was TONS of food for only $11. There were lots of clams, which were a bit chewy but otherwise good. Could have used some extra salt as well (had to add lots of salt and parmesan cheese). I also liked the bread and seasoned olive oil it came with. Would definitely come back to try out some of their dinner appetizers and entrees!"], ["Sungeeta A.", "I've been here twice (once for dinner and once for lunch), and I have to say this is a solid Italian restaurant. Great service, nice wine list, and decent Italian food. I think the strength of Andino's is their appetizers. The first time we got their appetizer sampler, where everything was tasty (and fried, which is probably why everything was tasty).  The second time we got the special, which was stuffed arancini - amazing. This was probably the best arancini I've ever had. Their entrees leave a little to be desired. I got their stuffed pork chop, which was really overpowered by garlic.  My bf got a veal chop, which was overcooked (he asked for medium rare). They were really nice and comped our dessert. Unfortunately, the chocolate cake we ordered was mediocre.  The service in Andino's really is excellent and you will have a good time here. However, in my opinion there are some better places on the hill."], ["Ryan K.", "Food: traditional Italian. Clams andino, clams casino, lobster ravioli with shrimp and pink sauce. The clams casino outshined their counterpart, but both were delicious. Served with a garlic butter sauce and lemon. They start you off with bread and garlic and oil. Heavy on the garlic which is fine by me. Tried the red sangria Sinatra. It was awesome and would def get it again.Service: as friendly as it gets. These people were on a first name basis with just about everyone...including me after about two minutes. I sat at the bar which has a full menu. Couldn't have asked for anything more here. They make you feel like family. The host was great too. Atmosphere: a little tight, a little loud, but I think that for this place, it just adds to the experience. Feels like a place all the locals love, but also welcomes the touristsSure...I'd go back."], ["A Z.", "Totally delicious, exactly what we were looking for when craving some Italian. The Aglio e Olio was delicious and spot on, and wonderfully garlicky. The fettuccini Alfredo was velvety, creamy and perfectly al dente. Got red sauce with bread and it was delicious. Hubby got chicken parm and loved it. Delicious homestyle, well done Italian."], ["Liz j.", "We went for a traditional thanksgiving dinner and it was a 10++++!   Every component of the dinner was delicious!  This is our second time for thanksgiving and both times were excellent!  Bread, fruit cup, soup, salad, main course and apple pie were fantastic!   Would highly recommend Andino's for Thanksgiving!"], ["Jillian G.", "There are so many wonderful options on Federal Hill for a good Italian meal.  You can't go wrong with a trip to Andino's.  I definitely recommend getting a reservation and if it's a nice night, requesting to be seated on their outdoor patio. We love their calamari and their pastas always have wonderful sauces.  Every time I have been here, I've received wonderful service from the valet, host, server, manager, etc.  On our most recent trip my indecisive husband decided he wanted to make his own pasta dish (adding sausage, onions, peppers and melted cheese to a dish of penne) and they were more than accommodating with his request. I recommend their eggplant parmesan and house sangria - delicious!"], ["Amy G.", "Came back with the aforementioned husband on a magic summer night on the Hill for some carb-loading in preparation for our bike ride along the East Bay Bike Path the next day. We had reso's for 8:00 but arrived early from CT (hour and a half drive, totally worth it!) and they were able to seat us immediately on the patio. Nice vibe out there on a warm autumn eve; I only wish they could do something to make the music more audible. They play a great selection of \"Rat Pack\" music that really adds to the atmosphere, but the roof exhaust fans from an adjacent establishment make the music a little hard to hear. Completely minor point.We started out with the polenta appetizer, which our waitperson, Kendra, suggested that we order with red sauce and melted cheese, yum! Very good with the seasonal sparkling strawberry Sangria. I ordered the swordfish Andino's special, grilled swordfish with roasted red peppers in a white wine sauce with pepperoni of all things--but it works; adds a nice salt and depth to the flavor of the dish. They also prepare this with chicken and possibly veal. The hubbie ordered the Chicken Saltimbucco, just as delish as the last time. Portions are truly huge, and the accommodating staff kept our doggie bags in the cooler for us while we took a stroll up the street to the Terrace and checked out the scene there, and stopped by the hookah place across the street. Our server, Kendra, was attentive and very willing to offer suggestions and input, which I always appreciate. Born and raised in the area I believe, she added a competent and personable touch to our romantic evening in Providence. Bravo once again, Andinos!"], ["Emily W.", "Walking down Atwells there are a million Italian places to choose from but I promise you that Andinos will not disappoint. Cozy, well-priced, dim-lit and welcoming- not only was the food delicious but the staff was so friendly. Hesitant to sit at the bar for dinner, but not willing to wait 2 hours for a table, my date and I decided to just do it and we were pleasantly surprised. Terri, our bartender, was awesome and remembered our names throughout the night and despite being really busy was very attentive. I'm typically not a big Italian food eater but I'm really looking forward to coming back here. So glad we stopped in and decided to stay!"], ["Ronald F.", "My favorite place in RI.  The best, most authentic, home made style pasta sauce. With the exception of seafood, which I dont eat, I have tried most everything on this menu dating back years and years. Everything is delicious, authentic and tastes home made. Even if you dont like a particular dish you will still be awed by how authentic it is and how it tastes like your Italian grandmama made it for you."], ["Donnie S.", "Never again! After eating a chicken dish and shrimp from there over the weekend I became extremely ill and went to the emergency room where I was told I had food poisoning. So they either cross contaminated or held food at improper temperatures. Don't bother!"], ["Kristen B.", "What food! What service! My husband and I heard so much about the Federal Hill area restaurants and were not disappointed! We sat at the bar and Teresa the busy bartender was phenomenal. She made everyone feel special. Even the valet attendant alerted a customer to a tire problem with his car. Locals so friendly! Now to the food...best chicken parm and stuffed porkchop we ever had! Wonderful home made soups,pumpkin stuffed raviolies and more! I usually am not  so wordy but please don't pass this place! PS try the Frank Sinatra cocktail!"], ["Leo M.", "Chicken Parm was excellent also had a meatball which was awesome. The wait staff was excellent. Ate outside on the patio great night with the wife."], ["Bruce W.", "Great Providence Italian...!!  Good spot before Pats games. Food is authentic, service is good and helpful. If you are close by stop in..."], ["Jeff F.", "Stopped in today for a quick bite at the bar.  28 years ago, while at college I worked on Atwells Ave in a small Italian trattoria and we specialized in pan fried calamari.  It was on the menu and I couldn't resist.  28 years and worth the wait.  Crispy outside and tender and soft calamari, well seasoned with light garlic and hot Italian peppers.  YOU MUST TRY THE FRIED CALAMARI!"], ["Darnell S.", "Great service, fantastic food.  Have been here many times including with a party of 50+ people and service and food was always fantastic.  Their calamari app is divine.. We love their veal/chicken/eggplant parm.  Only drawback is I don't think they make their own pasta, we usually order it without now.  Good wine list and prices."], ["Blake B.", "A decent place to eat on Federal Hill. I had the Sirloin with Marinara sauce and Fettuccine. The sauce was a very good: warm, homey, hardy with tasty chunks of tomato. The fettuccine was nothing to brag about and neither was the sirloin and at $28 bucks I was hoping for a bit better texture and flavor than bland noodles and lightly seasoned sirloin. Also note, the only dessert they make in house is the tiramisu. Despite knowing this, I tried the cheesecake and cannoli. I wish I hadn't."], ["J P.", "Came here after a game at PC. What a friendly place. Service was good and food was very delicious.  We had traditional items such as meatball, chicken/veal parm and chicken Andino's. Will certainly visit again."], ["Melanie C.", "Very good food, all 4 courses! Service was excellent! Will definitely go back. Small dining room. Reservations required."], ["Julie D.", "Not much space inside, but the food is amazing. The pasta is homemade and the veal is unlike anywhere else. The thing that really got me hooked on this place was the pumpkin ravioli!"], ["Fonny L.", "The pasta are great. Chicken parmiagana is crispy and juicy. A great patio seating to enjoy our lunch"]], "Tony's Colonial Food Store": [], "Zooma Trattoria": [], "Al Forno Restaurant": [], "Enoteca Umberto": [["Xiao Z.", "Oh wow, what a phenomenal find in the busy street of Atwell avenue. Tucked along a string of Italian restaurants with their unique claims to fame, this establishment sets itself from the competition with their dedication to fresh ingredients, tried-and-true recipes that can only be found in the most obscure hole-in-the-wall restaurants in Southern Italy. I came here on an early Saturday afternoon, seeing a few empty tables, only to be told that without a reservation, we'd need to return at 10pm! At first, my initial reaction was one of shock and gall: the place is smaller than Kitchen, with an empty 2-seater table, why would I wait 5 hours to eat heavy Italian food at the dead of the night. Then, I noticed what people were eating: a ginormous ball of fresh mozzarella, artistically drizzled with balsamic vinegar and served over fresh tomatoes. The chefs were actively slicing thin slices of prosciutto and placing them beautifully over a honeyed fig on a fresh bread-piece. We were sold and did indeed return 5 hours after our early embarrassment. Upon revisitation, we noticed that there were only 4-5 tables, with jazz playing in the background. The overall ambiance was chic with class and a touch of homeyness. The staff were incredibly kind, knowledgeable and made our visit feel unique and welcomed. We tried the eggplant bruschetta, fig and prosciutto, large mozzarella salad and the homemade pasta with fresh pine nuts.Unfortunately, the one negative point was that the enclosed environment, with the loud background music made us feel so overwhelmed that we had to leave before our dishes were completed. The staff were very accommodating and the dishes looked amazing, even in tupperware. I would love to have an opportunity to return to this place, and hoping to add another star if we're able to sit through the meal. Food: 5 starsPrice: 5 stars (amazing deal)Service: 5 starsAmbiance: 1 star - just because we had to leave."], ["Mike F.", "Hands down awesome!   Great experience.  Pasta was perfect.  Wine choices you've never heard of that are excellent at any price. Highly recommend."], ["Kim C.", "Had a great experience on June 20, 2015.We had outside reservations in hopes the rain would hold off. It rained but we kept dry. I, myself, was a very newbie at Southern Italian cuisine. My friends and I enjoyed every minute of our experience. Umberto was very down to earth and how every business owner should be. He's passionate about his business and the food he makes and being a small business owner myself, I love to see someone else as passionate about there work as I am.Umberto won't forget me... The woman who asked a lot of questions and one who insisted not being called \"MAM\" lol... Guess I am sensitive to my age... And then end the night by having cappuccino and the bottom of the cup came undone. Only happens to me!!!"], ["Bill K.", "Great experience all aroundThe owner is extremely hands on and very accommodatingSmall , cozy place right aim atwellsGreat wine selection , relaxing kinda rustic Italian.Reasonably priced, good valueWe would definitely return"], ["Kevin R.", "Its very unfortunate, but this place has gone down hill.  The kitchen is essentially non existent, the owner has put 5-7 tables outside. This gives the owner 10 plus tables and he is the manager, the sole waiter and server.  The waits are long, the interior is cramped.  The owner has gone from being friendly and courteous to being in over his head and just plain rude to long term patrons.I wish it wasn't so, but it is...I will update my review if it changes...."], ["Ráhil S.", "Great ambience, great service, great food. It's definitely a new favorite spot on federal hill."], ["Michael S.", "Better late than never my good man Umberto!  While it has been over a month since my initial visit to Enoteca Umberto, the experience is still fresh in my mind due to how unique and memorable it was.Umberto and his wife Lea have created a family style atmosphere bubbling with excitement and outstanding attention to detail.  Their passion is apparent at every stop in the dining experience start to finish. From the outstanding wine list with detailed tasting notes by Umberto himself to the amazingly creative specials and plates dreamed up by Lea in a mini-me kitchen to the as delicious dinner soundtrack (Rufus!). There are enough detailed reviews about the food to explore, so I won't repeat the praise (get the mozzarella), but I will say that if you have the opportunity to stop in for a glass of wine or a plate of pasta any day of the week, you will leave with an experience you won't forget...even many months later!"], ["Pothik C.", "We had an amazing experience at this restaurant - delicious, authentic Italian food, wonderful service...this charming spot is a gem in Providence! We were traveling from Boston and got a recommendation to try Enoteca Umberto. You feel like you've stepped into Italy. The olive oil is imported directly from Italy. You feel like you're eating in a grandmother's kitchen in this family-owned place with gourmet touches. Our appetizers were great - the freselle was tasty as well as the panini sandwiches. The highlight of my meal was the white bean soup with broccoli rabe - this was AMAZING! Hit the spot on a cold snowy winter day in Providence. I wish I could get the recipe so I could make this everyday! Thank you Umberto (the owner) for your friendly service and your charming Italian family for the great cooking and service. We will definitely come back when we visit Providence again."], ["Max L.", "Best meal I've ever had!! Lovely atmosphere, great service, but above all the food was just phenomenal! We shared bruschetta with prosciutto and Gorgonzola, assorted cheeses, and the pomodoro pasta. Wish I could rate 6 stars :D"], ["J. C.", "My wife and I were looking for a new place to try for our anniversary, so after reading the Yelp reviews, we decided to try Enoteca Umberto. We had arrived 30 minutes prior to our reservation and expected to be told to come back later. This would not have been too upsetting, since Federal Hill is a nice area to walk around, and there was a singer belting out the tunes from across the street. To our surprise, they accepted our version of timeliness with a smile, and offered us the \"Sicilian Terrace\". I thought the owner, Umberto, was trying to convince us to take a bad table, but we accepted it anyways, and to our delight, it was just as enjoyable as he described. It was quiet, away from the foot and car traffic, and positioned in a romantic corner on the side of the building.The owner was upbeat and personable. He recommended we try 4 or 5 smaller plates, which was perfect for us. We enjoyed a great variety of meats and cheeses, a pasta and ceci dish, lasagne and a robust bruschetta with sliced meatballs. My wife enjoyed her meal with a Bellini, and I enjoyed a couple of glasses of Lacryma Christi for all the wrong reasons (\"3 Coins in a Fountain\"), but it was deliciously dry and perfect with the meal.We both would recommend this restaurant very highly, and see if you can get the Sicilian Terrace!"], ["Richard P.", "Not just a meal - an experience!We went to Enoteca Umberto based on the TripAdvisor reviews, and we're so glad that we did. We were staying in Warwick for an event, and needed a place for dinner. The restaurant is in the center of an Italian neighborhood full of restaurants - there were loads of tables out on the sidewalks and on a closed street - live and recorded music was playing, and the atmosphere was terrific.Enoteca Umberto specializes in authentic wines and cuisine of southern Italy (Sicily, Calabria, etc). Enoteca means wine bar - so it is not a typical restaurant menu. We started with the pomodoro salad - an assortment of sliced heirloom tomatoes drizzled with excellent olive oil and a sprinkling of sea salt. There are four courses on the menu - the first is Freselle or Bruschetta - bread with toppings (like a flatbread, but different - and better). We had the caponata topping - best I've ever had. Then the Antipasti - we had the assorted cured meats and cheeses - also delicious. The main course is pasta - home made, we chose Ceci - which is garbanzo beans, olive oil, garlic, and lemon.The thing that really made this place stand out is Umberto himself - he waits on all of the tables (it's a small place - about 8 tables) and really makes you feel welcome. He sets the atmosphere - warm and gregarious, and makes sure everyone is enjoying themselves and appreciates the restaurant's unique approach.If you are in the area, and can get a table, go there. Be sure to call ahead - there are two - three seatings, and you won't get in if you don't call"], ["Shadee A.", "I think this was the best meal I've ever had. Umberto was so sweet and very knowledgable. His wife whipped up the most delicious pasta. Excellent experience, food, wine, all of it!"], ["Michelle D.", "This is the best hidden gem ever. Small but amazing menu. I felt like I was back in my grandmothers kitchen again. Make reservation because it's limited seating but so worth it.  This has become a favorite."], ["Anthony M.", "Effing love this place. The atmosphere, service, and food were hard core awesome Italian.  This is a must stop every time we cross by Providence."], ["Katy E.", "Solidly good food. The fresh mozzarella was perfect--it was served on a bed of arugula, which the leaves were much smaller, softer and flavorful than I've had in the past (I typically avoid arugula altogether, but it was good here) and the dressing had a sour bite to it--really delicious. The meatball (I forgot the official name of the dish) was sweet, savory and spicy--just a little kick to it-- with a creamy cheese on top...such a great dish. I also tried the Pasta Giardino--similar flavored sauce to the meatball, but more mild. Also very good. Very authentic cooking, nice atmosphere and all around fun place to eat!"], ["JoAnn H.", "We had a truly wonderful dinner yesterday evening.   I had called earlier in the week to book a reservation for I was passing thru Providence for one nite.  Umberto, the owner did everything he could to get us a table.... granted I was not giving up.  When we arrived he was so kind, and gracious. The place is small and ever so quaint and simplistic is the best of ways. The food was perfect.  What I believe makes their food so perfectly tasteful is their use of FRESH ingredients and allowing the flavors of these ingredients to shine thru.Bravo Enoteca Umberto.  Thank you so very much.ps.  congratulations Umberto on your upcoming wedding:)"], ["Sean M.", "This is a 6 star establishment being held down by Yelp's star limit. Pros: Best waitstaff I've ever encountered. Unbelievably friendly, passionate and knowledgable. Terrific wine at reasonable price points.Cozy, inviting atmosphere.Superb food. Didn't try the entree specials but the appetizers were a great accompaniment to the wine.Cons:No cons, which is sort of a con as it leads to an uninteresting Yelp review.Would I recommend? Yes a thousand times over."], ["Larry O.", "Great food. Great owner. Small which makes it even better. The antipasto was tremendous as well as the bruschetta with figs on top was out of this world."], ["Burak E.", "It is the best Italian food outside of Italy :) It is a very small place. You need to have reservation. We had four courses with my wife, and it was a delicious experience. The owner is great. Ask for her advice what to eat. She makes great combinations. Whatever what eat, you are gonna love it. Definitely recommended!"], ["Jamie H.", "Amazing amazing amazing. Great experience. Umberto is wonderful, welcoming, and so hardworking and passionate about his food and wines. An authentic Italian experience on The Hill."]], "Rosalina": [["Linda F.", "The food is wonderful, the service is terrific and they have a fantastic wine selection. It gets really loud but so do I so, wtf?! Lunch is quite different, it is much quieter, same great food and service. I'm tremendously glad they are downtown because who wants to traipse all the way to Al Forno for dinner? Not this woman. Rosalina will do very nicely and you don't have to wait an hour for a table, of course there's no Kyle but you can't have everything."], ["Nick N.", "Unfortunately i was very dissapoonted with the meal.    Pasta was over cooked.  Maybe even poor quality of pasta     Seems like some of meal was microwave"], ["Scott M.", "Readers Digest: One of the best Italian spots for the price range I have had. And the free drinks for Yelp Check In also helps!Long Version: The size of this place is fairly small, but they have a few places setup for larger groups, although anything larger than 6 may be a stretch. It is a bit loud, as they have music playing and everyone tries to talk over the music and then the next thing you know you can barely hear yourself think. This may bother some people, but honestly we adapted.The owner seems keen on keeping up with emerging trends and technologies, as they even offer a free beer or glass of wine for Yelp Check Ins, which is not the reason we came here but was certainly a plus. Also, I believe she even visited our table and was extremely friendly to us and our daughter. They serve you bread with specialty local cheeses and olive oil from the owners grove in Greece. The olive oil was a hair salty but paired well with the fresh baked bread.The waitstaff was quite friendly, although I felt they seemed a bit rushed. The food also seemed to take longer than expected. But I will say, once the appetizer (we tried the fried dough) and meals we delivered, they were well worth the wait. The portions were very fair, especially the kids meal. Our meals were not too much that we had any to take home, but not too little where you did not feel full. Just right. I imagine the pasta was fresh, although I cannot tell for sure. Either way, the pasta was cooked perfectly and the sauces complimented each dish very well.I certainly will be coming back here again when I am in the area."], ["Meghan W.", "Enjoyed delicious Butternut Squash Spaghetti! The atmosphere was also delightful, and the starter bread was yummy. My friend got the squid ink spaghetti, which I had a bite of and that was also very good."], ["Maria G.", "Far from \"Italian \"...the food was less then par....all 3 dishes were awful!  Over cooked pasta, soggy & chewy chicken Parmesan , sauce in eggplant app. Was sweet and too much!  Never going back"], ["Kathryn R.", "Great decor, atmosphere, staff, food and drink selection. My party ordered the fried dough starter, and for entrees: fusilli with shrimp, squid ink spaghetti and ravioli with rave reviews all around. Good sized portions, not too much, not too little and the house bread served with Narragansett ricotta was a great touch. Definitely recommend it and would love to go back."], ["M C.", "My fiancée and j have been here a couple of times and quite enjoyed our meals. For my mother's birthday we offered to take her and my family for dinner.I can't say enough about how enjoyable the meal and service was. Highly recommend this restaurant for a date night or a large group. The food was fresh, piping hot and between courses the wait was more than acceptable."], ["Mike L.", "My daughter in law made a recommendation to eat at Rosalina last night and we were all were extremely satisfied with our meals. We also had the special dessert: Belgian Waffle with strawberries, banana, ice cream, cream and chocolate Nutella sauce on the side. We will be returning in the near future for sure."], ["Queenie L.", "After hearing all the good reviews about yelp elite events, this time they held it in this new restaurant in town, nothing was gonna stop us to check it out!! As we expected, the whole check in process was smooth & easy.  We sat at the bar which is close to the kitchen and we always love to watch how the food is prepared & I found that watching bartenders getting busy mixing drinks was so relaxing and entertaining! LolWe both loved the drinks there and wish I remember their names, they were the specials of the day, mango mojitos & watermelon with grey goose, both very good, however, the bartenders weren't using any measuring cups, the drinks weren't very consistent, some stronger some weaker! But in general we still love them!They had buffet bruschetta bar, and omg, all the bruschetta toppings were so delicious! Sun dried tomato sauce, blue cheese white sauce, white hummus, rabi etc... Everything tastes delicious! For entrees, we had jumbo shell pasta filled with cheese which was absolutely yummy, I'm not a big fan of cheese but this jumbo shell wasn't heavy at all! The fillings was so fluffy and tasty! I love their sfogliatelle better, this Italian pastry was original and totally blew me away!!! So yummy!!! I hope they do serve them daily because I'm obsessssssed!! Tony, the owner drove all the way to NYC to get the best cheesecakes just for the event for us!!  The cheesecake was one the best New York cheesecakes I have ever tried but I wish it was original made in the restaurant but I totally adore his hard work for us!!  Btw the decor there is so chic and urban, I love it!!!! Can't wait to take my friends there!"], ["M S.", "I so want to give Rosalina 5 stars but unfortunately extremely poor service and subpar food ruined our experience. The positives....Absolutely love the atmosphere and style of restaurant. It's not your big stuffy dining room but rather a smaller neighborhood spot with an urban chic vibe. Excited to see a place like this in Prov. Menu a plus too..not trying to hard yet interesting options and diverse...can get pastas, fish, steak, pork. Something for everyone but not overwhelming. Homemade and fresh. And why we won't go back...service and food that didn't live up. Busy Sat night, full restaurant, and we had reservations. Ended up sitting at bar as we sometimes prefer that and sadly the service was non existent. Bartenders barely acknowledged us, wouldn't make eye contact, took forever to finally ask \"what do you want?\", put a drink and food in front of us, and never came back. And when there was interaction it was as we were a bother. No excuse...service is everything. There for an hour with empty glasses for half of it and since no eye contact never got another drink. Even as we were leaving the bartender was walking towards us and no \"thanks..have a good night\" just a miserable look on his face avoiding us...umm thanks! Then the food...read great things about the not-your-typical calamari...should have been called Celery& Peppers salad, as it was flavorful it was about 1/8 calamari and 7/8 celery and peppers. Paid $10 for a chopped up piece of celery. Got the swordfish which was very good but a tiny piece and asked for salad instead of the carbs and my salad had to be sitting in a half cup of dressing and husband's pasta was more heavy cream then pasta. No dessert as there was never an offer just a check delivered. So disappointed Totally bummed as the vibe/decor and menu options makes me want to go back, and recommend to others, but not sure I want to waste another $100 to be treated poorly and leave feeling like I want to go eat somewhere else now. On another note the Valet guy was super nice and it's complimentary!"], ["Lizz W.", "Hmm Roslina is great! Cute little place located right in downtown. I am not crazy red-sauce lover but there's is amazing. The eggplant parm app, bomb digggity. Cool cocktails, laid back environment and decent service. I like it. I'd go back anytime."], ["Tyler R.", "I stumbled upon this place based on a recommendation from a friend. Comfortable atmosphere with a \"you're family\" style of service. I sat at the bar where you get a great view of the kitchen. I came in pretty late so I went with a liquid dessert (some delicious port). I'll definitely be back!"], ["Gabriel O.", "Awhile back, I went out to dinner with my sister. We were in the mood for Italian, and Rosalina caught our interest. Neither of us had been before, and neither of us left disappointed. In fact, as if to prove that point, When I brought my girlfriend to Rosalina for her birthday last weekend, by sheer coincidence my sister had made a reservation with her significant other as well! What both of us learned from our first visit however, was to make reservations. Seriously, this place is what I think some people would call \"poppin.\" While Rosalina isn't exceedingly small, they are small enough, and they are popular. So call ahead. The menu can seem a little lengthy, but in that length there is variety. On my last visit my girlfriend and I split the Fried Dough Pizza appetizer. It was larger than I expected, but it was delicious. I would recommend it if you are looking for a quick lunch, or as something to split with your party. The entrees are well proportioned and equally delicious. I've had the Ravioli and the Gnocci. Both were great, the Gnocci comes out on a griddle with plenty of melted cheese. Personally I think think the Ravioli are a better dish. They are packed with flavorful cheeses and paired with a pair of fresh meatballs. Each table receives a basket of bread with cheese and olive oil, prior to every meal. The bread itself was a little too crusty in my experience but is still good. The olive oil is sourced from a greek garden of family affiliation. I'm not a fan of it unfortunately, but that's strictly my opinion. I am a huge fan of the spreadable cheese from Narraganset Creamery however. It's like the incarnate of fluffy, buttery, cheesy delight. The cocktails are refreshing and pretty creative. They have plenty of sweet fruity drinks, but also have a few whiskey based cocktails, which I always appreciate. On my last visit I had something that was pretty close to a bourbon sangria. (I can't presently recall the name.) I will probably try something else next time, but it was well worth the 9 dollars. The cocktails are also consistently priced I believe. Beyond their cocktail menu they also have a good wine and beer selection, and if you're checking in on Yelp you can take advantage of that!The decor is nice; I like Rosalina's branding, for one, but the seating is modern and comfortable, and the walls are adorned with large paintings, that don't call too much attention to themselves but are appealing to take in. The one thing I really missed is their desserts, which are apparently quite good. I'll definitely return on that point and update my review accordingly. Rosalina is a nice spot, and I think it's a great addition to downtown Providence."], ["Bianca B.", "The Pizzette Frite is out of this world!"], ["Karen M.", "Have you ever wondered what it would taste like if you took chocolate cream of wheat, made it thick like a custard, spiked it with a smidge of cayenne pepper, then flambéed it like crème brûlée? Two answers:1) Like the Polenta Brûlée at Rosalina2) As awesome as it soundsEntrée was really good too --I had the cheese ravioli with meatballs, yum -- but honestly that dessert so thoroughly blew my mind, I barely remember the rest of the meal. (Though I do remember the free glass of wine I got for Checking In on Yelp!)Just go here. Trust me. (And order the polenta brûlée!)"], ["Collin C.", "Food was mediocre. Pork chop was burnt and bland."], ["Donna K.", "After getting rush tickets to PPAC last night, my daughter and I went searching for a place nearby to eat.  As we didn't have reservations (not knowing we would be able to get tickets to the show) we set out for a restaurant that we had seen last month on a recent trip to PPAC that looked interesting.  Alas, we couldn't get in there or even sit at the bar, so we left and walked a little further and came upon Rosalina.  As we both enjoy Italian food, we went in, checked the menu, and were offered seats at the bar which offers full food service.  That was fine with us as we only had about an hour.      It was a great thing that we landed at Rosalina!!  My daughter had the Ravioli with meatballs and said it was the best she ever had!  BTW, she is a very fussy eater, even at 26, lol.  I asked for just pasta and meatballs which is not on the menu, and the bartender (Zac, I believe) was quick to assure me that it could be done.  It was delicious as well!  After initially choosing not to order drinks, we changed our minds and I got a great pumpkin ale on draft and she got a glass of wine. Prices were extremely reasonable and the only disappointment I have is in reading the reviews here today, we missed out on the delicious bread and dipping oil that people are raving about!  But, as we go to PPAC quite frequently, we will sure to come back, make an advance reservation, and sample it then!!  Overall, a terrific experience!"], ["Jennifer D.", "Very good Italian food.  Cozy atmosphere.  Great to meet for drinks and apps.  The wedge salad is delish!!!  Can be a little on the pricey side, but worth it."], ["Liz M.", "Amazing!!!  If you're in Providence this is the best restaurant!  Lauren, the owner, has a \"gem\" in the city!  Everything we ordered was fresh, homemade, and incredible!  From the salads to the Dessert - nothing disappointed!   Don't miss out!"], ["Brian M.", "Excellent food and wait staff. Mary, our server, had great recommendations. Had the antipasto which was great. Wife had the Greek salad and then the ravioli. I had the seafood stew and the sauce was out of this world."]], "Pane E Vino": [], "Venda Ravioli": [], "Napolitano's Brooklyn Pizza": [], "Angelo's Civita Farnese": [], "Caffe Dolce Vita": [["A M.", "Just got back and I can absolutely confirm the negative reviews that were posted here. The service is shocking--the waitress kept forgetting things and when we asked for plates she shrugged and got pissy with us. I don't understand this place. All the waitresses run around like they're trying to bail out the titanic. It was extremely stressful for us and we weren't even doing anything (except waiting, of course). Any change you want to make is met with an automatic \"upcharge\" and they act like they're doing you a favor. I felt like I should apologize for asking for a glass of water...and a fork....and a knife...and...you get the picture.  The food wasn't great and we left large portions on our plates (come to think of it...they have very fat busboys). There are literally dozens of restaurants around Federal Hill and you would be well served seeking out any one of them. Pass on the \"Caffe.\""], ["Meghan M.", "I will start off by saying that Depasquale Square is very pretty in the spring in summer months. Caffe Dolce Vita is just average, if not below average. A lot of people tend to hype up the restaurants on Federal Hill, but I was so not impressed. I was there for lunch as part of a party of 8, and we were crammed into a tiny table (this was WITH reservations).  The service was just  meh. It wasn't awful, but it certainly wasn't good. I had an eggplant parmesan sandwich, which I guess I thought I had really high expectations for. It should be called \"bread with a little bit of eggplant in it\". The huge (hard) roll just really compromises the entire sandwich.  Not enjoyable by any means. Based on some of the other reviews on here, doesn't look like too many of the pasta dishes are up to snuff either. Kind of disappointing since this area is hyped with so many restaurants. I'm all set."], ["Darline T.", "I've been to Caffe Dolce Vita on 2 separate occasions. Both times I was very unsatisfied. Their menu is not vegan-friendly so I was always stuck with overpriced fruits in super small bowl or plain old wheat bread (not gluten-free) just to fill me up. It is a very busy place and gets crowded pretty early but the waiters tend to have a grasp on their tables for the most part. The only thing I would suggest is that they educate all their cooks and waiters about dietary restrictions. I'm a stickler for attentiveness and even more so when I'm only ordering 2 things: fruit and  wheat bread with no butter. So don't mind me for being slightly annoyed that my bread had butter spread all over despite me telling my waitress 2-3 times (the first batch was toasted to perfection and the remake was not). Sorry CDV but I'll take my penchant for reasonably priced food elsewhere and stick to the drinks as it's one of 2 things I can appreciate."], ["Andrew N.", "I would have given them 4 stars but they seated us next to the loudest group of people I have ever sat next to in an otherwise empty restaurant. Wow, those ladies could yell! I had to yell across the table just to hold a normal conversation. On the other hand, the food was delish! The menu has standard Italian fare, nothing out of the ordinary or particularly interesting. BUT the they do the traditional very very well. I had the veal parm. Amazing! My wife had over sized cheese ravioli. Also very good (I snatched a few bites when she wasn't looking :).I would recommend this place to a friend sans the loudmouths."], ["Joyce A.", "Went here for our usual date night and we were not disappointed. We had a pitcher of sangria and it was delish  I ordered the bolognese and my bf had the steak. No complaints about our entrees. Huge serving on my order so i got to take some leftovers home which is always a plus. Def order the tiramisu for dessert."], ["Annamarie T.", "Came here for Sunday Brunch and was not disappointed! They had such a great menu, I mean can you really go wrong with a pancake gelato sundae, or nutella crepes for dessert? Even if you are looking for something a little less on the sweet side, they did have there regular b'fest options, had \"The Special\" which was toast, eggs, and homefries aka perfect breakfest combo!Def someplace worth checking out, and when it gets nice out they have outdoor seating which is great!"], ["Marikate N.", "Horrible horrible horrible place!!! I hate it here ! Worst restaurant experience of my life. Hour late for reservation. Never told reservation couldn't be outside when I asked 5 times on the phone. Food takes forever. Not busy except outside and they don't pay attention to you.  The wine is so bad it's mind blowing.  When asked for a different drink, made us pay more.  Food is not good.  Don't bother so many restaurants in providence.here right now and actually so bad I took the time to write this..."], ["Kiki M.", "Yum!! I've spent time in Italy, and this place has the best Italian food outside of the peninsula I've ever had!  You cannot go wrong with the eggplant appetizer, the risotto is delish, and the pitchers of sangria are to die for (especially if you ask them to cut it with club soda instead of Sprite).  I've been here a couple times now, and have always had good service, and plenty of leftovers to enjoy the next day."], ["Lizz W.", "I cant say enough about the prefix dinner menu. I have it at least once a week haha but I cant get a better offer anywhere! For $50 you get a pitcher of sangria, an appetizer, 2 side salads, 2 entrees, and a dessert! For the appetizer you MUST get the calamari or stuffed mushrooms. The calamari is a HUGE portion. But the stuffed mushrooms are savory. For the entree I highly recommend the Chicken Marsala. It is soo goooood. I have also tried the Penne Primavera, Chicken Saltimbocca and Phiily Cheese Steak Sandwich. All are great. But the dessert.... COPA MARIA is soooo flippin delicious I could eat it everyday. Also they have an \"in the biz\" discount I found out about last week. If your in the service industry and bring a ay stub you get 20% offf your bill!!!!"], ["Beth A.", "SAY IT AIN'T SO!!!  I have always enjoyed going to Dolce Vita on Federal Hill.  The food, the outdoor seating, the energy of Atwells...the whole experience.  It also happened to have my MOST FAVORITE cannoli on earth (and I've tried a lot to be sure).  What they did with their homemade ricotta filling was nothing short of a religious experience.  I would routinely tell people about it and where they can find it (complete with hand written maps/directions).  Today is one of the saddest days of my life.  My family and I ventured to the Hill to have a nice lunch to start off the Memorial Day Weekend and upon the dessert being placed in front if me I sensed something was wrong.  One bite sealed the deal.  The waiter was immediately called over to explain.  How could Dolce Vita CHANGE one of the most perfect things in earth?!?!?!?  What did they do with my most favorite ricotta filling?!?!?!?  No!!!!!!!! This new version doesn't hold a candle to the old one.  So sad...."], ["Sarah E.", "My favorite restaurant in Providence.You just cannot get a better deal than CDV 's price fixe dinner offering. Granted, service can be a bit slow. But you really can't beat the price or quality for the amount of food. I love love love this place!"], ["Vilay S.", "This isn't the first place I think of when I think about going to the Hill, and I never hear it recommended. That said, I had friends visiting from out of town and wanted to eat in the pretty square, where all of the action is, but without spending tons of cash. The prix-fixe deal is a steal! Dinner for two for $50 - one app, any entree plus salad, one dessert to share, and a bottle of wine or pitcher of sangria! I had the frutti di mare which was pleasantly garlicky and seafood-y. The portions are typically gimongous - I took my leftovers home and had it for two lunches.I went back another night and ate inside because it was too cold. Eww. Despite the fact that there were men in suits and on dates in there, the inside feels old, stuffy, sticky, and cheap. I would never eat inside again.I wouldn't go here for the food alone, but throw in the al fresco dining and bargain prices and you've got a pretty good package deal."], ["Michelle D.", "I have gone here a several times and still disappointed. I have already gave them too many chances. The calamari is always greasy and flies around the food even in the winter. I really have not had a great dinner there. Being on the hill there is alot of competition and they need to change something."], ["Alan C.", "Very good,went there tonight and the Waitress Andrea who has been there for years was very funny and the food I had the special ribeye with rabi and garlic mashed potatoes and salad was great."], ["Lucinda W.", "Great find on Federal Hill.  Serving breakfast, lunch and dinner. Casual atmosphere with attentive waitstaff. Sit outside (and enjoy live entertainment) on summer evenings.  Great selections for every palate. My favorite breakfast place - huge fresh from the farm eggs; and the best Italian tuna salad on the Hill. Reasonable prices, and if you live nearby, they deliver!!"], ["Alissa D.", "My husband and I recently went here for our anniversary. Not really knowing about many restaurants on Federal Hill, we looked to Groupon and Yelp to help us decide. When we first got there, the outside was nothing like the cute, romantic Italian restaurant I had first envisioned but it wasn't a dive either. The day before I had made reservations online, when we got there they had no record I had done so. They were very nice about it and still say us right away. The menu was very extensive and had I not reviewed it online before I would have had  no idea what I wanted. Our waitress was friendly but understandably super busy because it was a Saturday night. We didn't mind having to wait for her because we were celebrating. We ordered pitcher of red Sangria which was amazing, tri colored tortellini Alfredo which was better than what I can make at home, but not the best I've had. And my husband had shrimp and pasta, which he enjoyed. For dessert we enjoyed a slice of Gregg's Death By Chocolate cake which was so moist and melted in your mouth! Overall it was a nice experience for a special date, we would come back here if we had a Groupon again."], ["L C.", "Tough to beat the atmosphere in DePasquale square.  This place is tops for breakfast in the morning after you enjoyable evening on the Hill"], ["Ellen G.", "Came for dinner one night this summer and our experience was pretty good. Decent calamari though it was a little buttery/oily for me. We got to the restaurant around 6 and there was no wait. Service was great and our meals, which were delicious, came out very quickly. I'd definitely recommend that others give this place a try and I'd come back again myself."], ["Grace R.", "This is our favorite place to take visitors when they visit Providence in the summer! Here is why:- Food: Their menu is standard Italian food but I must say their quality is consistent and the food always tastes delicious. Portion is VERY generous. Pasta is always cooked right! It's the most simple thing but you will be surprised some places can mess that up. Oh before I forget, you must try their sangria!! - Outdoor sitting: We always sit outside because we love the outdoor music and just people watching on a nice summer day in Federal Hill. - Setting: We love this place because it's super casual and unpretentious unlike other just slightly intimating fancy restaurants on Atwells. I can rock out in my cocktail dress or super casual in my jeans and both attires are perfectly ok :)"], ["Scottie M.", "I came here for Sunday brunch a few weeks ago.  The food is good.  The sangria is good.  Service is slow.  Waitresses sometimes look hung-over."]], "Siena": [["Vezna S.", "To start off I must say that when I came in the place was kind of empty which didn't really say great restaurant to me. That didn't last long because it was soon packed with patrons to the ceiling. The interior was pretty nice and sleek which I liked but it could have a bit more lighting inside. Our server/waiter was the most professional person we've ever encountered. Our party was telling him so many different orders/requests and so fourth and he didn't write a single thing down which surprised me but he did not do one thing wrong which was great. Service was top notch 5 stars.The food was also great. I was undecided on what to get but the server was going through their daily specials and the salmon special sounded great so I opted for that and I was pleasantly surprised with it. I'm normally not a big fan of salmon but I was trying to eat healthier so I got it and it was amazing. For the appetizer we just got their giant meatball dish and man was it tasty. Everyone else at the table seemed to like their meals including this twin breast chicken dish and slow cooked beef brisket meal. Everyone was elated with their choices. Food was 4.5 stars.The best part of the meal was definitely the desserts. We decided to just get two desserts and share it among the table. We picked their bread pudding and tiramisu. The bread pudding was the star of the show for everyone else but me. I really enjoyed it don't get me wrong but their tiramisu was something else. It was the best tiramisu I've ever had and the portions were quite large. I will highly recommend this restaurant to everyone who's in the neighborhood and looking for a nice night out. The service, food and atmosphere inside the place was all five stars for me."], ["Cassandra C.", "A new favorite on Federal Hill!!!!Service and atmosphere were top notch! Portions were enough to fill you up with extra to take home. Wine was tasty and delicious. Penne alla vodka was out of this world! Shared the side of old school Italian eggplant parm-- perfect for two. Topped off the night with mouth watering chocolate moose cake.... Just writing this review makes me want to go back!!!We will definitely be visiting Siena again!!! A must do while in Providence!"], ["Paul M.", "This is my third straight week in Providence for business, and I think I have been to this restaurant seven or eight times, generally to eat but not always.  I made my way here on the recommendation of a co-worker and the fact that my hotel provided me with a free appetizer coupon.I am continuously impressed with the quality of the food and the lively, friendly atmosphere.  The appetizers are usually more than enough for me, although I have had the salmon diavolo and last night's special of rigatoni with porcini mushroom and truffle sauce.  Both were outstanding as were the meatball appetizer (HUGE) and buffalo mozzarella appetizer.Add to the outstanding food is one of the most lovely and friendly bartenders (named Sienna coincidentally) I have ever met in all of my travels.  She makes every visit a joy and is more than attentive to your enjoyment of a great dining experience.Recommendations would be highly recommended.  Even dining alone at the bar, often after 8:00pm, I sometimes found the need to wait until a spot opened up for me.  The place stays open late, and it is not unusual to see people arrive at 10:00pm for drinks and sometimes dinner.  I have never seen a \"slow\" night here."], ["Cristin S.", "I have been to Siena for two restaurant weeks and I am so thankful they had almost the same menu. I got the exact same things as I did the previous year! The fried calamari with banana peppers is super tasty. My main course was the salmon with some creamy sauce on top and green beans to accompany it. For the last part of the meal I got a chocolate cake with a raspberry sauce and vanilla bean ice cream. My friend always gets their penne with vodka sauce. Huge portions, you will not leave hungry! She gave me some and the sauce was orgasmic. So you must try Siena especially on restaurant week because I loved my meal so much, I came back the next year to get it again....and come to think about it I probably will this year again."], ["Monica S.", "This place truly deserves five stars. From making reservations to the service to the food, I loved it all. The penne a la vodka was to die for! It didn't even need the additional chicken or shrimp (I got the chicken- I feel like it dried out the dish). I also highly recommend the meat and cheese platter!"], ["John E.", "Siena is a restaurant located in Federal Hill at about the midway point of Atwells. You can find it in the center of a row of shops and restaurants, with parking along the street or in some back-lots or via valet.After suffering from a less-than-optimal experience at a local Guatemalan restaurant for lunch, I was excited to receive this above-par recommendation from one of our vendors for this fine dining establishment. Friday early evening and Siena was packed, luckily our vendor was a frequent visitor - our wait was about 45 minutes. The interior is nicely furnished and a bit classy for my regular t-shirt-and-shorts, but in this instance I was lucky to be dressed slightly above that level in business casual due to the earlier meeting.The restaurant is low lit so please excuse my rather dark and grainy photos - a short stint at the bar while waiting allowed me to sip on a rather good Harpoon IPA - this ended up being my go-to beer while visiting Rhode Island.The service was particularly good with frequent stops due to the length of time to get the food to the table - it wasn't excessive once you adjust for the crowd and wait.Caprese Salad - this was atypical with arugula, tomato, fresh mozzarella cheese and crumbled cheese, drizzled with balsamic vinegarArugula Salad - something a bit simpler than the caprese and very good.Scaloppine di Vitello Porcini - this very nice, classic veal scaloppine came finished with porcini mushroomsFilet Mignon Dinner Special -  This very nice filet was covered in a compote of veggies and served with haricots vert and a wedge of polenta - this is what I had and it was divine.Frutti di Mare - Shrimp, clams, scallops and fish sauteed in red clam sauce on linguine. I was especially jealous of this dish (started to order it but someone at the table already had and against my gluttonous desires, demurred). Involtini di Melanzane -  Pan-fried eggplant rolled with Prosciutto di Parma & herbed ricotta cheese, baked with marinara sauce. For our vegetarian, Sid.In all a delightful experience that I hope to one day repeat. It also ended up being some of the best food I had while visiting Providence.(longer review posted to my food blog)"], ["Holly E.", "Every summer, my friends and I try to get out to a restaurant that we wouldn't normally visit for the $30 3-course specials that many higher-end restaurants offer for Restaurant Weeks. This year, I recommended we try Siena, and I'm so glad we did. I had never been to a restaurant on Federal Hill and I definitely think I made the right choice.We arrived about a half hour early and who I think was the manager greeted us and let us know our table was already ready. We decided to take a seat at the bar for a drink while we waited for our last friend to arrive. The bartender was super sweet and we ordered our cocktails and sipped them as we watched her in amazement while she ran the busy bar all by herself. She was awesome. When our friend arrived, we headed back to our quiet table against the beautiful back wall.I ordered the giant meatball for my appetizer after seeing raves about it on Yelp. I'm SO glad I did. My friends ordered salads and they were picking at the meatball, wishing they had ordered it. For my main course I got the penne alla vodka with shrimp, which I only finished about half of because I was so full (and had some amazing leftovers for lunch the next day). For dessert, I ordered the chocolate cake with roasted hazelnuts and a tiny, perfect scoop of vanilla bean gelato. Everything was perfect. I will definitely come back to Siena anytime outside of restaurant weeks!"], ["Bijon H.", "I came here about a year ago and loved it so much I couldn't wait to come back. I went last night with my boyfriend and sister and it was HIGHLY disappointing the way we were treated. 1st my boyfriend called ahead asking about a dress code and the hostess said no, (I figured they're most likely lax because is was a Tuesday night). We get to the restaurant a little before our reservation to be told \"you can wait in the corridor until exactly 8:30\". That was not inviting & not professional. While waiting and talking amongst ourselves a hostess comes out to start cleaning the windows while we're standing there in the middle of service!! She walks into our convo and wishes us a good night?! Too many strange things and we haven't even sat down yet. Finally we have a seat and order a bottle of wine and a few appetizers. The wine was recommended by our waiter but unfortunately was either oxidized and/or corked because the taste was completely off. We send it back to try another and she comes back to say \"I can't just send this bottle back if you don't like it.\" Awesome. Noted. However it was your poor recommendation not our taste buds! Within a few minutes the waitress must have complained because the manager walks up with a vengeance telling my boyfriend he's going to be asked to leave if he doesn't remove his hat. The timing of this all was way too convenient. Not to mention she was speaking so loudly as to try to make a scene!! The manner in which he was asked was completely disrespectful, out of line and NOT professional. This waitress and manager clearly had something against us before we even sat down but we ignored most of the signs while enjoying each other's company. The last straw was her attempting to treat us as though we've never been to a fine dining restaurant before. I told her we called ahead about dress code and since no one mentioned upon arrival why is it such a huge deal when we're half way through our meal?! And let's be honest I have no problem following the rules but we all know delivery is everything. And that manager is wretched I will never be going there again. I will never recommend this place. And I will be making a complaint to the owner. I'm happy we chose integrity over a place that's overrated anyway. We went down the street to camilles which was WAYYY better and we were treated with respect and kindness. Priceless service!"], ["Khusbu P.", "Ohh my gosh. The food was soo good! I was able to make last minute (literally) reservations are on Opentable for three. We were promptly seated. We had the eggplant parm, truffle fries, and pizza. All of which were amazing! I would definitely go back :)"], ["Robert S.", "Siena has become one of my favorite restaurants in Providence.The service is impecable.   Very knowledgeable servers, very polite and very happy to be working there.The wine list is very good, including full bottles, half bottles and glasses. I loved their Beef Short ribs last time I was there.   They were tender, flavorful, delicious.   Served over a creamy risotto.    I have also tried their Frutti di Mare.   Absolutely perfect.   All seafood items were cooked to perfection and the pasta was cooked al dente.   Check it out !   You won't be disappointed."], ["Sungeeta A.", "I was very excited to try Siena because I had heard many great things, but I ended up pretty disappointed.  I debated between 2 and 3 stars, but because Siena has such a great reputation we had high expectations that were not met in the least. The service it self was mediocre with our waitress often absent, despite the restaurant not being that busyThe food was, for the most part, average. We shared a pizza for an appetizer, and it was pretty good. I also enjoyed the penne alla vodka. My boyfriend's veal saltimbocca, however, was very disappointing. The veal was tiny and the green beans were burnt. The whole thing looked like it came from a frozen TV dinner tray. Maybe we just caught Siena in an off night, but I don't think we'll be back to give it another try."], ["Janelle M.", "The service was great, the Patriots game was on, and the food was amazing. Very accommodating on any special requests or questions on food, ask for the soft garlic bread!"], ["Amanda J.", "We went here for dinner and it was absolutely amazing. We started at the bar and were pleased with the large selection of wine, cocktails, and seasonal selections. The bartenders were very friendly and made us feel very welcome. When we sat down, we were instantly given water and bread. Our waitress was quick to come over and was very personable. She was very knowledgable about the drink menu and was able to give suggestions and opinions easily. We got the eggplant and small-neck clams for appetizers and both were great. Everything on the menu sounded great but I decided on the penne alla vodka and was so happy with my choice. I would recommend this to anyone who likes traditional Italian food but also likes a modern atmosphere. After dinner, we were able to walk around the neighborhood, which was lovely!"], ["Heather B.", "Never a question that you'll get a good meal. Today, like 4 other women who were with me, I ordered the shrimp risotto. 4 plump shrimp with creamy paremsean risotto with a vegetable broth- melt my heart. My husband loves the fruit de mar and my dad swears by the bolognese. We started off with both the calamari balsamico and calamari fritti- fresh, large and perfectly cooked. The  calamari balsamico is unique to Siena and I highly recommend it! This location offers outdoor seating which is always a treat. The interior is beautiful, calming and comfortable. The bar is relatively small here and usually packed. They are able to accommodate large parties, there is a room in the back that could probably seat up to 30. If it's a holiday you are looking to come on, I highly recommend calling at least 2 weeks in advance for a reservation. Although Siena is a little upscale, they are very willing and able to accommodate children, either with a simple pasta dish or their delicious wood fire pizza!No matter what you are in the mood for: steak, seafood, pasta or pizza you'll have a great meal.  Come treat yourself and enjoy!"], ["Patty K.", "Soooooo disappointed- ordered swordfish which came out raw then recooked til completely dry (not edible). Bummer heard great things about sienna ......"], ["Alban J.", "This was A-maz-ing! We had a table outside in the sidewalk but it turned out to be perfect. We had pizza and penne alla vodka. Everything was delicious. Pizza crust is thin and crusty, and penne sauce was to die for. The desserts also were great. We recommend the bread pudding and the cheese cake. Wicked good!!!The waitress was very nice too. Will definitely go back!"], ["Eric C.", "This quickly became one of my favorite places here in Providence. As all you Rhode Islanders may already know, we are known for our Italian food. Most are tucked away in the Federal Hill/Atwells Ave area with a few sprinkled throughout the city and beyond. Siena is situated in what I call the heart of Federal Hill which is apt as it should be the beating organ of this Italian district. In a somewhat innocuous outward appearance, Siena sits casually to the side on one of the busiest streets in Providence. Don't be fooled by the lack of cars up front. They have a valet service so it makes it seem they are never busy when in fact, they are probably one of the busiest places around. Tip 1: ALWAYS book a reservation. Just do it online and get your name on the board or you'll never get a spot! We walked right in without having to wait where as others who just showed up had to wait hours.Tip 2: You must get the meatball appetizer. Look, it's a pound of meat.. what's not to like? Share it though..Tip 3: Vodka penne will blow your mind. That is, if you like Vodka sauce. Between this and the meatball it was more than enough for two people. Remember not to forget dessert!I did try the pizza.... I wasn't too thrilled with my choice (I can't even remember the type that I got. But I do remember telling myself that I should really try the vodka sauce pizza the next time!They have a great bar area and really surprisingly limited seating within the building. Again, book early, park around the restaurant and just walk over!"], ["Theodore H.", "Still the best place on Federal Hill for dinner. Tuscan, light and not overly priced. Service is excellent. Only sad part of dinner last Friday night was the missing portabello mushroom appetizer that was a favorite for me and my family. Change is sometimes never good."], ["Jenny C.", "Be prepared for a Debby Downer type review, smashing stereotypes left and right. Sorry!Everyone always recommends Siena as the greatest Italian place on Federal Hill, so when my dad came to visit RI, I wanted to take him there (he loves Italian) and try it out for myself. WELL, after all of that building up I'd done, as soon as I walked in and saw the velvet thrones in the back, I realized I'd eaten there before. It all came rushing back as a memory of mediocre food. Actually, that isn't a fair assessment. I remember the bolognese was a disappointment--I'd been on a quest to find the best in Providence, and it wasn't at Siena's--but the rest of the food might have been okay. The point is I don't remember, and for me, that's a bad sign.Here's my assessment from this time around. 1. Reservations are needed way in advance for the weekend if you'd like to eat before 9pm2. It's LOUD. Tables are tight and I had to yell across the table for my dad to hear me.3. The waitress (or at least ours) will be visibly disappointed if you don't go all out: bottle of wine, apps, dessert, etc.4. The food is okay. The gnocchi sounded amazing (black truffle oil!), but I wasn't a huge fan. The vodka pizza, however, had great flavor, and I imagine their penne vodka would be good.For now, I'll keep experimenting around Federal Hill. I'm not ready to agree that this is the best there is..."], ["Xiao Z.", "Really great American-Italian cuisine here, with attentive service and formal ambiance. I came here for a paid business meeting, and were placed in the private room with a large screen TV and very attentive service; this of course, may not emulate all of the other regular dining experiences, but it was certainly top notch. I had the fried eggplant, which decent, although not particularly jaw dropping, and the $29 veal chop that was simple, but elegant with amazing rich, but not overpowering mushroom sauce. The desserts were a little on the large and dense side, but still very delicious.Overall, it's a great place to take your family and your date if you wanted to impress them. Just make sure to bring a larger sized wallet.Food: 4 starsPrice: 3 starsAmbiance: 4 stars *Service: 4 stars *"], ["Jeffrey B.", "The food was exceptional for my wife and I tonight.  So why two stars?  The service was abysmal, my Manhattan smelled like rancid gasoline, and the dining area is RIDICULOUSLY noisy.Your best bet is to go when it first opens, shovel dinner down, and get out before 6.  Past that, bring earplugs."], ["Patrice M.", "Went to Siena during restaurant week and everything was great! Ordered the meatball for an appetizer followed by the salmon entree. Everything was cooked to perfection. The only thing I didn't like was the fruit tart for dessert. It had a very strong lemon taste but I should have considered that before ordering it considering I'm not a lemon fan. Besides that, food was delicious in a great comfortable environment."], ["Philip E.", "Truly a dining experience, great Federal Hill location, the atmosphere has an upscale buzz, beautiful people everywhere, service was challenged by huge crowd but still executed the mission.  Started off with delicious flat bread pizzas, one with prosciutto and figs and the other alla vodka with spicy buffalo chicken.  2 different fried calamari appetizers were just average at best, but main courses stood out, especially the veal 4 different ways.  Lobster Mac and cheese was a downer, too dry and not enough cheese.  Short ribs over risotto was very good.  Desserts did not disappoint either, lemon creme brûlée, Italian cheesecake, tiramisu, all excellent"], ["C S.", "Wow - it would be difficult to have a better dining experience.  We were greeted promptly at the door and our server appeared shortly after we were seated. The server was well versed in the specials and was able to answer our questions on the menu. She was very attentive throughout the meal - excellent wine skills - overall excellent service.  This is my idea of a good menu - there were so many great choices on the menu, we started planning to return before we even placed our orders.  The shrimp and risotto was prepared perfectly and the sea bass and scallops was absolutely amazing. Such a great dining experience we can't wait to return."], ["Beantown T.", "The pasta a fagioli is a fantastic starter.  I love brothy northern italian dishes and this always hits the spot.  The kitchen crisps up proscuitto for me to sprinkle on top.  It's the little things that go a long way for me and they have no problem with special requests.  Fried eggplant is delicious too.  Very gracious staff.   A little light on ambience, but go.  It's great food"], ["Walter K.", "Went there for my 6month anniversary with my partner. Really incredible restaurant. very fancy, they clean up the crumbs after your meal and everything. The wait staff seems spectacular, and they're very attentive. The food is very very good, with clear attention and delicateness put into each plate.The specials all sounded great, though i ordered off the main menu. I really liked the dessert options as well. Got the creme brule, only the second time in my life I've had it. To be honest, I wasn't a huge fan of the lemon, but other than that it was spectacular.Really nice atmosphere as well, although a bit loud just because of the bar and number of people in there. I'll definitely dine there again next time I want a fancy fancy meal."], ["Leela S.", "Came here for a late dinner after spending the evening at PPAC--their kitchen is open late, which is a plus. Siena has a classy, romantic ambience, which makes it perfect as a date venue. However, we were a group of friends, and the atmosphere suited our platonic crew just fine. The complimentary bread is not bad at all. I was starving, though, so I may be a tad biased. Their wine selection is substantial--we picked up a great Chilean red to accompany our meal. I ordered the rigatoni as my entree. It was a hearty, wholesome pasta meal with a generous amount of ground sausage and tomato-white wine sauce. I quite enjoyed it, but it did not blow me away to the extent that I thought it was worth about $20. If you're spending this kind of money on an Italian meal, you're better off going to Bacaro or Al Forno."], ["Anna G.", "Fantastic holiday decorations!  Amazing food (at fair prices)!  I really, really liked Siena.  I think it had some of the best pasta I have ever had!  I want to go back to try the tagliatelle but the penne with vodka sauce was awesome!  The polpette was incredible!  I would be the happiest person eating those two dishes forever!!  Five stars based on food and ambiance alone.  The one bad part --- the service was very, very mediocre.  I wouldn't say bad, but pretty close.  We waited over 10 minutes to even place a drink order and our waitress never came back for food.  We waited so long, another waitress came over to take our order and expedite our dining experience.  mehhh"], ["Jenn Z.", "Great wine, veal, gelato and cappucino. Not too sold on the rigatoni pasta dish but the rest of the meal was very enjoyable"], ["Chanceny K.", "I love love love this place! We went there on a Sunday (our anniversary). Best service ever. We had a bottle of wine, app (eggplant), the pink vodka sauce pasta with shrimps! Also our waitress even had a candle on our cake for us."], ["Joseph A.", "The steak was really good and that's about it. Nothing else to say about anything else because that's all that came with it.  The server was robotic in her presentation of the specials.  The only surprise was the bill being so high."], ["Steve S.", "I liked everything about this restraunt. Got a good seating despite having no reservation. Great service. I had the veal saltimbocca which was thinly cut and done to perfection. Great bread and caesars salad and desert. Nice ambiance, lively but not too loud. It was rated as $$$ but I would say it is more of a $$.  A good deal."], ["Tena D.", "Great restaurant, friendly service and food is great! I just feel it's a bit over priced."], ["Queenie L.", "I love their kitchen but not their service.Food is good flat bread is my new obsession but their service is yuck.The service is \"just a OK\"  from the valet to the host and continued to the waitress.  They all seems very busy to help u.  I'm glad my food is good to make up everything else."], ["Philip F.", "Excellent Italian food here.  We had the crab cakes, penne alla vodka, and pasta bolognese.  The crab cake was lumped with plenty of crab meat, the vodka sauce had a spicy kick, and the bolognese was meaty and satisfying.  Service was very nice and the bottle of wine we had was a very flavorful white pinot.I'm not a dessert guy either, but I also had the cappuccino gelato and it turned out to be a perfect end to our meal."], ["Sarah L.", "I have ate the east Greenwich restaurant a few times and have been happy. I went to Federal and was very unhappy. I was 8 months pregnant and the waitress kept offering me cocktails. A total of 5x even after I said no very pregnant no thank you. IWas eating with a 13yrs and a 3yrs so it wasn't like they were drinking.  My nieces chicken was under cooked. Thank god it wasn't my dish. When I said something to the waitress she stated they had been threw a few head chefs lately. The owners where at the Smithfield location. Food was good not great. East Greenwich is much better!! Federal hill a big disappointment."], ["Brian G.", "Please do yourself a favor and order the meatball, you won't regret it! Tasty food, excellent service, and wonderful ambiance at the Federal Hill location. I just got a sick craving for that meatball..."], ["Janice K.", "Excellent service, quality meal, nice wine selection, perfect experience. Polpette Grande was amazing as well as Gamberi Toscana for apps. Pesce Spada alla Griglia was prepared to perfection as well as the Tagliatelle alla Bolognese.  All of this with a fabulous Willamette Valley Vineyards 2014 Whole Cluster Pinot Noir. Delicioso!"], ["Benjamin J.", "This restaurant is always receiving accolades and rave reviews, so I was pretty excited to finally eat here (for restaurant week). Unfortunately, it just didn't do it for me. I started my meal off with the meatball appetizer. Its a meatball, topped with a dollop of ricotta, over some marinara/tomato sauce. The meatball was the size of a baseball. Maybe a softball. It was just too much. It actually would have been sufficient for an entree. I think they should have decreased the size of the meatball, or broke it down into 3-4 meatballs. I can't emphasize how massive this meatball was. For my entree, I ordered the bolognese (not knowing how big the meatball entree was). The entree was appropriately sized, and maybe my appetizer ruined it for me, but it was just too much meat, and not enough sauce. And it was a little too oily/greasy for my taste. Dessert was the redeemer for me: pumpkin spongecake with cinnamon ice cream and a caramel drizzle. Tasty, and a good size. Service was okay. Our waiter never came around to ask us how our meals came out, and seemed kind of indifferent to our dining experience. Perhaps in the future, I'll come here again and try something else. But unfortunately, my first experience was so disappointing, Im not sure when that'll be."], ["Yana R.", "Excellent Italian food. It's a little more modern and refined than some of the other Italian restaurants on Federal Hill. Prices were good. Definitely a place I will come back to again and again. They had a lobster ravioli special the day I was there, and it was the best lobster ravioli I have ever had."]], "Bacaro": [], "Bob & Timmy's Grilled Pizza": [["Heather B.", "I've gotten take out from here before bit went back because of the RI Food Fights pizza deal. We got a 14' BBQ chicken pizza and it was delicious. I think you have to like buffalo sauce because the BBQ was spicy and had some heat. Not a lot of cheese (Gouda) could have used some more. Overall good stuff and I'll go back!"], ["Joe C.", "\"Awful Experience\"This will be simple review.  Went in to try the vaunted BBQ chicken grilled pizza.  Got served a pizza with what felt like 10 pounds of raw onions on it.  Too much sauce and all of the toppings fell off.  Barely any chicken.  Needless to say, went to grilled pizza place and ordered a grilled pizza.  One of the house specials and it was awful.  Go to Caserta's.  Thanks"], ["Robert S.", "This is one of my favorite pizza places in Providence.   They have excellent grilled pizza, on the thin side, the way I like it.    They offer an ample menu of many specialty pizzas, many toppings, sauces, etc.   I am partial to the ones that have less....like cheese, four cheeses, or just 2-3 toppings max..    I find the more toppings, the less epicurious is for my taste....LOL...  Check out their Pizzas 1, 2 or 3.    You know what I mean when you read the menu.In addition, they serve nice sandwiches, pasta, salads and dessert....but the place is definitely known for their PIZZAS  !!! Try it out...It is a great place...They have a nice patio during the warm months...unfortunately, they don't take reservations..."], ["Jillian Q.", "This place had been on our \"want to try\" list for a while and we finally made it over there last week. It was a weeknight so parking was fairly easy. For a weeknight it was pretty busy in this little restaurant. We settled in with a pitcher of 'Gansett and ordered one of the special salads and pizza. The salad was an antipasto, it was your standard salad with meats and cheese on top, but bonus points for the crazy amount of banana peppers on the salad. The pizza was pink vodka sauce with olives, peppers, spinach, and a ridiculous amount of delicious feta!! They do not skimp on the toppings here! But the grilled pizza crust was not sturdy enough to handle all those toppings and the crust did not have the \"grilled\" taste that I had loved from other grilled pizzas I've had before. I think if we go back we will order a more simple pizza with less toppings."], ["Scott V.", "This place has really good food everything always seems to be extremely fresh. Last night my wife and I went there for dinner. We had ghe nachos with fresh motzerala and fresh tomato I was good could use another flavor cheese also.she ordered a salad excellent homemade dressing.  Than we split a grilled pizza also excellent"], ["Christian V.", "Mann! you have no idea how great their pizza is. Words can't even explain. Not sure how much more to elaborate Top 3 pizza's I've ever had in life."], ["Steven R.", "This place is amazing I been here about 10 times and pizza is AMAZING, I was kind of unsure of grilled pizza but it is fantastic every type I had was great. Calzones are great too also the wraps are good with super fresh ingredients. I love this place. Staff is super friendly as well"], ["Cecilia L.", "Best pizza in Providence! Our friends recommended we stop in and the pepperoni pizza 100% lived up to our expectations!! Check it out!"], ["Bruce B.", "At the recommendation of a local we went to Bob & Timmy's. This was our first visit to Providence and we had high expectations. When our pizza came out cut in squares I was afraid we had blundered. But, the pizza was good and eating outside was pleasant.. It was not the pizza of my youth eaten in NYC but it was better than most of what I've encountered in New England. We are still searching for \"real pizza\" and will continue the search on Federal Hill when we come back."], ["Kimberley T.", "Delicious crispy pizza and polite, efficient service. Fresh, flavourful tomatoes. Reasonably priced. Mushroom pizza, house salad and special eggplant fries all recommended."], ["Shari W.", "For those of you who read my \"Worst Pizza Ever\" review of Federal Hill Pizza in Warren, this is the antithesis!  I don't know how they do it but every pizza at Bob & Timmy's is perfection.  Our favorites are the lasagna pizza and the eggplant pizza.  You will not be disappointed."], ["Ryan H.", "Have you ever had a grilled pizza?  Nestled in Providence, Rhode Island is the famous grilled pizza place, Bob & Timmy's.  Grilling a pizza is definitely a unique way of preparing it.  They start by soaking the dough in olive oil and then begin grilling it before adding any toppings.  Your tastes buds can immediately tell that it was grilled by the smoky flavor of the crust - which is no thicker than pita bread.  Their grilled pizza has made Bob & Timmy's popular enough to support two restaurants in the Rhode Island, and I dined at the Federal Hill location.  I enjoyed being able to eat on the outside patio there, and I believe the one in North Smithfield has a similar option.  My pizza was their Great White, but I think I would have been better served to order one with traditional red sauce.  I did, however, enjoy the nice gooey cheese on it.  Overall, I liked Bob & Timmy's, but I don't think I am as big of a fan of the charcoal-grilled crust as some others may be."], ["Amanda F.", "Decided to try something new and stumbled upon this place right on the  back edge of Federal hill which is great!!!! Away from the busy area! Super small place but the pizza I had just a simple pepperoni nd bacon grilled with me and my fanicee it was soooo goood first time trying a grilled pizza and I loved it definitely recommend this place if your looking for good pizza place with nice prices. :)"], ["Yana R.", "I went here a few times, and at first I liked it, but my enthusiasm quickly waned by the third or fourth visit. The dough is frequently not browned enough, looking kind of pale. Because the dough cooks very quickly on the grill, the toppings often didn't seem as cooked through as I would like. There are better pizza places out there."], ["Justin K.", "So while in Providence visiting a buddy, he said we have to check out Bob and Timmy's.  I myself have just begun grilling pizzas in my back yard so when I saw this place had grilled pizzas I was excited. We went for lunch on a Sunday and sat outside on a gorgeous day. They had some good local brews by Harpoon so I stuck with the UFO. When in Rome??? The pizza menu itself is tough to get through because everything looks so damn good! We finally decided to go with Half Great White w/ clams (menu says optional for the clams, but if you don't do it, you are a fool!) and half 4 cheese with vodka sauce.  By the way the service here is fantastic. Never did my beer go empty without an offer of a new beer! The pizza did not take very long to come out and when it arrived the smell of goodness punches you in the face. I started with the clam pizza...I am glad I did.  This pizza did not lack flavor OR clams for that matter. It was delicious. Then I moved to the four cheese and vodka sauce. This pizza was next level ish. As I went tearing through this pizza, I forgot my name it was so good.  It was a religious experience!  I heard the voice of angels singing!! Oh, wait a minute, we were sitting next to a church that had a service going on, that was ironic and perfectly timed as well. Meanwhile, back at the ranch, that vodka sauce on the pizza was brilliant. Overall this was definitely the best pizza I have ever had. The crust was thin and delicious and all the toppings worked well together. My buddy and I definitely ate the whole thing; there were no leftovers on this trip. But then something happened, we were asked if we wanted to try the desert pizza. Desert pizza? We summoned from the depths of our stomach, room for desert. We willed this to happen.  We replied,\"Well, sure. Why not?\" We went with the mango desert pizza, the small. One piece of advice, the small isn't very small.  The amount of fruit on this pizza is ridiculous. Fresh kiwi, raspberries, blackberries, blueberries and mango with a cream cheese sauce underneath.  It was delicious. We pushed through and devoured the small pie.  I was now food drunk.Overall this place is fantastic. I highly recommend coming to this place and eating here. Ignore the ghetto talk, go to Baltimore or Philly if you want to see a real ghetto, this place has charm.  You will not be disappointed."], ["Bobby L.", "Damn good grilled pizzas. Stopped here heading home from the Cape and was not disappointed. Staff were great and pizza, which has been featured on TV, was spot on. Highly recommend. Was nice to sit outside on a cool Summer's night too."], ["Allison M.", "I can eat a whole pizza here all by myself. I'm serious. It's perfect. Fair warning, though, if you're looking for ooey-gooey, piping hot and bubbly cheese you will not find it here. This pizza is thin, crispy yet chewy, and saucy with obvious attention to topping proportions. In other words, it's well covered in toppings but won't fall apart at your first bite. You can taste everything, and everything tastes good.I highly recommend the Lasagna pizza. Try the Mesclun Green salad if you want a taste of the best balsamic vinaigrette of your life. Add the goat cheese, too. It's worth the extra couple bucks.Ambiance is a little off. Service is inconsistent, and the dining area is usually messy (crumbs on the floor, dingy windows). It's also a bit cramped. But, truth be told, I rather like that about this place. There's something about the humble surroundings and casual attention to customers that makes me feel comforted."], ["Rachel G.", "Best Pizza in Providence, and among the best in the Pizza belt."], ["Donny T.", "I agree with a lot of the other reviewers about the mediocre service. It seemed like a bit of an inconvenience to the hostess to seat our small party at the outside patio. Poor service aside - the pizza was really good. We made a custom pizza with pepperoni, bacon and green peppers. The ingredients all appeared fresh. I really enjoyed the sauce - just the right amount of tang."], ["Good E.", "wow, yelpers totally let me down on this onethis is probably the WORST pizza and calzone i have ever consumed in my life.i got their famous 'wood grilled' pizza. the toppings were falling off the pie. as in all the toppings. there was a giant mound of toppings in the box. obviously not enough cheese. also, the pizza was soggy. yucky. i hate soggy pizza! it was so gross i pretty much threw it in the trash.i had high hopes for the calzone, that also was soggy and the inner contents were literally coming through the crust. how this place has managed to stay open for so long in federal hill is completely mind boggling to me.. go to casertas, fellinis, twins , tommys, all are MUCH better pies IMHO"]], "Guido's Restaurant": [], "Camille's": [["Kevin D.", "Camille's is restaurant dining raised to the level of performance. It is brilliant not just for the exquisite food but for the totality of the experience. From the moment you step in the door and are warmly greeted by Mike the Maitre' D you will feel like a cherished guest. Should you find yourself in Providence do not pass on the opportunity to indulge in this cherished landmark. 100 years of tradition reflected in every moment."], ["Gregg S.", "The food is top notch and the prices are very good.  Sometimes the table service can be extremely slow during lunch.  Kitchen wait times are fine but I've had to leave our table to find our server on more than 1 occasion.   Otherwise, this would be 5 stars.Calamari appetizer is excellent."], ["Kim R.", "Went to Camille's last night to celebrate our wedding anniversary.  Loved it!  Food was phenomenal, traditional Italian food that was not disguised by garlic.  Portions were huge and presentation was beautiful.  Our waiter was so professional (told us he had been there for 10 years), pleasant and attentive.  Our courses were served slowly, allowing us to spend time savor both the food and the evening.  Not rushed at all.  I loved the old school ambiance (even had a coat room!), it just made me smile to listen to so many Italian people talking, laughing and joking.  You know it's good when the customers were clearly local and Italian.  Made me nostalgic for Boston's old North End (before yuppification).  Can't wait to come back!"], ["Mary N.", "Came here the other night from out of town with my boyfriend's in town relatives. It was my second time here (boyfriend's family insists we come here every time we are in town).  Service was amazing from beginning to end and the food was absolutely delicious.  I had the house special barramundi and my boyfriend had the veal chop.  Both were cooked well and perfectly seasoned. We also had the calamari, burrata and fried something balls. The pastas looked delicious too.  Portions for everything including appetizers were huge.  I enjoyed everything. Wine list was pretty awesome too. All in all, we had a great time and the waitstaff made us feel pretty welcomed and special."], ["Joel S.", "We got the recommendation from an employee of Tasca Automotive Group.  We had no clue where to go and went with it.   Thank you Tasca!!   The maitre'd was a very pleasant and professional greeter.  The bread was very fresh with olive oil dip, simple and a perfect pre-meal complement.  We got the tradtional garden salad that was hand served by our eloquent and passionate waiter. Now to main course.   This was probably the best sauce I've ever had.  Slow cooked three meat and perfectly sweet and delicious.   I was able to get the Gnocchi with that sauce substituted.  I love Gnocchi and I saw the description of that sauce and for only $4 more they made it happen.....  Best Italian dish I've ever had.  The Gnocchi,  which had an added ricotta ingredient was \"Perfetto\"  aldente.    My wife had a Rigatoni and Eggplant dish with a dollop of RIccota and she was raving about it.  Our son had a simple kids spaghetti and meatball dish and we stole 1/2 his meatball.   It was huge and it was unbelievable.To complete the meal, I had a perfect slice of Tiramisu.  My counterparts had a strangely overpowering meringue and fruit dessert.   You have to take that slow as the Peach Topping was super-nuclear strong.  I don't know if we enjoyed it but we kept trying it because the taste was nice,  just too overpowering. I am not going reduce the 5 stars because of that meringue dish because the rest of our experience was just too good.  By the time the night was over we figured that we had been waited on by not less than 8 different people.  The service was second to none.    All of them quietly polite and attentive.   Can't wait to go back......"], ["Megan M.", "The service was very good. Mike the maitre de and our waiter Joe were very friendly and made sure we had an enjoyable meal. The portions are large. The pasta fagolie is AMAZING!  While there is not a children's menu they can make chicken fingers and pasta for kids. The only thing disappointing was we did not get to try dessert. Hopefully next time."], ["Brian P.", "The best upscale restaurant I have ever been to. So elegant, the best professional service,  and the food it's the best I ever had. I always go there for any professional meetings or just to celebrate.  Its totally the best place for any events. Definitely recommend this place for people with class :)."], ["T D.", "Had dinner at Camille's with 8 people for my mothers 60th birthday. Figured we would be guaranteed a good dinner. So sorry we went here. Very disappointed. The calamari was the worst any of us had ever had. The batter was soft and soaking in olive oil. What really was disappointing was all 8 dinner entrees were served cold!! We didn't tell the waiter at the time because we didn't want to make anyone feel uncomfortable. Plus what could they do... Send all 8 entrees back? Then we wouldn't have had dinner until 10:30 or later. I told managers after dinner and I called to follow up with them. They never called me back. I called again and they said sorry i should have addressed it when the food was served. Just wish this dinner was perfect for my moms special day. Won't go back. Cold food is just unacceptable."], ["Chelsea W.", "Best restaurant I have ever been to in my life , came here for my 21st birthday . They gave me a private room and  complementary canolie's . The food was beyond amazing and they give you massive portions .The service is awesome! Definitely the highlight of my birthday"], ["Katherine F.", "My husband and I celebrated our birthdays with a lovely evening at Camille's last night.  It was, as usual, a wonderful dining exerpience. The staff were extremely attentive, professional,  and friendly.  Our waiter heard me wish my husband happy birthday and following our delicious dinner surprised us with a lovely and delicious piece of cake for desert!!  Camille's has truely mastered the art of fine dining. Always an excellent experience!!!!"], ["Jamie D.", "This place does a really fantastic fine dining experience in terms of quality and presentation of the meals, but I'd be remiss to not mention my experience here was equally memorable due to the staff. I went here last fall with a large group of my drunk, loud friends and our waiter, David, had our whole group impressed. I'll put it this way - I had a great meal at Papagayo last night and I couldn't tell you my waiter's name, but my friends and I STILL measure waiters against David and reference him by name. The dude - without us asking - brought out plates and split our apps and desserts into portions so we could all share, which got big points from us. You know how most waiters go over the specials like they're just trying to remember the script and you just let them go through the routine? David told us every detail from where and when the local salmon was harvested to which garden the chef got the organic veggies from. We were dare I say captivated to hear more! Oh yeah, the food - wow. I won't get specific, just be prepared to spend fine dining money and have an amazing meal. Really classy atmosphere and feel, hopefully you get David!"], ["George S.", "There is nothing bad about this place at all. The staff couldn't be friendlier and more accommodating. The food is well above a 5 star award. We had London as a server. He not only was professional he made sure we had the best experience possible. I would recommend this place before any event. Seems to fill up earlier during Saturdays but Friday seems to be the best to easily get a table. I would recommend calling ahead regardless. Absolute gem in the heart of the hill."], ["Hillary G.", "By far one of the best dining experiences I've ever had!!!! The waiter was extremely attentive, the service was quick and on point. Everyone was extremely friendly and Inviting. All around a great atmosphere!!!! I would definitely go back again!!!"], ["James B.", "I received another award in March of 2013 there!  Amazing food is something that makes all people return to places like this!! Place is so professional from appearance to valet parking!! There was about 20 of us at the award ceremony and everyone was pleased with their meals!! This place is a must!!"], ["Dev R.", "This place was recommended by the concierge, and it was good.  Friendly, knowledgable service from real Italians.  Sophisticatedly dark atmosphere.  Marble dining tables.  Good food.  Good drinks and dancing.We were 10 strong.  Reservations honored.  Sat at a lovely table which made us want to stretch and relax--formally.  Wines ordered with complimentary calamari (hotel coupon).  I don't eat rubbery stuff, but their calamari was top notch! Tasted more like onion rings.  We also shared oysters, crab cakes, artichichokes, and bread.  I had to ask for olive oil and vinegar, and noted the wane taste of the oil, but overall, we enjoyed the first course.We ordered salads over soups.  All were delicious! Ceasar, arugula, apple, candied bacon walnut...I can't remember all we had, but everyone enjoyed their salads.The entrees are a bit much to remember: steak, fish, pasta, chicken--it ran the gamut.  I think the only person who didn't enjoy their meal was me. : (. I had the rib eye and it just wasn't flavorful.  No one should have to salt down a perfectly rared piece of beef.  Oh well, I left it on my plate, sated with the first two courses.  Seems like everyone else enjoyed their meals.  They came out looking like works of art.  Wish I could have had dessert.The lounge opens at night with a live band.  Nice atmosphere.Overall, glad to have done what was named a \"Providence institution.\""], ["Melissa P.", "If you want real deal Italian food, come here. Their calamari alone is worth the trip, as is their shrimp wrapped in prosciutto (scampi alla satiago). Staples like chicken parm are done to perfection and portions are large. Prices are very reasonable for the quality. Service was outstanding."], ["Dennis B.", "We were in town on business so I asked my customer where should we go.......he suggested this restaurant.....we sat at the bar for lunch.....this place from when you walked in and met the maitre d........I knew this was a excellent restaurant......the bar staff was excellent. .....the food was fabulous.....great experience was had......I will be back."], ["Lauren L.", "An excellent evening start to finish.  We had a family friend come in for the weekend who wanted \"old school Italian.\"  Since Camille's was founded in 1914 with excellent Yelp reviews, this was an easy choice.We honestly got the best service we have EVER gotten at a Providence restaurant.  The Maitre'd (Michael) was incredibly polite on the phone when I called to say we'd be 10 minutes late for our reservation.  The staff (Andrew was our incredibly nice waiter) was quick to greet us, grab our coats, and the Maitre'd himself took us to our table.  The ambiance was very classy- lots of dark colors, prints, heavy decorations.  You would be wise to dress a little nicer than jeans- several ladies there were in dresses and many of the men had blazers on.  The menu does encompass a wide variety of palates.  We spent a long time debating our options.  In the end, our friend got the veal, I got the baked scallops with crab, and my husband got the classic orecchiette with sausage and broccoli rabe.  As we shared the entrees we could all agree that these were GREAT.  The veal was amazingly tender and flavorful.  My scallops were perfectly cooked, sweet, and the seasoning was a bit heavy but very VERY good.  My husband's pasta was incredibly fresh and well cooked.  We split the calamari (very good) and burrata (very fresh, a little underseasoned by my palate, but overall still very good).   The wine list was extensive- there were many options that hit most palates and budgets.  For dessert we shared the tiramisu.  The mascarpone was nice, a little on the thick side, but still delicate and tasty.  Overall, this was one of the nicest evenings we've had in a while.  It is a perfect place for a special Federal Hill evening."], ["Alexandra L.", "I have never been so pleased with a meal as I was tonight. Camille's delivered the most well timed and coordinated service I've  seen in an establishment. We indulged in calamari for our appetizer. (perfectly cooked; tender and lightly breaded.) Alan, our waiter suggested a white Italian wine from B Lange that accented our seafood dishes magnificently. After informing us of the specials, Alan suggested a rare tuna steak crusted with sesame and almonds. Along side was a wonderful coconut lime rizzoto topped off with \"fried\" shrimp that left us speechless. My boyfriend ordered a frutti de mare over a linguini with a spiced red sauce specially made by the chef. All of the shellfish was cooked to perfection and the scallops cut like butter. For dessert, we were again suggested a plate to share. Deconstructed cheesecake. The fresh raspberry purée complimented the cream cheese and light crumb perfectly. I would recommend Camille's to anyone planning for a special occasion or looking for an amazing dining experience."], ["Chulo K.", "Old school great start to an evening in Providence Rhode Island. Service at the bar top notch. Appetizers even better. It's a don't miss."]], "Costantino's Venda Bar & Ristorante": [], "Cassarino's Restaurant": [["A P.", "We were having a business dinner for 12 and were seated upstairs.  Comfortable table and friendly staff.  The wine selection was good.  The Stag's Leap Cabernet was a great choice for the veal Parmesan.  The lobster ravioli was delicious for the first two raviolis then the saltiness was quite noticeable.  The waiters were attentive and timely with everything from our drinks to appetizers to coffee. Bread seemed stale.  Our dinner was at 7 PM.The portobello salad with roasted vegetables was delicious though too heavy on the dressing.  Same for my colleague's Caesar salad.Shrimp scampi was good.  Shrimp a bit overcooked though.  Large portions so you definitely won't leave hungry!Coffee and cappuccinos are ok.  If you can, try to have coffee elsewhere. In case you're wondering, yes, I sampled food from other's plates for this review."], ["Amanda B.", "This place was a first for us the other night and wasn't super impressive sadly. We got there a little late but the kitchen rushing us to order by 930 so they could close was a little crazy. Drinks were good, once we ordered the food came out quickly which was nice but it was a rushed time overall. Someone had ordered seafood as we were leaving and the smell was terrible. Seafood shouldn't ever smell that bad, I was really glad we weren't eating it but sad it made us rush to finish our drinks and get outside! Our server was nice but for 9-930 on a Saturday night I expected a little more of a crowd. Overall, certainly not the best but not the worst either."], ["Fadi B.", "I don't see any reason not to give this place 5 stars. The service was great and attentive. The food came in a timely manner, and the waiter was more than happy to give us what we wanted. Food was excellent, and so was the complimentary bread. Prices were also great, but then again I'm not exactly a great reference coming from NYC. The most expensive thing on their menu was $21, which is about average for an NYC restaurant.Also, I know from living close by for a few years that parking isn't very easy in the Federal Hill area, but their valet service was pretty efficient."], ["Richie S.", "For a first time experience I have to say that this place certainly exceeded my expectations. My wife and I came with our friends last Saturday night for dinner and were pleased that we got seated right away when we showed up for our 7:15 reservation. Right away our sever came over to take our drink order and to make some suggestions based on the specials available. We started with drinks and soon followed with some Italian wedding soup which was amazing. My wife got the saltembucca and her girlfriend got the Marsala and her boyfriend got the lobster ravioli. I on the other hand took advantage of the veal rib chop special which was absolutely amazing, so juicy and tender plus the broccoli rabe that came with it was some of the best I've ever had. We are really looking forward to plan a trip back here again soon. Hope you enjoy!"], ["Tom O.", "Food was very good, service not so good.  We were told by our waiter to order our apps and entrees at the same time. Never heard of this anywhere before. Got our apps and they were excellent. We asked for more bread to soak up the juices of the clams zuppa. We asked again 5-7 minutes later and our waiter said the bread was still in the oven.  He said this as the bus girl was delivering 2 baskets of bread elsewhere.  Then on a redrink order, he forgot one of the drinks and we had to wait about 10 minutes to get it. Overall a delicious dining experience, but the service left a lot to be desired."], ["Michael R.", "Excellent food. I highly recommend the Brucetta appetizer. My steak with a Gorgonzola crust was cooked to perfection. The only downside was we had to eat on the third floor. Other than that I would highly recommend this restaurant for a good meal."], ["John V.", "Dined here on Saturday 11/14. My date and I arrived a little early but were promptly seated at a cozy table for2 right near the bar. Our server was Michael and he was assisted by a young man who's name I'm sorry to say escapes me. Both were very polite,professional and attentive throughout our stay! The young man soon arrived with the best Italian bread I've ever had in a restaurant! We ended up asking for seconds and thirds!My date and I started with an antipasto and fried ravioli. The antipasto was absolutely outstanding, ravioli just okay! We then shared a chicken casserino which was very good and a huge portion! An overall very satisfying meal! I will definitely return and recommend Casserino's to all!"], ["Shawn T.", "Came here last summer and remembered a decent meal.  It was not so good this time around.  I opted for the special pasta dish with braised beef ribs and thought it was way too salty.  The toasted ravioli appetizer was below average. Service was spotty."], ["Bruce K.", "The food was good but the kitchen was very baked up all it took a while to get our food.  We had reservations and were seated as soon as we walked in by a friendly hostess.  Nearly every table was occupied so the ambient noise a tad loud for casual conversation.  The music was also a touch loud at first.  We asked if they could turn it down and they promptly did.I had the Pollo Millano.  Everything was cooked very well and the flavor was incredible.  My wife had the Cassalinga with veal.  She liked it as much as I liked mine.  Our son had the pesto ravioli.   About the only thing left on his plate were some of the olives and some tomatoes.  We all agreed that the portions were more than enough to fill up anyone.To finish the meal we shared an order of tiramisu.  We all agreed that it was probably the best we have ever had.  That's saying something given we recently traveled across Italy and had it everywhere we went.The family decided that we should add Cassarino to our short list of restaurants to always try when in town."], ["Aimee Z.", "Cassarinos was pretty good. We really enjoyed the squash flowers that were on special that day. The atmosphere was very nice and the service was great. As for our entrees we were a little disappointed. My husband ordered a pork chop that was recommended: he thought it would be a thick on the bone chop however it was thin and fried and the edges especially were hard and too crunchy/crispy. He had asked for it medium so there was a lack of communication there. Also my entree was a chicken dish with ricotta cheese, spinach, mushrooms & red sauce. My chicken also had the hard edges, the dish was pretty good but nothing I would order again. I'm glad we went to try it out! We had a nice bottle of wine. And I enjoyed the time with my husband."], ["Stephanie C.", "Unfortunately, my husband and I were not impressed. We enjoyed the atmosphere when we walked in and expected a table in the main dining room but that was not the case. They sat us on the third floor in a corner that was dark and away from everything which I didn't like. But I'm not a complainer so I just sucked it up. First off, it took literally 20 minutes before someone came to our table. Being a server myself, this is where I started to judge things, unfortunately. If we hadn't already gotten our drinks from the bar we wouldn't have had any for at least a half hour. We got the clams casino for an appetizer and they were delicious. But our server pretty much never came back so we had to ask someone else for water and bread. My seafood pasta dish was excellent but my husbands breaded, deep fried veal was disgusting. He gave me a taste and I was good with tasting it again. I didn't like it at all. Overall, we looked forward to a date night all week away from our 1.5 year old, got dressed up and was very disappointed. It felt like I was sitting in my grandma's kitchen. And she probably would have been a better waiter"], ["Neil M.", "We were taking out my dearest and oldest friends in honor of their 50th anniversary.  They were intending to use gift cards for this restaurant (thus the choice to go there) however we insisted on treating.  We had 6 pm reservations and were seated, downstairs, promptly by a pleasant hostess.  Our server was Michael who greeted us friendly enough until we ordered non alcoholic drinks (none of us drink alcohol).  There was then a perceivable change in attitude.  There was a distinct disinterest in us; interactions lacked the usual social pleasantries that we, at least, are accustomed to when dining in what are supposedly fine establishments.  (I have dined in many excellent Federal Hill restaurants and servers were always most pleasant and fun).  We understand that good food takes time to prepare and we were in no rush, however, we were very hungry.  We were served delicious bread, but only four slices for four people so it evaporated quickly.  Our server was slow in returning, doing so, it seemed, only when seating new customers nearby.  When we did finally catch his eye (he never did approach to ask if we needed anything such as a refill on our soft drinks, although the water server was always around refilling glasses), we requested a refill of the bread basket.  This took, no exaggeration, a good ten minutes I think he forgot about us and I had to remind him; called to him, actually, as he inattentively trotted by us.The food was delivered and there are no complaints about the food; it was very good.When finished, we were offered dessert menus, which we declined, but requested two expressos (these, sadly, were terrible- no foam at all).  Michael returned and literally dropped the sugar container on the table then slid it across at us, which we thought very unprofessional, even rude.Although we enjoyed the food and each others' company, the pour service and attitude did put a damper on our enjoyment thus we are hard pressed to recommend this establishment to friends and others.  It is sad to think that our experience might have been tainted because we do not imbibe, or, perhaps, it was just this one server."], ["David F.", "I dined at this restaurant with my girlfriend and were greeted promptly by a male server who told me about the specials for the night. I decided to go with the sangria list since it was so extensive. I had the VIP sangria and I really enjoyed it. I believe it was prosecco, sprite, fresh fruit, and brandy? We had the squash flower app special which was exceptional followed by a veal cassalinga and a chicken francaise. We were satisfied with the price, food, and the service and we will definitely return to Cassarinos."], ["Bill K.", "Got to be my go to place for traditional Italian foodAlmost too many choices for this guy who lives Italian foodBread is as good an fresh as it getsOur waiter suggested a wine that was very goodI had the pork which the waiter suggested , it was outstandingWaiter was very good"], ["Ashley A.", "After much debate about which ONE place to try on Federal Hill for Italian, our client finally just told us to try Cassarino's. We booked a table for 7pm on OpenTable and were seated right away. Our favorite person was the server who brought the water - he was super nice the whole time our waitress was great as well - out on a limb, I think her name was Stacey. I'm 100% guessing. We ordered the Clams Casino which were almost like bacon wrapped stuffed crab...but clams. My coworker got the Southern Mule to drink which he said was real good and different. For dinner I ordered the Lobster ravioli and coworker got the Bracciola which he butchered trying to pronounce - but he's from Alabama so cut him some slack. The portions were huge so come hungry...and don't spoil your dinner eating all the bread and butter (like me). Since this was one of our last travel weeks for the year, we went halfsies on a turtle cheesecake and lava cake - a small bite of each on the spoon plus some ice cream is the perfect bite! Overall we left happy and stuffed but enjoyed the experience!"], ["Michael C.", "Probably our favorite spot on the hill. The best thing I can say about this restaurant is that it is consistent ; the food is always good but the service is remarkable and it's a pleasant place to meet friends and have a nice dinner."], ["Jason G.", "Had a very enjoyable meal tonight with two families, four adults and four children.  Everyone enjoyed their meals from the Cassarino special with veal to the lobster ravioli.  The mozzarella salad was amazing.  Service was very good."], ["Nick R.", "Pollo broccoli con rabe. Hands down, one of my favorite dishes anywhere. Prices aren't bad, considering the location. They have complimentary valet parking if you're worried about that as well. Good atmosphere, also have upstairs dinning. Make a reservation on a weekend."], ["Mike P.", "Definitely one of the top restaurants on Federal Hill for food. The interior is pleasantly outdated. The staff is very friendly and fast, especially our waiter Tyler.The chicken saltimboca was absolutely delicious as was the side of a potato croquette. The portions were so large, I don't really need to eat until tomorrow.I look forward to coming back and trying other things on the menu."], ["Bonnie B.", "Fabulous service and the food was nothing short of spectacular!!! We drove down from New Hampshire and couldn't be more impressed!!best bruschetta I've ever had. The entrees are HUGE and flavorful. They rocked Ono he kitchen and out on the floor!!"]], "Joe Marzilli's Old Canteen": []}