{"L'Artisan Cafe & Bakery": [], "Oasis Grill & Market": [], "Mediterranean Grill & Pizzeria": [], "La Camelia": [], "Capriccio": [["Steven P.", "Long story short...went inside and my wife and I stood at the door for 5 mins. No hostess / about 5 waiters walked by without saying a word to us. I thought it was bingo night because most of the patrons were 60 plus. I have Nothing against  older ones but the decor / and guest really emphasize out of date! We turned around...walked out! Valet guy was nice, but he was bewildered because he just parked my car. I told him what happened and he made mention he could get us a table. I respectfully declined and tipped him $5. Was not his fault for this experience  but I will not go back."], ["Daniel P.", "Average.... start right from the beginning.  dress code is business casual and there were people with jeans.ok.  PRO's1. valet parking is awesome,  especially in Providence. 2.coat check is a plus3.beautiful ambiance. 4.service was impeccable. 5.nice beer and wine selection.CON's1. waited 50 minutes for my meal. (I almost walked out)(I witnessed a couple order, eat, and leave then another couple  sat down and ordered , and then we were served)2.finally served a cold, overcooked steak. 3.my girl ordered the risotto,  it was awesome, nice chunks of steak, cheesy rice...$170 meal, tip, valet, coat check...save this place for special occasions."], ["Bruce O.", "Great night and great food.  Have the Hudson Valley Foie Gras, you wont be dissapointed.  In fact you won't be disappointed with any of the food.  Great service and good drinks.  Make a night of it and enjoy!"], ["Sungeeta A.", "I came to Capriccio twice and both times I walked away so full (and satisfied) I could barely move. Luckily I didn't have far to go because of their complimentary valet service.  My meal during restaurant week was especially enjoyable. I chose the carpaccio for an appetizer and was blown away - it was covered in truffle oil!! Seriously, can it get any better? Not really, but the entree came close. I got the Pacific Sea Bass, which is one of the best fish entrees I've had to date. The previous time I came I got the Pork Loin Valdostana - also an incredible dish  but very heavy. Be prepared to do nothing for the rest of the day if you get that dish. Dessert is decent but pretty run of the mill - the panna cotta and chocolate mousse are both tasty but don't really stand out like the rest of the meal. Won't stop me from getting dessert when I come back, though!"], ["David K.", "Nice place.  Quick valet service, didn't have to wait for a table at 8pm.  I ordered the Veal Parm.  Very good, pounded thin.  Also ordered the bolognese.  Again, very good.  Service was solid.  Waiter was a bit arrogant, and didn't pay as much attention to the table as he should, but in his defense he had a couple very large groups.  I didn't think it was that expensive.  They also had very comfortable chairs, make you feel like a king. Dinner for 2 with no booze was $79."], ["Pamela J.", "The waiter was  bit off.  The food was just okay. The restaurant was beautiful. My Carpaccio was excellent. The rest was just eeh!"], ["Steven P.", "At one time, Capriccio's may have been the best restaurant in Rhode Island -- and one of the best in New England. And though it has fallen down the list a bit -- a result of many high-quality, upscale restaurants that have opened through the years as part of the city's renaissance -- Capriccio's hasn't missed a beat.We began our dining experience with an assortment of appetizers that included a rich and generous lobster bisque, gently cooked calamari, and a grilled mozzarella caprese rich with the flavor of fresh herbs and prosciutto -- all fabulous. For my entree, I wisely selected the Veal Oscar which  was smothered in a rich Hollandaise sauce and littered with tasty lobster chunks. Exceptional. And my wife raved about the Beef Bourguignonne Risotto, a personal favorite, not often seen on local menus.But before you pack the younglings in the mini van, two bits of advice. First, the restaurant prides itself on fine leisurely dining -- don't be in a hurry or have other plans. And second, don't forget your credit card --  Capriccio's can be expensive.So if you can afford my advice, enjoy Capriccio's at its own pace, soak in the old-world ambiance, and enjoy the attentive table side service whenever you can. It is a uniquely Providence experience."], ["Josh S.", "The atmosphere was cool, brick basement with old world charm. We were surprised to see the prefix menu as restaurant week was over. It looked good and had the apps we were going to order before we saw it so we ordered from it.Even though we added extra apps and bought wine, I knew we were sunk by the waiters expression. My scallops were good, but the chicken dish my wife had was pretty terrible. If nobody wants to cook or serve the prefix menu, take it down. Our bill was still around $200, probably what we would have spent otherwise as we wouldn't have added apps and not ordered dessert in the same place we dine. With so many great places to eat in providence I would encourage the wait staff to be respectful of where people choose to offer their palate and worry less about an extra $5.00 tip from a more expensive entrée."], ["Jill M.", "Top of the line all the way!!! Service, food, and atmosphere are impeccable! This is our special spot where me and my boyfriend go for special occasions. We can only visit a few times a year but they treat us so well that we keep coming back! If you are into amazing food and service, you will LOVE this place, we do! Highly recommended :)"], ["Pat T.", "I really love the fact that a restaurant maintains the elegant aspect of table side service... a true white tablecloth restaurant. The famed Sole imported from Holland did not disappoint, the meunière sauce was rich... the fish tender (could have been served warmer however).I was a bit disappointed by the side dish offerings, as well as my friends meal (lobster in vodka sauce over cappellini which was all overcooked, lobster tough... again food not warm). I must give props to the service aspect though, even if the server lacked knowledge of the wine list."], ["Bruce K.", "Old school where people dress for dinner and the service is impeccable ; and while the ambiance is not trendy; it's dark and cozy. My wife and I celebrated a birthday and it was a perfect night. The food was great (wife had squid ink pasta, beet salad; I had squash blossoms and a sliced steak pasta side). The amazing thing was that the price for the  quality of food was quite reasonable. Tip: order the blossoms off the menu; just ask the waiter if they have them"], ["Lillian Hua G.", "First the good things about this restaurant: the ambience is very good, and the waiters are very professional and polite. The wine list is impressive.The food, however, is simply mediocre. The pork loin I ordered was very oily and bland. The portion was huge, which might count as a plus for some but not for me. I ordered al dianto riso as appetizer which was pretty good, though. Overall, my impression is that the dishes are priced as such because they have to pay for the tuxedo worn by their waiters, not for hiring great cooks.."], ["Jamie G.", "Took my wife out for her Birthday... We were going to a show after dinner. Bobby (our waiter) was incredible. Got all our food out in a timely but not rushed manner while still getting us out at the exact time I hoped for. We both orderd the Steak Dianne served table side that was so delicious we wished the next day we had left overs.   Once again, you did it guys,  2 thumbs up to all the staff!!!  Best restaraunt in Providence!!"], ["Tessa B.", "Went for an anniversary dinner with my boyfriend. I rate 5 stars for the food, but the service was another story. I felt as though our waitress was very stern, and serious with us. She was not very friendly or sociable at all. I feel this is because of our age, as we are fairly young but not teenagers. Best veal parm I have ever had though. Love the fact that this place is actually downstairs below street level, it makes it unique. Great food!"], ["Cindi L.", "My favorite restaurant in Providence. I love the ambiance. Very romantic and the food is delicious."], ["Dominic W.", "I have driven past this restaurant many times but due to its prices had never stopped by. During restaurant week, I came here for lunch. The maitre D was a slightly rude to me and my party, perhaps because we were in our 20's, which irked me a little. He even came to pour us water later on when we were eating, but reached right in front of the plate while I was eating without excusing himself and poured - he also never resopnded every time we said \"thank you\". Our server, however, was very friendly and knew exactly what he was doing. He was respectful and made up for the service problems. The food came in good time, and it was amazing. I had the mussels with white sauce (very fresh) - a little too much butter, but I'm not complaining about that. For my entree, I had the pork loin stuffed with cranberries and spinach and it was much better than I expected. The pork was perfectly cooked, juicy, and the fat-lean content was just right. The potatoes were roasted slow and were seasoned very well. For dessert, I had the panna cotta - smooth, clean, and perfect after a large and satisfying meal. The berries that came with the panna cotta were lack-luster, but did help to cut into the sweetness."], ["Grace F.", "WOW!!! This place is crazzzy!! Went here for lunch and it was so awesome. Firstly the decor is beautiful, I went to the ladies room and the stall was like a fancy bat cave, no lie! The walls are like a cave. The waiter was so authentically Italian, he was super nice what a gentleman. The lunch was a pre-fix for like 16 bucks. I had a bowl ( a bowl!) of potato squash soup. My friends entree was the veal parm, I had the crispy eggplant lasagna, I took photos check out the portions!! For dessert I had the tiramisu , to die for! I had a Cosmo, my pal had a margarita, we finished dessert with expresso and coffee, this crazy spectacular lunch cost us less than 65 bucks. The waiter followed us to the car with our humongous left overs. Hands down the best lunch I've had like ever. This sh@t is like 4 realz!"], ["Theresa H.", "Went last night for dinner. Service was very slow. Food was just ok, nothing great. I got the sea bass and my husband got the fettucine which was prepared table side (but actually behind our table against a wall so we couldn't see what he was doing :(.  Since we had to wait a long time for the server to prepare the fettucini, my dinner wasn't hot any more when they presented it.Tables too close together for cooking dishes table side... A chef was cooking over flames right next to me for another table, so we could see what he was doing for them! Won't go back, wouldn't recommend it."], ["Chad C.", "If I was looking to whack someone or more likely have the GREATEST BEEF WELLINGTON I have ever had this is where I go. It has old school charm, a superb wait staff and the food is to die for. Its something right out of the Godfather and a must go. Clams casino also deserve a mention. Sit back and let  the evening wash over you here you will not be disappointed. If you have ever set foot in the Olive Garden, you cant come here you have no taste."], ["Anna G.", "I love the old school feel of Capriccio with the formal wait staff and cozy feel sitting downstairs.  We were lucky enough to have the restaurant week menu that they carried over for the summer.  The arancini was phenomenal.  I would go back just for that!  The chicken parm was delicious too.  I definitely got my money's worth as the portions were huge.  I would recommend this for the experience and the great food!"], ["James And Gina S.", "Where else can you find flambé, steak Diane, or Dover sole served table side with exceptional service? The prices are perfectly in line for the quality of food, portions (not many restaurants believe in giving you a salad and side of pasta anymore) and attention to detail. We dined as a party of 9. The waiter was nice enough to visit all sides of the table to list specials and answer questions without yelling and disturbing other guests. Every course came out at once, even the table side options were timed perfectly. My only complaint was that one guest and I ordered the beef Wellington med/rare and it came out well done for both of our servings.  If you like rare stick with the Diane. This restaurant really is a gem in prov."], ["Alisa C.", "Came here last month for my birthday with another couple. Hadn't been in years...my first choice was Café Nuovo which is their sister restaurant and my favorite but they were closed (!?) on the Saturday night I wanted to go(it was also my husband's bday we were celebrating). We hadn't been in a few years because the last few times it had been a so-so experience but this night made up for it for sure and we will be back. We started with some drinks at the bar. They have a really nice bar - just wish it were larger and they used to have entertainment but I don't think they do that any more. We were sat on time for our reservation. Service was very good. Food was good although they seemed to have switched the temps of my husbands and my meat where he got veal medium rare and I got steak well done. The waiter was quick to remedy the situation. And brought out all new sides as well. It was worth the wait. In addition we must have mentioned it was our bday and he brought out a small cake for the table and bought us a round of drinks for the inconvenience. Very classy Capriccios, thanks for the memories and we will surely be back."], ["Jessica D.", "My boyfriend and I had a great experience last night going out for my birthday. Everything was great from the dimmed lighting and look of the restaurant to the food and service we received. Initially we were going to just order off of the restaurant week pre fixe menu but after hearing the specials we thought otherwise. I had a blackened squid ink pasta with an tomato arabiata sauce with clams, mussels, bay scallops and squid. It was amazing the sauce wasn't as spicy as expected but all the flavors we're excellent. Although I think I may have liked my boyfriend's dish better which was lamb sliced into 3 tender pieces in a blueberry port wine sauce and mashed potatoes. Phenomenal. I definitely enjoyed the large variety of wine available to us as well. All the servers we're very pleasant and attentive to us, a very professional look to the service. To top of the night we both had martinis the Chocolate Cupcake and the White Chocolatini. So sweet and very well made. We had these alongside our desert which was crepes made tableside and flambe'd, it's a nice touch that you don't see at many restaurants. It is a pricey restaurant but everything is worth it, if you are going to go out somewhere special Cappriccios is a great choice."], ["Terry L.", "This is our 2nd time going here and will certainly not be our last. They offer free valet parking which makes it very easy and we love not having to worry about where we will park. You have to walk down stairs into the restaurant. The service is impeccable. Men wear tuxedos and really know there stuff. We sat not far from a fireplace which was nice. The atmosphere is very nice. We loved the food....our friend got the shrimp Flambe which they make by your table and that was impressive. The gnochi is the best I've ever had and the sauce is by far the best I've tasted. My husband got surf and turf and loved it and other friend got steak of some sort which he enjoyed. A nice night out!"], ["Norma O.", "What a disappointmentWhere do I begin to address what was wrong with my dining experience at Capriccio.  I am a RI native now living in DC but visiting the area with a friend who wanted to experience some authentic Italian cuisine.  Capriccio was always a wonderful choice for that.  I have dined all over the world at some of the best restaurants and was excited to show off a home town favorite.  We arrived for our reservation on time and were seated in the corner which surprised me since the restaurant was mostly empty.   Our waiter arrived as soon as we sat down and the first words out of his mouth were \"do you need me to take that away from you\".  This was addressed to my dining partner who had her phone in her hand but was not on the phone.  She was somewhat confused by his comment and then he followed with, \"you don't want to get my second reminder\" He then gave us menus and walked away. The tone of the evening was set.  My dining partner, a surgeon who had checked on a patient while we valet parked the car, was completely taken aback by the rudeness of our waiter.  She was not on her phone, there was no talking to disrupt the other diners,  she simply had the phone in her hand and was putting it away. The rest of the evening was no different. Our waiter rushed though the specials barely returned to the table to ask if we were enjoying our meal and forget about refilling our glasses with our $100+ bottle of wine.  The only enjoyable part of the evening was the food. It was delicious but in no way made up for the atmosphere our waiter created.  Our waiter was condescending, abrupt and his behavior was completely unacceptable. Maybe our waiter thought that since we were two women dining together he didn't have to put in any effort. Clearly we know he could since we both witnessed him showering the nearby tables with attention. An embarrassing representation of dining at a highly rated RI restaurant."], ["H.j. J.", "I would rate it lower if there is an option for that. The place is way overrated the waiting staff are old hard of hearing wayyyyyy too slow. I went with bunch of friends and none of us liked their food that's how bad this place is. It's just an average restaurant all the hype is for nothing."], ["Cris L.", "Enjoyed dinner there last night for the first time. My husband had the Lamb Wellington special and I had their Bay Scallops with Risotto special. It was amazing. Incredible food, great atmosphere, and impeccable service. This is our new \"fancy\" restaurant."], ["Jessica B.", "I went with my husband on a Friday night. The place is very romantic and beautiful inside. The food was good not amazing but I'm more disappointed in the service part of it. I didn't expect to have such an un-attentive waiter. Observing the restaurant, every waiter just looked as though they were on point, enthusiastic about the menu and all about servicing their customers. We went early so we were probably the youngest couple in there at the time around 6:30ish. I'm not sure if it was done on purpose because we are young and they don't think we go out much but we got the newer waiter. He had trouble reciting the menu which is fine, I wasn't upset about that but he seemed to start to disappear from the middle of the dinner. The Burrata cheese appetizer was melt in your mouth good it came with a roasted pear and was just so delicious. My husband got the Beef Wellington which he loved and ate everything although the waiter forgot about his side dish. I got the Truffle Veal dish which I was happy with but not blown away. My side of pasta came as I was finishing my meal and by then I was all set. The worst part of it was he asked if we wanted dessert and I said yes so he hands me the menu and I'm pretty sure he is supposed come out with a tray of what they have or at least a description. Well he never came back. We waited 15 minutes and he was nowhere in sight so we asked another waited to find him and he said he'd be right over.Another 15 minutes later he finally comes over and we ask for the check, mind you no apologies for disappearing or what's worse not even mentioning anything about me wanting dessert! I did notice he coincidentally waited on the other 2 young couples in the restaurant which I think proves my point. It was just sad because it was MY first time eating there and I thought I was going to be wowed by service especially when all around me the waiters seemed so passionate about the food there. Oh well back to the Hill we go I suppose."], ["Sarah C.", "Delicious Italian food and romantical atmosphere. Also, their 3-course, $15.95 lunch cannot be beat. Perfect for a date night!"], ["Candy C.", "Baby Arugula Salad with a hint of Truffle Oil- the best salad I've had since I don't know when.  Calamari Frits with Italian Pepper is also quite good. House Chianti is really a perfect match for the steak- I think it was a sirloin."], ["Michelle E.", "I've been going to Capprico's for years now and I was disappointed to have to only give it 1 star for this past Friday nights dinner.Night started off with a bug in my husbands drink, then small bugs flying around while we all tried to eat our appetizers.  The drink was fixed no problem but the flying bugs nothing we could do.I ordered the Lobster and Pasta dish and my lobster tasted like ammonia, when I googled it said that the lobster had been dead to long and shouldn't be eaten at that point.  So the rest of the night I worried being 4 months pregnant that I had eaten bad shell fish and worried I was going to be sick...thankfully I didn't!  Better luck next time...which wont be for a while, sorry Cappricio's"], ["Hilary H.", "I'm confused. Perhaps I got ahead of myself when I was picturing Pauly Walnuts and Chris-tu-fuh in a super-elegant Italian joint, but, well... I was. This IS Providence and this IS Capriccio, after all. I did see a few ladies in glittery dresses and ill-fitting soes, and I did see a few big guys with thick accents, and I did have my vino poured by a charming man from Sorrento, but did I feel the magic? Not so much. Our waiter was new, and seemed very nervous. There were a ton of specials in addition to the massive 50,000-page menu, which was slightly overwhelming. I decided to play it safe and go with the Black Angus strip steak. It was presented beautifully, but it was a tad over-cooked and tasted heavily of char. The accompanying mashed taters were scrumps, and the sauce was perfect. What I really loved about Capriccio was the building - really beautiful, charming and old city PVD. The restaurant is in the lower level, and the exposed brick floors have a thick glaze over them that ads such elegance. All of the waiters (no waitresses, please note) are dressed in sharp tuxedos and look as neat as a pin. They even come flambe certain items table-side, which is so old-school I can't even stand it. I wish I had ordered the shrimp, as the man at the table next to me did, so that I could get a fron-row seat and what smelled like a divine meal. Next time!"], ["Melanie M.", "I had gone to Capriccio years ago and have never been back. My husband and I used to go there often to listen to jazz music downstairs and enjoy appetizers, etc. A few years later my husband surprised me with dinner there and later a show. I ordered a filet mignon. I ordered it medium rare. It was very well done. It was so awful I had to drown it in steak sauce just to eat the small amount I ate. A $50 piece of steak was ruined and I never went back. Too bad because I love great steak but sadly I have no desire to eat there again."], ["Bryan H.", "If you like being harassed by wait staff this is the place for you. took my gf here after work both in suits, and was told by the wait staff to remove my beanie I was wearing since it is winter and all. The place was empty and this completely ruined my dinner. I asked for the check immediately and I will never be returning. I will make sure this place is not an option for our clients and future business gatherings after this experience."], ["Brian D.", "Capriccio is both the most expensive and best fine dining experience I have had. I was in Providence for a work conference and was invited with a group to dinner at this fine restaurant. From arriving at the eatery, I was blown away by the ambiance and class of the place. You definitely need to dress it up. After a few drinks at the bar, our group was brought to a private room. The room was elegant and the waiters were fantastic with an eye for top service. Our group (20 of us) ordered one of every appetizer so I got to sample all of them. I especially liked the smoked salmon and mushrooms. For dinner, I went with the recommendation of our driver which was the Osso Bucco. It was fantastic and maybe the best piece of veal I have ever eaten. The wine list was extensive and all the one's I sampled were excellent. I was happy that I was not paying the check.I definitely recommend Capriccio for a fine dining experience. It is pricey but well worth the money in my book. I will definitely visit again the next time I am in Providence."], ["Anne W.", "I did not believe it myself.  Why would all the good Italian restaurants be in Providence?  I thought Boston had the North End which is supposed to blow my mind but yet I keep trying the places there and endlessly dissapointed.  My fav Italian spot is actually in Fenway.. okay, this is besides the point...We came in here after the beach looking less than appropriate for a place where the waiters wear bow ties.  I loved the decor.. it's in the basement.  It's date appropriate.. definitely.Free valet.. you just need to tip them.  I found parking down the street but I was also there at 9 pm.I actually really loved the food.  We ended up eating at the bar.. and had two appetizers and a main course which they split graciously for us without asking.  Great service.On to the food...1.  Clams with white wine sauce.. not my favorite but they were decent.  There are a lot of onions in this dish so if you're not an onion lover.. you will not like this.  They were littleneck clams though which are delicious.  None of the clams were empty of meat or completely closed... so it was good.2.  Risotto rice balls.. also not the best I have ever had.. but the mushrooms stuffed in them was sooo good.  I didn't like the brown gravy sauce.. I am a fan of the red sauce.3.  Lobster with angel hair.. that was really really REALLY good.  Chunks of lobster with a creamy tomato sauce.  Loved it!"], ["Angel L.", "I have been to Capriccio with my boyfriend two times in the past two years.Honestly, if I were rating the food alone, it would probably be three or four stars. It's one of the classier restaurants in Providence. The food is solid, but nothing spectacular, especially for the price. I'd much prefer spending a little more and getting something truly special in NYC. The horrible part about Capriccio is its consistently condescending service each and every time. Maybe it's because we're young, 20 year olds, who are not necessarily in a suit (but we do dress appropriate for the occasion). But it doesn't matter. No matter who walks into your restaurant is your customer, and each should be treated properly.  At the end of the evening, we are still paying as anyone else in the restaurant, and you're providing a service to me. If Robuchon in Paris, Caprice in Hong Kong, and Le Bernardin in NYC can provide personable and respectful service to us young college students, I'd expect Capriccio to as well. But no. On Valentine's Day last year, we made a reservation well in advance. When we got there, we were told that our table is not ready (which is fine, considering it's probably one of the busiest nights of the year), and for us to take a seat at the bar. Sure. That's until when I see multiple parties (of 2 as well) who walk in after us get seated immediately while I'm relegated to the bar with zero attention for AN HOUR. Not to mention, once we're seated after many complaints, our server seemed to think it's fine to ignore us as well. This week, thinking that last time was just a one-off thing, we decided to give Capriccio another shot given the Restaurant Week deal. We called in an hour ahead to ask if there's space for lunch, and they said yes and we left our name. Sounds to me like a reservation. When we showed up, the extremely rude maitre d promptly told us that he doesn't see our name and that there's nothing he could do about since they're full at the moment. Not a single apology, even after I started getting pissed off and telling him this is absolutely unprofessional. With that, I will never visit Capriccio again. Truly, who do you think you are? I'm a paying customer at the end of the day and I don't need your arrogance and condescension. Plus, the food isn't anything special."], ["Lars L.", "This is by far one of my favorite Italian restaurants.The price is on the high side, so be ready to pay.  However, it is worth every penny.The service is top-notch.  Great place for a date or special occasion.  Also, I good place to go with old friends and hang out in a relaxed, non-rushed environment.EVERYTHING on the menu is incredible.  Osso Bucco USED to be my favorite, but they discontinued it.  I am sure the desserts are great, but we never have room because the serving sizes are so large.Call ahead and make a reservation."], ["Kris D.", "A NYE tradition, dinner at Capriccio's! We have been delighted by many dinners here and we always have a fantastic experience every time. The service is impeccable, our server even went the extra step & offered to take a picture of us after dinner near a holiday decorated area to remember our evening. I try to order something new even if it is just a special appetizer. Last night I treated myself to the Foie gras appetizer. It lived up to the hype. The 4 complex levels of each savory bite started my dinner off with extremely high expectations.  Of course with every visit at least one person in our party will order the Flambe not only because the taste is out of this world but we look forward to seeing Enzo the flambe chef, he completes the night with his expertise and interesting table talk.  He told us last night he had been Capriccio's flambe chef for 40 yrs! In a city that is filled with what seems to be trendy fine dinning establishments Capriccio's still stands out as a indulgent classic dinning experience."], ["Matthew R.", "I guess its time to leave Urbanspoon and join Yelp like everyone else! Here goes.I haven't been to Capriccio's in a long time. We had a $100 gift certificate so decided to go this past Wednesday. It was nearly empty when we arrived at 6:30 (had booked through open table) and it remained dreadfully slow the whole evening.First the good news, the food! And really, that's what is all about. We ordered the special cheese app with some beets and prosciutto. It was tasty but nothing spectacular. I ordered the beef wellington and my girlfriend ordered the scallops and risotto. Both were delicious. The meat was cooked well and the wellington was accompanied with some flavorful potatoes. We ordered a nice bottle of Venetian wine and that was also fantastic. Too full for dessert.The ambiance of the place hasn't changed in years and is certainly not for everyone as it can seem a bit impersonal and stuffy. However, those things are non-issues for me. They still do some table side service, which can be a nice touch when going out for an expensive meal. One of the waiters cut my wellington into perfect portions.Our problem, was not with the service (per se) or the food. About 5 minutes after our wine was poured and before we ordered any food, the valet came to our table to inform us that our car had been hit in the parking lot. There was no major damage, but we were outside dealing with police and the other driver for 45 minutes or so. When we returned it was as if nothing happened, with our wine still on the table. I had informed our waiter of the situation before we had gone outside. Ok, so we eat and enjoy our dinner. Now recall, our car was hit in their lot after their valet parked my car.  I really anticipated a comp of some sort. Nothing major, a free app, free dessert. Anything more would have been appreciated, but unnecessary. Nothing. No mention of it.  We were totally put off by their lack of interest in our predicament. We never mentioned it again at dinner to our waiter. I guess being more vocal would have probably worked for us, but I would like to think that a situation like this would have garnered a little \"old fashioned\" customer service on their part."]], "Waterman Grille": [], "Livi's Pockets": [], "Skarr": [["Annamarie T.", "Stopped here for drinks one night and it was a pretty nice place.It's a trendy little hookah lounge,bar,and grille on the hill. Didn't get to try the food but it looked like a  nice menu. The specialty drinks were great though, I love the Godiva Martini! I'd consider this place, a stop before a night out, I'm not sure its a night out place, but its something worth checking out."], ["Kristine R.", "I came with a group of friends on one of their free entry nights.Needless to say, I won't be coming back.Let me list you reasons why...- The venue was small.- It was crowded.- I was always making contact with strangers from every turn. (And no, I didn't like it.)- The music was blaring.- Lights were doing all sorts of crazy things.- I didn't know if I should sit or dance. (I opted to stand for 90% of the time I was there. Which wasn't saying much, since I left after having my drink.)- Apparently other people felt the same way and went for a lap dance. (I guess that is a good middle.)- Last time I checked this is suppose to be a hooka place, not a club.- It felt like a trashy cramped club. (Sorry, but I gotta say it.)The only redeeming thing that they had going was that their watermelon mint hooka was pretty good and that they made a pretty mean expresso martini.So, kudos to the bartender! But, that's about all I'll praise about over here."], ["Honore F.", "I got pulled into a group of people at Tammany Hall that wanted to go here. When I saw the front of the place I started laughing. There was no way I would have ever gone there of my own accord. Flashing strobe lights, in-house \"DJ\", not for me.      When I tried to order a whiskey they informed me they didn't have any. I then looked at the sparse liquor shelf and realized that everything was flavored vodka and liquors. Very limited beer selection. When I asked the bartender whats she could make that wasn't sweet, she blankly stared at me. I got a lemon drop.      It would be one star, but I didn't have to pay for the experience."], ["Gabriel O.", "The hookah itself was nice, however the atmosphere was less than ideal. I was out with a couple of friends, and we were hesitant to come here to begin with because of the oddly specific dress code taped to the door. (No white shoes, timberlands, baggy jeans, etc.) Our waitress was friendly, but seemed a little high strung. When we asked for water we were given water bottles of varying brands and charged $4 for each without our prior knowledge of the price, or there being one at all. There was house music playing at high volume 90 percent of the time making it difficult to converse, the men's bathroom toilet was missing it's handle, and apparently the women's bathroom didn't have soap.The hookah was enjoyable, and the combinations at Skarr are creative, but that's about all it has going for it in my opinion."], ["TinoX T.", "Nice place,Awesome Music,Cheap Price"], ["Kathryn L.", "Attempted to use a Groupon that was soon to expire here on a Sunday night. I checked the website to make sure they would be open, it clearly stated open on Sunday nights and when we got there there it was closed. The dress code taped to the door was also pretty off putting - no white sneakers, Timberlands...etc. I e-mailed the owner of the restaurant and never got a response. Horrible customer service if you ask me! I won't be back."], ["Marta F.", "One of the wait staff suggested we add a  pineapple top to our coconut hookah which sounded good to us newbies. A particular young male on staff was very attentive and made sure our hookah kept going. When the check was brought over we were stunned by the large tab so we asked for a breakdown of our bill. Two reasons why the tab was so high. (1) We were not told that the pineapple top (and I mean just the top) was $35.00.  (2) The tip was included and we were not told that therefore they \"almost\" got tipped twice. We think it's sneaky & we won't go back."], ["Pretty Y.", "i have stopped by with couple of my friends. great place, cozy.atmosphere is very nice and best of all was their flavored fruit hookahs!!worth every penny paid!great experience, fast servicenice music, and fun crowd.highly recommended !!!!!!!!!!!!!!!!!!"]], "Rosalina": [["Linda F.", "The food is wonderful, the service is terrific and they have a fantastic wine selection. It gets really loud but so do I so, wtf?! Lunch is quite different, it is much quieter, same great food and service. I'm tremendously glad they are downtown because who wants to traipse all the way to Al Forno for dinner? Not this woman. Rosalina will do very nicely and you don't have to wait an hour for a table, of course there's no Kyle but you can't have everything."], ["Nick N.", "Unfortunately i was very dissapoonted with the meal.    Pasta was over cooked.  Maybe even poor quality of pasta     Seems like some of meal was microwave"], ["Scott M.", "Readers Digest: One of the best Italian spots for the price range I have had. And the free drinks for Yelp Check In also helps!Long Version: The size of this place is fairly small, but they have a few places setup for larger groups, although anything larger than 6 may be a stretch. It is a bit loud, as they have music playing and everyone tries to talk over the music and then the next thing you know you can barely hear yourself think. This may bother some people, but honestly we adapted.The owner seems keen on keeping up with emerging trends and technologies, as they even offer a free beer or glass of wine for Yelp Check Ins, which is not the reason we came here but was certainly a plus. Also, I believe she even visited our table and was extremely friendly to us and our daughter. They serve you bread with specialty local cheeses and olive oil from the owners grove in Greece. The olive oil was a hair salty but paired well with the fresh baked bread.The waitstaff was quite friendly, although I felt they seemed a bit rushed. The food also seemed to take longer than expected. But I will say, once the appetizer (we tried the fried dough) and meals we delivered, they were well worth the wait. The portions were very fair, especially the kids meal. Our meals were not too much that we had any to take home, but not too little where you did not feel full. Just right. I imagine the pasta was fresh, although I cannot tell for sure. Either way, the pasta was cooked perfectly and the sauces complimented each dish very well.I certainly will be coming back here again when I am in the area."], ["Meghan W.", "Enjoyed delicious Butternut Squash Spaghetti! The atmosphere was also delightful, and the starter bread was yummy. My friend got the squid ink spaghetti, which I had a bite of and that was also very good."], ["Maria G.", "Far from \"Italian \"...the food was less then par....all 3 dishes were awful!  Over cooked pasta, soggy & chewy chicken Parmesan , sauce in eggplant app. Was sweet and too much!  Never going back"], ["Kathryn R.", "Great decor, atmosphere, staff, food and drink selection. My party ordered the fried dough starter, and for entrees: fusilli with shrimp, squid ink spaghetti and ravioli with rave reviews all around. Good sized portions, not too much, not too little and the house bread served with Narragansett ricotta was a great touch. Definitely recommend it and would love to go back."], ["M C.", "My fiancée and j have been here a couple of times and quite enjoyed our meals. For my mother's birthday we offered to take her and my family for dinner.I can't say enough about how enjoyable the meal and service was. Highly recommend this restaurant for a date night or a large group. The food was fresh, piping hot and between courses the wait was more than acceptable."], ["Mike L.", "My daughter in law made a recommendation to eat at Rosalina last night and we were all were extremely satisfied with our meals. We also had the special dessert: Belgian Waffle with strawberries, banana, ice cream, cream and chocolate Nutella sauce on the side. We will be returning in the near future for sure."], ["Queenie L.", "After hearing all the good reviews about yelp elite events, this time they held it in this new restaurant in town, nothing was gonna stop us to check it out!! As we expected, the whole check in process was smooth & easy.  We sat at the bar which is close to the kitchen and we always love to watch how the food is prepared & I found that watching bartenders getting busy mixing drinks was so relaxing and entertaining! LolWe both loved the drinks there and wish I remember their names, they were the specials of the day, mango mojitos & watermelon with grey goose, both very good, however, the bartenders weren't using any measuring cups, the drinks weren't very consistent, some stronger some weaker! But in general we still love them!They had buffet bruschetta bar, and omg, all the bruschetta toppings were so delicious! Sun dried tomato sauce, blue cheese white sauce, white hummus, rabi etc... Everything tastes delicious! For entrees, we had jumbo shell pasta filled with cheese which was absolutely yummy, I'm not a big fan of cheese but this jumbo shell wasn't heavy at all! The fillings was so fluffy and tasty! I love their sfogliatelle better, this Italian pastry was original and totally blew me away!!! So yummy!!! I hope they do serve them daily because I'm obsessssssed!! Tony, the owner drove all the way to NYC to get the best cheesecakes just for the event for us!!  The cheesecake was one the best New York cheesecakes I have ever tried but I wish it was original made in the restaurant but I totally adore his hard work for us!!  Btw the decor there is so chic and urban, I love it!!!! Can't wait to take my friends there!"], ["M S.", "I so want to give Rosalina 5 stars but unfortunately extremely poor service and subpar food ruined our experience. The positives....Absolutely love the atmosphere and style of restaurant. It's not your big stuffy dining room but rather a smaller neighborhood spot with an urban chic vibe. Excited to see a place like this in Prov. Menu a plus too..not trying to hard yet interesting options and diverse...can get pastas, fish, steak, pork. Something for everyone but not overwhelming. Homemade and fresh. And why we won't go back...service and food that didn't live up. Busy Sat night, full restaurant, and we had reservations. Ended up sitting at bar as we sometimes prefer that and sadly the service was non existent. Bartenders barely acknowledged us, wouldn't make eye contact, took forever to finally ask \"what do you want?\", put a drink and food in front of us, and never came back. And when there was interaction it was as we were a bother. No excuse...service is everything. There for an hour with empty glasses for half of it and since no eye contact never got another drink. Even as we were leaving the bartender was walking towards us and no \"thanks..have a good night\" just a miserable look on his face avoiding us...umm thanks! Then the food...read great things about the not-your-typical calamari...should have been called Celery& Peppers salad, as it was flavorful it was about 1/8 calamari and 7/8 celery and peppers. Paid $10 for a chopped up piece of celery. Got the swordfish which was very good but a tiny piece and asked for salad instead of the carbs and my salad had to be sitting in a half cup of dressing and husband's pasta was more heavy cream then pasta. No dessert as there was never an offer just a check delivered. So disappointed Totally bummed as the vibe/decor and menu options makes me want to go back, and recommend to others, but not sure I want to waste another $100 to be treated poorly and leave feeling like I want to go eat somewhere else now. On another note the Valet guy was super nice and it's complimentary!"], ["Lizz W.", "Hmm Roslina is great! Cute little place located right in downtown. I am not crazy red-sauce lover but there's is amazing. The eggplant parm app, bomb digggity. Cool cocktails, laid back environment and decent service. I like it. I'd go back anytime."], ["Tyler R.", "I stumbled upon this place based on a recommendation from a friend. Comfortable atmosphere with a \"you're family\" style of service. I sat at the bar where you get a great view of the kitchen. I came in pretty late so I went with a liquid dessert (some delicious port). I'll definitely be back!"], ["Gabriel O.", "Awhile back, I went out to dinner with my sister. We were in the mood for Italian, and Rosalina caught our interest. Neither of us had been before, and neither of us left disappointed. In fact, as if to prove that point, When I brought my girlfriend to Rosalina for her birthday last weekend, by sheer coincidence my sister had made a reservation with her significant other as well! What both of us learned from our first visit however, was to make reservations. Seriously, this place is what I think some people would call \"poppin.\" While Rosalina isn't exceedingly small, they are small enough, and they are popular. So call ahead. The menu can seem a little lengthy, but in that length there is variety. On my last visit my girlfriend and I split the Fried Dough Pizza appetizer. It was larger than I expected, but it was delicious. I would recommend it if you are looking for a quick lunch, or as something to split with your party. The entrees are well proportioned and equally delicious. I've had the Ravioli and the Gnocci. Both were great, the Gnocci comes out on a griddle with plenty of melted cheese. Personally I think think the Ravioli are a better dish. They are packed with flavorful cheeses and paired with a pair of fresh meatballs. Each table receives a basket of bread with cheese and olive oil, prior to every meal. The bread itself was a little too crusty in my experience but is still good. The olive oil is sourced from a greek garden of family affiliation. I'm not a fan of it unfortunately, but that's strictly my opinion. I am a huge fan of the spreadable cheese from Narraganset Creamery however. It's like the incarnate of fluffy, buttery, cheesy delight. The cocktails are refreshing and pretty creative. They have plenty of sweet fruity drinks, but also have a few whiskey based cocktails, which I always appreciate. On my last visit I had something that was pretty close to a bourbon sangria. (I can't presently recall the name.) I will probably try something else next time, but it was well worth the 9 dollars. The cocktails are also consistently priced I believe. Beyond their cocktail menu they also have a good wine and beer selection, and if you're checking in on Yelp you can take advantage of that!The decor is nice; I like Rosalina's branding, for one, but the seating is modern and comfortable, and the walls are adorned with large paintings, that don't call too much attention to themselves but are appealing to take in. The one thing I really missed is their desserts, which are apparently quite good. I'll definitely return on that point and update my review accordingly. Rosalina is a nice spot, and I think it's a great addition to downtown Providence."], ["Bianca B.", "The Pizzette Frite is out of this world!"], ["Karen M.", "Have you ever wondered what it would taste like if you took chocolate cream of wheat, made it thick like a custard, spiked it with a smidge of cayenne pepper, then flambéed it like crème brûlée? Two answers:1) Like the Polenta Brûlée at Rosalina2) As awesome as it soundsEntrée was really good too --I had the cheese ravioli with meatballs, yum -- but honestly that dessert so thoroughly blew my mind, I barely remember the rest of the meal. (Though I do remember the free glass of wine I got for Checking In on Yelp!)Just go here. Trust me. (And order the polenta brûlée!)"], ["Collin C.", "Food was mediocre. Pork chop was burnt and bland."], ["Donna K.", "After getting rush tickets to PPAC last night, my daughter and I went searching for a place nearby to eat.  As we didn't have reservations (not knowing we would be able to get tickets to the show) we set out for a restaurant that we had seen last month on a recent trip to PPAC that looked interesting.  Alas, we couldn't get in there or even sit at the bar, so we left and walked a little further and came upon Rosalina.  As we both enjoy Italian food, we went in, checked the menu, and were offered seats at the bar which offers full food service.  That was fine with us as we only had about an hour.      It was a great thing that we landed at Rosalina!!  My daughter had the Ravioli with meatballs and said it was the best she ever had!  BTW, she is a very fussy eater, even at 26, lol.  I asked for just pasta and meatballs which is not on the menu, and the bartender (Zac, I believe) was quick to assure me that it could be done.  It was delicious as well!  After initially choosing not to order drinks, we changed our minds and I got a great pumpkin ale on draft and she got a glass of wine. Prices were extremely reasonable and the only disappointment I have is in reading the reviews here today, we missed out on the delicious bread and dipping oil that people are raving about!  But, as we go to PPAC quite frequently, we will sure to come back, make an advance reservation, and sample it then!!  Overall, a terrific experience!"], ["Jennifer D.", "Very good Italian food.  Cozy atmosphere.  Great to meet for drinks and apps.  The wedge salad is delish!!!  Can be a little on the pricey side, but worth it."], ["Liz M.", "Amazing!!!  If you're in Providence this is the best restaurant!  Lauren, the owner, has a \"gem\" in the city!  Everything we ordered was fresh, homemade, and incredible!  From the salads to the Dessert - nothing disappointed!   Don't miss out!"], ["Brian M.", "Excellent food and wait staff. Mary, our server, had great recommendations. Had the antipasto which was great. Wife had the Greek salad and then the ravioli. I had the seafood stew and the sauce was out of this world."], ["Brent R.", "Rosalina is a great addition to downtown Providence. You can order a bottle, a glass or a container that has about 2 glasses in it. Perfect for sharing or for yourself. The food is always tasty, although I am not  a huge pasta fan. It's a great place for a mixed drink, too, especially when the weather is nice out."], ["Brian G.", "What a great addition this is to the Downcity restaurant scene! Rosalina cooks up fresh, delicious and authentic Italian cuisine. Cozy seating outdoors, and a vibrant restaurant scene inside, too. Love the complimentary ricotta cheese and olive oil with the bread. DO: order the meatballs and ravioli - to die for! DONT: make a decision not to come here!"], ["Lizzie W.", "One of the best meals I have had to date.  The service was excellent and the food to die for.  I had tried the fusilli with shrimp, the asparagus salad, and the avocado salad (which comes with insanely delicious crostini ).  Their bread is also incredible - served warm with light cheese and olive oil- and the waitress didn't hesitate to bring us more upon request. I will definitely be coming back."], ["James Y.", "Nice atmosphere and a beautiful bar. Enjoyed the eggplant parm. The serving was quite large easily enough for dinner. Tried the wine from the tap.  Not bad."], ["Bread Man S.", "A very nice place, good food, happening and good service..1- We were there on a Friday night and I have to say, the food was great, we order the Seabass and the Egg Plant Parm, as well as steak and everything was awesome. 2- Lauren and Tom (The Owner) doing a wonderful job in a highly competitive environment and especially in Providence, RI where we have many great choices. Well done. 3- Kayla the Hostess could not be any nice about keeping our reservations, even when we arrived a bit late, she made sure we got a great table4- They have Valet service which is nice in Providence given all the snow and cold weather5- Kayla made sure my flowers delivery was set on the table. Wow. She also made sure our car was ready when we left - amazing. You can't teach this..6- Its a happening place, everyone want to be there. Thank you for a nice dinner. Back soon. B"], ["Richard P.", "When you hear great Italian restaurants in Providence, you immediately think Federal Hill. However, Rosalina is a great addition to the downtown food scene. Rosalina has food that is just as good, if not better to the Hill. The Pizzette Frite is a must for your appetizer. It will be one of the best things you will ever try (not just saying that, it's truly amazing)! The prices are reasonable, the meals are delicious and incredibly tasty, and the ambience is inviting and family-oriented. If you are a RI'er and looking for a new Italian restaurant, Rosalina is for you!"], ["Kelly B.", "We  occasionally go to Rosalina's and I don't know why we don't go more often.  It has a great, relaxed vibe about it and everyone is friendly and ready to please.  The food is consistantly good and the menu changes often.  I love the bolognese and the eggplant is lovely, thinly sliced and perfectly cooked.  Their sauce is light and perfect on everything.Try the fried dough appetizer, hits the spot every time!"], ["Jean F.", "I went back recently and had the ravioli and meatballs - let me tell you, those were the best damn meatballs I've had in a while!   MMMmmmmmHHHMMMmmm"], ["Vicki L.", "I would certainly go here again. Wonderfully drinks, great food done exceptionally well. Went on a Thursday, no reservations for a party of three. We're seated right away. The oysters could have been colder but they were great small bellies. I got the veal parm, yummy! And topped it off with the Nutella ice cream and espresso martini. My mouth is watering just writing about this place!"], ["Matt S.", "I wish I had time to sit down here and eat, but I work in an office around the corner so I get takeout from Rosalina whenever the overtime gets handed out.  Squid ink pasta sounds like a horror movie but it's pretty good sand the hot pepper flakes.  Also love the gigantic Ravioli and quite possibly the best sauce I've ever had. Going to try the steak tonight!"], ["Ashley M.", "This is a great spot! We took friends from out of town and were so happy we did. You can taste the authenticity and freshness in every bite of food. We started with the shrimp appetizer and it was delicious. Beware it does have a bit of a kick to it but not too much. Our friends had the dough ball and it was awesome. It is a very heavy appetizer though so make sure you share. For mains I had the gnocchi and it was soft, pillowy and full of flavor. The rest of the table had ravioli with meatballs and devoured it. We will definitely be back!"], ["Doro R.", "A refreshing new addition to Providence! I came for a private event therefore the fare I sampled was what was offered.  My first impression was that a lot of the options were vegetarian friendly.  Although not logical, this is almost never the case at Italian restaurants.  Vegetarians typically have 3 options: spaghetti with marinara, eggplant parm, cheese ravioli.  I could see just from the limited items presented that this place would be a dream for a vegetarian looking to eat at an Italian style restaurant. Of the 10+ items available for sampling only one or two were meat dishes.  I reviewed the photo another Yelper posted of the regular menu and saw that there is even a vegan \"steak\" option.  Wow!  I'm so impressed.  I'm not a vegetarian, but know far too many for me not to take note and add this place to my rotation of places to take out of town guests.  I also sampled a few specialty cocktails.  These were great!  The bartenders were able to keep their cool and stay very attentive during the madness of the event.  It was clear that the bartenders were as quality as the ingredients.  I'm excited to head back with friends."], ["Paddy C.", "I would give them 5 stars but their cocktails are not that great.The antipasto and Italian Wedge are amazing as is the swordfish entree. My fiancé has had their veal specials both times we have been here and enjoyed both."], ["Chris C.", "This place took over the space where the long-running and beloved Cuban Revolution was in Downcity. The space is appealingly modern and comfortable.After our party of 5 waited 30 mins then had to ask for WATER, a waiter never came after that.  We had to get up and ask AGAIN for service, and finally got drinks and food ordered after 40 minutes of sitting there.As for the food.... first, they were out of about 4 things on the menu, which means they aren't managing supplies properly.  While the Bolognese was quite good (though I have a feeling the pasta was NOT home-made, which is sad!) , the corn panzanella salad was a big bowl of corn (with silk in it), a few cherry tomatoes and crutons and little dressing. (I wouldn't have served that at home.) We also shared the cauliflower with raisins and feta app, which just don't work, with too much vinegar and just an odd taste.The kitchen obviously doesn't have it together with wildly varying quality, inconsistant levels of \"tastiness\", and poor ingredient management.Very unimpressed overall, and unfortunately, probably wouldn't come back with so many other good food options in PVD.(We did get our drinks comped for the ridiculously long wait.)Comped 5 drinks for long wait"], ["Shannon F.", "Oh. My.  God.  ohmygodohmygodohmygod.  I would like to start by saying that it was not my fault that it took us that long to come back.  I have been trying to come here what seems like forever.  I will after this be trying to come back for another very long time.  I had tried the famous eggplant crostini at their yelp party, and we vowed we would come back for it.  As soon as we sat down bread was offered to us.  I refused to eat the bread based on the fact that my eggplant was coming.  Refused I say!  Even when my friends told me how delicious the bread was. \"No!\"  I said.  \"my eggplant is coming, stop tempting me with your evil ways and your bread!\".  Well, I think I said something similar.  It might have come out as \"No thank you, waiting for my eggplant.\".  Anyways, aside from the most perfect dish in the world, we also got stuffed shells.  I have to say that I was not as impressed with the shells.  There was only 4 small shells to a plate, and mine was hardly edible.  It's one of the facts of life that when you put pasta in the oven and you don't cover it with sauce, that the pasta gets hard.  And that's what happened to my piece.  The more I tried to saw through my shell the more the filling inside spilled out. The rest I hear were fine.  I will say the one ever so small thing about my eggplant crostini (mind you, I call it mine-there were other people eating it) was the Narragansett creamery ricotta side was too small.  Also, I feel like we could have gotten more bread.  Out waitress Deeanne was great, very pleasant, and even though she was completely crazy busy, you couldn't tell.  Totally worth every dime you spend here, I can't wait to come back to try some entrees."], ["Adriana P.", "My boyfriend and I ate here for the first time tonight before going to a show at the PPAC. We sat at the bar and the bartenders were very friendly. We had an incredible meal and an overall great experience! Don't let the size of the restaurant turn you off!"], ["Nic Y.", "Great option for dinner, reasonably priced and great flavor. We had the gnocchi, bolognese, and ravioli, all awesome. Definitely get the dough and sauce appetizer. We are here for a week and probably will be back before the week is over."], ["Katy S.", "This is top-notch italian food, and in my opinion better than most of the places you find on Federal Hill. I got the bolognese, which normally is a dish that doesn't impress me too much. Well this was the best bolognese I'd ever had- they must make the pasta by hand, because it tasted fantastic and had just the right amount of chew. I would order it again. My boyfriend got the squid ink pasta and loved it. Our only complaint was the the service was lacking and not at all friendly, which doesn't match well with the quality or price of the food. We sat at the bar and next time will try to make a reservation so we can get a table and (hopefully) enjoy better service."], ["Yorlys G.", "Found this place on yelp.... And after seeing the reviews I decided to take my brother for his birthday lunch. All I can say is wow !!! From the service to the food everything was incredible :) they were so accommodating they even let us order from the dinner menu even though it was only 1."], ["R. R.", "I truly wanted to like this place. The waitress (owner's mother) was the sweetest woman and did a great job with our party. Out of the 6 of us, I believe only 2 people were somewhat satisfied with their dish. The food was either bland or overdone with flavor. My boyfriend has the pork chop, which had a very strange flavor to it. The peppers on it were delicious, but the pork had an odd sour taste to it. My father in law had the lamb chop. He complained about the texture being too tough and hard to chew, which should not happen with lamb. He is a pretty good cook himself, so we feel that his opinion is credible. I had a pasta dish, which I do not remember the name of. It had zucchini and parm cheese. It was pretty bland. My brother in law had a fish, which he liked very much. My sister in law and mother in law had the bolognese which was average at best.   I'm not sure if I would give this place another try just because I feel that it was also expensive for the quality of food."]], "Tel Aviv Bar & Tapas": [], "Circe Restaurant & Bar": [], "Capri": [], "Andreas Restaurant": [], "Opa The Phoenician": [], "Kartabar": [], "Providence Byblos": [], "Mediterranean Cafe N' Pizza": [], "East Side Pockets": [], "Skewers Restaurant": [], "North Side Pockets": []}