{"Toro Restaurant": [["Aly I.", "After seeing all the good reviews, my boyfriend and I decided to check out Toro - overall, it's very good! We ordered a soup to start, which was delicious. For our main meals I ordered the ground beef burrito (excellent) and my boyfriend got the rooarroz con pollo. He was expecting it to be a little different, as they prepare it in a different then other restaurants we've gone too, but it wasn't bad. A little too much sauce for his taste.We will definitely come back again though! The staff was very attentive and friendly."], ["Meghan D.", "Went there with a groupon not knowing how quaint a restaurant it is. Service was superior (waitress was so pleasant and friendly). The lamb dish that was delicious and the steak chimchurri  was so tender. The drinks were excellent. Looking forward to the seafood nights."], ["Help Y.", "Ambience. Decorated in colors & decor typical of a Mexican rest'rant fare, ya know with the cactus and all on the walls...Not to mention they played classic rock. Must be a Tuesday night thing.  Salsa (complimentary) had a ketchup based after taste to it served w/generic tortilla chips. Sangria-Margarita. Was ok...o_O could use a lil more tequila taste to it, seemed like I was drinking punch despite it being mixed w/sangria tho. Veggie Chimi & Beef Enchilada w/mole sauce served w/yellow&black beans, guac & sour cream. It's alright w/ japenlo sauce...Server was helpful at least."], ["Sean K.", "If it wasn't for the very friendly and attentive bartender/waiter I'd be giving Toro 1 star.  But he was very nice and went out of his way to make sure he took our order quickly, checked on how we were doing, and brought us the check as soon as we asked for it.However, the complimentary chips and salsa are completely lack-luster.  The salsa tasted like they just took crushed tomatoes out of a can and added some herbs to it.  Horrible aftertaste.  The appetizer that we got was just ok, but everything on the menu seemed a bit overpriced.  Including the drinks, which were about 2 bucks too expensive each.  Bottom line, after the tip we spent 37 bucks on 2 drinks and an appetizer.  When we go to El Rancho Grande we spend 37 bucks on 2 drinks EACH, an appetizer or two, and two entrees.  Not to mention the food isn't even in the same league.  I won't be going here again."], ["Susie B.", "First time in my life I went to The Hill and it wasn't for Italian! My boyfriend and I love to frequent Mexican places so we found this one on Yelp. Very clean, staff very friendly. The best salsa I ever had! Very fresh ingredients with the right amount of spicy kick!  The first time I ever asked for a second bowl of salsa! I had the combo plate of chicken chimichanga and pork tamale. Perfectly cooked and the tamale was authentic. My boyfriend had the special steak with a jalapeño sauce and grilled shrimp and this wicked awesome green rice! Again, all perfectly cooked!I gave it 4 stars due to the retried beans and regular rice were nothing special. Beans were watery and rice very plain and small portioned. And, I wish they had more of an extensive menu regarding authentic dishes. However, we would go back and recommend."], ["Janardhan C.", "Absolutely amazing!! New place.. Friendly staff.. Excellent combinations .. I came in with high expectations as it had a  5 on 5. They delivered and lived upto the rating..This is a must try.."], ["Rebecca V.", "This place is fine, but no where near as good -- or as affordable -- as other options, including El Rancho Grande in Olneyville and even Viva Mexico downtown."], ["Gloria J.", "Went there last night with a friend.  So needless to say was excited based on all the great reviews.Sadly was extremely disappointed.  First we ordered the Toro sangria, which was highly recommended by the waitress.  It had a really strange taste to it...not terrible but weird.For dinner my friend had a chicken quesadillia, which she said was very bland.I had a chimichanga with rice and beans.  The chimichanga, was average at best...got a little soggy half way thru it.  The rice had a weird seasoning I could not place, it was not good.   And it turns out the beans were actually refried beans that tasted like cardboard.Disappointed. :("], ["Mike W.", "Great food & drinks. The gentleman behind the bar is a great bartender very friendly. It's a nice family restaurant. I love the taco chicken salad and the Margaritas"], ["Nicole A.", "My man and I went to Toro for Taco Tuesday ($1 tacos) tonight and were totally underwhelmed. The owner seems like a super friendly and passionate guy, so it pains me to say unfavorable things about his restaurant, but I am going to go ahead and say them because I Yelp the truth.The \"famous\" sangria was so terrible, I barely drank half the glass. We were the second of two tables in the dining room and they still managed to mess up our order of 4 tacos. The chips and salsa that were brought to the table when we sat down tasted as though they had been cooked in stale, old oil and the salsa tasted oddly sweet kind of like spaghetti sauce. The tacos themselves were pathetic, but it's hard to complain about a one dollar taco. They didn't really taste like anything. They were so bland that my man who never puts hot sauce on anything, added some to his \"meal\".I found it strange that there were sugar packets on the table, but we had to ask for hot sauce. I found it even more strange that our tacos had shredded cheese on them.The place was clean, but the ambiance was a little sterile. The lights were a little too bright to feel any sense of coziness, which it could use given the hard wood chairs and the tile floor. The owner was very friendly, but the waitress seemed to have more interest in standing behind the bar chatting up some locals than she did in giving any attention to her two tables. We were not offered glasses of water, we were kept waiting so long the owner ended up coming over and asking us if the waitress had taken our order yet (which clearly she hadn't since we still had our menus), we weren't given coasters or cocktail napkins with our drinks, we had to ask for hot sauce, and then we had to ask the owner for our check. None of these things are unforgivable, but they do add up to an underwhelming experience. We're really surprised that there are so many 5-star reviews here (and also on Facebook) for Toro. Between the lackluster service and the bland food, it is surprising they've been able to stay open this long. It also doesn't help that parking on Atwells Ave is kind of a nightmare, too. Sorry, Toro. We really wanted to like you, but I'm afraid you haven't given us any reason to come back."], ["Lucy R.", "Great cozy ethnic atmosphere set in the previous Blush lounge. Efficient courteous service with impeccable authentic Mexican food. I will definitely return soon!"], ["Robert S.", "Glad to finally review this place! Came here late one Tuesday night, among the last patrons in the place. I was surprised that the kitchen was even open, given that it was probably midnight at that point. I enjoy that there is a full bar in addition to the restaurant; however, I neglected to partake in any indigenous beverages that particular night. Although there was only one man working both the bar and the tables, I was immediately attended to. I received my complimentary chips and salsa (love me some complimentary), which were both superb; the salsa in particular is worth noting, both for its freshness, and perfect palette of tomato essence and spiciness.I ordered a bowl of pezole (the hominy soup oh-so-difficult to find on this coast), which turned out to be the red variety with pork (a green, tomatillo-based version exists as well). It was a bit lacking in salt for my personal preference, although I am a bit of a saline addict...so perhaps it was satisfactory for the average person. All in all, the flavor was definitely there, and it made for a nice appetizer.My main course was the burrito. You are given a variety of options for filling and sauce, which I am a huge fan of. I opted for the tomatillo sauce (again, a pretty rare find on this coast), with steak. The portions were quite large, and the taste was amazing. I haven't tasted this sort of authenticity in a burrito since being back on the West Coast... It's the closest I've had since moving here 5 or so years ago. The steak was literally cooked and seasoned to perfection.I know that amazing Italian joints dominate the Fed Hill scene, but if you ever have a craving for some south of the border, Toro is definitely worth stopping in for."], ["Andrew M.", "Great place to unwind, have a drink.. HUGE TVS!!!!  The Chicken Wings are the best in the state.. hands down"], ["Michael V.", "I am really conflicted rating this restaurant. The carne asada and salsa and chips were great but the rice and beans that accompanied it was very bland. The margarita was good but not great. So given that I would try it again."], ["Chad M.", "Soo good.. Had the steak chimi churri, medium rare... Everything was awesome, fresh chips and salsa.. Rice was delish. My friend had a burrito and i cant wait to go back to have that next.  If you like real good Mexican i suggest u try this. they keep their kitchen open late!!  Bartender was cool too. A++"], ["Blake B.", "Horrible had the cheese enchiladas and got food poisoning. I will never eat here again and recommend you to avoid it."], ["Ana C.", "Horrible service it was ridiculous and food was mediocre. This by no means close to a Mexican restaurant"], ["Nathan C.", "I've lived on the hill for a couple years now and Toro is undoubtably the most well rounded Mexican restaurant for the area. The bartenders were prompt, the food was great and most importantly it was a comfortable atmosphere. I would recommend this to anyone looking for a good Mexican dinner"], ["Trevor F.", "My wife and I came to this restaurant bc of good reviews, and we could certainly agree with ppl. The food was excellent! Tasty, and very authentic Mexican flavor! The staff was very friendly and attentive, the deco of the restaurant is just great, if u want to experience a real Mexican place with authentic tasteIi would definitely recommend it!! And the price is great too..."], ["John S.", "One word \"Steak Chimichurri\" ok that's two words but it's fantastic here!! Everything we ordered was fresh and excellently prepared."]], "Tortilla Flats": [["Suzanne G.", "We decided to try Tortilla Flats after driving by recently and reading about it in a local Foodie magazine.  I called to make a reservation but they only accept them for parties of six or more; kind of a bummer, I am a real fan of reservations, especially if they can be made on line.  We decided to head over early so we wouldn't have an issue being seated.  Neighborhood parking was easy which was a plus.  We arrived at 5:30 on a Sunday evening and were seated right away.  Pretty cool atmosphere; very good vibe walking in.  The restaurant was very clean as were the restrooms.  The booths were wooden and fit the decor nicely but weren't the most comfortable.  Our waitress wasn't the friendliest; she later told us she had bad allergies, so maybe she was having a bad day.  We ordered the Gringo nachos which were excellent!  We had the chilli served on the side which was a great choice because the chips stayed light and crispy.  I had the combination plate with one pork enchilada and one beef tamale.  My bf ordered a chicken tamale and a chicken taco.  We both agreed the tamale was yummy but very heavy.  My enchilada was so delicious! The rice and beans that came w the combo plate were also very good.  The bill was very reasonable; I was a little annoyed that I was charged $1.75 for soda water; it wasn't bottled, it was from the soda hose; seemed like an odd charge.  We were both happy with our experience and will be back next time we are craving Mexican."], ["Jennifer D.", "My boyfriend and I have 5 kids at home, so getting a sitter for a night out is kind of a big deal. We walk in and are greeted by a paper sign reading \"Please wait for table\". I didn't know I'd have to wait 10 minutes to be greeted by a person. A party of 4 came and I had to remind the host/ess that we hadn't yet been greeted. We're told 25 minutes max. Seems reasonable so we wait it out.Several other people come in after us,  but once they start getting seated before us I speak up. \"I already called your name\" s/he says. \"Yes, but I had to remind you that you forgot to seat the only other couple that had been waiting longer than us first.\" We were seated (nearly 45 minutes later) with an eye roll.We sat at the table for 10 more minutes and were not even greeted by anyone. I'm livid. An hour of babysitting money down the drain, and we're left to decide whether or not to stay or go...I knew that if even one thing went wrong at that point I'd be beyond the point of enjoying my night with my guy sans kiddos. And their track record of sheisty service thus far didnt leave me with much hope. I explained my disgust with the whole experience to some apparent manager and left.Now we're eating some yummy wings over providence. Good night."], ["Tracey Lynn N.", "Don't let my \"stars\" choice get the best of you...I LOVE THE FLATS! I've learned to accept their flaws and will always continue to patronize and crave it as often as possible.The food is yummy and I think the prices are alright for the neighborhood and portion size. I'd be bummed out if someone broke into their kitchen to tell me they weren't using top quality foods, but it seems fair. Guacamole is one of the best around and the Sangria is delicious and deadly. What sucks you ask? Service. It's rushed. I know there's a line out the door nearly every night and you're into \"burning and turning\" for tips and profit, but a little friendliness and personal attention goes far. So far, I'll never sit at a table there again. (Also, a little bummed out they no longer have a lunch menu.)"], ["Gerald N.", "3.5 stars for lots of food but very salty. I was dying of thirst after coming here. We came on a Sat night and waited about 15-20 min for a table. Service was great. We got the chimichunga which could be shared by two people. It was packed with meat and delicious but just very salty. The rice that came along with it had a very unique taste which I did not really like. The cucumber salad it came with was pickled, ew. The chips and dip was delicious but salty. Overall, I'd try another place but I wouldn't resist coming back here."], ["Jennifer E.", "Flats, as my friends and I lovingly call it, has earned my extra star.  Why does it deserve this, you may ask? Well, first off, I have been finding myself at the bar there more and more.  Friendly service, decent tex mex, and yes, of course, the awesome margaritas have made my husband and I regulars over the years. Since my last review, I think the food here has grown on me since I've found a few items that are pretty damn good.  The garden quesadilla is filled with fresh veggies and is perfectly paired with their tasty cucumber salad.  I also really enjoy both their fish (catfish) and their shrimp tacos.  They are a bit pricier, but are very good.  If you want something a bit cheaper, their chili is a very good option.  It is paired with a buttery giant hunk of their house-made cornbread.  They have a rotating specials menu, including drinks (margaritas, mason jar cocktails, and frozen concoctions), apps, entrees and desserts.  I typically go with their awesomely strong margaritas (skinny on the rocks with salt is my usual go-to) but I've had an awesome frozen mojito recently that was pretty delish.  They also have a pretty good, but small, draft selection for the beer lover.  As I've mentioned in my previous review, it can get pretty busy on the weekends and evenings as it isn't far from Brown and their margaritas are pretty famous in the area.  I recommend grabbing a spot at the bar if you can, as their bartenders are super friendly and helpful.  The only experiences that I've had that I haven't enjoyed have been sitting in the dining area."], ["Chintan M.", "We had their Margarita pitcher, which was strong but not tasty."], ["Lyd M.", "I used to go here a lot back in the day for the margaritas. They are strong and there are a lot of fun flavor options. In fact, these margaritas are single-handedly the reason my now-husband and I got our start! Anyway.I've been in for meals here on a handful of occasions and the food isn't very good. It's edible if you happen to find yourself in the situation but definitely isn't anything I'd recommend. Flavors tend to be bland (either that or too salty) and the menu isn't very interesting.Final verdict: go in for a margarita (or 3) at the bar and maybe order the chips and salsa."], ["Brooke R.", "My favorite go to restaurant for Tex Mex. The drinks are super strong and you get lots of food. Remember don't shoot this place down because it's not true Mexican. It's a varied Tex Mex menu. It speaks for itself. Charging for chips and salsa is a little New York / Boca Raton, but what can you do? Everything is  awesome, including the service. Come at least once a week in the Fall/Winter  months."], ["Chris J.", "Good beer on draft and a nice variety of reasonably priced mix drinks. The service is pretty good as well. The food is pretty good and one of the best things about this spot is that they do a \"sampler plate\" of different Mexican food. You can pick and choose from the different options and get it all one plate for a decent price. I wish more Mexican places did this!"], ["Chris S.", "I have been going to this restaurant for over a quarter of a century! There is a reason that it has lasted that long. Great food great beverages great service. Last night I had their version of Mac and cheese, which was a healthy portion of penne pasta with lots of cheddar cheese and enough habanero and poblano peppers to give it a serious kick! The chicken, garlic and spinach balance it well.One caveat: the room is loud! If you're looking for a quiet setting this isn't it."], ["Barry N.", "Tortilla Flats: One tequila, two tequila, three tequila, floor...I sincerely believe that the above statement properly sums up the Tortilla Flats experience and no additional review is necessary. However, in the spirit of fairness and informing the reader about this popular Tex-Mex joint, I guess I'll carry on. ;)Anyways! Tortilla Flats is one of those places where things are truly hit-or-miss. There are a number of reasons for this, but it does deliver precisely what it promises.This restaurant is typically very busy. That's because it has got some prime real estate! Not only is it down the street from Brown University; it is also close to apartment living for many other local universities, including Johnson & Wales and RISD. This means college students with cash to blow, and also university faculty and staff who are very well-paid.All in walking distance from a restaurant that is too small to really support demand.That's one of the kickers about Tortilla Flats. It has a beautiful interior. I love the wooden benches and such. But because of the oversized seating, there isn't enough! You can sometimes wait forever to eat/drink here.....Which doesn't make all that much sense, considering that the only real perk to Tortilla Flats over any other Tex-Mex location is that it's in stumbling distance for people with cash flow.So yeah, Tortilla Flats can get pretty darn crowded. That's fine and all. I can deal with a packed bar. But I don't go to a Tex-Mex place to just drink; if I really wanted tequila, I'd go pretty much anywhere and have a marg. The whole point is to go and enjoy the food!Unfortunately... the food isn't really all that stellar. The rice and beans are as plain as can be, which works and yet also isn't a real reason to order the Mezclar Combinar (combo plate) other than the fact that it's cheaper than purchasing the individual items.The enchiladas are pretty good, but a lot of their meat is dry. The veggie option is more of the same bland rice and beans. So either way, the filling inside your enchilada, or tamale, or taco is going to be tough to chew. Bummer!Their nachos are plenty to share and could pretty much make a meal for two or three. They've got some good nachos!Margaritas are delicious, a good price, a bit strong, and come in pitchers for larger parties.All in all, it's a two-star restaurant, but a good place to bring a large group of friends. The waitstaff are very friendly as well."], ["Kris D.", "Should have posted a fabulous review long ago. Starting off with service, if her name is Jade you hit the jackpot! I want her at every restaurant I visit. Please clone yourself, hopefully she's invested in some way & won't leave. I don't need to give details of how amazing she is, please just take my word.My favorite is the Baja catfish tacos! The guacamole & chips, salsa - half hot half mild, black bean salad, harvest veggie burrito all are smart, a simple taco salad, cactus flower.. delicious and fresh choices. Margaritas to please! Parking is not the easiest when it's busy all on street but waiting is usually quick. The bar is huge! I also like the tables near the back against the windows for optimal viewing. This is a popular, fun happening place be prepared. (Not a fan of the pizza place next door the people were very nasty and rude to me once.)"], ["Lisa D.", "I have driven past Tortilla Flats for more than 20 years and wondered what it was like inside.  Last week, I had my first meal there.The decor is cute.  I love the spool tables. The servers were very nice.  The food was meh.  The mole sauce tasted burned. They offered a cucumber salad instead of rice and then left it under a salamander so that the cucumbers were all wilted and sweaty... meh.  I'd go back for drinks, but would probably leave the food."], ["Scott V.", "I must start by saying the nachos are very good. The toppings are served on the side so that the chips don't get suggy. Must of the other food is ok . Dumpy kind of bar atmosphere but good. I usually get the fajitas last time tried the may an tacos. I think I will stick with fajitas."], ["Monika N.", "Awesome neighborhood spot for a kick ass margarita and tex-mex food. I've been coming here for years and I love it every time. It gets crowded but the booths are roomy. Decent beer selection, nothing fancy. But the margaritas, especially the house one ($6!!!) will knock you on your ass! The BBQ chicken nachos are amazing. Good enchiladas, too. And options and ways to veggie out and veganize the dishes. Good burgers and sandwiches, yummy fries. An awesome veggie burger. The salsa comes mild, mixed, and hot, and the hot is HOT!!!! Amazing apps, buffalo chicken, waffle fries, chips, everything. Just come, just come!!"], ["Aaron S.", "I always enjoy an occasional visit to Tortilla Flats.There is a good draft selection (bring back Red Hook ESB for the winter please) and yes the pint glass margarita with a float of mezcal described in another review ;)My latest visit had me sampling a jalapeño margarita that was really heavy-handed on the jalapeño.  Yikes!  Chugging a pint of whiskey in 3 seconds would have hurt much less.  This one was not a hit for me; I was happier with my Dos Equis.But here's the thing - most of the food offerings are pretty solid from standard Tex-Mex to some Cajun and Louisiana-style offerings.  My favorites are the chips and salsa (a little pickled and a little sweet) and any of the fajitas, especially the salmon.There are nice little extras like the cucumber salad that you get on the side with some entrées.For me 3.5 stars would be about right and I will continue to return on occasion to continue sampling."], ["Monica B.", "Dear Tortilla Flats, please get better ventilation. The fajita smoke wafting from the kitchen choked up a young member of our party and she needed to leave lest she have an asthma attack.Salsa was good, chips also were addictive, wish they had a bit of salt. Yes, the Flats margarita is worth it. Hit me hard and fast.The food was better than I remember it from years past. Lots of the members in our party enjoyed their plates. However, I must say that parts of my pulled pork were cold, which was disappointing.   Overall, a pleasant experience."], ["Jim L.", "The incredible burrito is incredible! Atmosphere and bar is fantastic!! My three other guests loved their dishes. I can't wait to introduce my other friends to this place!"], ["Z B.", "Food is awesome, except some salt is need on some entrees. Cucumber jalapeño cocktail is incredible, a pitcher of this drink is penny wiser. Great atmosphere and moderate service. Eye candy is often not too bad either"], ["Tish B.", "Quick weekend lunch ended up at Tortilla Flats (tortillaflatsri.com), one of the few good Mexican food in Rhode Island. Started off with the Buffalo Chicken Nachos, made with homemade fries covered in shredded Chicken, Buffalo Sauce, Blue Cheese and Shredded Cheese. A delicious starter, or enough to be a meal. These delicious nachos were followed by the meal, my meal was the Slider Trio. Which included a Buffalo Chicken Slider, Pulled Pork Slider, and Traditional Cheese Burger Slider. A little bit of everything, this was a wonderful sampler plate. I have to say the Cheese Burger slider was the best of the three, followed closely by Pulled Pork Slider The Buffalo Chicken Slider was average and had a hard time competing after the Buffalo Chicken Nachos. My lunch guest ordered a combo plate including an Enchilada and a Tamale, with sides of Rice and Beans. Everything had great flavor and the Tamale was cooked traditionally in the corn husk. Both topped with a delicious Enchilada sauce and plenty of cheese. A great place for Lunch or Dinner, this has been one of our lunch favorites for sometime now. Sadly we tend to get the same waitress every time, and time after time she is a miserable host with a rather disgusting attitude. When I go to a restaurant I look at the food first, that is the most important part, but the next thing is the wait staff. When you are greeted with a smile and the waiter or waitress happily waits on you, you pair this with good food and you have a great review. Sadly that's not the case here..  Luckily the food compensates for her reoccurring rudeness. Before leaving we saw a table order the desserts, while we just got a glimpse they looked phenomenal! We will be keeping this in mind when the sweet tooth strikes. The Fried Ice Cream was SCREAMING my name!!  hisandhersreviewspot.tum…"]], "Restaurant Mexico Garibaldi": [], "Panaderia Maya": [["Angela I.", "Despite the fact that this little bakery/restaurant/convenience store combo was originally listed as Mexican, one ought to note that it's actually Guatemalan, and holy smokes, it is it amazing.Panaderia Maya, or Maya Bakery, is a little hole in the wall across from Rising Sun Mills on Valley Street.  They sell traditional Guatemalan food advertised on the storefront, such as enchiladas and tamales, as well as desserts (the strawberry cake and the chocolate-covered bananas are out of this world).  Although the interior isn't fancy, you can sit down and eat your food, and the enchiladas, which entail a fried tortilla with a heaping scoop of meat and fresh vegetables, are only $1.50 each.  They're huge.  I stuffed my face for THREE DOLLARS.It should be noted that Panaderia Maya is cash only, but it doesn't matter, because all you have to do is scrounge up three bucks and you're set.  Four bucks and you can get yourself a tamarind soda.  Really, the best thing about Panaderia Maya is that it's across from my yoga studio, so if I ever feel like completely undoing the good deed I just did for my body, I can go cross the street and eat banana cake."], ["Fatima H.", "I love this bakery so much. Everything is good: the food, the bread, the cookies, and especially the cakes!"], ["Christopher F.", "Kind of run down on the outside and no 5 stars on the inside but they make tasty and cheap sandwhiches, taquitos, and have a lot of baked goods that I have not tried.Totally recommend it if you want something quick, cheap and solid quality."]], "What Cheer Tavern": [["Ryan K.", "I hear many people calling this place a Hipster bar.  I don't know whether I should e offended, or if I should take it as a compliment, because when I come here, I feel at home.My favorite part about this place is that it is one of the few places in RI that you can have Proclamation on tap.  While to some, that doesn't translate to anything, but they are the next big thing in beer for Rhode Island.  That being said, they also offer a lot of other gems that don't come across that often like Maine Beer Co, Founders, etc.The bar itself is a little small, but that's my draw.  The crowd isn't obnoxious, and the bar staff is super friendly.  I especially enjoy the random artifacts on the wall. I usually come here to drink, but the wings are definitely a great choice to keep yourself from getting too deep into a 10% or higher beer.  I've had the buffalo a few times (phenomenal) and the bacon wings, both great!I enjoy this bar, I just wish it were open all day, but that's probably what makes it great."], ["Chris J.", "Nice little beer bar!The bartenders and pleasant and attentive. They have a good amount of seating inside and out. Street parking is always easy to come by.The beer selection changes often and has a nice variety to it. My one issue is that the beers tend to be quite expensive and many are served in pretty small glassware if it is high alcohol (this is becoming more common elsewhere though). I would come more often if the beers were just a buck or so cheaper.The food though is pretty cheap and really excellent quality for the price. They make some really interesting and different items for a small beer bar. They do a variety of beer events as well. And since Track 84 closed they are one of the only spots that do so."], ["Hannah H.", "What cheer is the best! Awesome beer that is constantly rotating! A small food menu that always changes, with fresh and delicious options. I always feel welcome in this unpretentious environment. What more could you ask for?My only complaint is that when I went today they didn't have the mofo fries, which are out of this world. But the sweet potato tacos I got were awesome and the chips and salsa were super fresh and on point. I understand they need to switch it up and it gets me trying new and delicious things.I sadly moved to Boston and can't frequent this spot as much as I'd like, but it's my go to spot whenever I am in Providence."], ["Sarah C.", "All the craft beers in a perfectly cozy, divey, fun bar. I haven't tried the food but others have told me it's always good. The bartender was attentive, our drinks were delicious, and the atmosphere is fun. There is free parking along the street. A must for all craft beer lovers!"], ["Liz M.", "As a craft beer lover I'm so excited my friends introduced me to this place. If you drove by you'd be likely to miss it. This is a small place with LOTS of charm. Free street parking so that's always a plus. I have been there a few times on the weekend and have always been able to park no problem. The bartenders are attentive welcoming and friendly.  They are also knowledgable which comes in handy since they change the craft beer list all the time. If it's new they have it. If if hot they have it. If it's tough to find they have it. I always have had something new to try there. Speaking of beers the prices are very reasonable. I haven't eaten there yet but will have to since all the foodAround me looked Pretty amazing. If your looking for a casual place to get a great beer with attentive service this is a great option. Go check it out and take meWith you !"], ["Kendra N.", "Heard so much about this bar and finally went in.  If you enjoy craft beer then this is your place.  Fairly small inside but so welcoming!  The bartender (I believe was the owner) gave us so much information about the beers they offered and allowed us to try it before committing to a full glass.  The prices for beer were very reasonable and the atmosphere was a fun, friendly place.  They have numerous TVs so this would be a good spot to catch a game.  We decided to order some food and I can't believe the quality and amazing food they serve.  We were told that the menu is always changing so this night we ordered the homemade chips and guacamole and wings, they were both so flavorful, I wish we had room to try the tacos they had.  Go there with a big appetite because you could have a great dinner and beer, I can't wait to go back again.  I feel that this will be my new go to spot for wings and beer."], ["Colleen C.", "Wings. Beer. French Fries. More beer. I could stop there but I won't. This bar is my go to in PVD for craft beer and delicious naughty food! I am in love with the bacon wings and mofo fries. So hard to branch out and try other things when they are so amazing. I have also had some of the ramen dishes but those are seasonal and come on and off the menu. The rotating tap beers are also top notch and not just IPA's. I love just sitting at the bar and chatting with other patrons and the owner are just awesome. They have a patio for the summer but I usually just stick to my corner seat at the bar."], ["Cristin S.", "Great Beer! We also sampled all the food. The pig tails were especially interesting and came in a finger lickin' sauce. I like the pickled veg!"], ["Claire P.", "Such interesting exciting food for such a small place! Love their wings, great beer selection and wonderful staff."], ["José C.", "The selection of beers are excellent, but my true love is the food.  The chef, and co owner of the bar is the daughter of a chef.  Her ability to come up with a clever take on differing cuisine is impressive.  My only regret is that there is no take-out."], ["Dave L.", "Don't be fooled by the outside appearance, while it may be small and not stand out as much as other places in the area, it absolutely holds up food and drink wise. I had been a few times previously and always known the beer list here is phenomenal but decided to try the food last night for the first time. So glad I did. We ordered the Tijuana Street Fries and the Chili Lime wings. Both were very good. The fries were absolutely delicious as they had large pieces of pork with a green salsa and a couple of cheeses. It was so good I wanted more once we polished off the platter. The wings were tasty as well and cooked perfectly. Not too messy and nice and crispy. Having tried these items I am excited to return to try other menu options. Next time the Poutine will be a must!"], ["Ashley G.", "Great little hidden gem! Small menu but great food!!Tried the crab and bacon wontons and I was pleasantly surprised. Wings were full of meat, well cooked and not greasy or fatty! Tried the thai and bacon ones. Good choices! Nice little spot for a quick bite. Bartender was super nice and attentive. Will be back!"], ["Stephanie R.", "No Bud, Stella, Heineken.  Just freaking amazing craft beers.  Don't be deceived by how it looks on a drive by. If you are looking for great craft beers, go in.  Also, Thai Chili wings."], ["Ben S.", "Good peopleGreat vibeI'm late to the partyThis spot seems to be a popular joint, but without any scenester hogwash. I walked in solo on a Friday night -but I was neck deep in a conversation in under ten minutes, comparing excellent (and creative as all get-out!) menu offerings while bending elbows with good beers and friendly people. I'm about it.Bartending was capable, helpful, and...friendly!  Beer selection is moderate and local for the most part (RI/CT) plus some further-outs (eg Sculpin varieties as of this writing.  PS - there were two solid offers not listed, worth inquiring about when you're in, in case there's any secret goodness you need to be about). I grabbed various beers, each tasty...but the selection rotates, so I'll stay mum on the particulars except to say I was pleased. The food options were a shock for \"simple bar food,\" which I'd expected going in.  Nothing of the sort here.  Asian, El Salvadoran, and mash-up culinary options were essentially the only choice. I clocked in a shift with the San Miguel Street Fries, but could happily have gone seven other directions. I appreciated the options thoroughly, but here might be the only knock - while the selections were inspired, the offering was merely good, not great, and it was what I was told could be considered a start-here-to-dig-the-menu choice. No problem, just not sublime - and if I return and find better options, best believe I'll upgrade.Environmentally-speaking, the music was pretty boss between latter day punk, real garage, and some fine rock n' roll. (The mood was further enhanced by Providence College basketball giving Villanova a run on TV - though your results may vary). Conversation was lively without roaring. The patrons were having good times; the bartenders were having a good time. In short, the people?  Having a good time. Recommended."], ["Zared G.", "There's not many neighborhood bars that I want to venture in to, much less continuously make it a point to go to, in So. Providence. But What Cheer is seriously one of my most favoritest bars in the city.  Great beer and booze selections.  Super cool owners.  The food is really wonderful as well - the imaginative toppings on the hot dogs and fries. Oh, and the wings. A great sized patio.  Shoots, I wanna go there now.  Meet me over there in 20!"], ["Vilay S.", "Great beers, great people, and the food is unexpectedly the bomb. The only other place that seems remotely similar in funky loud food stylings is Red Fez. The tacos and nachos are spicy and so full of flavor. And the POUTINE. I crave it all the time, because where else can you get poutine?"], ["Stephanie K.", "Wow since my first review this place got 10x better. The craft beer is still awesome but whoever was cooking this sat night was spot on!Everything was cooked on point! The bacon wings were crispy with tons of bacon and plenty of meat. The moro fries were also crispy with lots of cheddar!"], ["Kyle S.", "Pretty safe to say What Cheer is my type of bar. Laid back vibe...check. Good craft beer selection...check. Interesting selection of bourbon / whiskey....check.This local spot isn't very big but it is very low key inside and they have a great selection of local craft beers both on draft and in bottles / cans. It seems like they are always rotating their selection on draft so I enjoy coming in and seeing something new to try.Also, I recently discovered how awesome their food is. While the menu is very simple, the food is eclectic and full of flavor. The mofo fries are a must try...the sriracha sauce and melted cheese on them was sooo good. And for a guy that isn't big into tofu, I absolutely devoured my bombay taco.The people working here have always been very friendly when I've stopped in and also seem quite knowledgeable when it comes to the different beers (and whiskeys). What Cheer is a great neighborhood pub that is certainly worth stopping by and checking out."], ["Josh W.", "I remember what used to be in this location. Do you remember? I'm so glad to have a business like this so close to my home. The owner and the staff are wonderful people, the beer selection is absolutely amazing, the food is absolutely to die for, and is locally sourced as possible. You can truly see the pride in all the work done there from the renovation to the products they serve to the way that they treat their customers. The menu is seasonal with some favorites kept on all the time but in the winter the addition of Pho and Ramen is absolutely amazing. You can really see pride in all the work that they do there. Last time I went I had the bacon hot wings and DT you want to street fries. The wings crispy not overly spicy and the little bits of bacon really shine through.The fries are hand cut and crispy pulled pork cilantro and cheese and a spicy pepper blend perfectly complement those hand cut fries. I can't wait to eat my way through all of the soups as well. I'll be seeing you guys again real soon and I'll bring great people back with me."], ["Kyle B.", "If you're looking for a welcoming staff, one of the best selections of TRUE craft beer and one of the most unique menus in New England...make it a point to stop in to What Cheer. The wings, the fries, the sandwiches, doesn't matter what you get...it's great & your palate will thank you later. The beer! The local brews, the out of state \"wow they have that\" brews and the ones you've never heard of but are glad you tried is exactly what makes this place worth the drive into providence. Do yourself a favor, get in here! (just not on Sundays)"], ["Jaki G.", "It's small and intimate with great beers on tap! I love just swinging by this place. About half the time I go here I can't find a seat though, maybe someday they will/can expand."], ["Joyce A.", "We enjoyed this bar! Very different because they have a limited menu. Bacon wings were good!  it's a very small place so i don't recommend going with a big group unless you arrive as soon as they open and you can save one of the tables."], ["Sam R.", "Great craft beer selection. Funny and friendly staff. Love that it's a small clean place with a beautiful patio out back that's large and fenced in. Very towny feeling; I've always been a fan of bars where you walk in and you know they're all locals who go there every other day. Love it."], ["La C.", "I should probably be ashamed of myself for taking so long to get a review up here.  This place is great. As a suffering grad student, I find this bar to be my weekly respite not just for the alcohol which rest assured is a massive bounty but truly because the food is off the charts amazing.  I live in North Providence where a bar like this would be shangri la and to be able to stop here on the way home and nosh on some truly unique eats is respecfully appreciated.  They have wontons, they have artisan tacos, poutine, sneaky hot dogs with a myriad of accotrements and korean street fare that will knock your socks off.  I swear the owners are totally screwing with their patrons because with all that good stuff on the menu I find myself hard-pressed not to create a fusion meal.  I bet they go in the back and say, did that girl realy just eat beef bulgogi with poutine?  Yes, she did.  Shame, shame. Alas, I did it and I don't regret it.  What I regret is that I get tired in class and sometimes I drive past the bar on my way home sometimes and fail to stop in.  Rather, I should drink a coffee and tough it out because thre isn't a chance in hell I've left the WCT without an innate sense of bliss and joy! If you have no idea what I'm talking about, trust me. Its amazing in every sense of the word how delish their food is.  Like I said, bountiful spread of booze but for me, the food is where its at!"], ["Jeff R.", "Very cool little neighborhood place with quality brews on tap.  They only have 10-12 taps, but they rotate frequently and they're usually pouring something new.  The food menu is small and looks interesting, but I haven't tried anything yet.  I wish I lived nearby because I would be Norm at the end of the bar.  Uh...maybe it's a good thing I don't live nearby..."], ["Chris W.", "Great little dive bar that surprised the heck out of me. Great selection of fresh local beers on DRAFT and food was amazing. So wild- from amazing carnitas to wings to ramen. Who would have known??"], ["Dee W.", "Great beer selection and awesome pub delights...a must go ! Thanks Liz McB. For introducing this place"], ["Jennifer E.", "What Cheer is exactly what I look for in a bar.  It has friendly staff, a fun vibe, and a great beer selection.I had read reviews for this joint previously, but never wandered out to that particular neighborhood.  I tend to stick around to a lot of bars in my own 'hood.  Luckily for me, i had an adventurous friend and we ventured out to check out this gem.  When we walked in, there was a handful of people hanging out at the bar.  The lovely bartender offered us a warm greeting and a review of the drafts that they had available.  One of the best aspects of What Cheer is that almost all of the beers are local, as in from RI.  I do believe that one of the selections was from MA, but I'll let that slide because of how amazing they were.  We were offered samples of any beer that piqued our interest.  I tried a couple and made my decision (Pretty Things stout).  We relaxed, chatted with some locals, perused the menu (a small list of your usual bar food items), and had a pretty awesome time.  I will definitely be back in the future to try some more local craft brews and possibily some of that tasty sounding chili."], ["Alma C.", "When I first came here, I was in the line of fire of an exploding tap that showered on me the clean crisp smell of locally sourced craft beer. Mixed with the aromas of awesome deep fried crispy Baffoni Farm bacon chicken wings, sweet potato fries with curry aeoli, and Goose Island Bourbon County stout seeping through my pores, I probably have never smelled better in my life.... Come to think of it, I'm really glad cannibals weren't around to sniff me out that night."], ["Courtney H.", "The only reason I am giving this bar two stars is based on the beer selections, which was nice. The service left much to be desired, including not having the food we ordered, the waitress just bringing us the check when we weren't ready, the bathroom running out of TP and finally another bartender cursing out my friend as we were leaving. The entire experience reminded me of a college bar where they try to get the patrons drunk and if you aren't drinking enough you get pushed out. I'm disappointed that my party would be pushed out because we had coordinated in advance and had a designated driver who was not drinking."], ["Lauren H.", "I love this place. They have great craft beers on tap, including local beers. The beers on tap change pretty frequently, so you can always try something new and interesting each time you visit.It's a neighborhood place - the staff makes an effort to learn your name, so after only a few times I get greeted with my name when I arrive or leave. The atmosphere isn't fancy, but they do have an outdoor space for the summer which is nice.Good (bar) food, too. I'd recommend the sweet potato fries and the poutine."], ["Ryan B.", "Not a great location and it's a tad small. The beer selection is decent with microbrews... but it's just lacking"], ["Richard K.", "I was fairly certain this was going to be a horrendous dive bar based on the neighborhood. Much to my surprise this was as sweet a hole in the wall you could find.  The beer selection is out of this world and the owner is incredibly personable. If you can manage to not be a dick you should have a pretty good time in this place. I  live on the East Bay so my visits will be infrequent but I WILL be returning.  Well done and Good luck guys!"], ["Andrew N.", "I had drinks with a friend at What Cheer Tavern today after work. I didn't know what to expect but had hopes that it would be good since there is such a lack of good bars on this side of town. The beer selection was excellent! Narragansett seasonal was the only crap beer on the menu. Everything else was from greats like Stone. They had an excellent Scotch Ale the name of which escapes me now. We also tried a few things from their food menu. The bacon wings were okay. I REALLY liked their kimchi deviled eggs. Good flavor there. Didn't quite mesh with my scotch ale but no big deal. The place is small and very clean. The thing that surprised me was how well lit it was. From the outside it looks like the kind of place you might go to hide, much like a cave. Not so. Definitely my favorite neighborhood bar to date. Dave the bartender (and maybe the owner) is very knowledgeable about his beers and local brewer's scene. He told me one of his distributors is in talks with Dogfish to maybe start selling in Rhode Island again!!!!!! Two thumbs up (two pints up anyway:)"], ["Andre B.", "What can I say, I came for the beer and left wanting more of their food. Self proclaimed beer geek in me drew myself to this new craft beer bar. They have a small local centric tap offering that is sure to please. I was initially drawn there for the Lagunitas Sucks! Imperial IPA. It was cold perfectly poured. Here's the good part. I ordered the Poutine special. Let me tell you it was out of this world. Fries were perfectly cooked with the cheese melting into that decadent gravy. Never expected that from a little corner bar. Then I ordered the sinfully good bacon chicken wings. Just a perfect level of heat and a hint of bacon goodness in the background. Keep doing what your doing. It takes a lot to impress me and you hit it out of the park."], ["David G.", "Having lived in Washington Park for ten years I've had to listen to my friends in other neighborhoods talk about walking over to The Avery, or down to the Wild Colonial, or even up to the Elmhurst Pub. Meanwhile, within walking distance of my house I had these options: McDonalds, Subway, and the Shell station. Oh, there was also a really crappy bar called the Acores Cafe, which I went to all of one time before my wife decided she was never setting foot in there again. I guess people screaming at the top of their lungs in Portuguese is not the nicest setting for a date night.Well, the Acores has been sold, and has reopened as What Cheer? Tavern, named after the famous greeting (\"What Cheer, Netop\") given to Roger Williams when he first came to Providence. What Cheer is an intimate space that specializes in local food and beer. The menu is small, simple, and locally sourced. The current beers on tap are Providence favorites Revival and Trinity, along with Newport Storm, Wachussett, Grey Sail and of course, Narragansett. Bottled beers are also available and generally fall into the New England craft beer milieu. Now, as nice as this sounds, it's still Washington Park so they do have $2 Narragansett Tallboys on Thursdays, and some domestic beer and cheap shot options as well. What Cheer Tavern has only been open for a few days, but so far it's drawing an eclectic crowd. You have some of the old neighborhood guys that used to come to Acores, college students from Johnson & Wales, professionals stopping in for a bite or a drink after work, some military folks, and people attracted to the locavore and craft beer vibe. All they need now is some hipsters and they'll win some sort of Providence Bingo.The space itself is cozy - probably holds 20 people comfortable with 30 being a tight fit. However, it has a really nice fenced in patio area that they plan to turn into a beer garden. Given the lack of outdoor seating at most bars and restaurants in Providence, I'm psyched to have such an amenity in my neighborhood. The owner seems nice and friendly. We talked for a bit while I was enjoying my Gansetts, and I always appreciate a bartender who takes the time to talk to a lone patron rather than just texting or cleaning and waiting until you need a refill. You can tell the place is still finding its feet. In some ways, I really like that. I like that it's not so busy that I can actually get to know the owner. I like that they draw an eclectic mix of people. I like that they're an unpretentious place serving craft beer and locally sourced food."], ["Eric W.", "Super tasty. Absorbed all the alcohol. And I just saw two rolls it toilet paper added to the bathroom."], ["A Z.", "The bacon wings were great, but I was an even bigger fan of their buffalo wings. They were probably some of the best in Providence if not THE best. I don't know what it was about them, they were just fantastic. And the bacon deviled eggs --- you won my heart!"], ["Wayne P.", "They have one of most consistently good selections of local craft beer around. If you are looking for a Ravenous Brewing Coffee Milk Stout, you will most likely find it here.The food and service is always great. Very knowledgeable staff when it comes to the beers. The food menu changes  periodically. But one warning the hot wings are SERIOUSLY hot, 3 levels reg/meduim/hot. I usually get hot to med other places. Medium was HOT. just saying. been several times and will continue to return. Oh and lastly street parking only."], ["Eric F.", "We saw that What Cheer was having their grand opening tonight and took a look at their website. Local Microbrews and good pub grub...so we had to check it out. We were pretty happy about what we found. This place used to be the Acores Cafe. My only experience with that place was calling the cops when I saw twenty people brawling in the streets outside the joint. What Cheer Tavern couldn't be further from that image. Great local beers on tap, friendly staff, kick ass blues cranking on the stereo, and several large HDTV's with football and soccer. We got to talk to the new owner quite a bit tonight. His mission is to bring great local beer on tap in a small comfortable environment. I am very pleased to see a place like this in the North Edgewood/ Washington Park area. Give this place a shot and I am sure that you will not be disappointed. I look forward to going back! WHAT CHEET!?!"]], "Don Jose Tequilas": [], "Tallulah's Taqueria": [["Olivia P.", "Fucking amazing. Gonna come here on the reg now. Holy shit. I am so happy got three tacos and a Yacht Club Diet Soda. Hailz yes. Flying out to Georgia tonight and I am literally sad that i will not be able to come here tomorrow and grab some tacos with my girlfriends. Cashier was so sweet and the churros were fucking amazing too. Everything was so good. Wish they had beer but i am also happy that they dont. I am scared that this place will become too much of a bar. People who come here literally come for the food. I am okay with that 100%."], ["Connie W.", "I remember seeing these guys at the Saturday Hope St Farmers Market, and enjoying a taco from their stand. Glad to see more options at the new store on Ives! I've tried both the barbacoa and carnitas tacos and enjoyed them both, barbacoa a little more - I shared with my twin and she complained that barbacoa had some parched charred bits but I must've skirted those and gotten the juicy fatty bits because I didn't think it was dry...I loved the thick sweet corn tortillas they were served in! And the delicious hot pink edged radish pickles on the side. I'm not crazy about their quesadillas only because they use the thick corn tortillas for that and I think quesadillas should be made with flour tortillas to let the filling take center stage. Just as I was leaving I saw a lady get a burrito bowl with a ton of lettuce and meat! I think she was onto something...next time I'm getting the burrito bowl with barbacoa. Maybe they will do half barbacoa and half carnitas??"], ["Glen W.", "Saw these guys at the Greenvale Vineyards Fall Festival on 11/8. Staff was wicked friendly and conversational. I had the carnitas and black bean tacos, both delicious. Nice balance of tangy sauce and full flavors made this a great, light snack. Get the bowl, you get more for the same price!"], ["Jamey B.", "I have technically managed to sample Tallulah's tasty fare twice now- the first at the cinco de mayo festival downtown and now in their new digs. They are under a soft opening right now. The yummy:- barbacoa- carnitas- beans (black)- tortillas- guac- everything elseThe \"meh\"- the space: they've done nothing to improve upon the interior of the last few incarnations of eateries at this location and I am again left wondering how they will survive the winter. A wrap around bar with lots of seating would not go amiss. - the price: $4.25, (4.50?) per taco (ok but not generous meat portions) and over $9 for a burrito is EXPENSIVE compared to the competition. The pricing would work better in a place with frills of some kind. If the weather is nice, definitely check this place out. They are for sure offering the best burritos on the east side."], ["Mario Francesco C.", "If you go to this place you can be sure of one thing: food is good. It is actually real food, not just cheap stuff that you generally get in fast food.I'm a fan of the burrito bowl and I order it once a week. I generally call 5/10 mins before and pick up the food. The service is very efficient.They also have Mexican sodas called Jarritos I have never had before, grapefruit is best."], ["Mallory S.", "Im updating my 4star review to a 5star. My husband and I just came back here for a second time and everything was great! We got chips and verde salsa...the chips had this great seasoning and the salsa was awesome. We also got soda and they have a little selection of specialty sodas- we tried the apple soda and it is soooo good! This is definitely our new favorite Mexican restaurant."], ["Tam G.", "This place is absolutely delicious, and I'm a tough food critic. Their fried shrimp taco is my personal favorite, but everything is good. They also have great vegetarian options (black beans, spicy potatoes). The food is fresh, flavorful and I love that they throw in some pickled radishes for acidity."], ["Rebecca O.", "Two words, burrito bowl. My own personal heaven. With meat selections ranging from basics like fish and chicken to barbacoa and carnitas, there is something for everyone. The food is amazing and the prices more reasonable than similar chains in the area. Tallulah's does Mexican the way it should be; vibrant and fresh!"], ["John F.", "Absolutely delicious. Best tacos/burritos available in the area by far. Make sure to get some green sauce with your order."], ["Katalyst S.", "Little place.  On a busy day there can be a wait for both food and seats.  They do have some outdoor seating: two benches, two big tables, and two small tables.  This place would be perfect if you lived nearby.Street parking works fine.  Usually when I drive by it isn't super packed.The draw to this place is the local ingredients.Good tacos.  Not great tacos.  Definitely good for Providence though.  I'm used to tacos like this with the double tortillas and a lot of meat.  I'm used to them being, on average, $2 a pop.   $4 for a taco is steeeeeeeeeeep.  Who stops at just one taco?  No one.$9 per person for 2 tacos is pretty intense.  Oddly, if the flavor had been what I was craving I would've come back here within two days, no doubt.  I probably would've given them a 5 star too, no question, despite the price. I'd be throwin' my money at them, basically, without qualms.So far I've yet to find a taco in Prov that's better than the ones I make in my kitchen.  I would love to stop cooking.  My impossible search continues...Service was super friendly! BYOB. *or buy it at the store one block down*In summary:For Prov the tacos were pretty good but you definitely pay for that."], ["Jessica S.", "I was here the other day for lunch. Good music, friendly staff, good tacos. A nice addition to the area. My fav were the shrimp tacos, would definitely return for those. I also liked the carne asada. The barbacoa taco was ok but needed more balance. I had to check to even see if they added the salsa and guacamole. It had enough meat in it but that's all I could taste. I do wish they offered flour tortillas as an option, like One More Taco does."], ["Nathan A.", "Here's my problem: I live within walking distance of this place. Already, I have been here a few times. And it is absolutely delicious. I guess it's not a problem for my stomach and taste buds, but a problem for my wallet. I may soon own stock in this place.Tacos, burritos, burrito bowls, tortas, and more. You can top each of these with carnitas, barbacoa, pollo, or simply ask for it vegan. Fresh ingredients, some of which they are growing on site. Burrito bowls include rice, lettuce, beans, protein of your choice, guacamole, pickled radishes of the gods, and this hot salsa of awesomeness. The burritos are wrapped in a tortilla that is crispy and sprinkled with a dash of salt that makes my taste buds, oh, so happy. Burritos come packed with rice, beans, guac, and a spicy salsa (it'll catch you off guard if you're not into spice). I'm a big fan of the carnitas. It's cooked perfectly, crispy on the outside, and flavored nicely. It's a small place with a few places to sit inside as well as a couple tables and benches outside. This is a great spot to pick up good food to go, walk over to India Point Park and enjoy a picnic. At certain times, the line can extend out the door. But, it's worth the wait and they serve you quickly. Some people may think the prices are steep. And, yes, it is a little pricy. However, I'm willing to pay a dollar or two more than a chain place like Chipotle to have incredible tacos, burritos, and fierce tasting food.I'll be a regular here...."], ["Jessica L.", "I have been holding off on heading into Tallulah's but that changed today. My aversion to Tallulah's was due to the price tag. $3.75 for a taco seemed a bit much. But I stopped in today and grabbed three of the carnitas tacos and hoped for the best. Just got them home and I'm pleasantly surprised. The meat was incredibly juicy and flavorful and piled high on this taco. Onions cilantro a little bit of guacamole and lime wedges round it out but the meat was definitely above par. Still seems a little pricy when I compare it to my personal fav but I also think there's more going into this taco. I'll be back for sure."], ["Joe C.", "Great Tacos, Steep Price TagFresh new place in Fox Point serving slammin Tacos.  The issue is that each taco is 5 bucks with tip.  You can easy eat 3 or 4 of these, which for 20 bucks is costly.  Ordered the the carnitas tacos and the barbacoa bowl.  Freaking delicious.  Great fresh taste, you know they use quality ingredients.  Grab yourself a yacht club soda and a few tacos and enjoy.  Just make sure to bring enough money in your wallet.  Thanks"], ["Karen V.", "I can't remember the last time I had this amazing of a breakfast burrito- I mean wow!! Amazingly delicious- very flavorful and so worth the money!!! Most definitely the best Mexican food in Providence!!!"], ["Kyle M.", "This place is great. Tullulah's is put in the middle of Fox Point on Ives, and replaced a BBQ joint that didn't last too long, however, Tullulah's is here to stay. Their menu is short and sweet and to the point. Gathering a collection of tacos, quesadillas, Tortas, and burritos, the menu here is unique and different from your typical \"Tex-Mex\" takeout. Although the place itself is small, there is outdoor seating in this quaint little neighborhood. I'm giving Tullulah's 4 stars because I think the tacos could be built up a bit more. Also, the wait time for seats and food can take a while because the place is small. Come here on a weekday and you'll be all set to enjoy some fresh Mexican food."], ["Meg M.", "So glad this place moved to the neighborhood! Such a great variety of tacos and all really fresh ingredients. Try one of the unique sodas they have. On the pricey side for small tacos but very worth it."], ["Justin J.", "Very good quality fresh food. I had the chicken burrito with carne Asada and it was the size of a small child. I've also had the fish tacos which are incredible. Highly recommended"], ["Alex D.", "Authentic and delicious I highly recommend ...It's expensive, but once you've tried it you won't even mind.great service and laid back atmosphere, BYOB!"], ["Rachael M.", "With my allergy to nightshades (peppers, tomatoes, etc) I am not able to eat anything at Tallulah's. However, my partner and many friends LOVE this place. We are a group of people who are food snobs. We only eat high quality foods, including pastured raised meats. Tallulah's uses some of the healthiest meat you can find in Rhode Island.I'll overcome my allergy and be able to try these authentic looking tacos someday!"]], "Letty's Cocina": [], "Chilangos": [["Bobby G.", "I finally made it to Chilangos after intending to make the trip for several months.  I had gone up with a couple of cousins back in August, but none of us were smart enough to check their hours and arrived on a Wednesday to a closed establishment.  Live and learn - I stopped in for a quick lunch last Friday with a friend on the way up toward Boston.I ordered the tacos and a michelada.  The michelada was refreshing and well spiced; the perfect beverage to wash down delicious traditional tacos.  There are apparently different meats available each day, so I have something to look forward to during future visits.  The meats I chose this time were steak, pork and fatty steak.  Each one was a flavor explosion and exactly what you would find on the streets in Mexico.  I'll happily make the drive up to Providence for Chilangos any day!"], ["Eric W.", "Cannot believe it has been over a year since my last visit. I love the new decor and vibe.  Oddly enough the old place reminded me of Puerto Vallarta, so does the new place. It must be the chips and guacamole."], ["Sharang D.", "One of the best authentic Mexican restaurants in Providence. From tacos to tamales, the food is exceptionally good. The service is great. The only thing I don't like at this restaurant is the water quality. It has a distinct smell and flavor (may be from the fridge it's kept in). Therefore, I always being my own water. P.s.: I love the tamales here.. Best in town!! :)Enjoy!!"], ["Maximillian S.", "Came here for a late-night date with my girlfriend last month. The parking is super sketchy without very good markings around the whole block, but we made it out alright.It's really a nice place to sit and eat. The staff is pretty young and attentive. It's a small little joint with sparse wall decorations.We ordered the queso which was surprisingly thick as we're more accustomed to thinner queso down south. It was pretty darn tasty, but the longer we were going at it, the thicker it became naturally. Still very, very good, but a little tough to work withI got the burrito done with pastor meat (pork done with pineapples). It was absolutely delicious, was a great size and filled me up.My absolute favorite was the horchatta. Took me straight back to my friend's Mexican place down in Austin, Texas.I've since gone and picked up food a few times from them and it took me more time to get there than for my food to be finished.Absolutely best place."], ["Jennifer H.", "I'll admit I was skeptical when Jen E. suggested Chilangos after the most recent Elite event. I wasn't crazy about the neighborhood (still am not), and I had never heard of the place (definitely changed for the better). But, I went along because my friend really wanted Mexican.This is one time you should jump off the bridge when all your friends do. I loved Chilangos, and I will dare to say that it is my favorite source of Rhode Island Mexican food to date.Yes, the neighborhood is totally sketchy. Yeah, the place is tiny and a little bit sketchy on first glance as well. But, the staff is incredibly friendly -- assuring us to take our time even though the kitchen closed at 9 p.m. (we placed our orders around 8:45) and they closed at 9:30 (we were there until 10).The classic margarita is solid and will leave you with a bit of a buzz. The food is amazing. Everything was fresh, well-seasoned, cooked properly and presented immaculately. I loved having black refried beans instead of the classic, and my enchilada verdes was so good I wanted a second portion (feel free to sub the meat with anything on the menu; they will happily oblige). Everyone left full and happy, and promising to return."], ["Rebecca V.", "Chilangos has gotten a huge makeover during the past year. The decor used to be pretty over-the-top, with carved wood furniture and bright colors. Now, the walls are dark gray, the tables are black, and the ambiance is much fancier. So are the cocktails: you can still get a great margarita, but I also recently saw \"The Picture of Dorian Gray,\" with tequila, creme de violete, and lemon. It used to be great for groups, but now the vibe is decidedly romantic.The last two times I've been there, I've really wanted a second cocktail--and a second glass of water!!--but have been more or less ignored by the waitstaff. It's like they don't want us to be there?The food here is good. Spicy salsa, delicious chips, large portions. I will continue to come here when El Rancho Grande has a long wait time."], ["Jennifer E.", "Ok so maybe reviewing Chilangos after only one visit is pre-emptive, but I was really that impressed.  First off, the owner/host/whoever he was, was so cute and nice I wanted to bring him home with me.  He may not have spoken very much english, but he was extremely friendly and made sure that me and my party had everything that we needed. He was lovely in a grandfather-esque way.    When we arrived it was about an hour from closing and he and our server let us know when the kitchen closed and didn't look in the slightest upset to put together a couple of tables for me and my fellow hungry Yelpers, post an almost foodless Yelp event. The service was fast and friendly and our server made sure that we had everything that we needed.  I ordered a regular margarita, which was seven dollars and tasted fresh, although not extremely strong.  I tried my friends cactus berry Marg and I can tell you that I will be definitely getting that next time.  The menu is full of authentic meals from enchiladas to tacos and burritos.  I was tempted by the veggie burrito but was sold by the idea of the tacos plus pico app.  For only four fifty I got my choice of any meat or veggie option in a corn tortilla with a side of pico de gallo.  I went with their version of pulled chicken, the pickled cactus, and the fantastic al pastor.   I couldn't believe the value considering that for a taco plate such as this I have usualy payed around seven or eight dollars.  The tacos were phenomenal and I enjoyed and savored every bight.   I was thrilled with every detail of my first Chilangos experience, from the laid back ambiance to the incredible drinks and food.   I am happy to say that my friends all loved their food as well because I am definitely planning on coming back sometime soon and am hoping to have some company for my next visit."], ["Victoria K.", "I have a sweet spot for authentic Mexican food. It's not the easiest to come by. There are many posers. After living in Los Angeles, I have truly been missing the presence of excellent Mexican in my East coast hangouts. Well, look no further. Chilangos fits the bill nicely. First of all, it's pretty much in the ghetto. That's a compliment. Don't expect to find really great Mexican food in the nice part of town. It's worth a visit outside of your comfort zone to taste the wonderful food at Chilangos.During our recent visit here, we were greeted by the most adorable old man who didn't speak a word of English. He did his best to communicate with us in Spanish, and whatever he was saying and doing must have worked because by the end of our meal we were fighting over which one of us was going to adopt him! (We eventually settled on joint custody).Our server Marie was also fabulous. She was really helpful and friendly, even though we stayed in the restaurant finishing our meal past closing time. The restaurant itself is fairly small and cozy. It has the perfect vibe for a Mexican fiesta. The margaritas are served in VERY generous portions and they are freshly made in a variety of flavors. I loved the cactusberry margarita, and my dining companions swooned over the original and mango versions. Several of us decided to order Enchiladas. I love how flexible the menu is here. You can easily switch out meats and vegetables and really get your food the way you want it, without drama. The enchiladas stated that they were dipped in their respective sauces and then topped with shredded chicken, onions, queso fesco, sour cream, etc. I assumed they were actually filled with these ingredients, but alas, they were literally topped with them! It was almost like a deconstructed form of what I consider enchiladas to be. But you know what? They were FABULOUS! Who cares if they're filled or topped when the food is this fantastic. Additionally the refried beans are BLACK instead of pinto (delicious) and the rice is great as well. Generous portions at wonderful prices. I'm smitten. Not only do I want to adopt the old Mexican man who works here, but I want to return again and again to satisfy every craving for Mexican food that ails my ex-Los Angelelino body."], ["Jef S.", "Solid Mexican food cred. Worth a trip.People complain too much about the Mt. Pleasant environs in their reviews of this excellent restaurant. I mean, I lived in Dorchester, MA for years, and this neighborhood wasn't nearly as bad. Maybe I just don't pay attention to these things, but it's always been my belief that for the Real Deal Food, one must venture outside one's comfort zone for the payoff.The first tip-off to Mexican food greatness was the fact that every other customer in Chilango's was Hispanic. The room and decor are really nice.  It looked even better after two Salty Dogs. Food: chips with spicy salsa. Asked for side of Habanero sauce (uh, hells yes). Guacamole nearly as good as my homemade, with nice thick chunks of onion and tomato. Got lengua tacos and nearly died and went to heaven: tender and delicious. Yum! Solid tamales, with the poblano pepper and cheese as the standout.Service was pretty good. Price was mid-range, but, mind you, we spent about $30 in drinks alone. One could eat here quite cheaply if they aren't intent on boozing up as well.Neighborhood notwithstanding, the parking isn't great out back."], ["Karen S.", "Don't be turned off by the appearance and location.  The food is worth it. We went here for a late lunch on a recent Saturday.   The complimentary chips and salsa were good. Warning, the salsa is on the spicy side.  Get the guacamole!!!!   Get the guacamole!!!   It's a large portion for a reasonable price and delicious.    I had the chicken verde and my husband had the tilapia.  Thumbs up on both!   The margaritas were also very tasty. See you soon Chilangos!"], ["Aia T.", "Try their salsa and guacamole. The guacamole is made fresh (from scratch) and the salsa is flavorful. Their servings are pretty huge too so if you can try their small plates that will save you some room to try a lot from their menu. For a small place like this, definitely worth a try. Try their flat bread with hibiscus. It's something interesting to try."], ["Help Y.", "Sunday, 1:50pm. I stepped into a dimly lit ambience, ethnic music softly playing, and decor of a colonial Spanish dining room, at least that's what it felt like...there were 3 families, Spanish, already there and the place is pretty spacious for any number of guests. Parking in the area can be sketchy esp'ly when you're not from the hood or not familiar w/the area. It's also AC on a 72 degrees kinda day so might wanna bring something to throw on, ladies...Traditional margarita, was juicy and balanced. Half way thru I felt a good buzz lol. Uno Mas pot favor! LolChips/Salsa-complimentary, was served after my drink was ordered and is not for the faint taste buds if you're not used to spicy-ness! However, it is home made fresh among the good ones I've had. Guacamole, which FINALLY came out for an appetizer btw...was worth the wait! It had such a creamy texture to it and flavors of lime, parsley, onions that I could taste cause sometime you can't taste anything but bland guacamole =\\ Michoccanas, enchilada topped w/shredded pollo, cheese on a bed of what appeared to be fried tostadas? Was served con arroz y refried beans. It was ok...wouldn't order it again tho, mediocre. Mango margarita, pretty good. So far my impression is that Id come here for the drinks and appetizers...Server took awhile to take my drink order and my appetizer guac took awhile as well to come out. I was refraining from eating up all the complimentary salsa til my guac here to the point where I hope it dsnt come out w/my main dish! ...yup and I was right that the time the guac came out that within minutes my main dish came out =\\ I HATE when that happens! At least he did noticed when I finished my 1st margarita that I needed another one O_O. 14% instead of my usual 20%...The End."], ["Heather V.", "SO GOODThe food was so good and the building has had some beautiful renovations. The food is authentic and delicious. The drinks are also very good, make sure to try one of there house drinks. The seats were not very comfortable, but the food made up for it."], ["Emma W.", "Chilangos is my favorite spot in Providence for authentic Mexican food, not to mention their delicious margaritas.Chilangos will always hold a special place in my heart, because it's where I went on my first date with my boyfriend. We sat at the bar on the saddles, and we haven't left each other's sides since then. Saddles might not be the most comfortable seats in the world, but when else do you get to sit on a saddle that swivels?For all of you adventurous eaters out there, you must have the lengua (tongue) tacos. They are melt-in-your-mouth delicious. My personal favorite are the cheek tacos. So flavorful and tender! You can choose your protein in most of their dishes, and I usually opt for the cheek. For an entree, you're good with pretty much anything on the menu, but I personally love all of the enchiladas, especially the enmoladas, a sweet and savory dish with chicken. The portions are ginormous and you will likely leave with leftovers. Now let me mention the margaritas. If you're going with a group, opt for the pitcher. It's about $30 and probably contains about six large drinks.  They are sweet, but not cloying. Perhaps my favorite in the city, and I am a margarita girl.  Interesting fact: Carlos, the owner, even makes his own tequila! He is super friendly and a delight to talk to. If you sit at the bar, make sure to strike up a conversation with him."], ["Jeffrey S.", "Simply awesome. Great guacamole! All of their tacos are excellent. This might be my favorite restaurant in the Providence area."], ["Amy F.", "Don't let the neighborhood throw you off, this place is so good! The salsa was really good and the guacamole was even better. Server was friendly and attentive. Will definitely come back when the urge for fresh tacos arises."], ["Robert S.", "Went there today with some friends.   I was intrigued by all the excellent reviews.   I have been a fan of Rancho Grande, so I wanted to see how this restaurant compared.First of all, they charge you for any extra bowl of chips you order.     There were four of us and we got a small bowl of chips (about 1 cup size).    I asked for two extra bowls during our lunch and I was surprised to see $1 extra charge per bowl on the bill.    The salsa is definitely very good.   Spicy, tasty, well made.I ordered the Bistec a la Mexican (spicy flank steak) and it was good.   No excellent, but good.    The meat was not as tender as I have tasted in other restaurants but it was not bad.   The Mexican rice and beans were average.My BF got the quesadillas and they were ok.    It seemed like they were made with corn tortillas instead of flour tortillas, which made them a bit heavier than what we were used too.The homemade flan was dense and sweet....still not the best I've had.Overall a good choice for Mexican, but I still prefer Rancho Grande better."], ["Kate M.", "I love Chilangos!!!I have visited a few times and each time I had excellent food and service! I will describe my most recent experience:My boyfriend and I ordered enchiladas.  I had the plate with verde sauce and my boyfriend had the first enchilada choice on the menu.  My favorite part of the plate was the beans!! I've never had such flavorful and delicious Mexican beans.  They can be so blah sometimes at other restaurants I have visited. We also ordered spicy guacamole with chips.   The homemade salsa was spicy, fresh and delicious! The spice was addicting and I could drink it with a spoon. We also had Negra modelos (which were draft)! This was a perfect beer pairing to those heavenly beans!!The service was great! This establishment must be doing well because on my most recent visit I noticed they have updated the inside (very restoration hardware in a tasteful way) and there was air conditioning.Our bill came to about $48 and it was one of the best dining experiences I've had in providence yet! It was totally scrumptious and the enchilada plates are huge and only $13!Hurry! Go to Chilangos! Yum!"], ["Danielle W.", "It had been well over 2 year since I had stepped foot into Chilango's, so when my friend said he was in the mood for some authentic Mexican, Chilango's immediately popped into my head.  We wanted somewhere casual, but not lunchroom casual.  I had heard that Chilango's recently went through a renovation and I was curious to see what had taken place. The last time I was at Chilango's, it was bright white and the bar was at the way back of the restaurant with saddles for bar stools.  I remember a yellow'ish kind of tone to the atmosphere and it having a somewhat dumpy feel.  I loved the food though!   Well, I was in for a pleasant surprise when I walked in here a few weeks ago!  It looked like a totally different restaurant, I couldn't believe it!  They painted it with a darker color scheme, placed new tables in a new format and moved the bar from the back to the right side up the stairs, however; I noticed that sadly, the saddle bar stools were gone.  There were candles on each of the tables and some soft music playing in the background. I also remember their menu being quite different but I felt like the change was for the better.  Our waiter was very attentive, sweet and quick.  We were sure to leave him a good tip!  I will most definitely be stopping back into the restaurant to taste more food from their new menu and to enjoy the ambiance of the new, improved and grown up Chilango's."], ["Rose R.", "Absolutely love Chilangos,  one downfall is the menu is a bit limited compared to other Mexican restaurants so I always order the same dish which is the enchiladas de mole (the best). Parking can also be an issue but it's worth it!"]], "Al Son De Mi Barrio": [["Francesca D.", "This place doesn't look like much from the outside but their food is amazing. They have a better selection of meat than most mexican places in the area (i was surprised to see tongue on the menu) and all of their ingredients were very good quality. Both times i've been there the staff was very friendly and the prices were pretty cheap considering the quality. Definitely a great spot for cheap, authentic mexican food. Try the tortas."], ["Mark D.", "These are amazingly good tacos, worth a visit!All the real Mexican tacos worth a try, but the chicken I would avoid. If u bring a friend that is not use to the real stuff they are fine, just no bang! Friendly service, clean kitchen, and worth a trip. They deliver too!"], ["Carlen A.", "Yummy, authentic Mexican food made with fresh ingredients! Their menu is basically mexican staples (tostadas, huaraches, burritos, etc) with your choice of meat. The special taco with chorizo was especially tasty.Not much in the way of seating inside--3 high tops with 2 seats each, but the server was very attentive and answered any questions we had about the menu.No booze, but they have a nice selection of sodas and juices."], ["Alma C.", "I have very little patience for gringo tacos when the real thing is so flavorful, inexpensive ($1.50/regular taco since this spot opened), and if you know where to look, no longer hard to find in Providence (whew!). Located in the at times nightmarishly busy intersection diagonal from the Price Rite-Eagle Square, Al Son De Mi Barrio is the dining-in offshoot of their stellar food truck regularly located off Manton Ave. This permanent space has 4 small 2-seater tables for dining in if you want, but there's been times it's been crammed with so many people it looks like the clown car at the circus. I've mainly gotten carry out b/c the space itself is very cramped, as in, take 3 steps in and you're at the register. I'd probably be a regular here if 2 things happened: 1. the street parking situation got better and 2. service speed regularly improves. Service in particular can be excruciatingly slow, so I'd ask what the wait time is before you pay. Because of slow service, I actually prefer their nearby taco truck, but it would be tough to find much better indoor tacos than these at this price point within a 20 minute drive from this place. Solid spot."], ["Joseph N.", "A lil hole in the wall place, just like the other reviews had stated. Yes, authentic mexican food. Not the terrible and medicare gringo stuff you see around here.I'm from southern california and have been to mexico numerous times. This is a great taco shop, especially in a tiny town like Providence."]], "California Taco Shop": [], "Poco Loco Taco Truck": [], "Mi Ranchito": [], "La Hacienda Restaurant and Taqueria": [["R F.", "This place has amazing Mexican breakfast! The chef Micky who works on Mondays is the best! But this place is great! Not the best area but it's all part of the experience!"], ["Carrie S.", "I got the divorced eggs and loved every bite! Fresh, original breakfast choices full of flavor and you can watch the chefs in action from a counter seat. My husband ordered the plainest, most boring option (he's anti-spice) and raved non-stop. His French toast was the best I've ever tasted and now we order a side of FT to share every time for a sweet treat finish."], ["Chandelle W.", "My new favorite spot for Mexican breakfast! My husband insisted on going out for breakfast but I was not in the mood for eggs. We found this place on yelp and decided to give it a try. The prices are right and the food is delicious. I ordered the chilango, think cut steak perfectly seasoned and grilled with black refried beans and crispy homemade tortilla chips smothered in salsa verde... each bite was heavenly. My husband worded a lunch special (yes, for breakfast) with chile relleno smothered n red salsa and a chicken tamale, he had not a bad thing to say about it. If you haven't been there yet, go."], ["Michelle D.", "This is a hidden gem. The menu selection is great, the food is fresh and the service is great as well. It was my first time here for breakfast (brunch) and there were so many selections. I got 2 tortillas black beans, egg on each one with toppings and friend plantains on the side. My friend got the homemade to order strawberry/banana pancakes (they are hugh) and the scrambled eggs, chourico, veggies, and home fries. The place is small and friendly and well worth the trip. I will be going back again."], ["Elle P.", "It was our last day in Providence and we needed a hearty meal before our long drive back to NYC. Yelp directed me to La Hacienda. Although the neighborhood is a little derelict and desolate looking, it is not dangerous. La Hacienda delivered on food and value!It's a small restaurant that would attract only locals. A plastic banner with La Hacienda's name covers the sign of the former tenants. We chose to sit at the bar. I ordered \"The Mexican,\" which was scrambled eggs with diced bell peppers and onions, refried beans, and corn tortillas. He had something similar, but with dried beef added to the eggs. They asked us if we wanted fresh homemade salsa and we eagerly agreed. Both the red and green salsas were incredible. We liberally drenched our food with it. I ordered a horchata, rice milk drink, with my breakfast. The food was absolutely delicious and I wish we could have tried other items on their menu.Our two breakfasts with tax and tip came to about $15. Incredibly cheap. La Hacienda may be the exception that proves the rule that East Coast has no good Mexican food."], ["Alicia D.", "My son and I LOVE this place! Breakfast is AMAZING and the service is great even when they are slammed! Consistent 5* experience!"], ["Jenny M.", "I love this place! It has good parking and right in the center so it's not too out there in the open to find. I really enjoy the service there as well as the food. There menu has a lot of options so it is great to go with a family who loves different things. I am always content when entering and leaving the restaurant."], ["Naomi D.", "First of all, the menu is ginormous! Love the fact that they offer American & Mexican breakfast which is a huge plus for me. They have endless options but every time I go I can't shy away from getting my all time favorite breakfast. Chilaquiles! It's a very simple Mexican breakfast & they make it just like my mother. Can't get any better than that. Milkshakes!!!! So many options as well. So far I've had the mango & passion fruit & they're sooooo good. I have a hard time not drinking it all before the food comes out."], ["Cabernet S.", "Wow, allow me to hop on the bandwagon. The reviews for this place seemed to good to be true, but they were all legit. Breakfast places all have the usual eggs, bacon fare. This place has all that and much more with a south of the border flair. Expect breakfasts and other meals laced with cilantro, spice and salsa.I had the divorced eggs, which were nothing short of divine. The menchaca and toluqueno were also good.The ambience is one of a throwback diner. One that other places aspire to but can never achieve. Try it and savor the experience. There's a short order station and an efficient crew working the floor. Have fun and enjoy this place. its awesome."], ["Michael V.", "I've been here a few times.  Both times I got the Huevos rancheros.   They were excellent.  Nothing fancy or over the top at this joint."], ["Leonel T.", "I've been going there for about three years it's my favorite place .. try the toluqueño omelet with American cheese it's so tasty"], ["Ian J.", "Awesome. Real Mexican. I grew up in LA and this reminds me of the good stuff. Authentic."], ["Carlisa D.", "Best breakfast in town and its inexpensive!! I eat here or get it to go every weekend. My favorite is the Monterrey Style breakfast, scrambled eggs with mexican hash, veggies, and jalapenos, its also served with beans and tortillas yum! They have a special called the Manny's Special that includes all the fixing plus pancakes. My son's favorite is their cinnamon french toast. Parking is tough and so isnt the seating but its well worth the wAit!"], ["Jazmin I.", "There's the one on plainfield and the other one further ahead. I love this place. Their steak is tasty and I will gobble up their pupusas! I've had their breakfast as well. Its very tasty. When I'm too lazy to go elsewhere, I'll eat here. It really is inexpensive and they make a mean cup of joe (when its fresh!). I'll always enjoy eating at this place. Not to mention, the service is good. I guess it also helps to know some of the people who work there."], ["Lorelei P.", "We LOVE coming here for breakfast - the Chilaquiles Salsa Verde and the Toloquenos are YUMMY! The owner is very sweet and friendly. Always packed for breakfast!"], ["Rahul M.", "This is an odd little place in Olneyville Square: an el-cheapo Mexican joint, with mostly forgettable dishes but a few standouts, like the fajitas, and, surprisingly, a full-featured brunch menu on the weekends! Good when you're hungry but Nick's up the street has an hour-long wait! I live in the 'hood and I'd definitely recommend it over the better-known El Rancho Grande further down the street."], ["J C.", "I am serious La Hacienda is that wonderful. My favourite is the rancheros. Great local breakfast!"]], "La Hacienda Restaurant": [], "El Rancho Grande": [["Emily W.", "I came here for lunch with a friend on a weekday afternoon. Fast and friendly service and tasty food and drinks. We each got the enchilada trio which was a good call- they were delicious! The margaritas were also perfect. The place is pretty small and I can imagine it gets busy for dinner! It's a little bit on the expensive side but I will definitely return!"], ["Barry N.", "I have a love-hate relationship with El Rancho Grande, and I think it can be summed up with another dichotomy: summer-winter!El Rancho Grande in the summer? Ice cold margaritas, delicious food, the best mole poblano around, fantastic salsas.El Rancho Grande in the winter? Ice cold climate! It gets very drafty in there. This is not their fault. They do their best to keep the restaurant warm, and on quieter weeknights, it stays a comfortable temperature.Considering the culinary talent of the El Rancho Grande cucina, I'm surprised they have not yet expanded to a larger restaurant. There is often quite a wait to be seated.Their brunch is good, although I can get the same brunch cheaper at other restaurants. It's dinner where this restaurant truly shines. The trio of enchiladas is the best I've had in this city. I rarely order anything else.Customer service is okay. The waitstaff are accommodating and pleasant. They're often understaffed for their demand, which I think is because there's simply nowhere else to put extra waitstaff.This is a spot I will continue returning to for many nights as the sidewalks unfreeze!"], ["Terri R.", "El Rancho Grande has pretty solid food. They were kind enough to donate dishes to New Urban Arts' annual fundraiser. After trying some bites at the event, my partner and I went to the restaurant and while I did like most of what I ordered, I found it to be a bit overpriced. I'd recommend ERG to friends, but if they're on a tight budged I might send themelsewhere."], ["Hilary M.", "We went back to El Rancho Grande the other hot summer night. Stepping in it was cool and not too crowded. The wait staff were excellent and we had fresh salsa and chips within minutes. Home made marguaritas (with fresh lime juice and excellent tequila) came next. Then! The absolutely delicious dinner: chicken and shrimp fajitas were out of this world and the enchiladas verde were spicy and absolutely wonderful. The service is top notch and the family that runs this jewel are to be commended for fresh food, great service and excellent drinks. A homerun!"], ["Albert S.", "Came here for taco Tuesday. Cute little place but I suggest getting there early because it starts to fill up since they can only fit about 20-25 people. Luckily whenWe arrived we sat right away but ten minutes into dining there were peopleWaiting for tables. I ordered the steak quesadilla, which was absolutely delicious. They offer $1 tacos on Tuesdays so I decided to order chicken tacos.  I did not care for these due to the fact that they were very dry.  The chicken was bland, and needed a sauce or a some sour cream.  I would go back and try some other things on the menu seeing as they pulled me in with $1 tacos.  Give it a try! You might find something you like!"], ["Rob V.", "Absolutely authentic. Very unreal. Very much a life changing experience. I want to buy an El Rancho Grande t shirt and endorse it proudly. I want to dip my head in a pool of their chipotle cream sauce. Love is real. I want to get hired and immediately fired for eating all the food. Also cheap. My chump change can happily  fill the pockets of all employees in this lovey establishment. 5 stars. Deserves 5 million more."], ["Emmy M.", "I have been meaning to try El Rancho Grande for ages, and will definitely be returning. The space is clean and welcoming, the service fairly prompt, and the food quite delicious. My friend and I started with the chips and guacamole poblano, which was yummy and satisfyingly spicy. I then ordered the enchilada trio, which did not disappoint. I would have maybe appreciated more cheese, but the three sauces were very flavorful and it was fun to eat such a beautiful, brightly colored dish! The enchiladas also came with rice and beans on the side, and the beans in particular were just the best- sort of smoky, very rich. They were potentially my favorite thing I ate at the restaurant. Honestly, I would totally order just rice and beans next time, were it not for all the other tempting options I still want to try. I have my eye on the chimichanga.Unrelated to the food: we came on a Sunday afternoon and easily found a parking spot on the street right around back. I am not sure if we were just lucky, but it seems like you're bound to find a spot if you just drive around those residential streets right behind the restaurant."], ["Constance G.", "Really, Yelp? Really? I saw how many positive reviews and stars this place got and wanted to try it out. I picked up my yoga pants and bib from the cleaners and headed on down to Providence. My anticipation was high. Sky high. Now here's where some Yelp realness comes in. In the amount of time it took us to place our orders and receive our food, I could have hopped a plane to Mexico City. Or taken a cruise! Even a nice little cruise to Mexico City. My chimichanga came without the guacamole listed on the menu because they ran out but didn't bother mentioning it. Ok, fine. I love guacamole more than most people but I let it slide. Let me just slather this baby with some salsa. But when you tell me there's no more fried ice cream.... GIRL, BYE."], ["Jennifer E.", "El Rancho Grande is another one of the amazing, authentic Mexican restaurants that graces our fair city.  If you've been to any of the other restaurants in the area, you know that sometimes you have to travel to the not-so-nice parts of town to get the best food.  I myself am willing to risk life and limb for a good taco. Well, all jokes aside, ERG is really one of the best Mexican places in town.  The restaurant itself is pretty small, and feels particularly tiny when packed on a weekend night.  They have a small bar with some stools and several tables, but when we did have to wait, it didn't take all that long to grab a table (it's just awkward when you aren't the only group of people waiting around for a table).  The margaritas are pretty tasty and they have a couple of Mexican cervezas on draft.  There menu offers all of the traditional choices such as burritos, tacos, enchiladas, and tostadas, but they also have some specialty dishes that sounded yummy and also daily specials that are listed on their chalkboard.  I highly recommend the fish and shrimp tacos but I had a very delicious Al Pastor taco as well.  Three tacos were enough to fill me up.It's a tough choice between ERG and nearby Chilangos but El Rancho Grande is definitely up there in terms of food quality, service and price.  I will definitely return, many times, in the future when I have the hankering for some real Mexican cuisine (NOT tex-Mex)."], ["Linda A.", "I visited on taco Tuesday, so of course, I can't say that I tried a wide variety of items. Still a very positive experience -- the small restaurant is cute and has an authentic, yet slightly hipster vibe. The bathroom was a little dirty and smelled funny, so I touched as little as possible. Ok, the food... The chips and salsa were super tasty. The chips were crunchy and sturdy, the salsa thick with a strong kick of cilantro. I tried the tacos: barbacoa, carnitas, carne asada, and pork butt. The last of which was my least favorite, to my surprise. The others were super flavorful and delicious. The tacos are on corn tortillas (I prefer flour, but ok) with little more than the meat present -- some onions and cilantro topped each with a wedge of lime. They aren't your Taco Bell supreme tacos. Ask for extras if you're expecting them. My partner said the chicken was a bit dry, but I didn't try them for myself. I look forward to trying more items as well as the desserts. The prices were super reasonable, too!"], ["Ben T.", "Food is great and staff is nice. Only complaint is if you go during dinner time except at least a thirty minute wait in a small crowed waiting area."], ["Portia J.", "I ordered in from this placed based on recc. that I received from a cute guy last weekend. I ordered the Nachos con Todo y Pollo with (which was a horrible idea because anything that is supposed to be crispy and hard turns into soft mush inside Styrofoam) the Camarones appetizer which came with this terrible bleu cheese-esque sauce and I really wasn't satisfied. The chicken was oddly seasoned. I have no idea what was on it. Will try again, will eat in on location."], ["Sungeeta A.", "Two words: QUESO FUNDIDO! I had this for the first time about a year ago and haven't stopped dreaming about it since. Smooth, melted cheese mixed with Pablano peppers (or Chorizo if you please) and served with tortilla chips - heaven!  It was just as good the second time I went.Everything else about this restaurant, including the entrees, drinks, service and prices, are also solid. They also have a wide variety of offerings - the last time I went there they had pork belly tacos as a special, which were delicious.  This place definitely gets crowded, though, so I recommend going early to get a table."], ["William K.", "My brother told me about this place.  This place is great.  I have no complaints.  All meals come with nachos and a little dish of a green salsa.  It is always delicious and fresh.  I think it has jalapenos for a little heat.I've had this tasty cheese app.  It is a bowl of melted mild white cheese topped with a sausage.  Comes with a bowl of nachos.  Very tasty.Chimichangas with carnitas is the bomb.  You can get chipotle cream sauce or another cream sauce to top.  It comes with a nice pile of shreded iceberg with guac, refried beans and rice for sides. This meal is $8.00 and it is a large portion of food.   The Taco de Playa are pretty tasty.  It has avocado, tomato, lettuce, corn, and diced shrimp.Rojo o Verde.  It's not the name, it's the choice.  Red or green?  Both are the ground corn with pork inside cooked in a corn husk.I had both.  I think the green better.  Both are good.They have a full bar.  A nice selection of imported sodeys.  A very large selection of tequila.  I drank a LOT of Corralejo (very smooth) when in Mexico.  They have it.Highway acess is less than 1 minute."], ["Evan V.", "With those tiny, little hands of hers, Maria sure does make some slammin' mole.The guac is without question the best in the area, whipped up fresh and frequently.The only downside for me is something that was only revealed sometime AFTER my fifth (and unfortunately final) dinner date here.  Many of the seemingly meat-free dishes still make extensive use of some serious animal byproducts - namely lots and lots of lard.  Which would certainly explain the exceptional flavor (sorry, but it is true).There is no questioning the authenticity of these dishes, which are rushed straight from the kitchen to your table, despite the bizarrely placed mini-stairway that leads up to the prep area - which is pretty wild."], ["Ben V.", "Waiting 40 minutes for few apps. And when we ask why it was taking so long she said it takes time to make quesadillas. -_-  I was hoping a manager would walk around and ask how is everytging going but clearly theres no management.  we left 20 percent tip but it wasn't the waitress fault it took so long for basic food.  Overrated."], ["Emma Z.", "This is my go to place in Little Rhody! Be sure to order multiple dishes, if the dish is cheap its not a lot of food. My favorite appetizer is the queso fundido, it a Mexican cheese fundo topped with green peppers! I always stick with getting a chicken quesadilla frita. very cheap and a good bang for your buck!"], ["Richie S.", "What more can I say, but the best taco I've ever had was at this place! My fiancé and I haven't been in awhile so we are well overdue to go again soon. The margaritas are outstanding and very reasonably priced compared to most other places. Now let me get back to the tacos, they have quite a variety but the one that I loved the best was the pork with caramelized onions and pineapple....so good!!"], ["Aia T.", "Pollo ala americana is great. Pina coladas were delicious!! Cabacitas are not so great hence my 4star review :( service is okay. Servers are friendly but forgot to fill our water and just noticed it towards the end. Guacamole, salsa, and pico de gallo are awesome!!! Salsa is better than the one in Chilangos actually. Will be back to try some more!!"], ["Marissa W.", "Love coming here...great portion sizes, great prices, great food...always packed which is a positive sign"]], "Viva Mexico Cantina & Grill": [["Ed E.", "First off, this is the first Mexican restaurant that has ever charged me for chips, which in my opinion is abnormal in its self.  The food is so and so.  Would I go back?  Probably not."], ["Olivia P.", "Excellent service. This is not a fancy place. This is a place for people who want a super filling meal and is feelin' some Mexican. Food was good. My friend got taquitos and a salad. I got pez. Both very good. Bill came out to be around $35. Very good service. My water was always refilled and the guy was very quick with our check and anything that we needed. Very clean. Cute hand painted chairs and pinatas hanging around. Probably will come again. Great place for hangover meals."], ["Shahina G.", "Great management and always friendly service. I recommend the \"viva la margarita\" mango flavor and the Mexican style steak which is my fave!"], ["Sarah C.", "This place is pretty good. Their decor is fun and inviting, and I think they have a back patio area? The chourizo burrito I got was yummy. But seriously, what is with the no free chips and salsa that I see happening at almost all of the Mexican restaurants I go to nowadays? Are they really losing that much money by offering those items for free?"], ["Beth J.", "Love this place! The fajitas are the best. The nicest staff & totally casual. I wish the guac was a little better but other than that we love it!"], ["Patti G.", "I stopped by during my lunch break, it was not busy, bartender nice , ordered my to go meal, was not offered drink or chips while I waited, ordered Consome  de pollo it was a chilly day, once I got back to office and opened it was very disappointed lot of like grease on top and could not eat the chicken pieces all dark, it's like they used all the unwanted gross chunks for it.Also ordered huarache and that was not all that great either I love Mexican food I am Mexican don't think I will return, very sad was looking forward  to a nice lunch"], ["Marilyn S.", "Loved this place!  My boyfriend and I found it by mistake.  We were driving around downtown Rhode Island and saw it and since we live Mexican food decided to try it...  It was absolutely phenomenal!  The tortillas are fresh and you can tell they are hand made...  I had enchiladas suiza and my boyfriend had a steak.  It was delicious...  Freshly made.  The service was outstanding...  Pleasant, attentive and friendly...  A gem!"], ["Axel D.", "I dont like leaving bad reviews but this was the worst Mexican food I've ever had. Everything was there but the flavor.  Everything just tasted like mush in my mouth with no \"sabor\".  The salsa verde was the only saving grace which I doused everything with.   The servers were all hanging out at the bar and the hostess was on her phone when we walked out. She didn't acknowledge us or say good night. The middle aged dude who was bussing was the only person working hard in the front of the house. Oh, but the prices were decent.    Yet another disappointing experience at a New England Mexican restaurant. No one can get it right around here."], ["Nirav M.", "My family and I visited and everyone was extremely pleased with their meal. I can only comment on meatless dishes as we are all vegetarian. The guacamole was fresh, and the vegetarian burrito and taco salad were also very tasty. Our waitress was very friendly and atmosphere is friendly and laid back. Would highly recommend!"], ["Ashley J.", "I'm not even sure I want to give them one star but I felt really bad for the waiter. Got there at 5:15 before the Bruins game so we would have plenty of time to eat. There was a table of about 50 people then just a couple other full tables. It took us about 10 minutes to get drinks then another 10 to get the chips and guacamole. They were good. It then took another 15 minutes to even order dinner. We started realizing as the place starting filling up that our waiter was the ONLY waiter. Just him and a bartender and the bar was full. We ordered our food and waited for about 30-35 minutes. We waited so long that the waiter apologized 3-5 times to us saying that the kitchen was backed up due to the big table of people at the front. It seemed as though that tables order got put in before the entire restaurant. People were getting up and leaving left and right. No one was eating just all sitting with blank faces on. When the food finally got there it was embarrassing, you could tell it was just thrown together quickly. We barely even ate it. We of course were charged full price for everything. I spent $50 with a tip, were there for an hour and a half and we didn't get into the game until 6:50. It was an awful experience. A Sunday at 530 across from the dunk, the night of a Bruins preseason game and one waiter? That's just stupid business."], ["Steven G.", "Food is great.  Horchata is amazing.  Ask for a White Mexican if you're at the bar.  It involves Horchata.  Nuff said."], ["Emily D.", "Avoid this place at all costs.We stopped in before a show at Lupo's. I ordered a chimichanga, my boyfriend ordered a burrito. I found a massive piece of dimply, rubbery, fatty chicken skin in my chimichanga, as well as 3 or 4 pieces of dark meat that were so dark they looked rancid. The chicken wasn't only bland and mostly flavorless, it just plain tasted bad. My boyfriend's burrito wasn't so good either. The rice that came with my meal was fresh and good, though. I ordered a Coco-Rita without salt and it came with salt. Whatever. But the drink just tasted like salt and sour mix. Not good at all. The bill was more than $30 with tip for the 2 entrees and one crappy drink. I was sure I was going to get food poisoning, but luckily I did not, at least. Awful."], ["Paul J.", "The food was good but I stopped in on a Tuesday evening and the place was dead. Wait staff was prompt and friendly. Prices were reasonable. Probably a better place for lunch than dinner. It's also a smaller venue so I'd probably cross this off my Cinco-De-Mayo list as its in the heart of downtown and probably gets slammed."], ["J R.", "Yummy, fresh salsa with homemade chips and ice cold Modelo... That already is a win!  The guacamole was amazing the meals were served quickly and everything was fresh and homemade.  I tried the goat and was reminded of a time many years ago... Amazing job chef!   It was an excellent culinary experience for anyone who enjoys cantina style dining."], ["Bob S.", "Rather bland. Not real Mexican food. Ordered pulled pork and it looked like Chicken. Really sucks they charge for nachos and dip. We will not be back again."], ["Kevin N.", "Not our first time there but possibly our last. From entering the door till we exited the staff was more concerned with watching a soccer game. Service was standard at best. Food was good but without service, we did not enjoy. While waiting for our food, we observed the bartender picking his teeth and then go ahead and make drinks without washing his hands!"], ["Brett B.", "First time here. Very good food and service for sure! I had the taco salad and it was one of the best ones I've had at any local Mexican establishments. You have to try their guacamole. My wife had the burrito regular and thought it was great as well.Highly recommended!"], ["Isabel B.", "I'll start by saying that my husband is from Mexico and we love authentic Mexican food! This is by far the best in the area and one of the best we've been to in the country! Order the Milanese torta or the chicken enchiladas. The green sauce is to die for. We go at least once a week and cannot get enough of this place!"], ["Vilay S.", "There are actually not many breakfast spots Downtown, and what people don't realize that is that Viva Mexico is a decent place for take-out or sit in for breakfast. I work downtown and I often call in an order for pickup both on weekends or weekdays. The Mexican Breakfast menu is the shit. Chilaquiles with sunny side up eggs, avocado slices, and refried beans means I won't be hungry til dinner. Total with tax and tip is around $10. The Mexican breakfasts come with sides of tortillas and beans, while there is an \"American Breakfast\" menu that offers toast and home fries.Sometimes the service can be spotty - I'm not even sure what time they truly open, and other times if it's too early you will be put on hold as they call over someone who speaks adequate English. The breakfast burrito used to be $3 if you paid cash, but now it's $4 or $5 so you get the idea. Get your confirmation if you have questions about times and prices because you can't really go by the takeout menu or online menu."], ["Meredith O.", "The service was very slow.  The prices were very reasonable and the food was so-so.  I would've been fine but we were all still eating when the owner came over and asked us to move tables so a large party could be seated.  Maybe I'm wrong but I didn't think that was ok to do.  So basically we paid the bill and left.  I should've asked to take my unfinished glass of wine off the bill.  Ironically if our service wasn't molasses we might have already been gone... Won't go here again."]], "Lucia's": []}