{"Toro Restaurant": [["Dan D.", "Very fun place, live music on Fridays. Efril the bartender is very personable and friendly. I recommend the stoli doli."], ["Stephanie R.", "Came here Sunday night with 3 people. I live in the neighborhood and am always looking for new places to try. We walked in and were promptly seated by the owner - who appeared to be the only one working the front of the house. We placed our drink order. The jalapeño margarita was delicious. Then we all ordered a different menu item so we could try them all. Chicken fajitas, tortilla soup, pork chimichanga, pork tamale, chicken enchiladas and a stuffed pablano pepper. All the dishes came with guac, sour cream, refried beans and rice. Everything was DELICIOUS and seasoned well. One person in our party said the rice could have used a tad more seasoning. We all left happy and full and well definitely be back again!"], ["Greg M.", "Everything about Toro is top notch! A must try for a drink is the jalapeño margarita, very flavorful with an added little kick. The food might be one of the best Mexican I ever had. Everything tasted so fresh, including the complementary chips and salsa. The staff was very friendly and welcoming. The restaurant was very clean and the decor was very hip. I would recommend Toro to any fan of Mexican food and date them to find a better place!"], ["Melissa K.", "I really wanted to love this place because I really love Mexican food. The pride that the staff (owner?) takes in the food is obvious so it makes me feel terrible to say that I didn't fall in love. The food was acceptable but I found it bland and lacking in flavor. I wanted more spice, more depth to the dishes and it just wasn't there. I would probably give it a second chance if I was in the neighborhood and low on options."], ["Zach H.", "We stopped at Toro for lunch, intrigued by the inviting atmosphere, and were thoroughly satisfied with our meals. Federal Hill may be best known for it's Italian restaurants, but Toro offers excellent mexican food and drink for reasonable prices. The lunch specials are an especially good deal at $8.50. All ingredients were extremely fresh and the dishes were flavorful. The staff were attentive and friendly. Definitely worth checking out if you are in the Federal Hill area."]], "Vinya Tapas": [], "Los Andes Restaurant": [], "Mi Guatemala Restaurant": [], "Bocado Tapas Wine Bar": [["Alejandra T.", "I hate to say this, but I have been to this place 4 times in the past 5 months. I am beyond addicted! Its best to groupon.I honestly have never paid from like a \"walk in\" perspective. Why does it get four stars? Well the drink are darn expensive. For a table for 4 we got a couple pitchers of sangria and beer, and it was about $170 for watered down Sangria.. GET OUTTA HERE!!! I love their entire selection of food!! I will definitely be going back.... just drinking form the cocktail menu of course."], ["David M.", "Went here on a Groupon. It's located right over in Olneyville with a lot with plenty of parking across the street. Inside you'll find a converted mill building kind of ambiance with high ceilings, brick, etc.. The cushioned chairs found at the bar and some of the tables are pretty uncomfortable, so brace your bottom for that. Service was more or less quick and friendly.Per my Groupon, I got the \"Bocado Experience\" which includes 2 cheeses, 4 tapas, 1 paella, and 1 order of churros. I also got a cava flight. I'll now review each of these components individually:Cava flight: A great selection of three cavas; 2-3oz pours at 9 dollars and served on a beer flight-esque paddle. I especially liked the rose Cava. It was such a nice start to the night.Queso (2, of your choice): We ordered fried goat cheese and Valdeon. The cheeses come with the usual spanish cheese board acompaniments: membrillo paste (quince), almonds, and a pimento. The whole kit looked nice and tasted even nicer.Tapas (4, of your choice): Tried a selection of tapas. There's quite a few at your disposal, so you're sure to find something that you'd like to eat. Problem is, none of the tapas we had were especially tasty, nor were they bad. Just your standard kind of tapas.Paella: Tried the seafood paella. The mussels and clams tasted extra fishy. We found this pretty interesting because we had a mussels appetizer and had no such problem. Calamari in the paella tasted a little rubbery and we found the whole thing pretty drab. Churros: Tasted of old oil, with notes of cinnamon. Chocolate sauce was pretty tasty though.I probably won't come back for the \"Bocado Experience\". It's a cool place to drink and eat some cheese though."], ["Alisha M.", "5 stars for the Cava and the ambience 4 stars for the queso 3 stars for the tapas 2 stars for the paella1 star for the churros All in all, an okay place."], ["Andria T.", "AMAZING!!!I've been wanting to try this place for a while, but somehow Valley street just seems so far away when I'm hungry!  Well, after last night's feast, I will be insisting that we go more often.  Not only is the menu extensive and full of options, but we tried seven different things, I loved every single one of them.  We even managed to have some leftovers!There is something on the menu for every taste; there are a ton of different types of meats and seafoods, if that's your bag, and plenty of veg and cheese options.We started with the fried goat cheese, patatas bravas and mushroom r-something.  It was all amazing.  Our server was great, and was totally open to us ordering a few things, eating them, and then ordering a few more.  The food came out just as it was ready, and everything was absolutely amazing.  I almost never want to get dessert, but we opted for the pumpkin whoopie pies, and I don't regret it for a second.The space is also absolutely beautiful.  We got a big booth for the two of us that could easily have seated 4-5.  It's cozy and intimate without feeling sinister, and I love the decor.  Though it's a tapas and wine bar, they do also have beer and cocktails.  Also, there's an off street parking lot across the street, which is MUCH better than trying to find street parking.All in all, this was a fantastic meal where I, yet again, ate way more than I should have.  I can't wait to go back."], ["Sam P.", "We were a party of six and it was the first time we dined at Bocado Tapas Wine and Bar around the last week of September. The hostess Sydney had a very charming smile and guided us to our table immediately. Dave was our waiter and was very diligent, professional and courteous. The menu sizes were very large and occupied all of the table space. He suggested the Bocado Experience for four and he helped us selecting the dishes. He also up-sold the specials which was the watermelon and arugula salad. The charcuterie was phenomenal especially the goat cheese and honey, it was everyone's personal favorite. The board was a bit rocky but the whole charcuterie sharing experience was wonderful. We took a bit of time to select all the eight tapas from the menu but Dave made it easier. As a group we all enjoyed the Whipped roasted garlic, spinach & feta dip with grilled pita bread and the Mussels dish. Some of us even quoted that \" we would come back just to eat the mussels\". However the chicken fritters were not very eye-appealing and lacked flavor. The rest of the tapas were very tasty and the service was quick to begin with. The paella we ordered was Paelle De Carna since we wanted to taste the variety of meats. The rice at the bottom of the pan was not cooked throughly and the whole dish was salty. At this point we were all full and could not really finish the paella. Dave offered to box the paella for us.  For dessert we had the chorizo and the flan. The chorizo was well fried and was coated with ample sugar however the chocolate sauce was watery. That was the only downfall. The presentation of the flan was simple and clean although it had the density of a cheesecake. As a group we loved the whole tapas bar experience and would love to go again. For those of you who want to give it a try, please do not hesitate to."], ["Emily A.", "Is it possible to give a place six stars? If it were, Bocado would get all six. I came here with my mom, brother, and best friend for my birthday. Our server was one of the best I've ever had-- she was so knowledgeable, made recommendations to everyone's tastes, and was the perfect guide to our evening. My friend and I had done tapas before, my mom and brother hadn't, but we had a groupon, so we were feeling adventurous. Everything was wonderful-- fried goat cheese, octopus, beef carpaccio, mussels, cheese board-- I can't even remember everything I ate, it was such a feast. Everything was flavored wonderfully-- not sure if the chef is improving since others' reviews here have mentioned mis-flavored food, but that was not our experience at all. This isn't a very helpful review, but I really have no complaints. I can't wait to go back."], ["Stan P.", "My friends and I visited Bocado in Worcester a couple years ago and we were apprehensive about how this location would measure up.  It exceeded our expectations.On this occasion we were using a Groupon for the 'Experience for 4', and the management allowed us to apply the value of that Groupon to an 'Experience for 6', which was just what I was looking for.  It's interesting to note that the Experience for 6 is setup differently than the Experience for 4 we've tried before.  You order fewer individual Tapas items but the portions are larger, and you get more food for entrees and desserts.Every item is unique and there are so many amazing flavors.  That doesn't guarantee that every one will be a hit - my friends recall that back in Worcester there were a few items the table didn't really enjoy as much.  This night however there were few if any negatives.  The variety and the intensity of flavor in so many of the items is just a wonderful surprise as your meal progresses.  It seems to start slow and you might even wonder at first if everybody is really going to have enough to eat, but by the end of the night you wonder how you all managed to enjoy so much food!Bocado is definitely going to be one of our go-to 'special occasion' places in the future."], ["Justin M.", "Got a great groupon deal and decided to give this a try.Wine selection was great and our waiter was tremendous!  The food?  Meh.  Fried Goat Cheese was definitely the star of our experience.The sarano ham came in a close second. The tuna...didn't taste like anything...not even tuna.The meatballs were ok.The rice and sausage in the paella was good but the seafood (squid, clams and muscles if I remember correctly) were absolutely flavorless.  From my experience working at a fish market that means frozen or on ice for far too long. Might pop back in to try some other items but seriously lacking for the price."], ["Anya D.", "I love this restaurant.  There are always new and delicious dishes, but I can depend on the meal being great every time."], ["Bikram S.", "Great Tapas place in Providence.  We (a group of 6) sat outside on the patio.  Service was excellent.  Sever very helpful in guiding through the menu.  Charcuterie and cheese board was great- would have been even better with more artisan bread.  Pomegranate was okay, a little light and perhaps heavy on ice.  We had vegetarians and non-vegetarians with plenty of options for both.  Grilled lollipop lamb chops and grilled venison were the top picks for us, with fried calamari a close third.  Braised rabbit was very well prepared, but as expected it was a bit gamey for some in the group.  They have an excellent selection of wines and the server was every helpful.  Wine flights was a great way to sample a few wines, matching them with the tapas.  All in all a great experience."], ["D N.", "Overall, a very solid choice for a weeknight.  Nice decor and ambiance.  Very attentive and friendly, but not intrusive, service.  Ample parking across the street.  The immediate area is a little sketchy.Now for the food:  most of it was great.  A couple of dishes were overly salty, and one of the four tapas we got was unimpressive, but most were great.  The charcuterie was excellent.  The sangrias were perfect, as were the churros for dessert.This was my first tapas experience.  I was a little worried that the package dinner for 2 would leave me hungry.  I needn't have worried, I left stuffed and happy."], ["Victoria K.", "I have very mixed feelings about Bocado Tapas Wine Bar. On the one hand, it's a really neat space with a vast menu of creative Spanish-style dishes. They have a great prix fixe menu option including meat/cheese, tapas, paella, and churros for dessert.I love Spanish food and I love tapas. With that said, the tapas I tried at Bocado were really hit or miss. The albondigas (meatballs) were quite tasty, with a touch of sweetness from figs and some tang from blue cheese. The blue cheese is assertive, but I like blue cheese so it worked for me. Personally, I love simple Spandish albondigas and don't really need all that extra culinary hoopla. A delicious, moist meatball in sauce is perfect.The croquetas and the  bola de arroz frito are both tasty fried tapa options. The complimentary sauces were good as well.The braised rabbit was salty and quite frankly the worst rabbit dish I've ever had in my life. And I love rabbit. I was so disappointed. It was my friend's first time trying rabbit and I'm afraid the experience turned her off of rabbit forever, which is unfortunate because rabbit can be really delicious otherwise.The cheese meat options we tried were tasty, and by the time we even got to the paella we ended up taking most of it home, but it was pretty good. Not the best I've had, but a solid effort. I think the menu is perhaps trying too hard to stand out by offering some less traditional tapas, or trying to make the traditional ones too gourmet, but I'll be honest, Spanish food is so delicious just as it is,  it really doesn't need the bells and whistles. Just good flavors. I would consider visiting Bocado again, but would avoid the rabbit dish like the plague. Otherwise, the meal over all was quite pleasant, although not mind-blowing."], ["Eric K.", "Ok so I have a biased opinion of Spanish food and it is hard to make this review in an objective manor. I was able to travel Spain recently and was able to eat a great amount of Spanish food. Naturally, I was excited to see a local place offering some of the great foods I ate in Spain. However, I was not completely happy with the food I ate. But I would go back and eat it again... and again.This has nothing to do with the how good the food actually is. The food is great, and on top of that the wine and drinks were excellent. I was expecting the Spanish food I ate in Spain, but that is not quite what I got.  We got the \"Bocado Experience for 2\", which is an incredible deal! The tapas are great, we ordered; Pan con Tomate, Dátiles Rellenos de Queso de Cabra, Croquetas De Pollo, y Patatas Asadas. Though they were all great, 3 of the 4 disappointed me. The Pan con Tomate had a garlic spread (which was unnecessary there is something simple and fantastic about crushed tomato, bread, salt, and olive oil). Datiles y las Croquestas were plagued by paprika. The Paella we ordered was very well seasoned and tasty, but the squid and the little necks were over cooked. I also didn't care for the chorizo.While this sounds like I was disappointed, Bocado makes up any of these faults in the overall taste, the drinks, and the atmosphere. I think the Spanish wine selection including the cava selection is great. The mixed drinks are of high quality to. We ordered the cava flight and some mixed drinks.Overall, like I said, I would go back, I wouldn't have dinner, just tapas and wine."], ["Stephanie C.", "I got a Groupon for Bocado and decided to go for Valentine's Day. While it is a bit expensive it's definitely worth it for the amount of food and quality of it that you receive. See my photos from Bocado for all the dishes we had. It's a romantic old factory that has been converted into a restaurant. Exposed brick, loft style and candles on all the tables.Plan out about two hours for this experience and be sure to try the Spanish wine. It's the smoothest wine I've ever had and the service was remarkable. A great date place for a couple or a small group. The only reason why I would say a large group may not be the best is that the tables are very small and the food does pile up since there's a lot of small plates. Enjoy!"], ["Jordan D.", "Sold. And not just cause of the Groupon deal.I've came here once before and recently popped in on Friday night (when literally EVERYONE around us was using the Groupon deal) and we haven't been dissapointed either time.Tucked into a little side street right between 10 and Atwells lies this damn good tapas joint. To start, the space has a whole industrial chic thing going on with high ceilings, big windows, lots of exposed metal and concrete - but is intimate enough for a little date night action or a small group. The bar (which is longggggg) actually looks nice as well although I feel like most folks grab a table. I also think we got the same server both times - an older white dude who seems to be high on life 24/7.Now, I know they try and get you with the 'experience' deal or I know 850+ people have bought the Groupon deal - but just wing it and order a bottle of wine and try different plates. Which plates, do you ask? Here are some that are pretty lights out in my book:Bone marrow: Enough saidRoasted brussel sprouts: Nice Spanish take on one of my fave veggiesBistec crudo: Comes with a nugs of tasty manchego and fried garlic. Get the carpaccio, garlic and manchego in one bite - so, so good! Whipped roasted garlic, feta and spinach dip: Your typical spinach dip, on Iberian steriodsLollipop lamb chops: Actually like these cause they're bite sized, they're not overly seasoned and taste like lamb chops right off your backyard grill!We got suckered into some bad sangria cocktail that was $10 a glass (!?!?) and completely meh. Luckil we just had one a piece and moved to the Royal White white rioja which was reallllllllllllllllllllly good - wonder where I could actually by this for back home!In summation, GREAT spot, good service, weird parking situation but the wife and I plan on coming back to try more plates for sure!"], ["Megan C.", "We came here because we received a gift certificate, and enjoyed the food so much that we returned again. Great food and atmosphere.We ordered the Bocado Experience for 2, and it was more than enough food. We had a mix of hot and cold tapas based on our waiter's recommendations - everything was delicious. We also chose the seafood paella, which I highly recommend. Also tried the sangria and a couple of wine flights, which was a good way of sampling the extensive wine list."], ["Geoffrey H.", "First timer at Bocado. Meal: Enjoyed a 2 person $75 fixed price four course tapas dinner. First course was charcuteria & queso selection (meat & cheese). We chose chorizo and fried goat cheese which were paired with a small loaf of bread, fig spread & spicy pepper. It was great. Second course were the tapas. We chose four tapas from the menu including a great octopus dish and lamb meatballs. There were about twenty choices for tapas both warm & cold. A lot to choose from, but the waitress did  a great job going through the menu and pointing out her favorites. Third course was a great paella and lastly was a plate of churros. Drink: In addition to our meal we got a pitcher of white sangria which was about $30. They have a red house sangria that is about $20. Definitely interested in coming back! TEnvironment: Great ambiance, very open industrial feel, very long bar, seats comfortable & tables closely aligned to one another. A warning, the portions are small, but the come quick and by the time you we got half way through the tapas we were pretty full. Best to come here on an empty stomach."], ["Mary K.", "I've come here twice now. The first time was for drinks only - so didn't bother to write a review. The second time was Groupon driven.Very hip and modern decor. The only complaint about decor was that my boyfriend hated the chairs - they were oddly shaped - he opted to sit on the side of an end booth with me. The place itself is very narrow and the bathrooms are located at the very front of the restaurant where the entrance is. Nice long bar with plenty of seating.The groupon we purchased was for 2 meats/cheeses, 4 tapas, 1 paella and dessert (only one available - churros w/ chocolate dipping sauce). Meats/Cheeses - duck and pork loin, came on a cutting board with bread/spread - both very good. Tapas - calamari, venison, littleneck clams, shrimp burgers (highly recommend!), brussel sprouts (good but not worth the money). Paella - Classic, to me the paella lacked a bit of flavor and I'm not a huge fan of the crusty rice bits but my bf is so I let him have all of that. The churros were way too overly doused with sugar - way too sweet for me. We each had a sangria as well, both were good. All items are listed in Spanish but have very detailed descriptions.Overall - I really liked Bocado. So much so, we purchased another Groupon but if we were to return after the next visit - it would be for the Tapas and drinks only, no paella or churros."], ["Mario M.", "I like the concept very much. tapas are good. wine menu is great. paella is nothing to desire."], ["Brent R.", "Never having been to the original location of Cuban Revolution, I couldn't compare this new restaurant's ambience to that one, but my friend said it is much better in all ways. The only way I can describe the décor is very chic, European perhaps. This is a tapas restaurant with Spanish cuisine, and there are many from which to choose. We ordered 4 and devoured them. The duck leg was delightful. I can't even recall the others, but my friend, who had just returned from a month in Spain, said they were close but not precisely what he experienced there. Keep in mind that the plates are mostly quite small, so this won't be a cheap trip if you want a filling meal. But it's SO worth it for special occasions. The service was exceptionally good. The wine list is extensive. Go there and eat up. It's terrific!"]], "CAV Restaurant": [["Meg S.", "This was definitely a cool place to go for dinner.  The ambiance was eclectic and different.  We had a reservation, and were seated right away.  The host even pulled out my chair (I love when they do that).  The waiter was very knowledgeable about the menu and gave us a ton of information to mull over.  I decided to try their scallop dish with lemon risotto, and my boyfriend had their Sautéed Lobster meat over fresh-cut Pappardelle. We are new to New England, and are not used to ordering fresh seafood in restaurants.  As we embrace New England we have been trying to order seafood dishes to ease our way in whenever we're confident it will be of high quality. We both enjoyed our dishes very much.  I'd love to go back and try their chicken!  In addition, they had a substantive wine list, and my boyfriend ordered a very good old fashioned.  The tiramisu was delicious as well. For the two of us, we were just under $120 with a healthy tip.The patio looked really nice too, though it was too cold for us to sit out there."], ["Stephanie F.", "The scallops I ate here were the most tender, juiciest scallops I've ever eaten in my life - and that's saying something because I eat scallops frequently. The lemon risotto that accompanied my scallops could've been a little more buttery, and I thought the shredded snow pea garnish was an odd touch - but eh, the quality of the scallops made up for everything else.Rhode Island really does have awesome seafood."], ["Doug R.", "Ate here with friends early yesterday evening while in town for a special fall event. A reservation was made by one of our party based on nothing more than some advance online recon of several notable Providence area restaurants. Because of its numerous good reviews, appealing menu, interesting history and decor, CAV won out over the competition. From the moment we arrived and were seated, it quickly became apparent we'd made a good choice. We were immediately attended to by the affable manager on duty and an equally friendly waitress. Our group consisted of 8 adults and one child, and throughout the meal everyone's needs were addressed promptly and courteously.Over the course of nearly 90 minutes a variety of appetizers, entrees and desserts were ordered (and shared) by our group. To a person we were impressed with the quality, freshness and presentation of the food. Standout items were the pan seared calamari and crostini with wild mushrooms appetizers along with the caramelized sea scallops and seared shrimp over lemon zest risotto and shrimp and sautéed white beans ragout over cavatelli entrées. Honestly, EVERYTHING served was quite exceptional! For that reason, and also because of CAV's unique atmosphere and stellar professional service, I could certainly justify the 2-hour drive to dine here again. It's that good!"], ["Paul M.", "CAV - Providence, RI - 7/31/2015One of the things I love about Providence is the abundance of really good restaurants... CAV is one such place. As you walk thru the courtyard you approach what will be one of the most amazing restaurants. The staff is very friendly and they offer the convenience of online reservations. Parking is ample and it's a convenient place to go to. Easy on /off highway access make this an ideal restaurant to travel to...The decor tastefully combines Art, Antiques and purposely placed lighting and tables. We were seated on the left as you walk in in kind of a special area sectioned off by a railing..We started with splitting a Cristini appetizer.. A melange of wild mushrooms Sautéed with wine, fresh herbs, and a com case of fresh plum tomatoes served over toast points... If I tell you it was beyond amazing I would not be doing it justice... Just the right size for two people to share...For the mains.. The Pan Seared Diver Sea Scallops and Shrimps finished in Lobstah buttah and Balsamic Reduction, served over Lemon Zest Risotto with Julienned snow peas...Duck confit and seared Duck breast... Cranberry orange compote, brandy orange Demi-glacé over butternut squash mash... The breast was good but the leg...? Holy smokes!For dessert a cappuccino and salted caramel gelato..Decor, service and food preparations are second to none at an incredibly reasonable price. Highly recommended! Well worth the drive from anywhere!"], ["Jen W.", "I have been to CAV a few times over the past several years for dinner and just recently for brunch. Every visit has been a good experience. We once had a 'room' in the alcove to ourselves and it was delightful. Privacy created by hanging antique rugs, and attentive service; we felt like we were the only ones in the restaurant and our waiter was amazing. You used to be able to reserve for a private corner if you have a special evening planned.  As it's been (quite) a few years since then, I'm not sure if they still offer that option.On our latest visit for brunch, our party started with Walnut Encrusted Brie and Bruschetta. Wow all around.  I could have (and almost succeeded in) eaten the entire plate of brie by myself!  Buttery, warm, sweet, with buttery crackers.  Just what I hoped it would be.  The bruschetta had big chunks of tomato and artichoke with grilled bread wedges so you can take as much or as little as you like.  Again, a gastronomic success. We did not know brunch was served until 4:00 on Saturday and I had scoped out the menu in advance and knew what I wanted to order for lunch. The brunch menu is not extensive and one of our party has dietary restrictions so it took a while to choose. I settled on an omelet with spinach, feta and mushrooms. A very tasty flavor combination that was well prepared and presented.  I ate so much brie it was impossible to eat the entire omelet, although I did keep trying until the waiter rescued me from an exploding stomach by removing my plate!The ambiance is fun and light, the wait staff were all very pleasant and efficient. Service was at a good pace; nothing was rushed out to us so you know they were making everything as ordered.  The entree order was placed after our apps arrived, so there was a nice break in between that allowed us to enjoy the apps and each others company. Outdoor seating is available, but I really enjoy the inside of this restaurant as part of the experience.  With drinks and tip, it came to just over $30/person."], ["Sam S.", "We went for dinner this weekend...had a reservation and were seated immediately. Although the food was delicious, CAV's real charm for me came from the friendly staff and decor. The antiques, the lighting, and the small(ish) dining room made the restaurant feel cozy and warm. On first glance at the menu I thought I had decided on a chicken dish until Tom (our excellent server) provided descriptions of his 'favorite' menu items. After hearing his description of the 'sauteed lobster meat over fresh-cut Pappardelle\" I felt I had to give it a try. I was not at all disappointed and am thankful to Tom for pointing it out. Overall, love the ambiance, the staff, and found the pricing to be reasonable (my girlfriend and I each ordered drinks, an entree, and split dessert leaving the ticket to be a little under $100 before tip)."], ["Kristen B.", "Went for lunch with a friend. We both had salads. Both were unique and delicious. I had the tuna Romano. Excellent! They had many good choices on the menu for lunch specials. The service was great. Had everything we needed. Pleasant atmosphere. I wish they had parking but I found some street parking which was fine. I like the decor. The bar area was big. I'd like to go back for dinner."], ["Farah-Jane J.", "Came to Rhode Island for the first time for a wedding this weekend. My cousins and I decided to have brunch on sunday before heading back to NY. Yelp was so helpful because we choose Cav based on the reviews and we were not disappointed one bit. The decor is amazing, the lighting wonderful, really antique feel. Not a party type of brunch restaurant like NY but definitely the right place to feed your inner foodie. Our waitress was really attentive ,she knows the menu and gave us good recommendations. And the hostess was lovely as well. I will recommend this place to anyone."], ["Marty R.", "I went here for a group event and my oh my was this place a sight to behold! The decor alone was eclectic, ranging from African voodoo dolls to a suit of armor. Our event had a waiter walking around, offering us drinks from the bar and complimentary brie and crackers. The brie had an almond apricot topping that made me spoil my dinner!I absolutely loved the duck with cranberry dressing and sweet potato. The meat was tender, dressing extraordinary, and sweet potatoes well...sweet. Everything about the dish was a slam dunk!They served us salted caramel gelato for dessert. UGH, if the heavens could have invented a better finisher, they wouldn't. Creamy like ice cream, but also light and refreshing like gelato should be. The staff was polite, patient, and super helpful. I would definitely go there again!"], ["Frank T.", "Almost did not dine here due to a women, who I'll call big bird just barged right in while we were waiting for a host to greet us. Apparently big bird had reservations so I guess where she comes from you just cut in front of the peons. As I was leaving the restaurant my wife asked if we could give CAV another chance. Well I was hungry and did not feel like walking around looking for another restaurant so we waited and were finally greeted. We asked to sit outside in the courtyard since it was such a nice day but I was worried that they would forget us out there. But they did not and our server was great. I ordered a caesar salad and my wife had a tuna dish. First they brought out bread which was very good. The salad was also very good and just enough dressing. The tuna was a bit odd since we thought it would be a grilled tuna but instead it was like tuna fish from a can but tasted much better.The inside was eclectic, a large room filled with antiques and various other items hanging from the ceiling and walls."], ["Peter S.", "Groovy little joint with myriad antiquities (both real and fake) filling the walls.  Food was spot on with what was described.  Favorites were the Butternut Squash Flan, the Tuna salad, and the crème brulee which was shareable.  Prices did not match up with the menu exactly, and I would not call this place a value, but it was worth the occasional night out."], ["Marco D.", "Went for late lunch / early dinner. Waitress was very nice, service quick, all the food & drinks were delicious.  About $100 for 2 people included: bread to start, 2 cocktails, 2 salads, 2 entrees, 2 coffees."], ["Scott M.", "Overall quite pleasant . Extensive menu and well done . Food was delicious. Decor is interesting and unique indeed.I wish they had more obvious vegan entrees . This was not apparent at first glance of the menu and I hope the restaurant can reflect this as many of us look at menus online before coming to a restaurant . The risotto was made vegan for me which turned out to be good. They had some sorbet dishes for dessert which was splendid . This salads were also quite nice. One other criticism I must make was our waitress . She was too robotic in her questions and quite rushed . We just barely got our appetizer or dinner and within 60 seconds she would rush ton our table  asking if the food was ok ( we just barely started!) . This waitress needed to give us more time and act a little classier . This isn't Friendly's or Greg's."], ["Brewster L.", "Ate here on a crowded Sat night - 7 in our group.Arrived a few minutes before our reservation and seated promptly. Ordered the calamari, chicken pizza, and walnut brie appetizer. All great.  Everyone thought their dinners were some of the best they've had. I had the scallops and agree with another reviewer that the risotto didn't live up to the rest of the plate. Wasn't bad, just wasn't in the same league. If I got the scallops again  might ask for them to be seared an extra 30 seconds/side - I like a little more crust on them. But they were great regardless. Desserts were all great as well. Gary our waiter was great and provided the perfect pace for service."], ["Anze U.", "The experience is incredible! The ambiance is special because of the innumerable pieces of art from around the world, the food engages all the sense, the portions are well balanced and at the end of the meal you leave satiated and in a state of bliss, wanting to return again. P.S. Ask for the smoked apple martini:)"], ["Holly K.", "One word, obsessed! The second I walked into CAV I fell in love. I just loved the decor and atmosphere there, it is really hard to beat! I recently reached out to them about possibly having my rehearsal dinner there I am so obsessed, and their private dining area is gorgeous. We went with a bottle of wine for the table and I really appreciated the variety of options as well as the variety of prices. We had no problem finding an affordable bottle that we all agreed on. I went with their hand cut rolled pasta with ricotta, in a shallot cream sauce. The finace went with the duck two ways dish and ate every bite of it. He preferred the duck breast portion while my friend Laura T who got the same dish preferred the bbq-ish leg. The pear chicken dish was also ordered at the table and was raved about. Basically there was not one thing that we would have changed as far as entrees go.Although the dessert menu looked impressive we all had so many desserts left over from Christmas that we decided to pass. The service was great as well.They have a free parking lot directly across from the restaurant, you really can't beat that in downtown Providence!"], ["Beverly S.", "Update:  I've been back to CAV So many times now, I cannot even count them.  THIS is where I take out-of-town guests and it never fails to wow them.  The food is excellent and always imaginative.  The decor will blow your mind.  I want to take everything in there home with me!  (Actually you can, for a hefty price, so I haven't!)Just go there - you will never regret it.  Great for lunch and dinner - free parking in a large lot across the street."], ["Hal M.", "Went here for Mothers Day and while I understand that any place is going to be busy on a holiday such as this, that doesn't excuse poor food and sloppy service. It took nearly an hour to get our meals and once it arrived the poached eggs were hard and cold. The bacon was basically raw and the potatoes were undercooked."], ["Katie B.", "Incredible. Really amazing dinner experience, and I do mean that sincerely!I had been wanting to check out CAV for a while. It had been recommended for brunch by a coworker, but somehow I could never fit it in (it is, for the record, somewhat off the beaten path). When my family came to spend the weekend and we were looking for a nice dinner, I decided the time to try CAV had finally come.Everything about this place is adorable. The outside patio area is quintessential Providence - eclectic, with a vintage vibe. Tables with umbrellas on the stone terrace, and trees with the sparkling lights, in an old mill-type building? Gorgeous. We were early for our reservation, so we decided to start with a drink outside. It was lovely - and our service was impeccable (shout-out to Tom for being a great waiter!). Once we ventured inside, the experience just got better. Tom, our waiter, was extremely attentive. He deftly explained the top choices and specialities, and was patient as we made our decisions. Everything was delicious. We started with the Goat Cheese Croquettes, followed by the Sophia salad (highly recommend both). For dinner, three of our party ordered the local-caught Caramelized scallops (all unanimously loved them) while I had the filet mignon. We topped it off with salted caramel gelato, tiramisu and chocolate mouse cake. It's a little pricey, but nothing out of the realm of ordinary for Providence. It's a dress-up-or-casual as you choose type place, which typifies some of my favorite places in Providence. I would recommend CAV to anyone, and will certainly be back."], ["Andria T.", "This restaurant is my new go-to when family and friends come to visit.  It's always tasty, and I feel like the eclectic decor and menu really sum up what Providence is about. I've never had bad service or bad food, but dinner can get a bit pricey sometimes.It feels a bit like cheating, but I honestly have nothing else to say.  It's a good restaurant--you should go there."]], "La Sonrisa Restaurant": [["Brandon R.", "Just had some takeout from there. Pork and rice. Awesome food and no shy on portions for 8 buck"], ["Silvia R.", "I will not set foot in this restaurant under any circumstances. Staff is rude, they wiped the counter were they serve the food and dropped the paper towel into the beans, pulled it out and continue serving as if nothing had happen.Their hot oatmeal drink tasted burnt.If you call to order food, good luck because they will still not have it ready when you arrive and make you stand in line (poor customer service at its best!)"], ["Sandra O.", "We ordered one meal for two. 6 of us ate a bit of it and now we are sick from food poisoning!  Horrible food!"], ["Margaret G.", "I've been eating at La Sonrisa for years. There was a short period of time that I avoided it, the food was not as good as it had been in previous years. I went a week ago and was so happy with it. Rice and beans, chuletas, pernil and a chinola for $7, you can't beat it."], ["Christian V.", "La Sonrisa is a great place to pick up some great-tasting Spanish food on your lunch break or if you're just in the mood for takeout. I can't really recommend anything except everything! Definitely try something new because, like a lot of Spanish and Spanish-influenced cuisine, La Sonrisa's food is bathed in flavour. Their drinks and in-house made juices and smoothies are a great little pick-me-up on those hot summer days and winter nights when you're feeling a little under the weather."], ["Sara F.", "Delicious food at a great price! We love the mofongo con camarones. The portions are huge and we usually take home leftovers.  Worth a try."], ["Truth Be Tol D.", "This place is fantastic!  If you're in the mood for some delicious rice and beans, stew chicken and plantains, this is THE SPOT to go.  This restaurant is CLEAN and it has a dining room if you'd like to stay and eat, or of course you can take your yummy eats to go.  The ladies are always pleasant and the food is always great!"], ["Philip S.", "This place is called \"La Sonrisa\", so that might explain why there's zero reviews here.This place looks like it wouldn't serve food better than your middle school cafeteria, but looks can be deceiving. The food is actually really good. I tried the Salmon and the mashed/fried green bean dish (sorry, I can't remember the name. It was in Spanish). Both were very nicely prepared. And the portions are huge; I don't think anyone was able to finish their meal here.It's a nice place to eat and catch up with friends."], ["Linda L.", "i just went to with my friend and it was my second time going there and the food is delicious, the service is ok, the first time i felt more welcome than the 2nd time. i order rice &beans with ribs and stewed chicken, their ribs are so tender and delicious overall good flavors and stew chicken was very flavorful and tender. the area is okay more like a take out spot."]], "Red Fin Crudo & Kitchen": [["Kristen T.", "I heard that this place was amazing. I went down with some friends who were here from out of town and I give it a five star rating !! It was a cultural experience to try all kinds of tapas from different regions . I was tasting the food and it was all exceptional !!! our server was knowledgeable and friendly !! We had flavorful desserts. Then we met the owners and tried the soup if the day and sampled a Cuban on fresh pretzel bread! What an experience and so much flavor !! Check this place out !! I'm excited to go back for Sunday Brunch :)"], ["Jim M.", "Went here on a Friday night after we gave up on a table at Providence G Rooftop after 90-minute wait. We were seated in under 5 minutes and the staff was courteous, helpful and pleasant from the moment we walked in the door to the time we left (everyone there said goodnight to us -- it felt like we were at home). We ordered a bunch of tapas items and all were great. Our favorites were the Brussels sprouts and the cauliflower dishes. Oysters were $1 apiece from 9-11 p.m. and they were fab as well. Will come back."], ["Neal D.", "A new favorite in Providence! Outstanding cocktails, fantastic options for oysters and a creative and well executed menu. We sat down at the bar and were greeted with one of the more friendly and helpful bartenders I've ever encountered. He made fantastic suggestions that really helped us make our decision. Also, they have a daily ceviche special on top of daily cocktail specials! I can not wait to go back."], ["Myesha B.", "Though I am giving a 4 star rating it's between a 3.5-4. I came in on a Tuesday around 6:30 with some classmates to do a class project. We were seated immediately in the bar area, our waiter came and greeted us soon after and informed us of the beverage and food specials for the day. Took our drink orders right after. 2 of my partners ordered the raspberry iced tea which they said was really good. When we ordered our food we started off with the croquetas de jamon. There were 4 of us at the table and received an order of 3 croquetas. They were very good and full of flavor though it would have been nice to know that there would be 3 in an order so we could either decide to order another tapa in addition to the croquetas or just order something else with more food. After the tapa was cleared from the table it took about 20 minutes for our food to come out which is a good amount of time to wait. One of my partners ordered the Red Fin Salad which she said was delicious and the greens were fresh. One ordered the mussels which she said were fresh and had a smokey flavor to them and the cilantro and salsa verde was very good though there wasn't any pickled jalapeño. The plantain chips were green plantains which were bland and were placed on top of the mussels mainly as a garnish. Another partner of mine ordered the fried chicken with braised greens and cornbread with some sauce on top. The cornbread was slightly over baked so it was hard to cut through with the fork and knife. The sauce was hidden but also didn't taste that good. Then braised greens were delicious and the best thing on the plate. The chicken was NOT seasoned and simply hard to eat, she took one bite out of the chicken and couldn't finish it. It was like the chicken was battered in something unseasoned. And I ordered the paella without the clams and mussels. Ahead of placing my order I asked which did our waiter prefer the baca Frits our the paella and he informed me that they were sold out of the steak which would have been nice to know ahead of time. But before coming here I seen a picture of it on the app and thought it looked delicious, I was disappointed by it unfortunately. The rice base used for it had no flavor at all, the chicken was bland and the chorizo was dry and not the best but had some flavor. I personally do not like to add salt and pepper to my dishes when I go to a restaurant but it was needed. I had to wait 5-10 minutes for our servers I come back to our table and ask how everything was to get salt and pepper. After dinner we ordered desserts. We split 2 of them and ordered the triple sin chocolate cake and the brownie sundae. They were both good but the scoop of gelato that accompanied the brownie was tiny as heck for the big piece of brownie. The check took forever to come because it seemed as if they were under staffed and our server was waiting tables as well as working the bar. At one point while waiting for the bill the bar wasn't busy and we expected him to deliver the check but got nothing. We waited about 10-15 minutes for the check. While waiting he greeted a table next to us and introduced himself to the table of men (which he didn't with us) and took their drink orders. After he brought us our checks we made sure to give him the money before he left again. The restaurant is beautiful from the area we saw because we weren't offered a table around the corner away from the bar. Our waiter was nice and friendly though knowing his name would have been helpful. One of the owner's came out and brought us our food though you wouldn't know it was her unless you have visited the website or have been there before. She came and left quickly to go back to the kitchen. It was nice to be able to tell that she was working and helping the BOH and FOH. Though a couple of the entrees weren't that good I would like to go back for the octopus tapa and maybe more or hopefully their Sunday brunch"], ["Nathanyle P.", "I give it a 3stars great! Great! Service my boyfriend and I sat at the bar. And was greeted right away by the bartender taking drink orders. We got the chicken wings special which was in my opinion under cooked and over breaded. We proceeded to get the paella which had chunks of well saffron sliced chicken, mussels, little necks, and rice. The shellfish unfortunately was a little sandy. And I did not taste much saffron in the whole dish. Overall service was great. The food was good but not outstanding like expected. So it deserves an average score."], ["George S.", "STOP reading my review and get over there already. This place is VERY VERY good. It's a new place in downtown that prides itself on their \"scratch kitchen\"I had the best burger ever at this place and I love their white sweet potato fries.Everything is made from scratch including their ketchup."], ["Kristen L.", "Every single bite was perfect. PERFECT!! I have never given a 5 star review or even thought about it! We have spent some time in Spain and love tapas, buts it's hard to find really great tapas... This place is it! Excellent service, cool and funky space in a newly bustling area. Can't wait to go back and try the paella which was served at the table next to us and looked wonderful!"], ["Michelle L.", "Food was terrific and atmosphere is great!  Steak and eggs were so fabulous I would recommend this place in a heartbeat!!  If you're a Bloody Mary & seafood can try the Bloody Rhody!"], ["Jack G.", "Fine dinner: calamari seviche on crispy tortilla, amazing not-cream-laden mussels w/salsa verde, brined/roasted/fried chicken on bone w/collards, corn cake -- Puerto Rico meets US Deep South...nice mescal cocktail, friendly vibe, surprisingly low price points for the food quality and ambiance."], ["Joe D.", "service was incredibly good they did a wonderful job taking care of a party of 13 it's definitely a place I would love to go back the food  wasn't great  but I enjoyed it I would recommend it ."], ["Hasan R.", "All around a great experience. Highly recommend to anyone in the area looking for a delicious bit to eat."], ["Patrick B.", "This place does it right. Friendly service. Outstanding, well-executed, flavorful food. So happy to have another quality tapas place in Providence. Very welcome addition to the city. Honestly can not wait to go back."], ["Edison M.", "The food here is nice.  The quality of ingredients to the presentation when the food arrives, are all commendable.  The only reason why it's not 4 stars in my eyes is something very simple that goes a long way.  A dish can contain all essential textures and components but without the proper seasoning (salt) the dish will not be at its greatest potential."], ["Lydia G.", "Visited Red Fin today for Drag Queen Brunch and it was phenomenal.  The entertainment was great and the buffet they put out was very very impressive.  The shrimp cocktail were giant, the eggs were beautifully done, and we received a complimentary cocktail ....we had bloody Mary's which were delicious.  So nice to have a place downtown that serves such a beautiful brunch...can't wait to head back!"], ["andrea l.", "Good food nice servers but takes way too long to get food delivered Tapas style is supposed to allow you to order as you goWe stopped ordering although we were still hungry because it took too long between dishes"], ["Bradley C.", "Don't miss this - these guys are KILLING it. Open 2 months and top flight everything. In Brooklyn you'd never get in."], ["Scott C.", "Place has a nice atmosphere and guests, however the staff can be rude and obnoxious toward customers. Don't judge a book by its cover Fin staff"], ["Frohman A.", "An inspired and diverse menu that is complemented by its use of local and high quality ingredients. My new favorite place. Sat outside for lunch and came back the next week to have dinner inside. I need to go back to try more, there's so much good looking food from the sea and from the land. The paella was amazing. The cheeseboard, refreshingly good (they are usually a disappointment at restaurants) and the offering of Iberico jamon was a plus as well. Love that they source from pats pasture also. Will be back soon!"], ["John O.", "Nice decor but a long way to go with getting food down, pricey drinks but bartender new his stuff. Duck confit gnocchi tasty but no clue on how to make a proper gnocchi, octopus dish was tasty but couldn't find the octopus. Paella I think I've had better at a change restaurant. Clams not in she'll overlooked, scallops like rubber and rice undercooked ."], ["Enrique C.", "Exceptional taste, presentation and service.  Everything we had was delicious; especially the oysters and hamon.  Adam was awesome and very knowledgeable."]], "La Roca Restaurant": [], "El Eden Restaurant": [], "El Salvadoreno Restaurant": [], "El Paisa": [], "Montecristo Restaurant": [], "Waterman Grille": [], "Spain Restaurant": [], "Carolina Market Restaurant": [], "Gracie's": [], "Romeo's Kitchen and Cocktails": [], "Pito's Restaurant": [], "Budare Grille": [["Heather H.", "What a find! Great place, clean, all fresh ingredients.  We had arepas, cachapas, plantains...  All delicious. We'll be back."], ["Lisa M.", "In the past my husband and I had eaten at a Venezuelan place in RI and he wasn't impressed enough to ever go back or really try venezuelan food again. After reading all the reviews, being in the area and me really wanting to try it, he agreed. It was a score! Ordered several things and they were all amazing!  The owner was there and very friendly and welcoming.  We will absolutely be back, probably sooner than we think because my husband loved this place."], ["Kim W.", "Went to Budare based on the amazing Yelp reviews, and let me tell you they were not wrong! Great food and service. Arepas are amazing. Definitely worth the trip to Central Falls. Also just a mile away from Paint and Vino in Pawtucket so a great place to get dinner beforehand. I will definitely be back!"], ["Bruce R.", "Wife and I loved the fresh ingredients and super tasty sauces. Nice portion and a large selection of ice cold beers. Family operated and they are super nice to talk to and easy to root for their success. We will be back!!!"], ["Justin B.", "I really enjoy going to the Budare Grille.  Today when we arrived, Colombia was beating Greece in a World Cup soccer match, and the excitement in the restaurant and on the street was  kind of contagious. Jairo and Raquel (the owner and manager) were very friendly.  I had the cachapa con steak y avocado which was excellent.  My family and I also got to practice our Spanish a little, which was fun."], ["J B.", "Great great authentic Venezuelan food! Everything is made fresh and from scratch!  The staff is lovely! Decor is fresh and inviting! A real gem! Try it!"], ["Liz R.", "Decided to give this place a try after seeing photos of some of their dishes and it did not disappoint.  Excellent food and service.  I'm still dreaming about the cachapas.  Delicioso!"], ["Eric M.", "My lunch today was stunningly unique and delicious. Jairo and Raquel made my first experience with Venezuelan food a memorable one.  They helped me select a couple of amazing arepas and prepared them perfectly. Thanks to them both; I will be sure to eat here again!"], ["Patricia P.", "Love it.. The staff is amazing.. I have never eaten at a place like this and they were so good at explaining the menu to me.. I also have many food allergies and they were very accommodating.. Highly recommend this restaurant."], ["Alejandro R.", "It gets better and better every single time I walk in! I'll keep this one short since I already posted a review for this amazing business in the smallest city in the state! Don't miss out on trying some great tasting Arepas."], ["Fernando S.", "My wife and I know arepas very well as we are from Venezuela and Colombia, these are the best arepas around here."], ["Francis F.", "Amazing. Great food, super friendly. The arepas are great (hungry guys will need two or more) and the fruit juice (the passion fruit is better than mango) is fantastic. Heaps of praise."], ["Cynthia A.", "The food here was really tasty. I had the Patacones rellenos (tostones plaintain sandwich) with grilled steak, avocado, and cheese. I especially liked the taste of the grilled steak - tender and juicy. They have 5 different sauces which I sampled with some yuca fries but I ended up sticking with the spicy one for the sandwich because otherwise it would have gotten too salty.The service was very friendly. The owner scrolled through pictures on this tablet and explained some of the dishes to us because my boyfriend and I probably looked a little confused when we walked in. lol We really couldn't decide what to get. Although I like arepas, I wanted to try something new and Patacon ended up being a good choice.We accidentally drove right past this place because their sign is hard to read while driving so careful with that -  it's next to a barber shop."], ["Thoa N.", "This place is delicious!! I got the steak arepa, the meat was tender and juicy. With every bite I was sad my arepa was disappearing. Highly recommended!"], ["Sean M.", "We just did Budare Grille for the first time and couldn't have been happier. Our 5 year old announced that she wanted to come back for her birthday every year. It's clean, friendly, and the food was amazing. Definitely worth checking this place out. We will be back."], ["Jillian J.", "I went here with my boyfriend the other day.  His idea of exotic food is eating at taco bell, so he was a little hesitant about trying something new.  In his defense, I also did not recognize anything on the menu.  The staff was super helpful and went over the menu with us, showing us pictures and not laughing at us when we butchered the pronunciation. I got a shrimp arepa and it was amazing and very fresh. My boyfriend got some sort of corn flour pancake filled with steak and cheese which was also great.  The staff was nice enough to give us little samples of all the sauces to try as well.  We will definitely be back!"], ["Clarisabel R.", "Food is amazing, super fresh,super tasty and is super clean.. I had the Mi Margarita arepa and I was craving more... Awesome service so friendly and fast... Wonderful environment for family, a vouple or just yourself trying to eat something goodd n quick... I loved ittt ill be backk n backk.... The sauces arree amazinnnn and a great compliment to ur food.... Everything you have here will leave you craving for more..... The owner and staff are extremely friendly and very upbeat about their food... Great neighborhood rest....."], ["Margaret B.", "I went here with my husband and my daughter and had a great lunch.  The owner was both extremely helpful and friendly.  We had the yucas for a starter that came with four tasty sauces, and a variety of arepas for a main course.  All were excellent.  The prices were a nice bonus too.  We will be returning."], ["Luisa C.", "A relative new place, opened a little less than a year ago, this place is a true gem in Central Falls. Its a very discrete location so it could very easily be missed but look hard,It's still there and totally worth it. The food is so fresh, the service is awesome. I keep coming back almost weekly when I feel like some healthy, delicious fast food. I have tried almost all the arepas and their corresponding version in green-fried plantains (tostones). I can't get enough of them and all of them are a hit. Very highly recommended. You can't go wrong with this place."], ["John R.", "I walked in not knowing what to expect, but the staff was very friendly and helpful. The ingredients for my wrap was very fresh and soo delicious! The establishment was very clean and I felt very welcome. I've had plenty of wraps in my life, but that one was by far, THE BEST that I've ever had. I highly recommend going in for a bite to eat any time! Seriously the best tasting food I've had in a long time. TRY IT!!!"]]}