{"Pattaya Thai Cuisine": [], "Four Seasons Restaurant": [], "Pakarang Exquisite Thai Cuisine": [], "Lim's Fine Thai and Sushi Restaurant": [], "Thai Orchid": [], "Lemongrass": [], "Apsara Palace": [], "Ruby Thai Kitchen": [], "Asian Bakery & Fast Food": [], "Green Basil": [], "Apsara Restaurant": [], "Rim Nahm Thai Cuisine": [], "Angkor Restaurant": [["A Z.", "First things first. The Nam Yaa Soup aka \"Medicine Soup\" is a highly coveted secret passed down from college student to college student. When you have a cold, you go to Angkor and get the Nam Yaa. It's amazing. I've never used the term \"explosion in your mouth\" or \"tongue orgasm\" before, but I think it's because I've been waiting until now. This soup is very, very different and it's not like any other soup I've ever tasted. If you like Pho, you will probably like it, because while it's not that similar, it has that same.. \"hmmmm... ohhhhhh!\" effect when you first taste it. It's sweet, spicy, and it'll make your nose run. Make sure to eat/slurp it while it's piping hot, because like any other soup, it's best when it's ready to burn you.As for other things... I'm not a fan of the street noodles, but I do love the Brittany Noodles.Their new location is lovely. There are only about 5 tables and a few stools at the counter, but it's not a very busy place most of the time (but always still pleasantly occupied). Granite countertops, a flatscreen TV that plays Cambodian music stuffs, and new tables & chairs.I've also had their Sweet & Sour soup and their Tom Yum (aka Hot & Sour) soup. I will always prefer the Nam Yaa, but in order of preference, I'd probably go with the Nam Yaa, Tom Yum, and then Sweet & Sour. I say this only if I HAD to choose, but I've gone in and bought all three before to freeze two of them for a later date.In any case... if you're sick, this is THE place to get soup in Providence."], ["Bailey M.", "The first thing you'll notice when you walk in is that this place is TINY. However, it is decorated nicely and there is a TV on the wall playing Cambodian Karaoke if you are so inclined. Our waitress was delightful-- very friendly, quick, and helpful with explaining the dishes on the menu. The best part of the meal was the fried cod-- I highly recommend it. All of the dishes (spring rolls, noodles, pad thai) were fresh tasting and delicious. I would definitely come back."], ["Mandy D.", "I can't even begin to rave about the Naam Yaa soup, although it seems that everyone on the page has done the job for me. Everything on the menu that I've tried has been exceptional so far. My favorite dish would have to be the green chili, hands down. It's got the perfect balance of spicy & sweet. If you're more daring, I'd suggest the red chili which is much spicier. Also, the mini eggrolls are delicious, and they come out quickly so they're a great starter.I can't wait for the new upstairs dining to open up. I'm sure to be back soon!"], ["Benjamin T.", "It might be a little hard to spot, tucked in just off Wickenden Street behind Adler's Hardware, but this little place is worth seeking out.I'm no expert on the subtleties of Cambodian cuisine- all I can say is that the food is delicious.I was especially impressed with the Nam Yaa Noodles, which warmed my soul and filled my stomach on a cold, grey December afternoon.I spoke at some length with the owner, Chut. He is the chief cook and bottlewasher, as the saying goes, with some help from his family, all of whom are descended from a Cambodian family that were (before the Communists arrived) cooks for the Cambodian royal family.Very friendly folks, a nice cozy place- a real gem for the city, which is increasingly becoming dominated by huge corporate chains."], ["Sue K.", "Wow. Just had a delivery service and it was so fast & quick! (mainly b/c I live literally two blocks away from the restaurant haha) but still, it took approx 20-25 min! and I ordered 3 dishes. Spring rolls (non-fried) were fresh and delicious! Their house sauce (i think it's mainly fish sauce) was good with it. Pad Thai was really good too! and i was surprised how they put a lot of shrimps in it! loved it. I also had crispy chicken wings and they were really good ;).  Spicy and cripsy!I am definitely going to order from them again. I still haven't sit down & eaten at their place yet but I really want to! Thanks for the delicious meal Angkor! also for the fast delivery while the whole east coast is having a major storm :)"], ["Angela D.", "After reading these reviews, I knew I had to check out the Nam Yaa. I am so glad I did! My husband got the Tom Yum, we split an order of lot, and ordered street noodles with shrimp & pad Thai. It became obviously clear we'd ordered far too much food once the soup appeared pipping hot to our table. The small is a general portion; so delicious.  As we sipped our way through the soup, our noodles were quickly considered tomorrow's lunch. The small amount of noodles that we did try were flavorful, with just the right amount of requested spice, and the vegetables were crisp, shrimp perfectly cooked. Looking forward to lunch."], ["Thomas W.", "This restaurant is tucked away off Wickendam.  It has a pleasant atmosphere and decent food.  It is not a place for foodies.  The fried dumplings we had were very good, but my Pad Thai was mediocre at best.  I asked for it to be a little spicy and they went crazy with the red pepper and jalapeños.  That did not bother me, but the noodles were not fresh and were melded together.  I would try another dish."], ["Greg L.", "The Naam Yaa (medicine soup with chicken and shrimp) was unique and amazingly tasty. Nantaing (sweet ground pork with coconut milk over rice cakes), Green curry with beef were other delightful highlights of lunch last week with Andy van Dam who's a great fan of Angkor and a fanatic foodie. Go, go, go!Great staff and happy owner. Service was cheerful, attentive and very helpful. New location is small on the ground floor, but second floor dining will open soon (late Dec 2010). Free delivery from 5pm to closing at about 9pm."], ["Jonathan M.", "Excellent curry, abysmal salmon.  Could have made the salmon better at home."], ["Matt S.", "I can't speak to the authentic nature of the 'Cambodian' element of Angkor's offerings.  The afternoon I ate lunch at Angkor, I was sitting next to a traveling couple.  The (a little bit too loud, slightly obnoxious) male of the couple ordered items that he seemed to consider especially Cambodian and was enjoying everything he ate.  (I swear, I wasn't listening in.  He was hard to ignore.)This said, I had a red curry that I would have identified as inline with many \"ThaI\" curries that I've had.  The spice level was perfect and it was a great lunch.   I was thrilled to find Angkor in this neighborhood, and I'd definitely return there again."], ["Edwin L.", "When it comes to asian food, would someone non-Asian giving a review on sushi has any weight? Would you ask a plumber for USA PATRIOT and Terrorism Prevention Reauthorization Act of 2005 financial advice? NO, I didn't think so. I'm Asian so LISTEN UP!-=Décor=-I was quickly seated and had wonderful Dim Lighting in a Romantic setting. *wink* *wink* This is truly a tiny restaurant... maybe a front of a house converted into a little dinner.  The décor is very unique but I felt at home. -=Service=-Service was prompt. My glass of water never came close to the half empty point. The servers didn't have a system so both of them tried to take my order... but the first server was very knowledgeable for what is on the menu and how it was cooked.-=Food=-I didn't waste any time! Main entry right away! I had to see what all the hype was about! Rice and Fish are the main staple of the typical Cambodian diet though many dishes are prepared with beef, pork or chicken. Sea food is abundant in coastal areas with shrimps and crab among the favorites. This includes fish-cooked in coconut milk and a variety of soups, and curries similar in taste though not in spiciness to Thailand. Truly an authentic Cambodian joint! I love the food!!!Side Note: they do accept credit cards for any order over $15.00I'll recommend this restaurant to anyone and everyone who isn't scared of Khmer Food Menu Cambodian authentic food!"], ["Helen W.", "I think it's my first time having real Cambodian food.  I think usually most of the SE asian foods are similar so I'm not sure of the difference.  The Nam Ya soup was awesome.  I thought it would be similar to Tom Yum but it's different and better.  We had the Saraman Curry which was a sweet curry, also really good."], ["Alma C.", "Decent Cambodian restaurant off Wickenden. The food is good, the service is attentive, and the restaurant itself is small and family owned. The prices are reasonable for the area though a little higher than other Cambodian I've had off the beaten path. Worth a visit."], ["Huong N.", "We found this place picking up some things from Adler's and decided to stop in and have a bite.  I was pleasantly surprised stepping into the quaint and cozy dining area.  It felt like coming into someone's home and they are inviting you to eat their home cooking.  And that was exactly how the food tasted.  I have been spoiled by fresh authentic south east Asian cooking from my travels and good old fashion home cooking so my expectations for the cuisine is high.  But we walked in with no expectations and found the experience to be enlightening in the least.  The bubble tea was perfect to cool off with in the summer heat and the \"lot\" appetizer (mini taro egg rolls) were delicious and perfectly proportioned.  I ordered the Rice Mitapheap with shrimp (garlicky rice with choice of protein and a side of pickled veggies).  It reminded me of the simple home cooked dishes with complex flavors my family used to make and still do.  Simply good in a no frills kind of way.  My partner ordered the spicy noodles and they were fantastic.  We had some questions about the menu and were greeted with the warmest and friendliest responses.  I definitely want to come back to try some of the more \"fancier\" dishes.This is no fancy place and don't expect the food to taste like anything you have had before unless you have already eaten here.  This is someone's family business that is offering up recipes tweaked by their preferences and wholeheartedly serving up to the public in hopes of pleasing someone.  And I am pleased and plan on coming back soon!"], ["Don W.", "This is one of our favorite restaurants anywhere.  Originally started by a woman whose Aunt was a chef in the Royal Palace in Phnom Penh, Angkor serves the royal food of Cambodia.  For appetizers, we love the lot (served with a home made hot and sweet chili jelly) and Angkorian chicken wings (moderately spicy peanut sauce with lightly fried basil leaves and jalapeno pepper slices) .  They also make one of the best fried dumplings anywhere.For entrees, we like Rice Mitapheap, Chicken Ramvong and Street Noodles.  The whole fried fish, with 4 sauces to choose from, is also excellent. BYOB, inexpensive great food and cheerful and friendly owner and staff make Angkor an amazing experience.  If it isn't too busy, ask the owner, Shootemah, to tell you how he survived the killing fields - chilling and inspiring at the same time.  Providence is lucky to have this restaurant."], ["Holly S.", "Nim chow and pad thai, yummy and cheap, very small inside, but that's ok, service was good, cept they had no shrimp that day :("], ["Chun C.", "I wish i can give them no star,I read all reviews about this restaurant, and I decided give it a try,so I called, by the way, I was in the Biltmore hotel,and I asked for delivery, I spent 40 dollars just for the food, when I had it, there don't have folks and spoons, I called them back right away, what they told me is : I didn't ask for it, they can't bring it back! Fine, if they can't bring it back, but don't try to make me feel like that is my fault, didn't apologize to me!How many people go to hotel bring their own folks? About the food, I ordered pad tai combination and no shrimp at all, street noodle combination no shrimp at all,  I don't know what to say, I didn't called them back, maybe I just had bad luck, but I m a one time shopper to them of course ."], ["J. F.", "Well this place is no Apsaras. Its a rather small place off Wickenden St. I realize that rent is expensive here and adds to the price but it does kill the business somewhat. I've been here before and had the street noodles. I decided to try them again... It seems like they overcooked it again... The chicken came out like it was freeze-dried. Sort of flaky. Almost everything I have eaten seems to be over done."], ["R B.", "If I hadn't had great Cambodian food before, this place would not send me running back to try it again. It was just okay. The medicine soup was good, but like everything else, too sweet. None of it had the sprightly freshness I associate with Cambodian food. Service was sluggish. Bathroom was...don't use the bathroom.The patron at the next table with the consumption cough didn't help either."], ["John L.", "Finally was able to come try out this place and the food is very good. I came with a friend and we created a four course meal that was exciting and delicious. The exciting part is a little hard to explain so I'll just explain the delicious part.So, we decided we will split all the food we ordered. For starters, we got two appetizers, the Nime Chow and  Chicken Satay, both were excellent. I personally prefer the sauce that came with the Satay over the peanut sauce from the Nime Chow, but that's just me. Not too much of a  fan of peanut sauce... Next for the entree we ordered the much talked about on Yelp, the Nam Yaa soup. It has a sweet and spicy taste that is pretty unique and very good! We also ordered another entree, the Beef Spicy Noodle dish. I love scallions with any type of food and they certainly did not skimp on it. As for desert we brought a bottle of Lagunitas Cappuccino Stout. I call it desert since this was tasted like Cappuccino. The restaurant is small, so we went early around 7 to beat the crowd on a Friday night and it turned out to be a great idea. There wasn't much people eating there yet. The service was great and so was the decor. They also had some ethnic karaoke on tv that looked like a bad soap opera. But it's part of the experience, I guess. I would definitely go again to try the other dishes and since it's BYOB, the \"dessert\" menu is unlimited!"]], "Sawaddee Thai Restaurant": [["Robert S.", "Went there with my friend Diego and we enjoyed our meals.We shared the Nime Chow appetizer and it was fresh and light.   The peanut sauce was very tasty with lots of peanut pieces floating on top.Diego had the Chicken Pad Thai and he said it was very good.    The bean sprouts come on the side, as well as the peanut pieces.   The dish was on the small size.   Yes, the portions at this place are not ample, but kind of small.....:-(I had the PAD WOONSEN - a dish consisting of crystal noodles stir-fried in light brown sauce with shrimp, mushrooms, baby corn,onions, scallions and eggs.    It was light and delightful.   Overall a good meal.       Again, I wished it would had been a bit larger....The place is small...only about 10 tables.    But the service is attentive and prompt.    The restaurant is BYOB.   They do not take AMEX nor Discover.    VISA and MC...yes."], ["Paul M.", "Okay, this place got a lot of hype but I was super disappointed. The food was decent, but everything was cold (except for the water!) and the portions were pretty small. Went with 3 friends and ordered two appetizers and 3 entrees and weren't quite full when we left. Also, this place is TINY. It feels something like sitting in a stranger's lap to eat at Sawaddee. I don't think I'd go back-- the other local Thai places are much better. We got edamame, chicken satay, eggplant pad, chicken drunken noodles, and a red curry with tofu. The curry was rather delicious, but everything else was a bit on the bland side.Recap: tiny place, tiny portions, okay food but nothing was warm"], ["Neha S.", "Solid thai food! Definitely the best Thai place that I've been to in Providence (admittedly not a very high number, oops).The Pad See Ew in particular is divine. I used to get it with tofu and vegetables, but I found the tofu a little dry and now just go for vegetables. The green curry here is also delicious. The thai iced tea is I think it could have done with a little more milk to round out the sweetness.As a heads up, this place is very small and not good for large groups. I wouldn't come here with more than 2-4 people on a weekend or you'll never get seated without a reservation.VEGETARIAN ALERT: a lot of the vegetable soups use chicken stock and a lot of the noodle dishes are made with fish sauce, so avoid the soups and ask them to make your noodles with soy sauce instead!"], ["Queenie L.", "We were craving for asian food so went to this neighborhood Thai food place.  Cute cozy restaurant, nice waitress but I wish I can score this place with more stars.  Everything taste like home made, did not meet the restaurants standards.  ;("], ["Joie S.", "I finally tried this place after hearing so much about it. I loved it! I had the angel shrimp and the Sam-Rod. Both were really good. It's also BYOB which is a bonus. Parking is super easy and the prices are comparable to other places. I've been wanting to go back since I left! The place is tiny so I bet there can be a wait during really busy times. We went around 8:30 and didn't  have to wait at all. If you like Thai food, check this place out."], ["Lou G.", "Very good spot.  Food is great and very fresh.  The place is small, good service, and is pretty quiet.  I go here often."], ["Rob F.", "Sawadee means Hello in Thai. Sounds inviting!  When the college kids are in town, you can't get near the place. It's small, and there may be a line out the door.  There are maybe ten tables. I ate my way through their small menu and wound up ordering tom kah soup as my go to dish.  A big bowl with chicken and coconut soup, and rice noodles. Little cups of chili, salt, limes, basil.. Back when I brought my Mom to the place, she would get the chicken noodle soup and I would get that. I would not order it to go however. I ordered two orders to go once, and they put both orders in a quart container, and it was half full and there were no noodles. I refused to take it. I spent 5 minutes arguing with a little Thai woman, but I'm not paying $20 for $5 worth of soup!  Daniel B put up a pic of his two orders of soup just recently. Check it out!  Sad!I tried the green and the mango curries everyone talks about. I thought they were small and watery. Hot, but watery. I had the whole fried fish a couple times. I'm not a fan of farm raised rainbow trout. It would probably blow my doors off if it was a scup or flatfish. It is crispy with fried garlic and chilies on top.   The place is out of menu options for me. I've moved on to places like Pattaya and Pho Horns, Bee's and even Apsara, which I like better."], ["Tyler W.", "My husband and I along with two of our friends had dinner here last week during Providence Restaurant Week. Food and service were excellent! I give 3 stars for the venue itself. While I can appreciate it being a small family-owned business in a college area, it had an overall dirty feeling. In order to use the [filthy] restroom, you have to walk through the kitchen, right by a tower of day-old dirty dishes. Reorganizing their bussing area and cleaning up the restroom would've probably gotten them a 4th star from me. As I said, food is EXCELLENT! I had chicken pad Thai, cooked perfectly. I started with the chicken 93 appetizer which had a perfect blend of flavor and spice, with the bag being tied by a green onion (nice touch!) Best part of the restaurant though, is BYOB! A great way to save money. We had 2 appetizers, 2 entrees, and 3 desserts (...don't judge...) and spent about $35. We brought two bottles of our own wine.Edit: spelling error"], ["Molly H.", "My boyfriend and I got pad thai, Masaman curry, and the sticky rice with coconut milk custard. The pad thai was quite good but we weren't super impressed by the curry. There was a little mix-up and we weren't given any rice despite definitely having ordered some. The portions were a bit small; there definitely weren't leftovers. Overall, it was good, not great."], ["Eric C.", "You know me and Thai. We're like an inseparable braid. When I move, I find the nearest Thai restaurant and I attempt to latch to it like a parasite. Unfortunately, I have to say.... there's no latching here at Sawaddee. They have the convenience of being close, but not only are they by far the most expensive Thai restaurant I have ever eaten at, but they nickel and dime you to death (yes, they charge you for the white rice that doesn't come with the curry). How much does white rice really cost? Shouldn't your $12 entree come with the $0.05 that it costs you for the rice? Who knows...Overall, the food was ok, and nothing to write home about which is unusual because I always write home about Thai. I also had their Rad Nah (or lad nah depending on who you ask) which is the rice noodle in gravy sauce. It's good and I wish I could say this would be my go to place, but alas this will likely be a resounding NO.Parking is difficult to find outside of the restaurant as it is all street parking in the midst of many other restaurants. If you're starving for Thai and willing to fork over the money, then this may satiate you."], ["Anita D.", "I am extremely late in reviewing this restaurant as the first time I ever went there was years and years ago. First off, do not expect to enjoy your meal in a spacious restaurant as that is not what you will get. There are about 8 tables in the entire place and extremely snug. One of my tricks is when frequenting little \"dive eats\" I always go in the \"off-season\" of the day, lunch early or late dinner...this way you are not cramped. On this particular occasion, I went for lunch and was pleased to see that theu have a lunch menu; however, it is only to dine-in...which sucks if you just want to take it back to the office with you. The server didn't speak very much English but was friendly. I started out with the lunch portion Som Tum Salad, fine strips of carrot and red cabbage tossed with lime juice, Thai chili, and ground peanuts. Very refreshing and delish, not to mention healthy. I ordered the lunch portion of the Tofu Pad Thai, the waitress talked me into trying it with the Crispy noodle which I was a bit apprehensive about doing as I like my flat rice noodles. I also asked for it to be extra spicy and was asked how spicy based on a 1-4 system...I got 4! The lunch Pad Thai started off with an included smallTom-Yum vegetable soup. It was the best Tom-Yum soup that I have had in a very long time. Not only were the veggies fresh and colorful, the broth was perfectly seasoned and each ingredient sang its own song. I left most of the cabbage in the bowl but finished every last bit of the broth. The Pad Thai was so tasty and spicy just as I requested. This Pad Thai was also the best I have had in quite some time. I don't like it when the Pad Thai is overly soppy & wet, glistening with oil. This was fresh, light and just enough bean sprouts, egg, scallions and peanuts. I was very pleased with my lunch and can't wait to go back to try other things which may be difficult as I can't imagine not getting these items again.For all of the people with bad experience, I am sorry to hear that. It is difficult with mom & pop spots as sometimes it is lacking in service or atmosphere but the food is amazing. For all of the people complaining about how small it is...Quality not quantity!! I will continue to go back to this place as long as it is open."], ["Dandaya M.", "Great options for food not usually offered. Too bad the food is not great at all. For the amount of money I should've had leftovers. $5 for 4 rangoons $5 for 4 chicken wings not the whole wing, 2 wings cut up. Never order for take out and ask for your receipt I was charged for something I did not even order! Also horrible service. Waiter was awful! Save your money!!"], ["Bryce A.", "I'm sorry; I know a lot of people love this place, but both times I've eaten here I enjoyed neither food nor atmosphere. Maybe I didn't order the right things, but most of my dishes included the same vegetables which were obviously dumped out of a package of a frozen, pre-cut vegetable assortment. That said, the food obviously didn't taste fresh. Ignoring that, it wasn't really palatable either. The sauces were not balanced or rich. They were often very thin, like water with soy sauce and some spices mixed in. The restaurant itself is a cramped room. It's so cramped in fact, that at one table the person sitting by the window cannot pull their chair out and the person next to them must stand up so that the other person can scoot over and out. It's like being on an airplane. With airplane food."], ["Molly L.", "Sawaddee is my staple for Thai food in the Providence area. It gets pretty busy on Friday, Saturday nights, but on other days, it's pretty peaceful inside. I've tried a bunch of dishes here, but my favorite entrees are the Grilled Chicken Kaiyang Combo, which is basically garlic-y grilled chicken served with a scoop of sticky rice and papaya salad on the side for $12, and the Tofu with Rama Sauce ($10). The best part of the meal is dipping the chicken in the rama sauce! Sawaddee Hacks:- They offer 10% discount for students but you have to ask!- If you get Pad Thai takeout, you get at least 3x more."], ["Shantael C.", "Came here middle of the week, so it wasn't so crowded. The servers were attentive and fast. She explained in details all that I needed to know. The food was hot and very fresh. It was not the best chicken Pad Thai I've had (noodles kinda sticky and the sauce slightly weird) but I'd surely go back with friends."], ["Andria T.", "Sawaddee is my first choice for Thai in Providence.  They have never let me down and the service is always prompt and courteous.  Everything I've had there has been delicious and fresh, and doesn't have that heavy, greasy taste that some other Asian cuisine can have.As others have noted, the restaurant itself is quite small--so I've only dined in a few times, but the seating is at different levels so it makes it seem less crowded and gives you a feeling of privacy.  It's fun on a winter's night to sit at the table(s)  right next to the window where you feel kind of like your at your grandma's house, but she's serving you delicious Thai food.They also have really, really good lunch specials, which I sadly have not been able to take advantage of (work is just a bit too far away), but every time I walk by the sign on the sidewalk, I kick myself.  maybe next week..."], ["Wow K.", "Sawadee is probably the most authentic Thai restaurant in Providence, adequately satisfying my homesickness. Since discovering it, I haven't really gone back to the other ones also because Foodler delivers it. The restaurant itself is a little cramped and can get full very easily on a good night. My favourites from the menu include Gai Yang (grilled chicken with garlic) paired with sticky rice, Pad Malay/Pad See Ew (stir fried wide noodles in thick dark sauce with vegetables and meat of your choice), Chinese Broccoli with Crispy Pork, and the Garlic Fish. All of these things are essentially what I would normally eat when I go home to Bangkok. The lady who owns the restaurant is also really nice. Once, we wanted to get the Mango Sticky Rice, but she said that the mangos weren't ready yet. She even let us sample a few pieces.Sawadee is definitely worth it."], ["Tayler S.", "Try the papaya salad!"], ["Eva R.", "The cramped dining room hasn't been an issue for me because I mostly order take-out and have only dined-in a few times on slower nights.  Im shocked at the negative reviews...I always get the duck with coconut curry and the shrimp pad thai, both are Outstanding!!!"], ["Nicole R.", "On my first venture to Sawaddee I went for the drunken noodles. The portion was really small for the price. I asked for extra spicy and there was no spice at all. The flavor wasn't too bad but just not what I asked for. The noodles themselves were in chunks stuck together and there were not very many pieces of chicken or veggies. With all the competing Thai places in the area I kind of feel like Sawaddee needs to step up their game. If I could go halvesies i'd give them a 2.5 but i'm feeling generous. So, 3 it is."]], "Bee's Thai Cuisine": [], "Hong Meas Restaurant": [], "Thai Fusion": [], "Gourmet House Restaurant": [], "Thai Excursion": [], "Thai Star Restaurant": []}