{"Mediterrano Cafe": [["Sarah C.", "Dang - why is today the first time I've heard of this place?! Their lunch buffet was absolutely delightful. Greek salad, falafels, veggies, kebabs, hummus, gyro meat, etc. Everything was fresh and outstanding. The okra stew was well received by me and the rest of my group. Oh! And the spinach/artichoke dip was A-MAZING. Overall, a great little spot. I'm definitely going to have to come back during lunch sometime in the near future. It's located in a strip, so don't miss it as you're cruising down 86th. Because I definitely did - twice. haha."], ["Jamal I.", "I'm SOOO disappointed about the customer services. They took the dishes while we still eating!!!!Tables beside us is dirty and uncleaned. Don't expect someone to take the empty dishes or even greeting you. Even the transaction run by iPhone!!!!Other thing, the price 15$$$$$ is soooo expensive for what they offer. There are many buffet in the city starting at 7$ to 10$ with great customer service and clean people. I will never be back to this place. My advice, take some course in customer services, clean the tables as soon as the customer leave. Don't leave the people with tiny dishes alone for long time AND try to reduce the price 15 $ is a crazy price. This is the highest buffet price in all the whole nation......"], ["Nic J.", "I really enjoyed my lunch here. Tender gyro meat, excellent chicken kabob, and all of the veggie dishes I had were really tasty. The place was clean and they kept the buffet well-stocked with hot, fresh food. It's a little steep at $13, but everything I had was really good. The coconut cake was an excellent dessert, especially paired with the rice pudding."], ["Erik J.", "I went there for lunch on a weekday and got the $13 buffet.  Although it has a smaller seating area, most of the tables were cleaned off but some weren't(who wants to eat next to another diner's dirty dishes?).  If the tables were all good to go, that would have been a better experience.  I'm Ok with a \"quaint dining experience\", but cleanliness plays a huge role in that.The buffet:Not bad, not great.  It would be great for $7.  The entire time I was there, approximately 50 minutes, the same lamb stayed in the pan under the heat lamp, which raises the question, \"how long was it there before I arrived?\".If the buffet has smaller trays and they had to constantly put out more fresh food, things that were supposed to be hot wouldn't have been cold(lamb, bad, etc).Result:Will I give it another try?  Maybe...  Would I go there regularly for $7?  Probably.Also, I understand a buffet with a big price tag, but don't make me get up and get my own beverage.  I'm paying $13 already.  What comes with it besides a nearly self service food line with good cooked hours before?  For $13 I can make my own Greek food."], ["Alyssa R.", "Really tasty and fresh lunch buffet with tons of vegetarian options. The items marked spicy are really not by my standards, but still flavorful. You can probably stand to skip the desserts, they were pretty mediocre. I love this kind of hidden strip mall gem!"], ["Graham T.", "It's hard to come by a good Mediterranean restaurant, but Mediterrano Cafe is definitely one of them. The buffet is great, especially the veg options. I would have expected them to have better non-veg dishes but the okra stew, falafel and hummus blew me over. The coup de grace was definitely the Coconut Cake. That just blew my mind. You must visit this place if your in town and looking for a nice lunch."], ["Heather B.", "We LOVE this place. There are days that I dream of their hummus and have to make the stop. The falafel is downright perfection in my mouth. Often they have to make more as soon as they see me coming through the door. That's okay. Its worth every cent to just eat falafel and hummus. Don't forget to request Turkish tea or coffee ! You'll be jacked ( and regular ) the rest of the day! :)"], ["C D.", "We ended up at Mediterrano by chance - the place we'd planned to eat wasn't open, so we scanned Yelp for something else. We were not disappointed.The restaurant is tucked into a strip mall behind Castleton Square Mall. It's about $13 for the buffet, which includes drink. It sounds a little expensive until you see what you get for that amount of money. The buffet includes plenty of options to please vegetarians and carnivores alike. There were a variety of salad choices, hummus, pita, tziki, beans, rice, falafel, gyro,  kabobs, and more. We tried a bit of everything.  The only thing we disagreed on was the spinach/artichoke side dish - I really liked it; my husband wasn't crazy about it (but loved the kabobs).We will definitely be back!"], ["Anna L.", "First timers? Yep. The owner greeted us, explained the process of paying at the counter before we grabbed a plate, gave us a thorough lunch buffet tour of their offering. Then he let us 2 ravenous beasts loose! Good first impressions so far.The buffet is divided into 1/2 vegetarian & 1/2 meat so it's a nice mix for the herbi-, carni-, omni-VORES. So we started off with a mixed salad w/ crunchy cucumber chips, diced tomatoes, & loads of feta cheese. Got a side of lentil beans to mix in as well. While I'm at it, I got a scoop of tangy lentil soup. Not being completely overstuffed on chowing down plate #1, I managed to get plate #2 - creamy artichoke (a lady's favorite said he), grape leaves stuffed w/ herbed rice, chicken kabob, gyro meat, apricot chicken, falafels, cracked wheat, & a pita bread sliver. Need I name more? Oh, don't forget a small bowl of hummus & yogurt to dunk your food in! Being ravenous beasts as we are, snuck in some coconut cake drenched in rice pudding for dessert at the end. Make sure to shake some cinnamon - Voila!Well...that was an effing good lunch. I like the fact that you pay before you eat - especially if you're on the run. Careful that you don't over-eat and fall asleep in your office chair back at work though. Weekday buffet is $11 and weekend is $13 (probably more specialties). Quite wallet-friendly for the freshness and variety they have. Don't forget to leave a nice tip in the register jar before you head out!"], ["Neal P.", "I had a GREAT lunch.  They either have new owners or finally found their groove.  Salad and cold veggie bar was great. Hot veg dishes were great. Falafel was moist and tender. Tabuli and lentil salad were notable. Meat dishes were good. Gyro meat was fresh and moist. Chicken kebab was great. Bulgar wheat pilaf was great.If you wrote them off after the owners changed, please give them another chance.    Things have vastly improved."], ["Suzie T.", "I took my daughter in law out for her birthday lunch today.  She always loves Indian, so I suggested this place which was new to her.  She loved it and the food was really good.Just as the first review stated, the buffet was hot and fresh, the place was bright , clean & the white table cloths brought an atmosphere of a Birthday lunch.  The manager/owner was very nice & gave us our privacy to have our long conversations in the corner and still managed to take away the used plates.This truly is a great casual gem of yummies for people in a hurry or ones that want to hang out and catch up on life matters!"], ["Sean R.", "My wife is practically a vegetarian and I almost elusively eat meat. This place is a good balance.The $13 buffet is awesome. 2 or 3 real solid meat choices. Gyro Meat and a chicken kabob thing that is really good. Rice, cracked wheat (which looks like rice) and falafel make for good sides. Coconut cake for dessert.We do have two kids and they only have 3 high chairs so that can cause issues if another family is there. Plus when the are busy it feels like all of the tables are on top of each other."], ["Angi B.", "Well worth the price, the lunch buffet has all the greats - gyros, humus, tabouli, soups, salads, veggie dishes. Both my gyro-loving husband and I (a vegan) loved it. Only down side is they aren't open for dinner. :-)"], ["Fujiwara S.", "Greatest turkysh food I ever had!! The very basic items like lentil soup, yougrut sauce are really good. Pita bread was very chewy, and strongly recommend to have with gyro and the salad just like gyro sandwitch. Kebabu, falafel, chicken spinatch, spinatch & artichoke, humus, wheat pilaf were also remarkable."], ["Aaron A.", "We've been wanting to stop in here for some time, but for one reason or another, we never made it in. Well, today, with an extra hour to kill and already in the area, Mediterrano Cafe was the perfect solution.Somewhat expensive for a lunch buffet, we felt it was well worth the price. Hummus was surprisingly smooth, and the tzatziki was cool and full of flavor. The warm pita was a perfect medium for slathering the good stuff onto! The pita is not pocket pita, rather a thicker, softer bread, sometimes called laffa or taboon. We happen to prefer this to the pocket pita as it holds up better and seems to have more flavor. We also enjoyed the tabouli, and my wife particularly liked the onion salad which were complimentary side dishes. The star of the meal for me was the chicken kabobs and the falafel. Kabobs were juicy and well seasoned, and served with onion. A pita with kabob, tzatziki, and the spinach artichoke dish made for a great mouth experience! We also very much appreciated the handmade, but perfectly formed falafal. Not so much ball, more dome shaped, these tasty morsel were large but light. A shmear of hummus on pita with a dome of falafel and you have a heckuva lunch.We dont typically visit buffets, but this would be a regular exception. If only it were closer to home! But I do expect we'll come by more frequently now that we've tried it. The dinner menu sounds good as well, with a chance to try things more adventurous than might be available on a buffet lunch."], ["Richard H.", "Fun buffet of Mediterranean favorites. Nothing adventurous, but most of what's there is well-prepared, and you can really load up! Good gyros, kebabs and rice. The two chicken casseroles were puzzling.   :-)  The decor leaves quite a bit to be desired, but the service is fine, and plates were whisked away quickly during our visit.You pay first, they hand you silverware and a cup, then you go at it."], ["Mara A.", "I love this place.  The owner is such a nice guy.  Their food is always fresh and delicious!! This is by far one if the best Turkish places in town! Thank you Turk!"], ["Kristen B.", "So, I say to my phone, \"Google, us there Mediterranean food near by?\" and unto me was bestowed this gift, straight from Google Heaven, of delicious, abundant, vegan food! I was instantly greeted by the owner who happily showed me that over half of the buffet was vegan! He special made a Greek salad for me without feta and confirmed the pita was egg free. I loved every bite, the spicy pickled veggies, the cracked wheat salad, the bean salad, but special shout out to the garlic egg plant. (it's worth noting that I hate eggplant, but they do something amazing to it.) There was plenty of meet, so carnivores would leave fat and happy too. Bottom line, get there."], ["Reza Z.", "The food is good but the cashier guy was one of the rudest people I have met in my life! Most of the tables were not cleaned on time so I had no choice of which table to sit at!"], ["Aditya C.", "Great buffet, a treat for vegetarians. Simple delicious med food.  Clean no fuss ambiance."]], "Grecian Garden": [["Anthony T.", "If you enter the city market on an empty stomach, your senses may go a little wild.  Every major kind of cuisine is at your disposal and if you are indecisive, you are going to be in trouble.  Today, I was starving and needed something quick before I went back to my office.  Grecian Garden caught my attention and the second I saw a chicken gyro on their menu, I knew I was at the right place to satisfy my midday cravings.The staff is very responsive and friendly. If you're hungry or in a hurry, this place should definitely be at the top of your list.  Some of the places in the market take FOREVER to make your order, not this place!   only waited about a minute and a half for my food.  Not bad considering it's hot and fresh!  My gyro was delicious, hot, and the perfect size for lunch.  I'll definitely be going back to try some of their other menu options."], ["Shaney G.", "Falafel was awful. Not sure if it had been frozen or the pita it was served in had been. Something had a freezer burn taste. I like crispy falafel. This was soft and mushy. The tomatoes were not ripped but only two little pieces so was able to take them off.  Maybe something else there is better but avoid the falafel!"], ["DeAnna P.", "Solid place to score a gyro in city market and I love their green beans.  The avgolemono  (chicken lemon) soup needs work.  The broth had enough lemon, but it was watery.  And something about the chicken just tasted off."], ["Katie B.", "Worst falafel I've ever had.  It was hard as a rock and tasted like it'd been sitting out for days.  The tzatziki was tasteless.  The lettuce was just iceberg, and the couple slices of tomato weren't ripe.  The only thing decent was the pita and even that wasn't very good.  Never again."], ["Stephanie D.", "I heart Greek food. I'm spoiled because I am neighbors with Santorini's. I mean hello, you can't get better than that. But when I came to lunch with the hubby on his break, I figured I was in the mood and would take a shot at this place. I've passed it a hundred times and I should have kept passing!I ordered the lamb-beef gyro which was just alright. The tzakiki sauce didn't taste very unique or Grecian at all to me. She asked if I wanted lettuce and tomatoes..apparently tomatoes mean two small slices. The lamb-beef wasn't very flavorful and tasted bland. I also got a side order of Greek potatoes which did not fall apart in your mouth and make you want more!! The only thing I liked was the baklava but that set me back $2.50. Another shop over sells it for $1.35...should have looked around better!Needless to say for $12 it wasn't satisfying, it wasn't anything unique or special to my palette and it definitely wasn't worth $12. For that amount I can go to my fav Greek restaurant and ordered the same thing and get the greek potatoes, beans, and rice as part of the gyro for the SAME PRICE and of course take home leftovers. Too bad. Too sad for me. I'm $12 out."], ["Haley V.", "I had the chicken gyro, and as a person that doesn't eat beef or pork, this was a pleasant surprise! The chicken tasted fresh and organic (like it had come from the farmer's market :) and the Greek potatoes were tasty and well seasoned. I will def. be back!"], ["Virginia L.", "Wow - that was about the worst lunch experience I think I've had to date here in Indy.  I feel like being detailed/ranting right now, so here we go.Decided to try a Greek Salad, a safe enough bet? no - not this time. -asked if it came with pita, he said yes.  It came with 1/4 of a pita. urgh.-salad dressing was not the greek I'd expect.  It resembled and tasted like Kraft Italian-feta was weird, not sure if it was cheap or some weird type, but it wasn't your typical feta.-I asked for extra olives. he offered to sell me a cup of five olives for $1. i said no.As I'm eating it I accept that it is mediocre at best and am dealing with it,  I'm hungry after all. Then something pricks my tongue as I'm eating.  I pull it out and it's a super spikey leaf of some sort, I spit it out and try not to think too much of it.  I look down again at the salad I'm picking through and I see this big weed with an unopened flower (dandilion?) on it in my salad - you know, the kind you pull out of your yard with the big spikey leaves.  GROSS!  I finished my 1/4 pita and olive and take it down to return or exchange it.  They look at me like I'm crazy when I walk up and explain my problem and then the lady argues with me.  She tell me she gets the salad from the bag - goes in the back to get the big bag of lettute to show me.  seriously?  i ask her if she would eat the weed and she says yes. come on.  All she had to do was admit someone made a mistake and didn't see it when they were making the salad and move on, but no, she wanted to argue with me.  I ask to exchange the salad for a  falafel sandwich since it's the same price and they give that to me without any stress. yay.Too bad the falafel is disgusting.  It's greasy, bad texture, bad flavor, probably the worst falafel I've ever had - i didn't even eat it.  Just took it off and ate the pita with the lettuce and tomato and will never be back.To end on a positive note, the pita was good."], ["TOMMY o.", "Mama's back, it's time to Eat !!!"], ["Jenn B.", "Service is friendly, food is a great quality! This is a great lunch destination. I'm a fan of Mama's meatloaf, but my mother fell in love with their gyro!"], ["Brad C.", "The staff is very nice, and the food is quite good.  Good value, too."], ["Jennifer B.", "Try the falafel, pay the extra dollar to add feta, it'll make it worth it.   I'm not so sure as to the freshness of the actual chunks of falafel but it was pretty tasty.  The service was extra friendly and fast and I was surprised by how much food they crammed onto that tiny pita."], ["roger w.", "Not a satisfied customer.  Eat at Arby's."]], "Istanbul Cafe": [["Trista T.", "So great! The served pita bread and some olive oil dip with our drinks.  I tried dolma as an appetizer, which was rice wrapped in grape leaves. Very different but awesome!  I also ordered the lentil soup which had more of a tomato soup texture because the lentils were blended in.  Yum! Last, I had the tabouli which had more of a tomato flavor in it than other versions I have tried.  I also was excited to try some free tea! (courtesy of my check in) Their tea and coffee comes in very very tiny baby tea cups fyi.  The We sat outside where they have a few tables scattered.  Service was awesome; they never let our drinks run out. What a great change of flavors from the usual american meals I have."], ["Elizabeth S.", "This place used used to be my favorite in Indy. The last two times I've been here, I have been really disappointed.  The food is overpriced.  Last time I has the falafel, which was burnt.  The lentil soup was too salty.  Not worth it!"], ["Amanda S.", "Love this place there is very good food there and good for the whole family lamb chicken and much more would recommend it to everyone and can't wait to go back."], ["Stephanie B.", "Wow!  We were on our way to one of our regular places when we came upon Istanbul Cafe and decided to try it.... and it was awesome!!  We had the hummus, shared the mixed grill kabob, and baklava for dessert.  Will be coming back soon!"], ["May K.", "My husband and i went there and shared zucchini pancakes, and he had some sort of a kebab and I had veggie stuffed cabbage rolls. The food was bland and underwhelming. Perhaps they're trying to cater towards Americans. They have certainly not put into their food any spices that I associate with Turkish cuisine. On a good note, the service was good.. but then, we were the only people there."], ["Wendy T.", "This place is fantastic! Food was terrific! Waiter was very nice and the baklava can't be equaled!!!! Great food!"], ["L G.", "This place is great! Came here for dinner with my husband and we will definitely be back. The food was really good (doner kabob and shish kabob), but the best part of dinner was the pita bread and oil they bring before the food. By far the best pita bread!"], ["Shaikha A.", "One of the best Turkish restaurant I have ever tried. I do recommend that you try the Adana Kebab and the chicken Adana Kebab; these two dishes are really good."], ["Kate S.", "Amazing food! Plus super helpful in trying to decide what to order for new customers!"], ["Ari A.", "I really like to eat Mediterranean food because its healthy and tasteful. Since last 4-5 years i think i have been into many Turkish and Mediterranean restaurants and i think this place represent the best taste and the quality. I have tried almost all of their salads and appetizers each of them are tasteful and most important \" fresh\". I recommend you to try Ezme, Grape Dolma and Shepard salad."], ["Gordon C.", "The place is pretty inviting -- IMO better than other mediterranean places in Indy for a datethe pita bread they served came out hot, fluffy and was a perfectly delicious pre-meal warm upMy date and I ordered the mixed grill kebabs -- it was indeed great for sharing as it was a sampling of the doner, lamb shish, chicken and adana kebabsThe chicken was very savory and the lamb shish kebab were verry tasty and delicious; the adana (ground lamb) was decent; but the gyro (doner) meat were muchhhh too saltyThe waiter could have been a little more attentive (I drank a bunch of water b/c of the salty meal)The rice and sauteed vegetables were decent3.5/5"], ["Marcia R.", "Appetizer sampler for two - worth every penny (yes they will refill your pita bowl & bring tasty oil when u run out of sampler options).  We were full by the time our food came!Main Meal: cabbage rolls w lamb - kinda bland I prefer the veggie ones - more flavor.  Shish kabob (marinated lamb) - excellent!  Not as spiced as Gyro meat but more tasty than wout the marinade.  I also prefer to get the big kabob meal split it and order extra sides of veg & rice.  The rice is surprisingly super yummy!Dessert: goat cheese pastry (thing) OMGsh so very tasty!!!  I would say order w extra whip cream if you like a very sweet last dish!  Very good for sharing (it was the size of a small plate). We ended up taking food home - stuffed.  The place was packed!  Had several Turkish people eating there as well :)."], ["Phillip H.", "Other than a month spent in Israel-Palestine for school, I admittedly don't have much experience w/ Mediterranean food. But I quite enjoyed the food at Istanbul Cafe. I started with a sampler plate with some hummus, roasted eggplant, grape leaves, and other appetizers. I likes this sampler better than my lamb entree, to be honest. The restaurant is worth visiting, if just to try something different"], ["Adriana V.", "This is an awesome restaurant with a very nice owner from Isatanbul and a dynamic server,  Danielle. The sampler appetizer was so yummy.  The seafood stew was tremendous. The chicken kabob juicy and well seasoned. As the only wine drinker of the group,  the house pinot grigio was very good. I would keep this place at the top of my list.AV"], ["V S.", "Two visits - the first, with kids for dinner, was very good. The second was star crossed. The appetizers and the ayran were good. But then alas, the entree.Cafe Istanbul aspires to veggie friendliness. The menu even contains a note \"great option for vegetarians\" next to the vegetable stuffed cabbage rolls. So being of the vegetarian persuasion we order it. The meal comes out, and shortly after the waitress informs us we have been served the lamb cabbage rolls instead. Despite us turning down the specials, and telling her we were vegetarians.High drama between the kitchen and the waitress ensues, ending in her asking us \"well how do you want to handle this?\". I just wanted to leave. And then insult was added to injury when the staff on hand refused to take the item off our bill. No other restitution was offered either. I was assured that this would not have happened if the owner had been on the premises. Cold comfort.Always sad when I have to pan a place with good food for human factors. But getting the customers what they ordered, and not substituting something they have excluded from their diet, is beyond the pale. The way they handled the situation - worse. I think I'll look for other alternatives for my middle eastern food. Preferably alternatives that know how to spell \"Mediterranean\". (I kid you not, look at the glass front as you go in)."], ["Deirdre G.", "Knocking off one star because my dad's meal was late coming out. I highly recommend the Turkish flan for dessert."], ["Kate G.", "will not go back. Our falafel was freezer-burned (?) And the pita chalky. The meal did not feel unified at all but instead just a bunch of sub-par meat and tasteless vegetables thrown towner on a plate.  The people we went with are from Greece and they couldn't recognize any of the food that came out. Two stars, but just for the company."], ["Maaz B.", "Five stars all the way. They remind me of Ala Turka Sultan, a great restaurant in New York which also serves Turkish cuisine. The food is fresh and authentic Turkish. The restaurant itself is nicely decorated with just about the right kind of lighting. I have tried the desserts as well and love most of them :-) I go there at least once a month. I'm hooked."], ["Abdulrahman A.", "We were four adults, a 7 month old baby, and a three year old girl. After asking for the bill they included the %18 tip because we are 6 people. They counted the 7 month old baby!! I have not seen any resturant doing that !!! The waiter said, this is the rule and I am not the owner!!!!! I won't come again and I won't recommended it. I hate the idea of using loophole to take people money."], ["Katelyn A.", "Where do I begin?  The atmosphere was absolutely fantastic, it is somewhere that you would be able to go dressed up or dressed down.  The hummus was fantastic and large portioned!  At first glance I thought that the prices were a little expensive until I saw the portions of the meals.  The money was well worth it.  Their baklava was the most amazing baklava I have ever had!  It was so fresh and tasted absolutely amazing paired with their coffee.  Will definitely be becoming a regular here!"], ["Jennifer V.", "I was in town for a conference and stopped in for lunch. Well, I came back for dinner and then again the next day. The food was wonderful and the service even better. The staff was fun to talk to and told us all about Turkey.I recommend: kebabs with yogurt, the appetizer sampler and the Turkish tea and coffee."], ["David H.", "I will definitely be coming back to Istanbul. Everything, the food, the service was top notch. You have to try the stuffed grape leaves!"], ["Hugh D.", "Went here with friend who grew up in Instanbul.  She loved it!!  Very pleasant surprise."], ["Rich B.", "Food, atmosphere and service are all top notch!We started with an amazing appetizer with hummus, tabouli, baba ganoush and a few other dips, all were great - in fact the hummus was the best I've ever had. They kept the warm, fluffy pita bread coming.I had the lunch special, a few options were available - I went for the red lentil soup - which was excellent, and the stuffed cabbage - which really felt authentic, had tasty rice and meat inside and covered in a red sauce with a subtle zing. Veggies on the side were a great complement.There were two servers working at the time; our main one took great care of us and if he wasn't around the other one was happy to jump in. We were well taken care of and they interjected just enough fun banter."], ["Lynn J.", "I arrived here \"blind\" one evening when my daughter booked and we took a relative from outside USA to dinner. We wanted to put our best foot forward because he had hosted my wife in South Africa. We were not disappointed. We ordered several dishes and some appetizers for the table and it was notable hardly a scrap remained on the table when we finished. He had a whole fish which surprised and delighted him. Very dramatic and fun. I appreciate a quiet ambiance and table cloths and this was pleasantly dim with quiet hum. Wait staff were quick and attentive without hovering. If I were in town (I live 55 miles away) I would become a semi regular for the evenings I want ethnic alternatives to \"American cuisine.\" There are fun new flavors and dishes to explore here. Try it out."], ["Diane E.", "Because I don't live near this neighborhood, I had never heard of the Istanbul Cafe.  However, I was able to go on an urban hike this evening and the meeting place was the parking lot between the Istanbul Cafe and Blockbuster Video (are they still in business?!).  Since I arrived early, I decided to meander over to the Istanbul to check out their menu.  As soon as I walked in the door and smelled the heavenly delights, I immediately placed an order for the shish kabob (lamb) and a side of the Pureed Eggplant to pick up after our hike was finished.I have to say that the lamb was spectacular!  So tender and juicy, I didn't mind eating it out of a to-go container :-)  I didn't know what to expect with regard to the pureed eggplant, but OMG! I have never tasted anything so flavorful!  It came with some flatbread that was also very moist and soft...perfect to dip into the eggplant.If I do this same hike again -- and I'm sure I will -- I plan on dining in and enjoying the entire ambiance of this charming little restaurant.  Don't let the stripmall deter you.  It is a nice shopping area at the corner of W 86th and Ditch Road."], ["Jennifer L.", "Can't say enough nice things about this place. Even though it's in a strip mall, the food is exquisite. The ambiance is calm. The staff is cheerful. The food is reasonably priced, and most especially delicious."], ["Jan P.", "Having travels to Turkey before, I have to admit this food is truly authentic. Now personally I do not care that much about authenticity after all it's all about flavor and texture. This place hits it on all three.  Yup, we'll be back!"], ["William D.", "We love Istanbul Cafe.  The lamb and chicken kababs are always tender and delicious.  Also the feta cheese in phyllo dough appetizer is yummy too.  Desserts are very nice with Turkish coffee for the brave.  American palates will not enjoy the salty yogurt drink (Ayran).  The staff are very friendly, though some nights they seem to be a bit short handed.  Try Istanbul Cafe, it is worth the price!"], ["Dana G.", "Great food. Everyone enjoyed their food.  We started with the stuffed grape leaves. Our party ordered the Stuffed Eggplant, Adana Kabob, Doner Kabob, Feta Borek, and Shepherd Salad.The pita served with our meal was soft and warm.We finished with Kunefe for dessert."], ["David W.", "Great taste. A must try. Staff is very friendly. If you've never had Turkish food this is a perfect place to start. If you have before, you will not be disappointed here."], ["David I.", "We ate here for dinner last night and really enjoyed the place.  We were eating at \"old people\" time at around 4:30.  We were the only guests in the entire place and they had the interior lights off.  I'm going to say the lights were off to save money because that makes sense if the place is empty.  By the time we left at 5:30 there were a few tables full.The decor is nice, and the place is very clean.  I'm willing to bet the owner has a serious case of OCD.  It would also explain the lights.We were waited on immediately and the service was consistently good.We had the Shepards Salad as an opener and loved it.  I enjoyed how the veggies were chopped into even sizes and small.  Great flavors and it'll be a dish that I remember for a long time.Next we had the zucchini pancakes and had to share them between us.  They were fresh, light and very tasty.  Perfectly cooked.My entree was the chicken kabob.  I don't like lamb so 1/2 the menu is out of the question for me.  The chicken was perfect, great flavors and moist.  The rice was also perfectly cooked.  The veggies were probably not cooked to order but they still tasted great.My wife had the Adamo (sp) Chicken.  She enjoyed it but the pepper flavor was a little too strong.  It ended up being finished as lunch the next day.The experience was much more \"upscale\" than Bosphorus, and the zucchini pancakes (and salad) were better, but the cost was double.  We will probably come back, but it will depend on our budget.  If were were going to drop another $60, we'd rather have sushi more often than not.There were no hot waitresses, or any waitresses at all when we were there."], ["Mike R.", "We went Friday evening to have a food adventure - our first time for Turkish food in Indy.  Place was pretty empty when we got there, a few people at the bar, but it filled in slowly as we sat.Justin our waiter is really the bartender, and he was very personable and attentive (humorous as well).We had the Fela Borek appetizer and while it was quite tasty I thought it was a little sparse for $6 - just four thin tubes of phyllo wrapped feta with flavorings.  My wife had the Adana kebab with yogurt, cubes of ground lamb and onions in a sauce on small squares of pita bread, with yogurt.  It had a good mix of flavors and the portion was large enough to make a good meal.I had the cabbage rolls which came with some very well prepared and flavored mixed vegetables (green beans, carrots, squash).  The rolled cabbage leaves were stuffed with a ground lamb/rice mixture and covered with a tasty reddish sauce.  Again the portion was certainly sufficient - I finished all of it but was not stuffed.The bottom line - it is a nicely decorated, well staffed restaurant, and the food is good.  I am sure we will come back again when we are in the mood for Turkish or Mediterranean fare."], ["Nathan C.", "Did takeout.  Maybe I ordered wrong.  But everything was pretty bland and over-priced.  The $9 salad was soggy, the lamb had little flavor, and the wrap was on a tortilla.  I don't know who that's catering to.   At it's best Turkish food is among my favorite cuisines, and I've had some wonderful experiences.  This was not one of them.  It seems like this place is cutting corners.  It's 2 stars because the host/waiters were friendly.  Was astounded with the rating this place gets on Yelp.  Could be a Yelp machine."], ["Theresa K.", "This place was kinda fancy! I didn't expect anything in particular, but I wasn't expecting that. There were a few things other than kebabs on the menu, but that was the main thing. I had the Adana Kebab. It was delicious. Between that, the Feta Borek (appetizer) - fried phyllo filled with feta) and the large amounts of pita and oil, I was able to bring half of my dinner home.... and I usually scavenge the crap out of my dinner, eating it ALL, most of the time. If anything is ever left behind, it probably wasn't edible in the first place. As mentioned, pita bread came... and when that was empty, the server offered to bring more (and did). And we didn't ask for more because I ended up bringing the last piece home, but crap. They gave us a LOT of bread. And it was always hot. The Adana Kebab was $14, and my boyfriend had the Chicken Kebab with yogurt, and that was $15. My Adana Kebab contained two lamb kebabs, plain rice and green beans & carrots... and not an overwhelming amount for the price. Our server was very sweet. She asked us about our super bowl plans, and she generally seemed very down to earth. She seemed to be handling the whole restaurant by herself (they weren't terribly busy), but she was still very attentive."], ["Katie W.", "Delicious vegetarian meal. Fresh and well-prepared. Somewhat expensive, but worth it. And the waiter was exceptionally nice!"], ["Wendy S.", "I ate here, it was fantastic! I wish I could give specifics, but Supper Club, and time have killed names of dishes. Let me say, though, of the things I tasted b"], ["Kate L.", "This was a very unfortunate meal. The waiter was incredibly un-attentive, and we didn't feel like the menu descriptions matched what we received.After asking specifically if I could have no peppers in my meal, he brought out my dish with peppers, and tomatoes (which was not listed on the menu). If these were not the 2 veggies I hated, it wouldn't be a big deal, but, they are. The fried eggplant appetizer came out a cold dish which was more like sauteed peppers & tomatoes with an after thought of super mushy eggplant.The Doner Kebab my dining partner ordered came out as greasy chunks of meat - not at all what she expected. (I'm not sure how they're usually served, but she expected something completely different.) :("], ["Dawn T.", "I don't even know where to begin, because everything was really wonderful.  I guess I'll begin with the appetizer plate which is where we began.My husband and I shared an appetizer plate for 2 and both enjoyed everything.  The babaganoush was the best we have had in a very long time if not ever.  I also loved, I mean LOVED the fried eggplant in tomatoes.  The ezme was also really, really good.  For dinner we shared the mixed grill plate. We were able to try shish kebob, chicken kebob, adona kebob and donner kebob. All of them were delicious. Shish kebob (lamb) was my favorite.  The lamb was so tender and the seasoning was super.  Really, all of the kebobs were very good, so it is difficult to explain why I like shish kebob the most, but I did.  I would happily eat any of them, anytime though.Typically, my son doesn't care for mediterranean food, but he had to go with us last night, and he ended up loving it."], ["Kelly M.", "Istanbul cafe does not have a gluten free menu, but our waiter knew which dishes contained flour. I have a weakness for lamb and ordered the shish kebab and it was tender and flavorful. I also ordered the lentil soup (usually gf) and our waiter quickly told me it contained flour! I was grateful for the warning.  We did order the Turkish flan for desert and I have now found another favorite dessert! I plan on returning often."]], "Santorini Greek Kitchen": [["Cherri W.", "What is there to not love about Santorini. The food is delicious and extremely plentiful. The service is outstanding. I have been many times and have always had a great experience. Opa!And they have a good wine selection, reasonably priced."], ["Robin C.", "My husband and I loved it! Food was delicious and service was great. The music they played was fun too! It set the mood for a great meal."], ["A N.", "Tonight was my fourth time dining at Santorini's and, as always, the food and service were both exceptional.  Arriving as a party of four without reservations on a Saturday night, we experienced a bit of a wait.  However, the manager more than made up for the wait with complementary starters.  I will definitely return!"], ["Silje S.", "Today (04.06.15) my roommate and I had something to celebrate today, so why not greek food right? Though we decided to do order pick up, so we could relax and stay home and eat. They were really quick to prepare the food, it was done before my roommate arrived to pick the food up (about 20 minutes). She ordered Calamari Dinner and I got the Santorini Special Combination, and we order a baklava to share just so we could try it. When my roommate got back she was carrying two bags with five big boxes and three small ones. I shocked to see that much food, so I say we definitely got our moneys worth! I have dinner for almost three days now I think. The food was really good, I have never actually had greek food. Only moussaka that me and my mom have made from a box. So I was certainly a happy camper you could say, I can't even choose my favorite out of the Santorini Special Combination. They were all really good! My roommate was also very pleased with her Calamari Dinner, she tried to make me taste it, but I just can't handle the texture (bad experience with squid). I will definitely try more greek food in the future, and will most likely take a trip to eat at the restaurant next time.I had three meals out of my one greek dinner, it was very tasty. I can't say much on the service since we did not eat there. Though, my roommate said it seems very nice and someone held the doors open for her and they were very welcoming."], ["Alicia C.", "Oh Santorini's how do I love thee...Flaming cheese, check. Delicious gyros, check. Amazing service and a fun atmosphere, check!This is seriously the BEST place for Greek food in Indy...if not the state!  My friends and I always order the choose appetizer combo option with hummus, Spanokopita and the Saganaki to get us started. IMO, a trip here is not complete without an order of Saganaki, but if flaming cheese isn't your thing, you'll still be able to enjoy the giant fireballs throughout the night from other tables.  For entrees, any option with lamb is good! My favorite entree is the gyro with green beans and rice.The lamb mix is always cooked to perfection with a wonderful mix of seasonings on warm pita bread. A warning though, the portion size of any meal is going to be large, so you might want to order a carryout box as well. Desserts are probably the only thing that I would say doesn't stand out for me here, but honestly there is hardly ever room for dessert!On weekends there is usually some form of entertainment, usually belly dancers or live music of some sorts. The owners seem to always be on sight, either tending to the bar or helping staff around the restaurant. They make sure that every guest is having a good time and that the service is good.There is a parking lot next to the building, but it is small and can fill up fast. If that happens, street parking around the area is the next best option."], ["Ashley S.", "This is hands down the most authentic Greek food you'll find in Indy. Our server Eric was phenomenal - he offered detailed suggestions but was never too invasive and made the overall experience something we'll always remember. First off, order the flaming cheese - the presentation is unique and the creamy consistency is delicious! I also recommend sharing the chef's platter - you get 5 entree samplings and three sides for $21! We split this entree and still had an almost full to go box. Lastly, end your night with the raspberry truffle coffee - a fantastic combination of smooth mocha and sweet liquor. I've posted pictures as well. Do yourself a favor and make this spot your next date night location. Affordable and unforgettable!!"], ["Suzi B.", "Excellent meal, excellent service.  Our server, Eric, was great, very informative.  Best Greek food since I left New Jersey may years ago.  Will be back every time we come to Indy.  Started with saginaki, what a show!  Had dolmas with the most heavenly lemon sauce.  The guys had gyros and all conversation stopped as they ate.  The spanikopida was wonderful.  Fully stuffed, we shared a baklava that was rich with nuts and honey."], ["Dang N.", "This place is pretty awesome. I was greeted by one of the owners, the wife which I didn't realize until later. I understand her husband still works the kitchen in the back. I arrived early and sat at the bar and watched the place completely fill up. My bartenders were fun and I ordered the fish kabob which was really outstanding. A ton of food too but understand that it's not fish served on a kabob. It's more like a fish plate where they cut up huge chunks of fish and throw on a plate with rice and potatoes and vegetables. Really outstanding, would absolutely recommend it. Their potatoes are also really, really amazing. Some of the best lemon potatoes I've ever had. When leaving I talked a bit more to the owner-wife and she's so friendly. Next time I come to GenCon I'll come back here."], ["Regina W.", "The people who run the show over here are smart. How can you not give this place 5 stars when they offer a unique and delicious $8 appetizer that they set on fire in front of you...for FREE as the Yelp Check-In Offer? This flaming appetizer is the saganaki and comes with delicious pita bread. In fact, I think the pita bread is the best I've ever had. Absolutely incredible.For my main lunch dish, I ordered the falafel sandwich which came with a side of your choice. I chose a side salad which came out before my falafel sandwich and was very, very good. My falafel sandwich came out with a beautiful presentation with four falafel patties laid flat on top of a whole pita bread. The falafel was crispy on the outside and moist and flavorful on the inside...really perfect.This place lives up to the high reviews."], ["Bruce E.", "Excellent food, huge portions, nice atmosphere, tasty desserts and after dinner coffees. The waiter. Stephen, an older gentleman, with a funny dry wit was  the \"icing\" on the cake. One of the owners made her rounds through the dinning area to inquire about dinner satisfaction. Haven't had this quality of food and service in a long time. You won't be disappointed."], ["Tara F.", "Best Greek food in Circle City/NapTown!I always get the Falafel...it's crunchy, yet wholesome in flavor and texture. With fresh tomatoes, feta cheese and tzaziki sauce, I'm in Athenian heaven, and haven't even touched the main course yet. My sister had her go-to of the Gyros, and I had the Spanokopita, and both made us feel like we left Earth and found food of the Greek Gods! The gyro meat was tender, melt in your mouth goodness, and warm pita bread to match made it one of the best Gyros I've had in a while. My Spanokopita was a warm, flaky pastry that had spinach and feta and 100% goodness in it. Did I mention that dinners also came with lemon potatoes, rice pilaf and green beans that each stood their own ground and were just as delectable as the main entree?? I've also had the Souvlaki in the past and it's fantastic as well!Prices were average for this meal. Don't plan to come here and try to be cheap because the food is well worth it. It's also an extra $1 for more tzaziki sauce, but it was the oh so sweet nectar that I needed to complete the experience. The staff is very friendly, and you can see the owners mingling about with their guests, much like it's a family gathering. There was even a dancer in a beaded outfit and cymbals dancing throughout the restaurant, so that added to the atmosphere.One of the must stop places in Fountain Square!!"], ["Kurt M.", "Stopped here randomly (for lunch) while passing through the city.  We almost didn't bother, as the dinner menu seemed ridiculously expensive-- but we were happy to find the lunch menu was far more reasonable.  Price aside however, the food itself was incredibly awesome-- some of the best Greek food I've ever had.  The staff were friendly and the venue was decent, but this place is all about the food.  So good."], ["Lois K.", "Did you say fried eggplant?  Santorini's is awesome!  Moussaka amazing too. 1st time at this restaurant while visiting Indy. Won't be my last for sure."], ["Emily M.", "Delicious food and fairly priced. Service was great as well. Left feeling very satisfied!"], ["Stuart D.", "The food is fantastic. We have pretty simple tastes, and everything is always cooked perfectly and seasoned just right. The service is what sets Santorini apart. We visited the restaurant early on a Saturday night. It wasn't packed, but it was filling in quickly. We had a large group, and we were served very quickly. Our server was constantly smiling, he had excellent recommendations, and he was extremely accommodating. We had a small child with us who was having a tough time keeping his excitement in check. We were becoming concerned that we were bothering the other patrons, and that's when the owner, Jeanette, popped around the corner. I really thought she was going to ask us to quiet down or leave. Instead, she encouraged us to stick around for the belly dancer, because she thought he would really enjoy it. She absolutely could not have been nicer. I can't say enough good things about Santorini. I wish there were 7 stars."], ["Matt H.", "This was an excellent place to eat! The food is very tasty, great service and the atmosphere was very relaxing, they even had a belly dancer for entertainment! My wife and I tried the famous Saganaki aka: flaming cheese for our appetizer, it IS a must if you try this place out, they set it on fire and yell opa! For my dinner I got the Chicken Oregano (kota) was very tasty I highly recommend it if you're not sure what to get! The service was great, our waiter was very professional and knew everything you needed to know about the menu! Perfect place to go for dinner I highly recommend! Enjoyed the whole experience!"], ["Ron R.", "Went to Santorini's for my birthday based on the reviews here on Yelp.   Great choice Yelpers!  I did have a great time and the food was great.We had a party of 10, so we ordered quite a few appetizers, bottles of wine and some mixed drinks.  The Saganaki was delicious and I highly recommend it to anyone who is a fan of Saganaki done right.The Hummus was, meh.  Not bad, but I've had many better.The Breaded Eggplant was....wowza...delicious.  This is a must try along with the Saganaki.  I would compare it closely to Eggplant Parmesan.For food, we all mistakenly ordered either the Chef's Combo or the Santorini Combo which are very similar but the Chef's combo just has a couple extra things like Dolmas.  Please take note:  This is a crap load of food.  I am a big eater, but when this was put in front of me, I wanted to faint.  I attempted to finish it, but there was no way.  I ended up taking some of it home and a whole bunch of my girlfriend's plate home to eat for lunch the next day.The only complaint I have here is the \"famous dessert\" they have.  Galakbaraks or something like that.  It is a phyllo custard with honey and sounds delicious right?  But it isn't....or at least not to me anyway.  It tastes as if you took cake, and dipped it in water and then tried to eat it.  Not very delicious at all.  Also, typically when you mention a birthday, they bring out the dessert for free.  Not here.  My girlfriend mentioned it was my birthday, and the waiter simply said \"oh, that's nice.  Dessert?\" lol....we took that as a birthday dessert.  Nope....was on the bill.Oh well, I had a good experience and would be back if I am on that side of town craving greek food."], ["Arielle T.", "Santorini was a wonderful experience. Our server was the best I have had in a long time. He was very knowledgeable about the menu and made recommendations for first timers. The atmosphere is quite fun and energetic, too. Be sure to order the flaming cheese. It's a neat experience. The portions are gigantic and everything we had was delicious and flavorful. I will be going back. We really enjoyed our evening."], ["Nicole R.", "Customer service was amazing. The owners are very friendly and present. The staff is helpful and friendly. Food was great. I've enjoyed everything I have ordered. Love the new outdoor area!"], ["Liz H.", "Went here for the first time with a large group that meets there every couple of months.  First impression, fairly typical greek restaurant. Decent sized menu.  Can be a little pricey BUT their portions are HUGE so def worth the cost.  I got a combo plate to sample a few of their things, all of which were good.  I was not thrilled with their side items, I found those to be a little bland.  The potatoes were good though.After dinner we went upstairs to their meeting room.  The stairs leading up are a bit steep and with little space to actually put your foot on.  On the walls was the typical countryside murals I have come to expect at most greek places complete with crumbling temples and columns.  They also have a restroom up their so you don't have to go back down to the main floor if you need to go, thank goodness.  i didn't want to go up and down those stairs any more times in one visit than I needed to."]], "Al Basha Restaurant": [["Sean C.", "I thought the previous reviews were a bit harsh, IMHO. The restaurant is clean, the lunch buffet is of terrific value given the dishes they offer. The servers are attentive and very nice, if a bit timid and shy. I will definitely go back and I hope more people support this place, Indy needs more ethnic restaurants and businesses like this."], ["Mike M.", "Went for lunch with friends, they got the buffet and raved about the chicken, stuffed cucumber(very original,  never seen that), gyro meat and greek salad. I wish I had got the same. I was brought up with Lebanese food and couldn't wait to try the kibbeh. Kibbeh is how I gauge a Mediterranean / Lebanese restaurant. Its not that hard to make but easy to get wrong, all you have to do is CARE about how it tastes! I am sorry to say it was almost inedible. Dry, texture was like eating raw wheat flour. No flavor. Don't understand how cooks don't taste the food before they serve, seems so freakin obvious!!I returned the food and the server was very professional and I ordered the hummus which was fine.  My greek salad was very good as well. Will most likely not return.  Shish Falafel on west 16th has never let me down and has 3 gyros for $10!!"], ["Cammie W.", "I opted to get take out but the cashier/server was very nice during my short time here. The food came out very promptly, which wasn't surprising since there were only a few other customers.The restaurant looked pretty clean. However, I never see more than a few tables here so that probably helps.I tried the Mezza Combo (comes with 2 grape leaves, 2 falafels, baba ghanouj, hummus, and pita bread) and the Chicken Shawarma sandwich. The portions are pretty big. The Chicken Shawarma comes with fries so for me, it's enough food to be split into 2 meals.Overall, the food was just too salty for me. The saltiness overpowered what other flavors the dishes might have had. The falafel was dry without much flavor (aside from pure saltiness). The hummus and baba ghanouj were also very oily.The Chicken Shawarma sandwich was very yummy though. The chicken was seasoned extremely well and was moist and tender. Again, too salty but I think having it over rice would have helped. It also got pretty messy for me because of the sauces/juices."], ["Bassam R.", "Very nice Shawarma and Falafel really good taste but unfortunately the cost of these sandwiches is very high."], ["Mike F.", "As a lifelong fan of Mediterranean cuisine, I always look forward to trying a new restaurant of the sort.  When Al-Basha opened in close proximity to my home, I was thrilled, especially considering that the restaurant features a daily buffet.  When I eat Middle Eastern food, I admittedly prefer to gorge myself.  However, overeating at lunch usually ruins the rest of my day.  I was disappointed when I learned that Al-Basha only featured a lunch buffet, especially after being overly tempted by seeing it.  Just walk by the restaurant in the afternoon, and you will feel my pain!I finally decided to try Al-Basha at dinner time, settling to order from the menu.  The menu is large--larger than that of similar restaurants serving Middle Eastern food.  Too many people these days equate Mediterranean food with a run-of-mill gyro joint; Al-Basha is not one of those.  Needless to say, I had a very difficult time deciding what to order. I started with the small hummus place.  Not only was it delicious, but the presentation was impeccably done.  Without hesitation, it was the loveliest plate of hummus I have ever seen.  The small plate was large enough for three people, and our server offered to refill the accompanying basket of pita.  Next time, I'll try the stuffed grape leaves (in Greek, Dolmades).  For my main course, I had the spicy gyros.  The meat was well seasoned, tender, and moderately spicy.  The meat was well complemented by tomatoes, onions, and grilled peppers.  It was served with paprika-spiced French fries.  They were a fine Mediterranean twist on an American favorite.The staff at Al-Basha was excellent. They were exceptionally friendly, provided prompt service, and were knowledgable about their offerings.  Our server, who identified as an American-born Palestinian, was eager to share details of his culture with my brother and me.  I appreciated that very much.  The best thing about eating ethnic food is gaining an understanding of the culture from which it comes.I will certainly return to Al-Basha.  I did make a recommendation to their manager: open the buffet for dinner on a weekend night.  Other restaurants (particularly Indian) have found this to be a crowd pleaser."], ["Steven M.", "This was the first time at this restaurant so all I wanted was a gyro and fries which I got to go. The gyro and fries platter was $8.50 which, I thought was a little on the high side, but once I got in the car I could smell the fries and I new it was on.  The restaurant appeared to be very clean, and well put together. I got home and quickly opened the box. Much to my surprise was a box full of fries and a very heavy gyro. I went to devouring the well seasoned fries which were still warm and very good. So for the grand finale I unwrapped the gyro and was very pleased to find a pita FULL of meat. Ate the whole thing in about 1 minute with some Arnold Palmer and now I'm in meat heaven. I would recommend this place based on portion size alone, but the meat was delicious and the fries were top notch. Can't wait to go back and try something else based on this experience."], ["Jason O.", "Great friendly service and good lunch buffet which is priced really reasonably.  The buffet has many tasty choices.  We also really enjoyed the baklava we purchased.  We will definitely be back."], ["Marvi B.", "I had the lunch buffet twice actually but was not very happy about it although everything was fresh and appeared clean. I just am not a big fan of buffets. I had their hummus, baba ganoug and the classic gyro and it was absolutely wonderful! Well seasoned and delicious! Actually their classic gyro is stuffed with lamb meat if you like your protein s more that the carbs."], ["Haley M.", "I had a carry out Gyro from here and it was delicious! Great tzatziki sauce and great flavor to the lamb and beef! It was also very speedy service. I will definitely be back :)"], ["Tiffany B.", "Pretty darned good. Full disclosure: I only had one of the salads and some fries since I'm a vegetarian--and my companion had to be cajoled into eating \"not American\" food--whatever the heck that means *SMH* but I'll definitely go again. I always take it as the best sign when people of the culture which the food represents are present in abundance, rather than a bunch of pasty whities like me. Such was the case here. The salad was dang near bottomless (not in the Olive Garden way--ew, mon dieu), but in an \"I think I just ate an entire garden's worth of Romaine sort of way. The dressing was an oil and lemon juice sort of thing- a smidgy too salty for me, since I hardly use salt, but still, I was dang near licking the plate clean. Fries: also awesome, but beware your finicky eating friends, it had a wee bit of paprika or something like that sprinkled on it. Really solid, decent quality from my first experience. Look forward to going back to trying their falafel, baba ganoush and more. Service was a little lackluster, but I think because we were in the transitioning hour between lunch and dinner, and he must have served us as a courtesy, so I'm giving them a pass on that. Looked like they had a setup for an extensive lunch buffet, so may have to get back soon to look into that, too.Love international food, and so stoked to see/ taste this one here!"], ["Naser A.", "Its probably the only middle eastern resturant in town.Their portions are huge, and the place seems like it just opened. They usually have a buffet during lunch time.I usually get from the main menu, and order the chicken shish tawok sandwitch. It comes with fries, so I limit myself from ordering an appetizer because its big, and comes in a pita bread.It doesn't taste like \"back home\" but it does the job. I'd still go there if I'm craving middle eastern food"], ["Franklin D.", "Eh... buffet looked totally unappetizing. Tried the kafta sandwich. It was ok, but something with the flavoring was off, just kinda sour. Also my sandwich came with home made potato chips with BBQ sauce.... whuuut? The baklava and baba ganooosh were pretty good. The service was on the weak side but not terrible, just had to speak up and let them know when you needed something."], ["Clif M.", "Decided to try something different for lunch.  Waited 40 minutes for a take out order, while watching others come and go that ordered at their table and get the same thing I had ordered wondering when mine was going to show up.Literally, 42 minutes from the time my order was taken (via the receipt), I got my food.  I only had an hour for lunch and it took 15 minutes to drive here.  So when I got my order, I took the bag and left.And I still ended up with the wrong order.  I can only imagine someone got my food thirty minutes earlier.  It was alright, but it wasn't what I order.  The people working there were friendly at the counter, but disinterested in checking on me while I sat at the table waiting.They were not that busy, but somehow I fell through the cracks here.  Either way, the fact that they didn't seem to think this was a problem means that I don't think I'd recommend this or come back."], ["Sunah K.", "Didn't even realize this was a sit-down restaurant til we walked in! Lots of space and family-friendly. Food was solid-- I had the gyro combo, which comes with a large side of hummus and a salad. I love tzatziki sauce and there was plenty, not just a blob in the middle. Hummus could use a little salt, but came out beautifully. I'll def be back for my gyro and falafel fix!"], ["Mary A.", "Great food in a great location! Everything is fresh and tasty (both the menu and buffet) but I would recommend the baba ghanouj and the shish tawook sandwich! they are my absolute favorite! The place and bathroom is very clean, well maintained and a great atmosphere!"], ["Tamara Q.", "This is a middle eastern restaurant rather than its counterpart casual food-places along the same strip. You can get a pretty good Gyro or hummus and baklava. Alternatively, you can come for the buffet at lunchtime. Price points are a bit higher than I expected, but if you expect it, it may be less disappointing."], ["William L.", "My wife and I went here last night for dinner. First the place was bright (well lit) and clean, a definite plus.Keep in mind our exposure to Greek / Mediterranean food is limited to 1-2 different restaurants with similar menus. This was not where we would normally go for Greek food.  I had the falafel dinner which came with a Greek salad, plus I ordered a side of Feta and Olives. My dinner had 4 falafel fritters on a bed of lettuce, 2 different hummis, some pickles and olives. One of the hummis was quite good but the other had a strange texture and sweet taste not to my liking. The pickles also had a very strange taste to them. The falafels them selves had a lot of cilantro in them, to the point the were green on the inside. Cilantro was also garnished over everything on the plate. The issue with this is that I do not like cilantro.The side salad was good it actually looked amazing. Taste wise however was good, not as fantastic as it looked. The Feta and Olives was just that plus more of those strange tasting pickles. this was good, I love Feta and black olives.My wife had the Spicy Gyros. She said the meat was quite dry but tasted good and said it was not \"Spicy\". It came with rice which was so dry she would not eat it, and again with cilantro. The stewed beans she said was great, she was amazed as to how well they tasted. We may very well be back to try something else."], ["Michael D.", "Far too over-priced for the quality of the food, at least what's offered on the buffet."], ["Yasemin L.", "It was okay. Kind of quiet place. The one in fishers is ten times better but the food was okay. The waiter was cool. The chips were hot and good. The kafta tasted different then most I've had. Overall a good place/"], ["Brandon S.", "Buffet was small, not that good, and over priced. Three restaurants within blocks that all have a cheaper and surprisingly good buffet. I will not be back for a $10 lunch buffet that is the worse in town. I heard the food off the menu was good. With So many options in area who knows, I may stumble in again sometime."], ["Sarah M.", "Great falaffel sandwich.  Prices seemed a little high, but it's nice to have a Mediterranean place in the area.  I'll be back!"], ["Deb C.", "First trip-lunch-delicious, generously portioned gyros sandwich on pita with house made tzatziki, tomatoes, onions and house made chips. Flavorful and fantastic!  Hit the spot!  Attentive wait staff, prompt service, clean and open warmly inviting atmosphere. Lunch buffet looks awesome but I was craving gyros. Can't wait to try for dinner."], ["Sara P.", "$9.80 pre-tip for the lunch buffet and fountain drink.  I highly recommend the baba ghanoush, probably one of the best versions I've had of this dish locally, with a wonderful smoky flavor and plenty of olive oil drizzle.  The salad with feta, tomato and Kalamata olives was light and tasty, but beware the olive pits! Tzatziki sauce drizzled over stewed gyro meat and saffron rice helped to balance the various flavors.   The place was busy for the weekday late lunch period, although the non-functioning AC made the dining room a little humid and uncomfortable; hopefully, this will be remedied as the weather warms up. I'd like to go back for dinner to sample a few dishes off the menu, beyond the buffet offerings...especially the mezza platter referenced by other reviewers. It would have been cool to see some falafel on the buffet, but since it tends to dry up quickly, I can understand the exclusion....and I may have just visited on non-falafel day. I agree that some type of dessert or fresh fruit is needed on the buffet. Overall, Al Basha is a welcome addition to this area, i.e. former chain restaurant wasteland."], ["Richard H.", "Notice that the \"meh\" reviews tend to be for the buffet. Well, that's a buffet for you!We went for a weekend lunch. Everything was delicious. On the mezza platter, the hummus was really, really good, as were the falafel and grape leaves. The pita bread tasted good to us. The kafta was excellent, and the fries were kind of addictive, althoug oddly a crispy fry seemed to alternate with a limp one. I prefer crispy.Service was prompt and friendly if confused -- portions of orders were forgotten, checks were a little mixed up -- but I'd definitely do back and recommend the place to friends."], ["Muhammad M.", "Great place ... Authentic food .. Best lamb kabobs.. There chicken shawarma and tabouli is awesome .."], ["Casey W.", "I ate at Al Basha for the first time today. We had the lunch buffet. Very traditional Mediterranean - Delicious! The owner was very courteous and chatted with us a bit (one person in my party is a frequent flier at the Fishers location). The only suggestion I have is to add label for dishes - not sure what many of them were, but they were all very very good. Baba ganoush and hummus were great as was the pita. Will definitely be going back!"], ["Anu G.", "We went there because the reviews were good. We were excited about having a Mediterranean buffet. But trust me that was the biggest mistake. There were a lamb dish, chicken fish and veg dishes but just one of each.And trust me, all were awfully sour and tasteless.Don't waste $10 for their buffet."], ["Edward J.", "First visit to Al Basha. Tried the lunch buffet. Delicious baked tilapia, al dente vegetables, yellow rice (saffron flavored, I think), along with hummus and pita bread. Everything was tasty, couldn't get enough of the fish. I wish there was something sweet on the buffet for dessert, but that's my only complaint about the food. Al Basha is in a strip mall filled with restaurants. There's parking in front and in back. The atmosphere is nothing special, but the staff was cordial."], ["Ana C.", "I was very excited to try the buffet. It was not bad, and tasted fresh, but was very limited in options. And the fact that there was no dessert is certainly sad. They have only recently opened so maybe as they get settled in the food and the experience will improve. Overall, I will probably be there again, in hopes they have found their footing. They seem a little overwhelmed at this point."], ["Dee D.", "Food was pretty good. However, the service was not so good. I am a strong believer in great customer service, especially if I'm paying for it. So for that reason alone, I will not be returning. (I only interacted with one staff member, but one is enough for me)."]], "The Parthenon": [["Nicole V.", "Great lunch place! Delicious Greek food. Casual atmosphere. Friendly staff."], ["Bhajahari M.", "Food quality is not bad but they serve small portions.  I had to visit a subway after the dinner!"], ["Chatiana D.", "I ordered from here through my eat 24 app and is very happy I choose this place. Besides the 20 min total for delivery, i loved this place. The Chicken Shawarmer was seasoned to perfection. As soon as I tasted the  Spanakopita, i began wishing everyday was Saturday. The organo fries was a delight to my taste buds and the Greek salad was delicious. Overall: 5 stars!"], ["Brittany H.", "Great food at a great price. I finally stopped in and tried it out and was glad I did!  I dined in and had fantastic service by one guy who managed the whole place and was on his game. I had the lamb kebabs and the were cooked well. I also tried some dessert. I don't know what it was but I would eat it again. I can't wait to go back and try more. I'm glad to see they are open to ten as well."], ["Stephanie C.", "I've heard so many delightful things about the new owners.  I must say I was extremely impressed with their impeccable customer service,  I can not wait to enjoy everything on their menu."], ["Mohamed A.", "The food is amazing!!!  Great service!!! my sister told me about it so I went and checked it out with a coworker. We first had the spicy Gyro and at that moment we devoted our loyalty to the Parthenon. now every time we have a meeting at work we order from the Parthenon. Now I have 13 coworkers who are regular customers at the Parthenon. Best Middle Eastern food I've ever had. Can't wait to go back and try new things."], ["Janie D.", "The Gyros - spicy and regular - were EXCELLENT!!!  These were the best gyros I've ever had!  But UNDERSTAND - ONLY GO FOR THE GYROS!!.  The Large Greek salad ($6+) consisted of iceberg - not Romaine - lettuce, 1 olive, 2 tomato slices, and palm-full of feta cheese.  This was the WORST Greek-ish salad I have ever had!  (It was embarrassing.). The chicken sandwich and fries were both cold and tasted like cardboard.  Our take-out order was incomplete, and they wanted us to drive 30 minutes to pick up what they had left off.  I feel this restaurant would be better served just offering gyros and NOTHING else, because their Gyros -spicy and plain - were absolutely amazing!"], ["Christine B.", "Dined here this weekend on a restaurant.com gift card. The prices here are so reasonable that we had a hard time getting to our minimum purchase in order to receive our discount! But that's a good problem for a customer to have. Saganaki was very tasty, although it does not arrive en flambe as it would a regular greek place. Nevertheless, the pita was fresh and soft, salad was fresh, and the gyro meat was the best I've ever had. Other places the meat is dry, overcooked, or overly greasy. This place it was perfect. Service was impeccable and very friendly. This place is family owned and operated. Baklava was heaven! The owner's son even came over to say, \"the baklava is easier ate with your hands instead of a fork, go ahead, dive right in\" It wasn't too terribly busy on a Friday night, I assume, because they don't serve alcohol, but sometimes you don't need booze to enjoy a good meal. Next time I go, I'll have to try the turkish coffee. The presentation alone is worth it. They also deliver within a certain radius. I really appreciated this place. Also, there were quite a few middle eastern families dining in here, which is always a good sign that if the families here are from that culture, this is as authentic and as real as it gets!"], ["Adrienne C.", "Just went to the Parthenon for the first time. I had heard this place had good authentic greek food. I was impressed. We had Saganaki and it was excellent. I also had Koshary for the first time. He said it was an authentic Egyptian dish that they serve there. I really liked the sauces on it a little spicy but not too hot and it came with greek salad. I was really impressed with the number of vegitairan and vegan options. My boyfriend got the gyro plate and the greek fries and was impressed with the flavor and the huge portion.  The service was also excellent. He even brought out a sample of the dolmathes and the Moussaka to try. Wish we would have saved room for baklava. The prices were also very reasonable. What a great little family owned place."], ["Wessam K.", "Great Arabic and Middle Eastern food. Food tastes like home cooking. Authentic!. I def. recommend it. Also, Great service. Ask for the special. They have specials daily that are not in the menu."], ["Wanda M.", "First impression walking in is a cold, barren room with sparse tables, uncomfortable hard chairs and I've been in surgery rooms with lighting not this bright. I guess my expectations was warm and pleasing decor with softer lighting. My trip to to the restroom found it dirty with at least 3\" of dirt along the baseboards and entire restroom was needed a thorough cleaning. The overall restaurant needed a fresh coat of paint and a good scrubbing. The duct work above my head was thick with dust and the black ceiling fans were gray with dust. I think I''ve made my point and I didn't even see the kitchen.Service was friendly and fast. I ordered the SPICY gyro and subbed salad for the French fries. The gyro was a decent size for lunch with tender meat and a hint of spice. Rather bland for again what I expected. Waitress offered hot sauce but then I'm just tasting a bottle of hot sauce...not seasonings. The salad was fresh, crisp iceberg lettuce with a slice of tomatoes, 1 blks olive and a few sprinkles of cheese. Good but over dressed in oil. All in all, okay, but I was not impressed with anything I tasted that would bring me back here over any of the hundreds of restaurants in the area. I just happened to be next door and starving and that need was met."], ["Matt B.", "Really enjoyed our dinner here this evening.  Friendly service, excellent fresh food and very reasonable prices. I had the spicy gyro (based on other reviews), my wife had the falafel sandwich +  we shared an appetizer and dessert.  The spicy gyro was really good. Moderate spice level to me,  spice was there bit not to overpower the flavors. also nicely complimented by the fresh cucumber sauce and tomato.We look forward to a return trip with our kids as well and will suggest to our friends."], ["Dennis H.", "Excellent food, amazing service, and nice atmosphere!  Our server Mohammed had wonderful suggestions!  Two new desserts were offered, and while i am ashamed to say I forgot the name of them, they were both jaw droppingly good!  The food and experience was well worth the price! Take the time to treat yourself to this place!"], ["Lucy H.", "We came here with the Indianapolis International Supper Club and enjoyed it very much.  (We also had the advantage of an Egyptian at our table to explain what some of the dishes were.)  Some of the dishes weren't to my taste and rabbit really DOES taste just like chicken, (though the texture was a little different), but the range of tastes represented was broad, letting everyone find something they liked.  I was very fond of the curry and the cilantro sauce."], ["Rfs S.", "I ordered the gyro (to go) and topped it with the cucumber sauce. 4 bites in my stomach tightened up and I threw it in the trash. I've eaten this before and it was fine. Apparently unlucky today."], ["Jenn K.", "Dropped in with my toddler for lunch not having any idea what I wanted. Tried a sample of a new dish (koshari) and it was a *huge* hit with said toddler - probably not for everyone's toddler but mine loves curries and spices. So we had that, lentil soup and rice pudding. All had great flavor and it was a terrific amount of food for the price. I ended up taking home the rest of my koshari and rice pudding,  and some baklava for later. Looking forward to more meals and the additional menu changes coming as these new owners get settled in!"], ["Brian S.", "This was the best place I found in the area for gyros when I moved here about 9 years ago. Back in early 2014 there was a change in ownership, and the food only got better. I love going to this place, the food is great, the people are friendly, the hardest part is deciding what to order, because it is all so good."], ["Steven Q.", "Very clean and comfortable atmosphere with good food. Never had food from this area of the world, but the waiter was very helpful with what to try."], ["Sarita B.", "We dropped in while shopping because they weren't busy and we were starving. The service was still a bit slow, but friendly. I ordered half a spicy gyro, which was well spiced and tasty. It came with a bit of lettuce and a few pieces of onion. I ran into trouble when I asked the server to confirm that the tahini sauce was dairy free. Obviously no tzatziki for me, but she eventually told me the tahini was okay. I had a reaction later, so I'm not really sure she asked the cook. I'm pretty sure she didn't get what constitutes dairy since she told me later she could offer a dairy free dessert. Cheesecake. Yeahhhh. If you don't have any allergies or questions, the food is tasty and cheap. I'd grab a spicy gyro here again sans sauce."], ["Krista R.", "Ate here recently with family. Two of us had gyro plates -- highly recommended. Another had chicken shawarma -- he loved it! We all started with the lentil soup and hummus/pita. Everything was good. Side Greek salads were tangy and fresh. Great sauces with the entrees, too.Only thing we didn't care for: the lights are BRIGHT. I would have loved a more intimate, romantic feel to the place. But the walls are bold and the lights harsh. I guess it IS in a strip mall...In summary, Parthenon has a simple menu. The food tasted fresh and delicious, and everything was a reasonable price. Atmosphere not the best -- will consider takeout next time."]], "Ali Baba Cafe & Hookah Bar": [["Dylan E.", "Not a bad place, but I think with the abundance of other restaurants around town to go get a gyro at, this one didn't really offer anything to compensate for prices that I found to be higher than most others.The location is conveniently close to the circle, and has large windows in the main seating are to offer a good people-watching experience. There is a back room that is much more decorated and looks like a fun place to go sit, but we weren't offered the option to go there and didn't notice it until we were leaving. It looks like it was probably where their hookah area was but now is just for eating, but don't quote me on that. They had some sort of fun Middle Eastern music on in the background to set some ambiance, but also had a big TV with football games on, so you get a little bit of two different cultures. The service wasn't quite on par for a place with only a handful of customers during my visit for lunch on a Saturday. The same person, who did not at all look happy to be there, was wearing many hats and was working as the hostess, waitress, bus boy, and cashier for the entire place. We got our orders in pretty quickly, but that was about the extent of it as far as service goes. I think a lot of it had to do with a decently steady stream of to-go orders getting placed at the hostess counter and taking up her time, but attention to our table was noticeably lacking.The food was ok. I went with the \"full\" gyro instead of the \"half\", which turned out to just be two smaller gyros and leads me to believe the half gyro is just one. Because of the two sandwiches, you end up with a lot less meat and a lot more bread than other places that make one big gyro. The pita was tasty and warm, and the meat tasted like what you get off of any of those large rotating spits, without being too dry or overcooked. The tatziki sauce left a lot to be desired, and was basically just chopped up cucumbers in a very watery base. It was definitely not yogurt based and whatever the runny sauce the cucumbers were in was, it just immediately dripped all over the place when you tried to eat. It came with a couple pieces of lettuce and one small bite of tomato. Overall, a place I'd probably go back to if I was craving Mediterranean style food and it was conveniently close to where I was at the time, but not somewhere I would go out of my way to visit again."], ["Corrine P.", "For lunch I ordered the spicy gyro and greek salad. The food was pretty good.   I will definitely go again, but I wasn't completely in love. Also, the service was not awesome. We had to find another waitress to refill our drinks and chase her down for the check."], ["Sonya A.", "We went in with rather low expectations, not expecting much at it was 8:30p and just wanted a quick bite. We were SUPER pleasantly surprised. We had the baba ganoush app, the half order falafel, full order spicy gyro and a side of fries. Every little bit of it was delicious! Good quality, good flavor! We are coming back to have a hookah session too.Food: 5/5Service: 3/5 - our lady was quite standoffish and liked to toss things onto the tableLocation: 5/5 - very clean and what a cool downtown location"], ["Chris Z.", "The food is amazing and the staff is friendly. I'd consider 5 stars BUT out of the 3 times I've been here there was 1 time that it was unreasonably slow. I'm talking 30 minutes for water and 10 minutes after we ask for the check before reminding the waiter that we still needed our check.Other than that one day, I'd recommend this place in a heartbeat. It is one of my favorite places for lunch when I'm in Indy for GenCon. And it is right across from the hotel we stay at too!"], ["Jenai M.", "Big fan of this place.  I eat here pretty regularly because I live and work within walking distance. I always get the Spicy Gyro, and switch between the Spicy Gyro sandwich and the Spicy Gyro salad.  The salad is filling and tastes amazing. If you have room, order the seasoned fries and/or the lentil soup.  Service is quick and I've never had to wait very long."], ["Alyssa S.", "Great, affordable cuisine! I frequently get carryout during the week, and am never disappointed in the lentil soup and spanakopita. Ali Baba also serves foul (a delicious warm dish made with fava beans). It's my absolute favorite and I think it's the only restaurant in town that makes it. Table service can be slow, but is always friendly! Convenient location, just a block from Monument Circle."], ["DeAnna P.", "They have reasonably priced lunch deals - around $7 for a combo with salad or fries.  The fries are nothing special, just seasoned fries, but they were served crispy and hot.  The spicy gyro is as advertised -- SPICY.  I loved the heat.  It was just enough.  I was disappointed in the slow service.  I remember it being that way the first time I went, but I chalked it up to it being a new place.  There's really no excuse now.  As soon as I sat down, I told my server I was ready to order.  She told me to hold on and didn't return for several minutes.  I see her (poor girl) racing around filling a to go order, running credit cards, and passing out checks.  Meanwhile, three other servers were standing at the counter doing nothing.  Staff needs to be trained better.  Still, a cheap tasty gyro less than two blocks from my office?  I'll take it."], ["Joanna B.", "As I am sitting here I am trying to figure out what to say about this place... and I think that is the biggest problem. I have nothing good nor bad to say. If this was the last place on earth to eat it wouldn't be a complete disappointment, but I am not sure I would go out of my way to eat here again."], ["Boz D.", "This place is terrible! Ordered falafel sandwich, had the falafel sandwich with hummus. First it was an open face sandwich, pita not really grilled like it says in menu, the falafel had no seasoning, totally bland.  The hummus same thing no seasoning.  You could have given me a plate of chickpeas and they would've tasted better. Ordered side of rice and green beans, the green beans were obviously canned, again no seasoning to the rice and beans.  Being from metro Detroit we have plenty of authentic middle eastern options so I know what it's supposed to taste like, and this place does not.  Another thing is don't say your authentic middle eastern when 3/4 of your menu consists of Greek entrees. First time visiting Indianapolis and this place, I'll come back to Indy but not Ali Baba."], ["Peter P.", "Downtown Indianapolis finally has a Middle Eastern restaurant.  Ali Baba is in the old Tea Cozy space.I went on their opening day for lunch, and the lunch deals here are pretty good.   I got half a beef schwarma (you can substitute a gyro) sandwich and a Greek salad (you can substitute fries) for about $7.Next time I go, I'm going to try their spicy gyro.No liquor license, but you can smoke the Hookah there.Also, the main entrance is actually on Market St., not Illinois St."], ["Scott M.", "Gyros, gyros, gyros.  Two lunch visits and they were excellent both times.  Relatively quick service for a sit-down meal and they have outside seating that seems to always be in full shade.Lunch special gives you french fries, no thanks - give me a 2nd gyro instead!  If you order the gyro sandwich, that's exactly what you get.  Two large pitas with a sturdy helping of meat, plus your choice of sauce (I like the tzatziki sauce although they call it something slightly different here).My only complaint is the lack of onions + tomato on the side, I like to have that option with my gyros ... but I'm willing to overlook it because of all of that tasty gyro meat."], ["Ben M.", "Tasty, good portions, authentic! Good for groups or a loner like me. Service was very good and the personnel friendly (including the cook!). Hummus and kebobs are great tasting. Probably crowded for lunch based on location close to businesses and Capitol offices. Not a problem on Saturday afternoon, though! I'll be back."], ["Whitney D.", "Food is delicious but service is HORRIBLE every time I go there. Even when there are only 5 tables of no more than 4 people and about 4 servers the service takes FOREVER when dining in. One day it took 10 minutes just to be greeted by a server. They were avoiding eye contact with us and it took me waving my hands over my head to get them to come back and take our drink order. The servers are never friendly and act like they do not want to be there. They are usually on their phones up at the front counter. We always go for lunch and the gyro lunch specials are delicious along with the fries but I would suggest just ordering carry-out. It's much quicker and you don't have to deal with the awful service."], ["Stacy Z.", "Back again this year, and it was delicious as usual. Only caveat, get take out! Service in the restaurant is notoriously slow even when it isn't overly crowded. Everyone is pretty friendly, though, and the food is fantastic."], ["Nate T.", "This is my spot right here!Fries are delicious and the spicy gyro for lunch is greatI wish the full orders came with a side but I can't complain too muchReally good me and everyone at my store love this place"], ["Bridgett M.", "This was my first time to Ali Baba and the food rocked! Some of the best falafel and spanakopita that I have had. Unfortunately, it was soooo cold inside. Also, there was a random flat screen tv with NBA TV on at a very low, but, still audible level. Very distracting. I will definitely order take out next time."], ["Omar R.", "Food is good, horrible service. Waitress seemed like she didn't want to bother with any of the sitting customers, mind you this is on a Monday night and a really empty place. Again, food good- service horrible."], ["Megan M.", "Favorite place around the corner from me.    If you come here you MUST get the babaganoush.  It is amazing!They have a spicy gyro that has a great kick and the full sandwich is actually two gyros.  I often save one for lunch the next day.    Each sandwich comes with lettuce, tomato and your choice of sauce.  Who wouldn't get the tzaziki?     I've had the falafel as well as the chicken - also solid choices.   Quick note that you can get a falafel on the side as well if you want to try it."], ["Lisa C.", "Reasonable pricing. Nice staff. Not impressed with the food. I ordered the tabouli for carry out. Mostly parsley, couldn't even taste or sense the cracked wheat in the dish, very vinegary. Only had 1 olive and 1 piece of cucumber."], ["Elaine C.", "The restaurant is conveniently located near the downtown circle.   I was in Indianapolis downtown for a conference, and I noticed that one of the attendees ordered a falafel wrap.  It looked delicious, so I decided to visit the restaurant.  I ordered a sweet green tea, Greek vegetable soup, and grilled lamb salad.   The tea was delicious.  It had a nice sweetness.  I think it was sweetened with honey or agave.   The soup was hearty and flavorful.  The slices of lamb meat were tender and full of flavor.   The greens and dressing were plentiful and filling.   I wish I stayed in Indianapolis for a few more days, so I could back and try the falafel wrap.   The prices seemed reasonable."], ["John H.", "Sucks. Walked in to get take out.Got a regular gyro sandwich, a regular beef schwarma. Was told 10 minute wait. Ok.Tried to watch the kitchen while they were prepping our order. I assume the cook owns the place as he was trying to leave the kitchen as the hostess/waitress said order in and he got a disgusted look on his face. Then he was on the phone the entire time he was cooking. After a quick walk to the hotel while putting the food in the fridge for later I figured id sample it.Gyro first...two aluminum foil wrapped logs that looked like hot dogs. Opened one...are u kidding me? A little cuke, a lil taziki and about 10 scraps of meat. What? Tried a piece of the meat...at least it wasn't dry and overcooked.The schwarma looked the same...2 pitiful foil hotdogs. Tried the meat....tough as hell. No flavor.Joke.Don't waste your time.On top of that I watched the hostess make some tea, throw the debris in the trash and then squash the trash down with her bare hand. Yup she did not wash it for the rest of the time I watched her. About 10 minutes. Glad she never touched my food other then the bag it was in.Ooooh! But they have hookahs. (hopefully you got the sarcasm)Don't waste your time or money, id rather go back to tata cuban next door for a sandwich. At least that place is clean."], ["Ed S.", "Not a bad place -- good for something different if you get tired of the usual sandwich and chips for lunch.I've only gone here maybe three times and have always had the Chicken Shawarma -- a full portion is more than enough food for lunch. Tender, juicy, and flavorful.Service is OK but a little on the sluggish side.I've never eaten in but the seating area appears to be decent. There's also a special room in back with Middle Eastern-style seating.... I've only glimpsed it when waiting on my order but it might be worth trying out sometime if you're out with a group.There appears to be seating available outside when the weather is nice, but I'm not 100% sure about that as I've only gone here in the dead of winter.Nice change of pace -- I'll be back and will have to sample some of their other menu items."], ["Jon F.", "The waitress Lilly was unfriendly, dressed like a hooker, and double-charged me.  Then when I tipped her 20% she gave me a dirty look.Never go there."], ["Tamara Q.", "Came with a party of 5 and left full and happy. Ordered spicy gyro which was two whole pita gyros. The meat was seasoned and delicious but it was greasy; It was a bit heavy for lunch but pretty awesome for $10+tip.  The only bad part is you take the smell home in your clothes and hair."], ["Joe D.", "I decided to try this place despite some dubious Yelp reviews.  Service was excellent, server was very polite, food was very tasty and good sized portions.  Prices very competitive. I had the Chicken Kabob dinner and my wife the Chicken  Shwarma dinner, both  of which came with a side salad. Will dine here again during future trips to Indy."], ["Rose L.", "I will get the negative out of the way first:  if you do not have at least an hour to kill, do not come here.Moving on.We found this place while walking downtown.  Looked good, so we walked in.  A girl and a guy were working, and about three tables had customers.  The girl looked at us and seemed flustered but acknowledged us.  We stood there.  We finally asked if  we seat ourselves, or . . .  No real answer.  We then asked if some of us could sit outside and some sit inside.  Girl says that is fine.  So, some go outside and sit.  The three of us left inside stand around.  Worker people disappear for a while.  Girl comes back out and seems preoccupied.  Finally, I asked if we could sit at an empty table.  She said yes, that would be fine.  We picked up our own menus, as the pace had already been set.  After about 7 or 8 minutes, a guy took our drink orders.  Several minutes later, we got drinks and he took our food orders.  Meanwhile, our \"outside\" group had not been acknowledged.  They got up and went to the pizza shop down the street.  I ordered a large appetizer plate and a large spicy gyro.  The plate had babaganoush, falafel, hummus, and the oniony, garlicy salad I never eat.  The stuff I like was fabulous, and my friends loved it, too.  The pita had been toasted, not just microwaved, and it was soooo good!Then came the \"whole\" gyro.  It was actually two complete gyros, and I was ecstatic that I would have leftovers for a snack later!  Oh my, the spicy gyro was so delicious!  By far the best I have ever had.  Coworkers loved whatever they ordered and cleaned their plates.  My \"whole\" gyro was about $8 or so.Getting our checks and paying our bill was another arduous task and took no fewer than ten minutes.  Keep in mind, hardly any customers are in the place.  Workers were super nice and did care about service, but I did not see any reason for the inefficiency.  Would I return?  Oh heavens YES!  I think I would call ahead for takeout unless I had a lot of time to kill.  Food is definitely five stars."], ["Bodie S.", "My dad and I were in the downtown area and on a whim my dad wanted a gyro and suggested we go to Ali Baba's across the street from the Hilton. I was not going to argue because I do in fact love gyros, so I eagerly accepted the idea. The restaurant is also a hookah lounge, but since we were in there around lunch time, between 11am and 12pm, there was no one smoking inside. The lounge is separated from the area of the restaurant where you consume your food without inhaling smoke. The music was very loud for a sit-down eating experience, especially for that time of the day, so that wasn't great, but the food tends to make up for it. I ordered the full spicy gyro sandwich with tzatziki sauce and my dad did a half sandwich of the same dish. The gyro was delicious. Spicy, but not overwhelming, and I was able to easily eat the entire thing. We also ordered a lamb appetizer pizza. It was also delicious, but somewhat small. Since we both got gyros, it wasn't a big deal and were probably somewhat happy it was so small, but for a party of more than two people, I would consider getting something else. Our pizza consisted of four tiny pieces of pizza. But all very delicious pizza. The feta cheese is strong, and the spices are plentiful, so be prepared for what you are ordering--it's a very strong dish. I was beyond pleased with the food. The service was good also, but mind you, we were the only two people in the restaurant. The server was foreign, so that could potentially be hard to understand for some, but it was fine for us. The food came within about 15 minutes; a perfect amount of time for light conversation. Something I thought was neat was that there were small tables outside, so on a nice spring/summer day, you could enjoy your meal outside on the sidewalks of downtown Indianapolis."], ["April S.", "It was so good, we went back the next day and took two friends. It's great to have a lunch place downtown that has fresh, flavorful food. We also tried the baklava which was exceptional. The warm honey mixed with the nuts and phyllo dough was the perfect end to fabulous meal."], ["Tracey R.", "Terrific *Jordanian* food. This is not Greek, so if you come here expecting Greek, you may be disappointed.If, however, you understand that the Middle East/Mediterranean is a big place with a lot of people groups, you will be pleased."], ["Jeff M.", "I've only been here for lunch, but what a deal!  I'm a big fan of the Gyro sandwich in general, but the Spicy Gyro Lunch Special (#2 on the menu) is my favorite here in Indy.  The pita is far better than the Wonder Bread equivalent that you usually get around here in town, and the Gyro meat is nicely roasted around the edges.  Add to this the Sriracha-based kick that they add, and you've got a great sandwich.  Opt for the Greek salad as a side instead of fries."], ["Jamison H.", "I have been here twice now....and while I have ordered similar dishes, it has been delicious both times. I have not eaten here for dinner, but the lunch menu is very affordable.I had the falafel and it seemed much more authentic than other places in town. You can pick from Tahini, Taziki or hummus as the sauce and pick from Greek fries or a salad....all for under 7.00. Both times I have left satisfied and wanting more. The hot tea is also very tasty and we have had babagoosh (spelling?) with hot pita both times...recommended.This is a tasty little place that deserves at least one try for a lunch break. It is also centrally located, just west of the circle on Market St."], ["Willie S.", "Great if sometimes quirky place for lunch. Try the lunch specials - they are a good deal for downtown. The spicy gyro has become a must have dish for my co-workers and me. The salad is decent. Fries for some of my friends. Service can be slow or fast - it depends who you get. It gets very crowded at lunch and the back room while perhaps authentic from a middle eastern perspective is low seating and low tables. Awkward for Midwesterners. But if you have a large group you will get to experience it. Bottom line it is on the weekly lunch rotation and not many make that list.PS. The spicy gyro is nicely balanced and not super spicy. From reading reviews it sure looks like the food is best served there rather than carried out."], ["Melissa D.", "I went here a little after 9pm on a Sunday (pretty much every inexpensive place in Downtown Indy closes at 9).  I didn't expect them to serve me but they did.  The food was delicious and very fresh (got a falafel plate and grape leaves).  They even gave me free tea while I was waiting for my food.  Awesome and will definitely go again!"], ["Chest R.", "Finally found a good restaurant in Indy. The falafel and spicy gyro are great and are on a whole other level compared to the others in the city"], ["Daniel M.", "Went in for lunch on a weekday and they were not that busy, but that didnt stop them for taking longer than I would have expected. The food however was good. I had shwarma and taboli with fresh pita bread. The food had an authentic taste and I will go back, but you have to plan for the wait."], ["Angie M.", "Spicy gyro.  Delicious.  French fries.  Delicious. Service.  Eh, it could have been better, but i will give them other opportunities to redeem themselves.  Meat was tender, juicy and very flavorful. I want another gyro."], ["Margaret B.", "I was visiting Indianapolis from NC and we ventured out to try this place!  The food here is excellent!! Everything was fresh and flavorful. I would visit again in a heartbeat."], ["Amanda B.", "I love greek food, I am also a fan of Gyros. This is the first time I have had a spicy gyros and it was yummy. If you like spicy food with a litle kick, give it a go! I got the lunch specail gyro and greek salad for $8. Perfect size for lunch. The Greek dressing they used was AWESOME! Since I live in NC I asked if they sold the dressing, I was going to take a couple bottles home. They dont sell the dressing but they were kind enough to tell me how to make it myself. I was in town for work and it was a great lunch spot. I was very happy that I decided to go in. I would go back if I am ever back in town."], ["Benjamin H.", "The french fries were the best thing about my falafel sandwich.. Not sure what happened here, but it wasn't good."], ["Lillian J.", "Great food, reasonably priced, service is a little bit slow, but not bad."], ["Wes W.", "I ordered takeout on a weeknight after hearing good things about the place from my roommate. I definitely wasn't disappointed. The staff was very friendly and my order was up in under 10 minutes. My whole spicy gyro with taziki was both huge and delicious. Plenty of well-seasoned meat stuffed in two pitas with cucumber plus lettuce, tomato, banana peppers and an olive on the side made for a very satisfied me. The taziki was a little thinner than I was used to, but after a couple of bites I was definitely sold.At $9.27, it was a bit steep to make it a super common meal, but I think the half size would be plenty for most people. I'm definitely looking forward to trying some Turkish coffee and maybe a hookah next time."], ["Bill B.", "Great food, very friendly staff. It is what it is. A hole in the wall to get some reasonably priced middle eastern fare in a downtown lacking much in terms of ehtnic food options. Plan for a long wait, they're kinda on their own time here so if you're the type that has to have your food right away it may not be your place. But if you want to kick back and enjoy a good Shawarma there's nowhere better in Indy."]], "Athens on 86th": [["C D.", "We stopped at this nice little family-owned restaurant at lunchtime last week. We arrived shortly after opening time, but there were already a few families seated.For our first visit, we opted for classics with familiar flavors. We ordered the hummus appetizer, pastichio, chicken souvlaki, and lahanodolmades (cabbage rolls). Dinner came with Greek salad (you can opt for soup instead), green beans, and potatoes or rice. We also ordered the avgolemono (lemon orzo soup). Dinner also included a toasted soft white bread.Everything was delicious and disappeared before we remembered to take pictures. The salad was not overly vinegary, the meats were tender and well seasoned, and the pastichio had a nice creaminess to the sauce. The hummus came with soft warm pita that had been toasted on the bottom - delicious!We will definitely be back to try new items, including the grouper special."], ["Kelsey S.", "I love this place! The staff and owner are so friendly. Just about every customer have the owner a hug, and I know why. When she found out it was my birthday, she sent over a cheese plate that was set on fire at the table. The meat is incredibly marinated and the side potatoes are great! I have also used them as a caterer. The owner sat down with us and served us the possible choices. She even let us order off the menu. As always, the food was great. My favorites are the spicy feta dip, beef kebabs, and lentil soup."], ["Kassity D.", "On of our favorite local restaurants! The staff is friendly and attentive. They have a fairly varied menu and always have tempting specials. We love to get the Athens Pikilia, a sampler platter that has everything from olives to gyro meat to tyropita. My fiancé loves the Athens gyro. I'm a little bit obsessed with the avegolemono, a lemon, chicken, and orzo soup that is velvety and full of flavor."], ["Leslie H.", "They have some interesting entrees that are pretty authentic. Their hummus is very garlicky for sure and it was pretty good. They soup (chicken with rice and lemon) was delicious. I honestly think that's the best thing in their menu."], ["Roberta C.", "We used to be \"frequent fliers\" here, but it had been well over a year since our last visit. We arrived right at 5:00 and were the only customers in the dining room at first.  We ordered the eggplant appetizer which came with one hot pita sliced 6 ways for $7.99.  It was delicious, but the portion was very, very small. We asked for a second pita - $1.59. We both ordered the dolmades, one with rice and the other with potato. Both came with small Greek salads (at least smaller than a year ago). The four EXTREMELY SMALL (size of my pinky finger) dolmades were very lightly topped with what appeared to be curdled, not-very-appetizing-looking avgolameno sauce. We decided to try it before sending it back and it tasted fine, so we carried on. The portions of potato and rice had shrunk considerably since last year, and the price of the dish had increased ($17.99). The only portion that was pretty close to what we had been used to was the green beans. Our total bill (including two iced teas) without tip was $55.00. The server was good (although our iced teas were not refilled) so we tipped her 20%, bringing our total to $66.00. Bottom line, our meal was tasty but for $66 we shouldn't have been hungry at the end."], ["Robert W.", "First visit. Nice decor, good service and tasty food.  Biggest drawback is value.  I thought my entree and appetizer was over priced.  There is just as good Greek food at lower prices elsewhere."], ["Tifani R.", "Went to Athens for lunch on a Saturday, and it was amazing! We started with Spanokopita and the Saganaki (a must!), and put together- we were in heaven! Such a great way to start the meal. As for our actual lunch, there were only two of us, and we couldn't decide what to have, so we chose three entrees to split! Couldn't have made a better choice. The lamb burger was on special, so we definitely ordered that! And we also split the Gyro Piato and the Mousaka plate... all three were complete authenic bliss! SOOOO GOOOD. All came with a side Greek salad, a mix of rice pilaf, greek potatoes, and green beans as well. Needless to say we took some home and left more than fully satisfied, and it was all worth it! Not to mention the waitress was the sweetest, most attentive lady. Despite the fact that there were only 4 tables full at this time, she was hosting, taking orders, serving, bartending, and answering phones! And a smile never left her face! We will definitely be back!"], ["Melanie P.", "We loved the food here! I had the humus appetizer and ordered extra pita bread for dipping. I absolutely loved the humus (clean plate club for sure)! :) My husband had the speciality gyro and loved it too!"], ["Rich B.", "We visited Athens on 86th recently and was pleasantly surprised.The only complaint I have is that the lights were down so low I couldn't see the menu - I had to use the light form my cell phone to illuminate the menu enough to read it. We noticed everyone received some bread with their salad course (toasted garlic bread type) and not many people were eating it so when we ordered we requested pita bread instead - I recommend you try this as well, the pita is excellent. The greek salad was one of the best I've ever had, perfect amount of dressing, herbs and feta, it's a must have when you visit.I was in the mood for gyros so I got the platter (not the sandwich) which was perfectly prepared - the meat was hot with the edged slightly charred just how I like it, the green beans were tender and seasoned nicely, their potatoes were slightly bland but I ate them with a little of the Tzatziki sauce and that fixed them up to my liking.Portions are generous the decor was authentic (what I could tell in the dim light), our server was attentive and friendly. The prices are a little high but it's a good place to splurge a bit."], ["Susie J.", "Took the family there for a birthday celebration. It was such a bad experience that despite my love of Greek food, (having lived there for 5 years,) I will never go return.The Resturant wasn't full but it took 45 minutes to get our drinks. If that wasn't bad enough, even when the waitress finally came back to ask if we wanted refills, she ended up forgetting to bring them. The food too took forever to be served.But the worst part came when we finally got the bill. When we first arrived they told us about their specials. We asked for many of the prices and were given prices in the range of 25-30 dollars. So you can imagine the shock to find out the special we ordered, a steak, was 45$!!!!  Nothing on the menu was over 30, including the beef filet.  And to add insult to injury it wasn't even a good steak. So all told, what was meant to be a special evening was an absolute bomb! If you still go, be sure you know what you are paying and have a designated waitress waver, to get service when you need it."], ["Nadine F.", "I really enjoyed the food at Athens on 86th.  Though I don't really know what authentic Greek food consists of, I feel like this place is authentic, because it had a huge menu with lots of dishes I haven't seen at other Greek restaurants.   Everything I had was delicious, and portions are large enough to share with a buddy.  Service was quick and friendly, and I would definitely return.  I only wish I had enough room left over for coffee and dessert!"], ["Rebecca B.", "Good food and staff very friendly. Nice atmosphere. I definitely want to try more on their menu."], ["John J.", "Went to Athens on a Friday night. Had a 7:00 reservation but did not need it for a Friday.As someone else stated the place is quite dark. We both had the Gyro latter which was wonderful. It came with green beans and potatoes which needed a bit of seasoning. The meat was wonderful but,I would have like a whole pita. They cut up the pita into small pieces which is fine...I just like to stuff it in a shell. It was very tasty and will be back. Not the same atmosphere as Santorinis but,very good food."], ["Marcie M.", "If you like to venture out and try different things, in the City of Chains that is Indy, this is a diamond in the rough.  Located in a strip mall just off of 86th Street, on the NW side of Indy, it isn't exactly in a fabulous location, but just inside the doors, you will find an air of Greece that cannot be found anywhere else in the city. If you love Greek food, you will get it here or if you like to try new things, definitely check out Athens on 86th Street.  Great menu options, great staff and fantastic drinks.  Offering a wide array of authentic Greek cuisine, you will have to choose from the restaurant feature dishes like octopus, tender lamb and a variety of innovative pastas.  I was very impressed with our cheese appetizer that the waiter caught on fire and yelled \"Ooopa!\" (not sure if I spelled that correctly) which was fun and exciting...not to mention DELICIOUS!!The restaurant is owned by a Greek family, decorated with beautiful mementos of Greece and is very quaint and relaxing, quiet and romantic.  Highly recommend for a taste of something different, for a first or 100th date, or for a small celebration."], ["Id O.", "My wife and I had a dispute one evening in Indianapolis while trying to decide on a restaurant to eat @. Our heated debate lead us to the parking lot in front of Athens on 86th. We decided to give it a try and we were both more than pleased!To this day, whenever we are in Indy, we make an effort to stop in for a meal from our mutual \"favorite restaurant\". We both are most impressed with their specialty chicken gyros!"], ["Bill L.", "If I had to compare this place to a woman, I'd have to say adequate hang-out material, and worth a few bangs, but not gonna introduce her to the folks. For Greek food, My heart will always belong to Santorini's. Athens is a cozy little joint with a cozy little bar. Server was a nice male about 25 with tats and spoke Greek to the kitchen staff. I kinda liked that. I assume it's family owned (aren't they all?) and he's part of the family. Anyway, food was decent but a bit pricey for that part of town. It's in a strip mall and outside looks a bit old and tired but once inside no problem. Would I go back? I suppose, if I were in that part of town again."], ["Amy G.", "Ate here over the holiday weekend.  The Grouper special is amazing.  Service was amazing."], ["Eva L.", "Yummy, authentic food, & friendly staff! We arrived on a day of a blizzard, so they were really slow and we got lots of staff attention. My sons were coached through the greek menu items by the waitress, and she seemed genuinely to like having kids in the restaurant. She made a big show of the flaming cheese for them too! However -  this isn't a kid's restaurant - no crayons or paper, and no lidded cups. So YMMV with a younger diner. My kids liked their kebabs as well as I liked my fish. I would go back."], ["Tom G.", "One of my favorite  Greek Places.  Excellent hummus and Tzatiki.   Nice atmosphere with a full bar."], ["Rachel G.", "I've been wanting to check this place out and finally got a chance to yesterday evening after work.  It's located in a nice part of 86th close to Planet Fitness.  Within a few seconds of entering, I was greeted by a young lady named Tori, she sat me immediately then took my drink order.  After that, I proceeded order the Avoglemono soup (I have a cold and have been craving soups like there is no tomorrow).  She allowed me to keep looking at the menu until I decided on something to eat.  When she came back with my soup, I ended up ordering Gyro sandwich.    This was my first time having Avoglemono soup so I wasn't sure what to expect as far as taste or texture.  Taste was pleasant, however, and, maybe it's just me, but I prefer to have less broth and more \"fix-ins.\"  Aside from that it was pretty good.  My gyro was delicious.  The meat was cooked perfectly and was very tasty.  All the veggies were very fresh, and the tztziki sauce was nice and cooling.  When I was done eating my sandwich, Tori came back and then let me look over the menu again for dessert.  I ordered the Baklava, and I was very pleased.  My only real gripe would be the interior decor.  Like the other reviewers, I have to agree, the place is quite dark, even 4:00 in the afternoon.  Secondly, although I understand they are going for the Grecian/Mediterranean theme, it seemed a little overdone and borderline gaudy.  Finally, there are areas of the floor and the ceiling that definitely could use some TLC.  To summarize everything, service was good, food was good, decor could use some help.  I'll definitely return to try out more of the menu."]], "Skyline Chili": [], "Gyro Stop": [["annesha a.", "Very good gyro. Although they wouldn't honor the Yelp coupon they still gave me a discount. Food was fresh hot and large. All good things."], ["N H.", "The gyros are VERY very good and reasonably priced at $6. However, they are a bit cheap in attitude - the person working up front said that a side of falafel was 4. When the guy in the back gave me my order he said the person up front made a mistake and it was only 3...like, no dude. If a mistake is made, it's not my fault. Give me 4 OR tell me before you put the order together that there is only 3 and ask me if I still want it. I only got the side because I thought 4 at the price was a good deal. I don't like being tricked. The place is a hole in the wall, so come here more for the food and don't be afraid of how it looks a bit dingy inside.Also: The tzaztiki sauce is very light and quite good."], ["Elisa R.", "I am happy I recently discovered this restaurant. It is a simple place with great food, and the family that owns it is very sweet and welcoming. I have enjoyed the falafel, Mazza plate, and Lebanese plate which are all great options for those looking for good vegetarian platters. The menu has variety, ranging from Middle Eastern and Greek food to hamburgers. This is definitely one of my top places for the freshness and great flavors."], ["Amy D.", "Everytime I crave a gyro, this is where we end up. The staff members at Gyro Stop are incredibly friendly and the food is always freshly made when ordered.  I tend to get a gyro (no tomato, no onion) with the tzaztiki sauce on the side, so I can dip my fries in it. I love the tzaztiki sauce here, because it has a subtle cucumber-taste instead of a \"in your face\"cucumber-taste. They also have a great hot sauce they will bring out for you, if you ask. My husband loves the gyro burrito (gyro meat, lettuce, onion, tomato, rice, tzaztiki, & cheese). We typically split a side of spanakopita, which is flakey deliciousness.The only reason for 4 stars, instead of 5, is because I haven't explored the menu enough [yet]..."], ["Allison M.", "I used to live a quick 5 minute drive away and would come here weekly. Now that I have moved I don't come here as often, but wish I could. The food is amazing. The owner always recognizes me, and is always so welcoming too. I get the Combo #5 every time: lamb gyro with a side salad and a beverage. Never disappoints. Prices are reasonable as well. If you're looking for a new place to try, I highly recommend The Gyro Stop."], ["Kryn W.", "Perhaps it was partly the plastic plate divided into little compartments, but portions seem unbalanced. What was that, 2 tablespoons of hummus? One tablespoon of sauce? For two pitas and six (I'd say overcooked) felafel? Quality was fine (except the imho overcooking of the felafel), but like the rating choices say, \"Meh. I've experienced better.\""], ["Malia M.", "Probably the very best gyro I have ever had. The owner so sweet and helpful. Will be back more often."], ["Casey R.", "I really really wanted to like this place. I'm not a expert on the gyro but I know I have eaten many and I haven't had one quite like theirs. I had the Big Fat Greek Gyro. There was a ton of lettuce on it that became soggy really quickly and the tzatziki sauce tasted like it had a ton of mint in it. Maybe that is what authentic taste like and I'm just not used to it? It was just totally different than anything I have ever had and I was not a fan."], ["Gary B.", "UPDATE:Stopped in again in December. Big change in attitude and product. Much better customer service -- new owners again?  At least different help.Gyro was EXCELLENT. Much better ratio of meat to fixin's.  I also ordered babaganooj, which was excellent. Came with a pita, and was delicious when added to the gyro. HUGE serving -- needed another put a AND the gyro.Since noe lentil soup was available, the counter help offered me Lemon Rice Soup. I am now thankful for the suggestion! Basically a chicken and rice soup with no chicken, the aroma opened up my stuffed nose.I hope this service and quality continue. MUCH better than last time.--------------------I used to visit this place regularly, but moved away and haven't been in until this week.  Gone was the original, friendly Lebanese owner that I met when it was located at 79th an Michigan Rd.  New owners seemed a hit surly, and would only answer \"He gone\".The food was a hit different, but neither a better nor worse. The Lamb Gyro seemed a bit sweeter than normal, but not in a bad way.  It was better wrapped in wax paper; a big help on such a sloppy \"sandwich\". Tzitziki sauce was a bit sparse, but all ingredients were fresh.The baklava was bigger than I remember, hut seemed short on nuts, tasting more line honey and filo dough alone.The disappointment was the falafel side. Overcooked to the point over almost burned, the pucks and the sauce lacked flavor.All in all, if you work in the far NW part of Marion county and need a quick gyro lunch, this is the place to go, but this is not the place as a \"destination\" of itself.BTW: Sign says is Halal. Dosen't make any difference to me, but some of our brothers may consider this important."], ["Jen F.", "Good place for a gyro.  I hate tzaziki and its hard to get them to leave it off, but I was eventually able to talk them into it.I'll definitely give it another shot."], ["Jimmy M.", "Not a great place to eat.  I only wanted something different and went their, Make sure you go their when its busy time else they will serve you stale food. I think I was served chicken amount that normally would be for one sandwich in two sandwitch's  The owner seems to not care to get repeat business.Will not go again"], ["Betsy B.", "Fiancé and I have been  trying to go here for the last year but it seems we are only ever there on Sunday's but they are closed. We learned today this is because they spend Sunday's together as a family - love this! So anyway we arrived tonight very excited and we were not disappointed! We've been looking for a great place to get Gyros in Indy and haven't been able to find one we love. That all changed tonight. They were so friendly and answered all our questions and explained the menu to us. Two traditional gyros, small falafel and a side of fries later we are full and happy. The gyros had the perfect amount of meat, sauce, tomatoes and lettuce. Don't forget to ask for a side of hot sauce - delicious. We will definitely be back. Thank you so much."], ["Yolanda T.", "I love this place I eat their every week end the food is great The staff is friendly  and they give the best service"], ["Krista R.", "Not AMAZING food, but it is worth eating when I'm craving something tasty and different.I always get a chicken shawarma sandwich and sometimes a side of hummus. Hope they make it-- the staff is very nice."], ["Whitnie E.", "Pretty standard gyro fare. I enjoy just the plain #1 gyro with french fry combo as a quick lunch. The gyro meat is good, the pita is fresh, and I enjoy the toppings. I am looking forward to trying the falafel after reading the good reviews about it. Its a great place to stop for a quick, tasty, and inexpensive lunch."], ["Jeff A.", "Used to be good place but not anymore I ordered chicken gyro platter, it comes with rice but chicken was very less and kinda smelly and there was too much onion in it and less of chicken, very disappointed"], ["Thomas W.", "The gyro sammich was bland.  The owner was very friendly and made me feel right at home... smiles abound.   I may go back to try the chicken shawarma."], ["Neal P.", "Kind of Greek/Middle Eastern restaurant in a fast-food footprint.  I like their gyros and shawarma.  Nice mom-and-pop family-run place.  The family is from the middle-east. Pretty clean.  Ambience is self-serve fast foot type, with self-serve soft-drinks, utensils and napkins. The food seems authentic. Though they do include a lot of American staples too, like burgers, hot dogs, chili dogs, NY dogs, Chicago dogs, fries, chicken wings, various fried fish, fried shrimp, subs, etc.This is a good change-of-pace from the fast-food restaurants along West 86th street.The same family owns \"Gyro N Kabob\" at 3681 West 86th, corner of Michigan Road.   I like Gyro N Kabob better as they have a lunch buffet."], ["Jess B.", "Gyro Stop has the best hummus in Indianapolis, period.  They also make the best falafel--in fact, it's the only falafel I'll eat.  The service is always good, Luke (the owner) is always very friendly, the restaurant is clean, and the food is excellent.  There's a large variety of meal options, including a good number of vegetarian items.  Plus, it's locally owned, which makes it doubly-good in my book."], ["Larry S.", "The Gyro Stop was in the Entertainment Book so I thought I would give them a try.  I take one step into the store and the cashier asks me what I would like to order, so I scan the menu and order two side dishes, a side of gyro meat and an order of fried mushrooms.  The cashier says that he is not sure if they can accept my coupon but shows it to the cook.  \"Buy one menu item get one free\" is straight forward in my mind.  The cook explains to the cashier to just charge me for one item and the cook asks for here or to go and I said I would like to dine in.I pay for my order and the cashiers asks, \"That is to go, right?\"  Well, I take a seat and hear some Middle Eastern music in the background.  Once I got my food it tasted good.  The Gyro meat is served with Gyro sauce and the fried mushrooms were served with Ranch dressing.As I am leaving I noticed the trash barrel has a circular hole cut in the top, I guess this is so people don't throw the baskets in the garbage.  The restaurant is located a block or two east of Trader's Point but this strip mall is a little trashy.  Their neighbor is a massage parlor.  On the lighter side, there are a pair of interesting gameball machines that have a pinball game built into them.  This was my one and only stop at the Gyro Stop."]], "Hellas Cafe": [["Clare L.", "As far as Greek food on the Northside goes, I don't think you can get much better than Hella's. This unassuming little building just south of 86th Street has been serving up deliciousness for close to 30 years and is definitely worth a visit.Some have indicated the price point is high - are you blind? The amount of food you can get for $16 or $17 is out of this world. All entrees come with a Greek salad, rice or potatoes and green beans. I went with the chicken gyro platter, and my only complaint is that I was picturing the chicken meat stuffed in the pita with the tzatziki sauce, instead of having to put it together myself. Also, I need to apologize for my garlic breath more than 24 hours later and after multiple swishes of mouthwash - so maybe they could cut down on the amount of spices in the sauce? Other than those minor things, an overall fantastic experience. I'll definitely be back to Hella's."], ["JV A.", "Just moved back to the Indy area & had to hit Hellas!  It was as good as I remembered it.  I had the spanokopita with potatoes and veg.  It would be a 5 star, but the salad was kinda lame.  Always get the potatoes (not the rice option) because they are great!  The spanokopita was perfect - just the right balance of filling to phyllo.  If you have kids, I highly recommend the flaming cheese!  Service was great."], ["Katie U.", "I tried Hellas for the first time and it was pretty good! I ordered the gyros (pronounced \"yeeros\") platter and for about $11 it came a/ a small Greek salad, pita triangles, gyro meat, tzatziki sauce, seasoned green beans, and your choice of potato or rice. Sounds like a lot of food but it was very well portioned -- it was truly a platter. The food was good, but I've had gyros before and they tasted the same so there wasn't anything special. It's kind of a hole in the wall place -- it wasn't busy and there was only one waitress working. I would venture to guess there are other Greek restaurants in the area w/ better Greek food + a more modern ambiance -- it felt like I was on the \"Big Fat Greek wedding\" set. A bit hokey in my opinion!"], ["Camille L.", "Expected a little more. Food took forever to get to our table and it wasn't all that spectacular. Decor was a bit over done as well. I'm not sure I'd recommend this place to friends."], ["Angelus K.", "This place is an old standard when it comes to Indianapolis Greek food.   It has been around a long time and has provided consistently good food for a long time.   The food isn't terribly creative, but they have all the Greek classics.  My only gripe would be that the food is a bit pricey, but if you're in Indy and you have a craving for Greek food--this place should be your go-to."], ["Holly G.", "Hellas has come a LONG way over the years.  I ate here many,many years ago and swore I'd never go back.  But my husband wanted to try it, so I agreed to return after a long hiatus - and I'm glad I did!We generally go at lunch, since it's right around the corner from where I work - which is good, because their lunch prices are a bit more reasonable than their dinner prices.  I always get the pork souvlaki, and have never been disappointed.  Their tzatziki is high on the garlic scale, which I love!  I'm not a big fan of the greek style green beans, so I try to substitute for something else when I can.  The greek style potatoes are consistently good."], ["Nicki C.", "My 2 year old son ordered chicken fingers tonight and I thought, \"really?  With all of this good Greek food and he orders chicken fingers?!?\"  Luckily, Hellas doesn't do what a lot of restaurants do for the kids menu - they actually make their own chicken fingers!!!  They were just another delicious (and delightfully unexpected) favorite for our family."], ["Ron R.", "Came here with my girlfriend because we were in the mood for Greek food.  Our local place was closed so we decided to drive a bit further out to Hellas.I gotta say, I was impressed with the quality.  We ordered the Saganaki and it was fantastic, although on the smaller side.  I ordered the Gyro Sandwich which wasn't really a sandwich but more of a heap of gyro meat on top of pita with some veggies and Tzatziki sauce.  My girlfriend got the Calamari which was in a red sauce and she said it was very good.My only complaint and negative star for this place would be the price.  I understand that Hella's is trying to bring itself into a different elevated level from other Greek places, but it doesn't quite achieve that.  The place at prime time dinner time had 3 tables out of the 20 in there filled.  My guess is that if they chopped the prices down by 30-40% (yes, it is that overpriced), the tables will fill up.You have a good product, just bring the price down a bit to create a value."], ["Maureen H.", "Love me some great Greek food and Hellas really delivers. The restaurant is lovely inside with a cozy, intimate atmosphere. The menu is loaded with Greek favorites and some lesser known, very authentic, old-world choices. They have a great wine menu featuring many Greek wines. I tried the Assyrtiko which was a delicious, bone-dry white; loved it! For dinner I chose the lamb kabob. The meat was so fresh and tender and came with rice, Greek green beans, and Hellas own version of Greek potatoes. Also a small Greek salad accompanied the dinner. Simply divine. My friends all ordered the pastichio and were happy with their choices. We were, sadly, too full to sample the dessert menu but the choices looked amazing and all house-made. Hellas has been on the northside of Indy for years and has always been a solid restaurant. Since the new owner took over in the past couple of years, however, it has become a top-notch Greek eatery."], ["Kaitlyn H.", "It is so nice to find some variety in food around this area. It is one of our favorite places to go with a group from work. We always leave feeling delightfully full from the delicious Gyro plate! From the feta to the hummus, all makes me feel like I am back in Santorini. The staff is always friendly and welcoming as well!"], ["MA S.", "Like many of our favorite restaurants, Hella's is decreasing its portion sizes and offering less to its patrons (esp. during Northside Nights specials).During the last Northside Nights, we noticed that they only offered a meatless pastitsio but were still charging the same price.On our last carry-out order, we ordered a Sampler Platter.  The amount of gyros meat we were given was pitiful and the slices of pastitsio and moussaka were only the size of a traditional baklava triangle.They have never lived up to our first dining experience there.  Disappointing."], ["Tinsley D.", "Decent Greek food. I prefer Santorini, but tried Hella's a few times because it's closer. Service can be a little slow. Also a bit pricey. They have a cute kids night with entertainment that is nice for smaller kids."], ["Wayne C.", "Disappointed in my gyro sandwich!A pile, 20or so, of \"chips\" of lamb, I think,chips the size of a fingernail and same thickness,not shaved, dumped on a pita, not rolled or foldedNeeded a magnifiying glass to find the onion.thin slice of tomato size of a quarter."], ["Tammi A.", "I am so excited about this place. If you're vegetarian order the combo plate with the intent of leftovers. It was all amazing."], ["Marty C.", "I was disappointed with my chicken gyros.  The tzatziki was very heavy and overpowered by garlic; I couldn't even taste cucumber.  The chicken had little flavor and appeared to be cut from a deli roll.  I also thought it was a bit pricey.  I don't intend to return."], ["Rick G.", "I'm not an expert on Greek food, so I can't say how authentic the food is.  I WILL say that it seems to be on par with my other 2 favorite Greek restaurants in Indy, the Greek Islands and the one in Fountain Square that I can't recall the name of right now.I'll also so, while I've not gotten a meal there that I think is over the top fantastic, everything I've got there is above average.  The prices are reasonable for the serving sizes, and the wait staff is knowledgeable about their food, which is a great help to those of us who are new to this type of cuisine.Good food, reasonable prices, and above average service keep us coming back."], ["Ben R.", "First of all, Ima start taking pics at these place I review, as I think it helps not only add some credibility to a review, but it's nice for people who use Yelp like I do to check out a joint.I'm giving Hellas a low rating strictly based on service. ( or lack there of ). If you read my reviews, then you know I always throw in the fact that I was in the \"industry\" for almost 20 long years, and my girlfriend was also in it for well over 10 years. We are not overly harsh and unrealistic about service, but when we get bad service we call it for what it is.The reviews about the food people have gave are pretty much spot on. Food is indeed good, and ample. Good beer and wine selection also. I have been going to Hellas here and there for many years. And the food has never disappointed me. Saganaki is wonderful, mezza plate is great. All the meats are fantastic. There really is something for everyone here. Great place to take kids, as well as a great place to have a nice night alone for adults. You won't go home hungry.Now, on to what ruined our night, and could ruin any night for anyone. I've seen as of late \"yelpers\" calling out their server by name, and even describing the server. I have not, nor would I ever do that. If you're a conscious GM, or even a owner, you know exactly who your bad and good servers are. You don't need me to give you their name. At any rate, we got there and the place was hoppin. People were still eating and drinking, the piano man (who's there on Fridays only) was still playin', looked like a good time. We were sat promptly, and our server came by and said they'd be right back to take our order. OK, we're drinkers, we like to have some cocktails and thumb over a menu. Once they returned they ask if we were ready to order our meals. I asked if we could throw in a drink order first, and their response was \"yeah, sure\". This wasn't a yeah sure happy kind of way. I didn't hear a sigh, but we expected to hear one kind of yeah sure. Drinks came back, we ordered the obligatory Saganaki, it was great. Server did not return to the table for about 20 minutes. Unacceptable. There's a fine line of overly checking up on a table, and just flat out ejecting from one as well. Naturally we were dry, and thirsting for more libations. They finally returned just after the 20 minute mark and we gave our dinner order. They started to bolt from the table and I said \"I'm sorry can we get some more drinks\"? AGAIN, the response was \"yeah\". This was with their BACK to us with the response. What if I wanted something different? or my GF wanted something different? They caught themselves and turned back around to say \"I mean you want the same things..orrrrrrrr\".....I just said, \"yeah, sure\". Drinks came back, then they brought my plate....just mine. Not my GF's. That came after I sat there starring at my dish. Then they finally brought her dish. Listen, I've been to Europe many many times. Still have family that live there. I GET that's how service is over there. But were in INDIANA. There were no more offerings of post dinner drinks from the server, no offerings of desert ( we don't eat it generally anyways, but it's nice ), nothing. We weren't the last table in there, so don't even try that. And still, we have been the last table in plenty of places before, but we're always our servers favorite table because we generally tip almost 50%. Not that night. In closing, I'm not bashing Hellas directly. It's a great place. I'm just saying to you use caution. In other words, if you get bad service, I told you so. If you get great service, let me know who they were. We'll ask to sit in their section next time."], ["Sam L.", "Stopped in for a to-go order of just the gyro sandwich. Was almost $9, which I felt was a bit overpriced for only a sandwich, no side. The sandwich had no lettuce or onion, as is the norm with other gyro sandwiches I've had elsewhere. Only toppings were the tzatziki sauce and diced tomatoes. The sauce and tomatoes were decent, but the meat was dry after an only 10-minute commute home. I might try Hellas again, but I may try a different dish. Seemed they missed the boat a bit on the gyro sandwich."], ["Charlotte S.", "In town on business and ordered a gyros. The meat was very dry and the bread was not great. I wouldn't recommend."], ["Cameron T.", "Wonderful little place to eat. It looks much nicer on the inside. I tried the stuffed grape leaves and it was delicious. I have also tried their desserts and they are amazing!"], ["William V.", "Best Greek on the North-side of Indianapolis. Our kids love the belly dancer!  The food is delicious and ample portions."], ["Robert W.", "Another good meal in a cozy atmosphere.  After eating at several of the other Greek restaurants in Indy, this has now become my favorite.  They have a large, varied. Menu, even with a lot of vegetarian meals.  Tonight I tried their sticky toffee pudding for dessert.  It was great andI had not realized it was a Greek dessert (I thought it was English)."], ["Jonathan H.", "Everything is amazing!  The hummus is out of this world."], ["Stacy J.", "Greeted right at the door, sat immediately wherever we would like to sit in the restaurant. Fast and VERY friendly service!!Server was the hostess and the table busser... and she did this for the WHOLE restaurant late on a Monday night... I have to say, she worked VERY hard and did it SOOOO well!!Had appetizer of Hommus = BEST Hommus I have had at a restaurant!! Husband had:Gyro Platter - Thinly sliced gyro meat topped with red onions & tomato served with pita and tzatziki - was a GREAT Gyro!! put didn't have a full pita to put it on, just slices... so a little hard to make it like a typical gyro... but taste/flavor was very good! I had: Spanikopita - Spinach feta cheese pie wrapped in phyllo dough - was pretty good, would have liked to have a lot more spinach in it!each served with the greek salad, potatoes and the green beans and were both VERY good!Dessert was the baklava and it was also fantastic!! Very fresh and not too soggy, just right!!Were popped in a little later than expected, so we also didn't get out until a bit after closing, and the staff was very sweet and told us not to rush, take our time... and though I felt bad for being there so late, the staff was great in making sure we knew it was no problem!Didn't expect to find such a wonderful experience, was pleasantly surprised and will be back for the event nights we were informed of!!"], ["Ron N.", "Love the gyros!!  And the best French fries ever. You can't beat home cut fries.  Reminds me of my favorite restaurant back home."], ["Phil B.", "For so reason my first review has disappeared. So here it is again. First time in Hellas was Monday 10/ 12. 1 other table of 2 kids 2 adults was sat. We ordered Saganaki. The portion was much smaller then Athens on 86. Tasted much the same. Our main dishes were Souvlaki with potatoes, rice and green beans. And Gyro platter with potatoes and green beans. Our food took forever. A table sat after we ordered got there main dishes before us even tho one of their dishes was exactly what we ordered. The owner I have surmised from a photo came out of the kitchen and sat with them and chatted. The food was Ok, the atmosphere was Ok, the price was Ok. Nothing to make us come back. Our waitress was very nice and she was uset our order was taking much longer than it should have. We did tip her well, it was not her fault. Thus 4 stars for her service 3 would be for food and other."], ["Marcia R.", "Preface with - It's about the food for me. I ordered the moussaka - it was not what I was expecting and did not have as much flavor as I am used to. My bf ordered the combo meal which was tasty (lamb, phyllo cheese & spinach triangles were good, yogurt sauce was good, everything else was meh.  Kids got spaghetti and cheese pizza's.  The spaghetti was lite on the sauce.  The Pizza's looked great and were kid approved (empty plates).  I don't mind paying good money for great food.  This place was more expensive than my fav. place dt (Med. Greek Island).  While my family of 6 thoroughly enjoyed kids night on Tuesday the flavors I am used to regarding the food were disappointing in comparison."], ["Stephanie U.", "We came here for the Northside Nights deal, and we got a gyro platter, hummus, and baklava. All of the food was delicious! The food and the atmosphere had a very authentic feel to it. Our server was also very attentive and the service was fast. So far, this is definitely my favorite gyro place in Indianapolis."], ["Josh R.", "I'm gonna be harsh, but I truly hope this helps improve the restaurant.  I was very unimpressed by the food and even more so because of the price.  We brought our family of 6 in on the free kids meal Tuesday.  The prices were still too high for what we got in my opinion.  My combo was about 6-7 out 10.  Nothing impressed me in the slightest. I've had equal or better gyros down the road in broad ripple for much less.  I do not intend to come back despite the close proximity to my home and the Jordan YMCA across the street that my family frequents regularly.  The waitress was wonderful, attentive and pleasant.  But, it all comes down the food and it just wasn't up to standard and the price is too much.  Wait times for the meal was quite long."], ["Bethany S.", "I want to like this place since I love Greek food, and this place has a bunch of vegetarian options, but I have been there twice now and not enjoyed the food either time. And the belly dancing was interesting but kind of awkward.The first time, I ordered vegetarian pastistio. I was excited about it because pastitsio is my favorite Greek dish and it's hard to find a veggie option. However, it was bland and did not have the delicious sauce most do. I don't think I even ate the whole thing, which means it's pretty bad. I asked the waitress where the sauce was and she said that this is traditional, but the first time I had pastitsio was in Greece and it was delicious with much more flavor.The second visit, I ordered veggie dolmathes, and they were a little better but really nothing exciting. I only ate them all because I was quite hungry. I've had better several places.In short, I don't understand why my friends seem to like this place so much... maybe the meat options are tastier."], ["Larry G.", "My wife and I went to Hellas for the first time last Fri night. We were so very impressed in so many ways. Where to start? The food was exceptional. My wife said the Mousaka was the best she's ever tasted. I had the Greek spaghetti with lamb. It's taste was complex and especially flavorful. Same was the egg plant appetizer. Oh, because it was our first visit, we were given a complimentary dessert. Yum! Kari was our server... exceptional service. The decor was fresh, warm and pleasing. Fresh flowers on all the tables. We enjoyed the photo slideshow of Greece and the music that played over the house sound system was a pleasure to listen to. That here were no TV sets blaring at us was perfect! We arrived later in the evening, too late to see the Middle Eastern dancer so we are planning another visit soon and plan to get in a little earlier. Thanks Hellas for a wonderful, memorable evening. Larry and Carol"], ["Kathy S.", "I was in the mood for Greek food and a friend of mine recommended Hellas Cafe. The atmosphere was lovely and the music was great! The lamb kabobs were done perfectly and I did enjoy the green beans. The Greek wine I tried was very good as well.Here's why I gave it three stars. I ordered the feta cheese pie as an appetizer and the top of it was burned so burned phyllo dough was not appetizing, needless to say. The other issue I had was the rice and the potato. The rice was just blah and the potato was weirdly shaped and very bland with no seasonings. I kept salting it to get some kind of flavor but it wasnt good. It was an experience but compared to the Greek Restaurant I tried in Hell's Kitchen in NYC, this doesn't even compare."], ["Erik M.", "Loved this place when I lived in Nora. Made a trip up from SoBro, and wish I hadn't wasted the gas. Roasted red pepper hummus tasted like old, canned, minced garlic. Literally got 8 pieces of pita with an $8 order of hummus. Gyro was old dried out meat with one slice of pinkish, nearly white, tomato. So disappointed with everything."], ["Tiffany B.", "Hella's is the kind of place you want to go with your closest friends and family. The atmosphere is friendly, fun and comfortable--just like home--if home were a place you were ably waited on 'hand and foot' and served mouthwatering Greek food. Hella's has heart--how many restaurants are so well connected to their community that they contribute to local schools and churches fundraising efforts?  That same spirit of building a future on traditions of the past is also evident in their tasty authentic Greek recipes. You will quickly develop a list of 'favorites' from Hella's menu. The taramasalata is a dreamy, creamy spread consisting of caviar, lemon juice and olive oil that you will greedily mop up with some of the best pita bread you can get, this side of the Mediterranean. The same goes for the traditional tasty tzatziki--another downright delectable dip. If you know Greek soup, your highest standards will be met with the house Egglemon soup. If you insist on the most popular dish, you will not go hungry--or wrong--with the Gyros platter, your choice of meat or chicken. If you must have something 'special' the frequently featured lamb shanks or cabbage rolls are not to be missed."], ["Theresa K.", "I had never been to Hellas Cafe before last night. I went last night for dinner, and when we walked in, the whole place was empty. The server sat us at probably the most crooked table ever. A couple times, my boyfriend put his elbows on the table, and my water spilled. The interrior was pertty interesting. I liked it. Sometimes you walk into a Greek restaurant, and you feel a mix of ethnicity and just old crap that's probably pretty worthless- Somewhat dilapidated, maybe some paint repair. Really, the outside of the building looks like this, and although our table was crooked as all get out, the decor looked nice and charming. There was sort of this thick, wood trim that almost reminded you of being in a reception room of some sort of church. But the living room was also pretty narrow. I don't know, it was kinda strange. A bottle of Skol vodka sat on the counter in the kitchen. I figured it was probably for cooking then thought very little of it. The food was very mediocre. The green beans were completely flavorles, and the moussaka didn't have much flavor, either. The potatoes tasted pretty good, though. My boyfriend had the veggie platter and it was $20! Mine was $15. They claim to use all local produce, (And I belive meat, too?) sothat's pretty cool.  I thought the food was not that great, and it was pretty costly to be not that great. I probably won't be going back."], ["Nadine M.", "This place is place is very good!  A little nicer than your normal greek restaurant.  Staff are friendly and the food is so good.  I recommend this place for special dinners."], ["Emily U.", "I spend a lot of time at Greek restaurants trying not to make eye contact with the belly dancer. Hellas was no exception. Their unique twist on the belly dancer experience that has become the norm for Mediterranean dining in Indy is that the music is more muzak-y and they employ a somewhat older dancer. Thankfully, she was fairly respectful of my eye-avoidance, though, so I was able to concentrate on the other aspects of my visit.The best part of Hellas was the excellent waitress we had. However, the veggie combo plate scored below Santorini and Greek Isles, with most of the dishes rating on the scale of boring. The spanikopita and lemon potatoes were pretty good, but the green beans, rice, tyropita and other offerings were bland-ish. The salad was excessively oiled and feta'd. I did like the hummos appetizer, though. It had a good garlic punch, but was predictably overpriced (seriously, when did it become okay to charge $6 for like 1/3 cup of smashed chickpeas and a teaspoon of olive oil???). The décor was kind of cozy, but also kind of half-assed, with your Greek urn-like liquor bottles and other Cerulean blue artifacts.Can you tell I'm kind of meh on the whole thing?"], ["Katie B.", "I typically review restaurant menus online before I check out a new place.  I did so before visiting Hellas and was uber-excited to see all the veggie options - veggie dolmathes, pastichio, and  mousaka -- I'm there!  I went with a group of friends.  About half of the wines on the wine list weren't available.  The saganaki, combination dips, and bruschetta appetizers were good but nothing to write home about.  But then came my meal, veggie pastichio.  I was very disappointed.  It was dry and bland.  Although nothing was horrible, there was nothing to really bring me back either."], ["DeAnna P.", "I think their food is really good.  The green beans are not as good as other places, but the pitas, gyros, and taramasalata make up for it.  If you've never had taramasalata, it doesn't sound too tasty (caviar dip with lemon and olive oil?!?!?), but it is SUPER tasty.  Think hummus, but saltier with the slightest seafood flavor.  You...Must...Try...It!!"], ["Cliff H.", "Simple, authentic Greek food. Kids eat free on Tuesdays! What more can I say... Opa!"]], "Mr Gyro's": [["Marlene M.", "Yelp the closest Gyro spot and got Mr Gyro. Best so far. Only one been too just here for the day.  Recommend this place to everyone. The have a lot to offer. And dec my price for lots of food!!"], ["Doug S.", "Has a bit of everything and the price is great.  If you're a Westsider you have to go!"], ["Tom O.", "Great value for money. The gyro meal comes with a generous serving of fries. Great variety of food. Fish. Chicken, pizza puffs. Something for most.Friendly owners and excellent service."], ["Nancy P.", "Gyro Plate dinner special was less than $8.00 for a Gyro, Salad & a Drink.....can't beat it. The people taking my order were very friendly and conversational. The place was extremely clean and well kept with the only exception of being out of soap in the bathroom but a busy holiday weekend could explain that. I left full and content so I couldn't ask for anything more out of Mr  Gyro!"], ["Laura B.", "The menu is overwhelming, and I felt a little pressured to order since the employees behind the counter were waiting on me to order. I got the traditional gyro dinner - lamb gyro with a small Greek salad. The gyro was a very large portion. I had to eat a lot of lamb out of the gyro before I could pick up the pita bread to eat it. I could only eat half of the gyro because I got full. The Greek salad was okay - iceberg lettuce, three tomato wedges, two Kalamata olives, feta cheese and Greek dressing. Not bad, but not great either.I would go back to try other menu items and to have the gyro again. Prices are relatively inexpensive, and there is a drive thru."], ["Brandon W.", "This place wasn't bad, but it wasn't amazing, either. I had the chicken gyro, and while it wasn't bad, it did have a bit of a tang to it. However, the Greek salad was probably the best salad I've ever had, anywhere! You should definitely check it out, though. I can't eat beef (which is why I had the chicken), but I've heard their regular gyro is pretty great."], ["Beth B.", "Really, could this place be any better?There's a drive through, all the fried food your heart desires and delicious gyros!  WE only had the gyros and the fried mushrooms but all of it was great and our service was fast and friendly to boot!Love this place and the people who own/run it!  Westside gem!"], ["Rob F.", "Not the best gyro I've ever had, but solid. Place is clean and serves above average gyros at a slightly higher then avarage price point. It's not a place I have to stop at, but rather I place I go to every once in a while. Personally, I prefer King Gyro, for gyros."], ["Sonya A.", "Quick cheap bite? This is your place. When lamb is on your mind but don't want to go to a nice, sit down restaurant Mr Gyros has you covered. Their menu is large but its all about the gyro and the fries.Food: 4/5Location: 3/5 Service: 3/5"], ["Amber D.", "Delicious fast food. I hadn't been here in a few years since I no longer live in the area, but I had a craving and am glad I made the trip back. Food is always fresh and tasty with ample portions. Great burgers, delicious fries (though you'll need to salt them). A pretty varied menu - I'd recommend going in the first time rather than using the drive-thru."], ["Tonya L.", "Big portions. Great gyro. Seasoned well. Could use one more pita bc they give so much lamb. Had a salad, kinda skimpy but still good. Was lettuce and a few tomatoes and olives.  My Lil sis had the fries. Twstes great. Restaurant is simple, almost threadbare. I presume many do takeout.  Lots of options on the menu. Great prices. My dinner was below $8.00 and had enough for leftovers. Will definitely return."], ["Daniel N.", "Great food, low prices, and the owners are fantastic people. I used to eat there once a week minimum, but now I don't work on that side of town. I still drop by after church every once in a while. The only down side is the location. Move to Avon please!"], ["Christine B.", "Finally, I've found a good gyro place owned and operated by real greeks! You order by number which makes it easy. The meat is tender and juicy and the pita bread is light, buttery and tastes like it was homemade from scratch that very day. Tomato is very fresh and tzatki sauce is definitly fresh and made the same day as well. Other gyro places in town seem like thier meat is dried out and pita isn't fresh. I get my usual here, gyro and an order of cheese fries and it's only abbout $7.50. Great prices and good services. It's not super fast, but that's because it's not fast food, it's greek food made quickly. If we ever move I think I'll miss this place the most. Don't let it's exterior fool you, it's what's inside that counts!"], ["David G.", "Mr. Gyro's should be renamed to Mr. Good Eats!I have known about Mr. Gyro's since it opened up.  I forget the exact date, but I can tell you it has been open for at least 10 years in this same location.  I decided to go and try Mr. Gyro's recently, I didn't know anyone who ate there so I never got any good or bad references about the place, but I do know this about locally-owned restaurants in general-- if they have been open for several years, it's not because the food is bad, right??Well Mr. Gyro's certainly follows this statement-- Overall the food in here is very good, freshly made, and an excellent value!!  How many restaurants have all those qualities these days?  Very few indeed.I'm not real big into gyros, which was the big reason for staying away for so long before trying it out.  i was plesantly surprised to find that the menu is quite extensive for being such a small restaurant-- anything from cheeseburgers to breakfast items can be ordered here.  I've had the tenderloin, double cheeseburger, grilled cheese, fries, and hot dogs here-- no culinary fireworks at all, just very good quality food.  This is a perfect place for lunch if you are in the area.And the value-- I once ordered a 1/2 pound double cheeseburger, generous portion of fries, and drink-- all for around $7!  Try that at any sit down restaurant, hell, try that at any fast food restaurant-- it can't be done!   And the quality of the food was definitely superior to fast food, with only the elite burger joints serving up a better burger than Gyro's.  I still haven't tried the gyros there, but I did observe about 10 people and what they were eating and 3 of them had gyro platters, so I take it to mean that the gyros are also pretty good.   The decor is well, let's say, old fast food restaurant style-- not very inviting for sure.  Don't let that keep you away, the food makes up for it.If you are in the area and need quick cheap eats, stop by and grab anything on the menu. This is a great place for people on this side of town."], ["Justin C.", "I love this place and was eating here once a week for a while until I'd tried almost everything on their menu. The staff is friendly enough. My wife and I returned here after being gone for almost a year and they still recognized us. This is a family owned place and you'll probably be greeted by mr Gyro, himself or his wife. The only thing that I really shy away from here is the bathrooms, which I can't remember ever being clean. It's worth stopping in for sure if you don't have to make a pit-stop inside. The gyro dinner or the hummus plate are my favorites"], ["Harold R.", "Lots to choose from. We ate inside the restaurant. Had the 2 Chicago Dogs, fries, and drink special. It was good. The hot dogs were Vienna. French fries were hot, good, and fresher than you would find at other places with similar prices."], ["Robbie R.", "The menu has almost too many things to choose from.  After working in this part of town for about 5 years I have been here several times and it is always consistently average.  They Gyro is exactly what you expect.  Once in a while they have a $4.99 special for 2 chicago dogs, fries and a drink thats not bad.  All in all decent food for a decent price."], ["Julia C.", "This is the second time I've come here in a week. I LOVE their gyros. I haven't had the lamb, yet.. I've just recently started eating chicken again but I still want to keep a mainly vegetarian diet. It's family owned and they have a fairly large menu of gyros, burgers, and lots of fried goodies... and it's not expensive at all. I think my gyro a la carte was only like $3 something. And the gyros are HUGE with larget chunks of grilled chicken and lots of yummy onions. My boyfriend ordered a 1/2 pound double cheeseburger (I'm still trying to figure out where it goes, he's so skinny!) that I took a bite of (gasp) and it was delicious. Of course I haven't had a burger in over a year... :PNow location wise, well.. this is why I'm only giving it 4 stars. It's not the in the best location. It's located in an old strip mall where most of the businesses are closing or moving (the Best Buy that was there moved over to Lafayette & 65 south.), but I really hope that they don't close down this little gyro shop. Check it out!"], ["Pebbles C.", "Had a gyro and it was one of the best I've ever had. Nice prices too"], ["Angie A.", "When I'm really hungry and can't quite put a finger on what to get I head to Mr. Gyro, cause I know he's got the solution to my problem. Mr. Gyro is ran by a Brother/Sister act that after being a regular for years I know they could give Donnie & Marie a run for their $. They are always zinging each other to the delight of who ever is within ear shot.  This place is one of many Jack of all Trades menu Gyro joins that have sprung up in Indy in the last decade or more. They have everything on their menu but the kitchen sink. I can't speak about much more than the gyro's because they are so good, and so generous in portion I won't bother with trying anything else on the menu.I get a huge Gyro with feta & extra sauce, huge order fries & a pop for around $7. That's excellent value in my book. Plus the fact that the flavors are exactly what their supposed to be it's a no brainier.*One last tip, I recommend the drive-tru or take out. The Dinning Room has all the charm of a county hospital waiting room.** If it's after dark don't risk getting out of your car the neighborhood is that bad!"], ["Michael T.", "Wide menu is always a plus for me as I like variety.  I've had better gyros, but it hit the spot in the time of desperate craving."], ["Ellen B.", "If you want good food at a great price try Mr Gyro. The gyro platter includes a side salad and drink for less then $8.00. The place is NOT fancy, but the owner and his family always make you feel welcome. My friends and family are regulars at Mr Gyro for several years - we are never disappointed with the food or service."]], "Mediterranean Grill": [["Danielle B.", "After hearing great reviews on this place we decided to check it out!  Very nice atmosphere, family owned. Sweet staff. Food was great, I thought it was a little pricey though. I would def return!"], ["Jennifer M.", "LOVE THIS PLACE!!! My husband and I started going right after it opened. We have never been let down. The hummus is out of this world and the warm pita only makes it that much better. Our service has been top notch - these are the kind of people that remember you from the last visit, know your kids name, and chat with you about family when you come. The tiropita plate is to die for and don't pass up the saganaki for starters. Price is right on track for good greek food and the portions are HUGE. This is a Friday night favorite for our family!!"], ["Lothar M.", "The Mediterranean Grill is a small restaurant tucked away in a typical Midwest strip mall. It combines Greek and Lebanese meals. We had the Maza Plate ($10.95), substituting the Baba Ganooj with Tzatziki (which, in the end, we got both), and the Fatoosh ($6.95). The Fatoosh was cut in very small cubes, including the pita bread, and had too much dressing. Still, it tasted good and fresh. We also liked the humus, but found the tzatziki a bit tasteless. The warm pita bread and Baba Ganooj were both good. The Tabouli was too parsley-dominated for my taste. All in all very decent Mediterranean food, but in a somewhat uncosy setting at at fairly steep prices."], ["Todd P.", "Over all good food, best hummus I've had I a long time. Prices are a little  steep, but would go back because the food was good!  By the way the service was good!"], ["Brad C.", "A good local family run restaurant (which Avon needs more of).I've had several very good meals here, and particularly enjoy the avgolemono."]], "Canal Bistro Mediterranean Grille": [["Katie U.", "When I'm craving Greek food, I go to Canal Bistro. I had my first ever gyro here and keep coming back for my fix. The sandwiches all come with fries, and you MUST add the garlic and feta. They're magically delicious!A few more reasons to love CB:-private parking lot with space for 8-10 cars along the side of the building-outdoor patio space overlooking the Rainbow Bridge and canal - great to sit outside on a beautiful day! -front covered patio (I once sat outside on a rainy summer day and loved it!)-plenty of seating inside (good for groups - call ahead!)-complimentary oil w/ herbs/spices mixed in and warm pita bread -very kind and welcoming staff (especially the owner!)"], ["Sarah D.", "I like Canal Bistro, its one of my go-to's in Broad Ripple!Pros:-The lentil soup. Its homemade and they have it almost every day!-The canal-side seating. -Complimentary pitas & spiced oil for dipping. So good! (Toddler tip: If you don't eat it all, wrap it up and take it down the canal to feed the ducks! Dinner & a show!  You're welcome.)-They're on OpenTable!Cons:-The floor on the way to the bathrooms is always slick (I assume from the open kitchen concept which also sits near the entryway).-Limited wine options at reasonable prices"], ["Matt D.", "I've been here twice now. Always great service, very friendly and attentive staff.I'd love to give five stars, but some of the food has been hit or miss for me. First time I went, I got a falafel side that I LOVED. This time, I got the falafel sandwich entree and didn't care for it at all. Falafel was overloaded with one of the spices and over-fried as well. I only ate about a quarter of the serving.However, there's so much else to love about this place. The hummus is unbeatable (we got it with meat), and the tabouli was good as well (though heavy on the lemon).The salads are very large. I got the half tabouli and it was 2x what I needed.They don't do half sandwiches.Didn't try any of the drinks, water was fresh and delicious on a hot day.Sit by the canal inside or on the patio and watch passersby."], ["Melanie C.", "AMAZING Mediterranean food!!! So delicious, one of the best Mediterranean spots I've been to and has become one of my favorites. Absolutely love the interior decoration too! I got the gyro which doesn't come in the traditional pits style but in a wrap; it is soooo good! I went for lunch because I think the dinner prices are a bit expensive."], ["Alex P.", "Unfortunately seem short staffed. Almost 30 mins before they took our order. So not too good."], ["Kara P.", "Oh man, Canal Bistro is my new favorite discovery. I'm a little annoyed that I hadn't known about this place before.The food is WONDERFUL. I started with the goat cheese bruschetta. It's a thin spreading of goat cheese on toasted bread, served with a cup of chopped tomato goodness. It was divine. I ate the whole thing by myself. Then I had the chicken shawarma for my entree. Because I stuffed myself with bruschetta, I didn't have a lot of room left, so I only managed to eat half of it. But damn, it was delicious. And the second half heated up great a couple of days later.I went with a few friends on a Sunday, and they were offering $5 mimosas. I had two of the pineapple. I highly recommend them. I will be dragging everyone I know to this place. It was utterly fantastic. And if you can score a table outside under the fans, it's perfect."], ["N H.", "Canal Bistro offers tasty food (both moderate and expensive), great decor, and a brilliant location on the canal in Broad Ripple.The restaurant is moderately busy when I walk by, so after scampering around in 90 degree heat, it was both nearby, had water, and Mediterranean food is always tasty!First, we walked inside in bummy workout clothes and asked to see a menu. Whoa - the entrees are at $18. However, sandwiches are $9-$10, and that's reasonable enough so we went for it. Had to laugh when the host seated us far away from other folks - it's not a dressy establishment, but we were really underdressed compared to other folks' classy casual wear. The decor is very nice with living room type chairs and a ceiling painted as the sky. It was nice to sit by the window and view the canal.The water is fancy - comes in a name brand glass water bottle that they set at your table. Ordered the hummus. It's got texture and is light on the lemon and garlic. It's good! But I prefer the creamy Lebanese version we got back in the Dearborn area, with lots of lemon and garlic. However I loved the fact that the pita bread is served warmed!! We also got oil and spiced for the pita bread as well. For $7, it's way overpriced (hummus costs little to make when done so in large quantities). The amount, however, was more than enough for my roommate and I. I just miss living in a densely Arabic populated area where you get a quart of hummus for $5. Alas! Regardless, within Indy restaurants this prices was about reasonable. My friend got the Kibe as a meal, even though it is an appetizer. Sirloin with ground beef, onions, barley, etc - it's very good. The tzaitiki was loved by my friend, but very different from the heavily cucumber taste that I'm used to. I got the Kafta Kabob (Lamb) and it was served in a pita. Quite good! Sadly I was already full from the appetizer so I only ate a bit. The meat was very good and I'd recommend the sandwich.The server got the job done, but not especially friendly. That's fine, however, because as long as I have what I need, I don't care if they're bubbly.Why only four stars and not five? There is no need to have Mediterranean entrees at $18. I care a lot about price. Maybe I'll change my mind after the next trip..."], ["Gyamfua G.", "Tried this place out because of a Groupon...and I must say I was pleasantly surprised. The decor is a mix of Algerian nights meet southern France broke man style..it was grand and elegant but a little gaudy...but still romantical!! So the food..we started with calamari... It was OK..not exciting just OK. The sauce didn't add a lot to it. The hubby ordered the gyro platter and I ordered the shawrma platter. Both were huge. The chicken on the shawarma platter was tender and well seasoned the beef was a little chewy. The gyro was very good...well seasoned. The rice was good as well. Next time I will venture outside the palate box...this place is definitely worth another visit!!*they do not keep salt and pepper on the table...you have to ask for it!!"], ["Hayat C.", "The banana bread martini was absolutely scrumptious I've never had anything that contained alcohol taste so good .The  pomegranate vanilla Cosmo  tasted very interesting it tasted like raspberry Coca Cola watered down with a shot of rum in it in a little bit of vanilla. l ordered baklava and it was just ok I have had better many other places. I really enjoyed our waitress she was very nice and sweet and that is rare for me to say usually I don't like the waiters anywhere I go but she did forget to bring napkins.   Overall experience it was good might come back before I leave .  I will order the lamb shank if I do. ;-)"], ["Melissa K.", "I really enjoy this place. I've had pleasant experiences all 4 times I've come here.To be honest, I think I've ordered the same things each time I've come (gyros or shawarma sandwiches or platters with feta fries). As an FYI, the sandwiches are actually wraps. This does not detract from how delicious the food is. The gyros sandwich I had the most recent time I went was amazing. They don't skimp on the meat. The meat has a nice flavor, and the tzatziki sauce is delicious as well.  The feta fries are good. The fries are not anything special, but the feta/fry combo is tasty. I am allergic to garlic so I can't get the garlic feta fries, but I think those would be better (more flavor and the feta would stick to the fries better).The location is great, as well as the service.  The patio right next to the canal is a very relaxing place to enjoy a dinner on a summer night!"], ["Taylor T.", "I have never been a huge fan of Greek food. It was my mother's birthday on Saturday so I put myself aside and took her out to her favorite restaurant. I really enjoyed the atmosphere of the restaurant and it was a nice seating arrangement outside. I purchased the chicken kabob with rice and salad. The chicken was delicious and had hints of garlic. The chicken was cooked to perfection and I now think I am a fan of Greek food! I of course had to get the French fries with feta cheese as well. They were delicious. My mom and I shared a bottle of their house Merlot and it was very tasty. Overall, our experience was great. It was a great place to sit outside and enjoy the view of the canal while eating a meal. The portion sizes were on the larger side. We quickly found out we could have easily shared a meal. We ended up going home with to-go bags. Our server was friendly, but I expected her to answer more questions since I didn't know much about Greek food. I would suggest this place in the summertime and I definitely suggest the chicken kabobs!"], ["Amber C.", "We went to Canal Bistro for a work meeting today.  I have been several times and wanted to choose a place that would cater to a vegan, a vegetarian, and 2 individuals with food allergies.  Canal Bistro it was!First off, the atmosphere of Canal Bistro is a 5/5.  Their setting on the canal is perfect if you are sitting out on the porch.  With a 4 top, we weren't able to sit as close to the canal with the view, but the shaded, covered porch with ceiling fans was a better choice for the hot day anyways.Due to the heat, we all had a very light lunch. The menu is broad so you are bound to find something that satisfies everyone.  For me, the must have is the Garlic Feta Cheese Fries.  They are very addictive, and no matter how many times I try to replicate them at home, I can never come close.My coworkers got the tilapia, hummus, more fries, and stuffed grape leaves.  I had zero complaints and nothing but praise.  Our waitress was very attentive to out table.  Prices seem to be a bit all over the board, but quality is spot on.  Overall, one of my favorite Mediterranean spots."], ["Linda H.", "Love coming here. Always try to sit outside and watch the ducks just swimming by on the canal. I got the Mazza plate it has Hummus with flat bread, Falafels in a cumber  cream sauce,2 spinach pies(spanakopita ) and my favorite Tobouli it chopped parsley with tomatoes ,onions, burgle wheat ,olive oil and lemon it the best. The staff was very friendly and helpful explaining the menu."], ["Katelin N.", "The best homemade hummus I've ever had! If you're looking for Mediterranean, there's no other place in Indy I'd rather go. Always a charming atmosphere and customer service is top notch. Great for date night or Sunday lunch."], ["Jason O.", "I really like this place.  Great atmosphere for a night out.  Nice seating options both indoor and out right on the canal.  The hummus and gyro platters are great. other options like the lamb can be on the mark or overcooked and tough just depends on the night.  They also have a great chocolate cake dessert."], ["Ashley Marie P.", "We were in town last night for a concert and stopped here for some Greek food beforehand. The only really disappointing item was the pita bread. It's just so doughy - not like any authentic pita bread I've had at other Greek restaurants. I'm not sure how to describe it other than Americanized pita bread!The rest is very, very good, authentic Greek food. I'd highly recommend the lamb kabobs, as they're seasoned and cooked to perfection. I had the lamb kafta and it was good, but nowhere near as good as the lamb kabobs. The accompaniments with the meal (feta, olives, pickles, lettuce) are fresh, and the rice is prepared wonderfully (not too overwhelmingly flavored). We also loved their standard side salad that comes with entrees - it's just fresh lettuce, tomatoes and cucumbers with a vinaigrette, however, the vegetables are juicy and taste like they were picked that day, and the vinaigrette is so light that you don't mind it's not served on the side.I'd recommend the mango juice if you're looking for a refreshing, not-too-sweet non-alcoholic beverage. We finished our meal with some ouzo, and it was wonderful, too.The atmosphere is very nice, but if you're going to sit outside, don't bother going for the side with the canal - there's not really much of a view other than some screaming ducks, a dirty canal and the occasional homeless person walking by. I'd instead shoot for the front part of the outdoor dining, where it's covered, so you can still enjoy the weather, but be a little shielded from the \"elements\"."], ["Clare L.", "Garlic feta fries. Enough said. As for their other food, I've had better falafel elsewhere in Indy but theirs is still good and worth having. The location is great, I love sitting outside when its warm and watching the many sights of Broad Ripple."], ["Jeanluc C.", "Great dinner with great friend. Love this place. The food is great and the terra see is awesome."], ["Vam K.", "I think they might make my favorite salad in the city! Now, I'm not saying it's a \"healthy\" salad, but there are vegetables so...that counts for something, right? The delicious, deep fried falafel patties are where I start getting in trouble. But they are so, so good and not your typical falafels either. These ones are made with leeks, and in place of the more common garbanzo beans, they use fava beans instead. Perfectly spiced, perfectly crispy fava bean patties atop crisp lettuce, fresh tomatoes and cucumbers, and pickled red onions, you really can't go wrong. I personally like to customize the salad a bit by swapping the dressing for their spicy tahini instead. Prices are reasonable and the ambiance is great-especially in the warmer months when you can sit out their patio which overlooks the canal-but service can be a bit slow at times, especially at lunchtime when they seem to have only one server working."], ["Jane S.", "Went for the first time and was not very impressed. We had heard good things about this place, but didn't experience it ourselves and do not plan on going back. Waited about 45mins standing outside to be seated. There were many tables open. We were not asked how many people we had (2). Overall the service was not good. Our food had the same tastes in about every dish. The food was mediocre. My boyfriend had the lamb shanks and they were severely burnt and he had to cut off most of what was there just to find a sliver of edible meat. I had the penne. It very over cooked and mushy. Overall wouldn't recommend it."], ["Kelly O.", "Cute little place next to the canal.I prefer this spot during the day, because at night it is a bit too crowded for me, but overall I think it is a cute place with good food and a fun atmosphere. The hummus is YUUUMMM and the pita is AMAZING. The have a decent wine selection and the prices are fair."], ["Jess C.", "The garlic feta fries are amazeballs! I like the ambiance and especially enjoy sitting outside right on the canal on a beautiful day. The have tried a couple different entrees and have enjoyed them all but as feta is my weakness I always go for the feta fries. Noms!"], ["Chinasa N.", "Canal bistro in Indianapolis is a must for tasty vegan option. I had grilled veggies that was tasty & mouth watering. The falafel was awesome too..the ambiance is Mediterranean styles."], ["Krystle B.", "One of my favorite places to eat in Broad Ripple. I love the atmosphere, and they even have live music sometimes. Classy but affordable. Their food is delicious too. You get pita bread and seasoned olive oil to dip it in before you order, that itself is delectable. The water here even tastes crisp and clean. They have a nice menu selection, as well as a drink menu.  Service was very good as well. Bravo Canal Bistro. Cant wait till its warmer out to sit on the patio."], ["Diane E.", "A year has passed since I moved to Indiana from Northern California...well 13 months and change.  I ate at the Canal Bistro my first night as a Hoosier and when a friend wanted to go out to dinner tonight, this was one of the choices that I presented her with.We walked from my house in Broad Ripple, a nice 20 minute stroll to get the appetite going.  We choose to sit out on the patio to enjoy the balmy summer night.  Our waiter, Derek, was awesome.  We asked for water to begin with and he brought it promptly.  Never pushed us.  I, who usually only drinks red wine, ordered the Pinot Grigio (what can I say, I'm craving white wine in this heat!) and my friend ordered the Malbec.  We enjoyed our wine with the pita bread and dipping sauce.For dinner, I ordered the spicy tilapia sandwich.  Derek asked me if I wanted regular fries or the garlic feta cheese fries.  I wasn't sure about the fries because my experience has been that garlic fries tend to be yummy on top and soggy on the bottom.  He assured me that wouldn't happen...and it didn't.  My friend ordered the Schwarma salad and loved it.  Dinner and wine for under $20.  I love it!!!It's funny that over a year passed and I ended up ordering the exact same entree that I had the first time!  I guess I'm a creature of habit.  Didn't realize this until I read my previous review :-)Nice healthy walk back to my house and I'm feeling very happy and satisfied."], ["Amber B.", "The lamb skewers here are my absolute favorite! They have some amazing appetizers such as their garlic feta fries! My kids can not get enough. They have awesome seating outside during warm weather which is just an added plus to their exceptional menu options. One of my all time favorites!"], ["Derek I.", "We love this place for any occasion. It's our go to when we can't quite agree on where I eat. My favorite is the lamb kabobs or the shrimp kabobs. We also love the garlic feta fries and the flaming cheese. You won't find a place with better food for a more fair price. The servers are top notch too. Thanks!"], ["Betsy G.", "So I decided to take my boyfriend to this restaurant when I read it about on Yelp. I thought  it was a good way to introduce Greek and Mediterranean to him. They gave us the option of sitting inside or outside, so we choose inside.I wanted to see decoration inside which was lovely. The lights for inside the place were beautiful. As it got dark outside, the lights would turn on, giving it a nice dim lighting inside the restaurant. The music was calm and mellow, which it was great to listen and also to start conversations and watch people go by. This restaurant is great to take someone who has no idea what to get but willing to try or an evening out  with family and friends. My boyfriend was lost in deciding what to get, so I decided to ramdomly order Saganaki and then Calamari Salad and Beef Kafta Kabob for our entrees. The dishes was huge, especially the salad, it looked like a green mountain with plenty of calamari. The second dish rice and ground beef  placed the dish almost like a thin steak with salad on the side. The spices they use in the ground beef, left me wanting more.  They bring Vero water to your table, apart from the beverages you order.  I reccomend you to try the Guava juice and Mango juice.  The gentleman in purple, I'm not sure if he is the owner or manager but I loved his service. He was observate and asked how we liked our dishes or if we needed anything else. He was always there to help out. So hopefully when I come back, he is there.As for the other staff members,  they need to pay more attention to ther tables. And have more knowledge of their menus when they are asked.  I'm not saying wait hand and foot on the customers but make them feel welcomed and friendly. Other than that I would come back and invite more people to at least get them to know this place next to the canal."], ["Julia S.", "I love this place, although it is rather expensive. I don't find the entrees particularly great, but their appetizers and desserts are wonderful! Try the Mediterranean Pizza appetizer, or the calamari, they're both great. Also, really great baklava. Love baklava."], ["Thomas J.", "[I should preface, here.  I hail from the tundra-abyss-post-industrial-apocalypse known as Flint, Michigan.  Though the people aren't good at finding jobs, (nor is industry good at providing them) the city has some LEGIT Middle Eastern/Mediterranean restaurants. (i.e. A joint called Badawest, and another called Taboon.) This said, I consider myself on the high-end of picky when it comes to the genre.]Canal Bistro delivered.  Visiting our Indy friend, my partner and I (and our friend) stumbled upon this place whist walking the canal.  I spotted a sign reading \"Mediterranean\" and our quest to find lunch was promptly over.  The decor is....elaborate? It reminded me more of a Jewish grandmother's condo in Boca Raton than of the rocky coastline of Greece -  but I digress.  It's the food that matters! And so it does.  The pita here is unlike any I've ever had.  The complimentary basket comes with olive oil for dipping and some kind of seasoning concoction the waitress kindly explained, and I have since forgotten.  That said - it's fantastic. I had the beef shwarma wrap with fries.  The fries come equipped with feta cheese and garlic - because...that's how the French like it!  No...No?  Regardless, they're so good you will mindlessly eat them whilst you figure out what you did right in life to have stumbled into such a terrific establishment. The wrap was divine.  The pita is thinner than traditional, lending itself to letting the contents take the spotlight.  As they should.  And they will.  The beef was tender, juicy and seasoned perfectly. The subtle hints of cinnamon (sounds weird, I know.  It's a Greek staple in savory food.) compliment the parsley, pickles, onions, garlic sauce, tahini - and who cares what else, PERFECTLY.  The taste took me back to my days living in Flint - and ironic as it may seem - made me long for them.  Well, at least for the food.  The liquor stores, hookers and broken dreams - not so much. Canal Bistro is a must-inhale-stop for the Mediterranean lover in us all."], ["Jonathan K.", "We've been here twice.  It's been fantastic for the kids, and fantastic food. They're accommodating with substitutions and because of this place my wife now likes Greek food. If you want to push your kid's horizons, go for the flaming saganaki. Sure, it can be a tad on the salty and greasy side, but that's the point, and it gets the kids into something more exciting and ethnic than corn dogs.I've done the wrap/sandwiches with both the schwarma and kafta kabob. Both were excellent.Oh, and don't forget the crack known as the feta garlic fries. Good stuff."], ["Rebecca B.", "I loved this place. Staff was attentive and friendly. I ordered the lamb kabob meaning to get the chicken kabob. But that wasnt an issue as it turned out delish. Had a side of their yummy garlic fries with feta cheese. My sister had the gyro platter and that was great too. I am defently returning for the chicken next time. Also very nice atmosphere there. 2 thumbs up."], ["Tony B.", "Outstanding Greek food."], ["Giles S.", "I have visited restaurant three times in the last 30 days. The quality of food varies by item.   On my fist visit my chicken shawarma was cooked perfectly.   It was fresh, juicy,  and very tasty however the other items I ordered were mediocre (fried calamari and soup) My second visit my chicken shawarma was very dry but the feta french fries were fantastic. My last and most recent visit my chicken shawarma was dry and burnt and the fries were greasy and very unappetizing. It would be great if quality of food were consistent.   I will have to pass on this restaurant the next time I am craving Mediterranean cuisine because quality is too inconsistent."], ["Deborah B.", "We celebrated St. Patricks day riding up The Monon Trail and wound up biking from downtown Indy up to Broadripple.  We wound up at Canal Bistro, because what says St. Patricks Day more that a mediteranean food?!!. We decided on a relatively light lunch and shared three small plates of hummus, baba ghanouge, and ceviche between the two of us. The hummus was great, as well as the baba ghanouge, however, I did not care for the ceviche.  It wasn't bad, just not as good as I've had in the past at other places.  They had the requisite local beers on tap, e.g. Sun King Osiris.  Also a decent cocktail and martini drink menu. The service was stellar.  It was beautiful out and a great place to people watch."], ["Nadine F.", "I really enjoyed Canal Bistro, and it seems like the best patio in town for when the weather is perfect, as it was today.  I went during prime lunch hour on a weekday, but  it wasn't very busy.  I see this as a positive, because it meant service was fast and friendly.  The food was fantastic.  I had the grilled eggplant sandwich.  Though I don't usually go for vegetarian options when eating out, this really hit the spot.  The eggplant was perfectly grilled, not slimey or bitter at all.  It had a meaty flavor to it, which went very well with the pita and sauce, and it was very filling.  I also tried some of my mom's lamb burger, and it was also excellent.  The hummus and Turkish coffee were also delicious.  I would definitely come back!"], ["Danyell W.", "Love all the grilled meats, vegetables and more. Salads were great - but Garlic feta fries were the table favorite.   Good location along the canal, good food and friendly staff."], ["Jo K.", "Feta and garlic fries are AMAZING, but besides that not worth my time. Couldn't even get the basics right.P.S. We asked if the pita was made in house and they said no. Probably something you could buy from the grocery store."], ["Emma T.", "Okay- so the food is amazing...lamb kabobs phenomenal! Fries with feta outstanding! What's the problem? The service!! I was told by the owner himself that he knows the service is bad and that the food is good so that's why he doesn't ask tables how their service was. The food is so good, however, that I will continue to go back. If you're in a hurry though don't count on timely service if you come here. Definitely major pro's and con's."], ["kat c.", "This is my second time there today and no complaints. We were greeted with fast friendly service. Not to mention you can't go wrong with the food. A new discovery was made which we saw another table order, French fries with feta cheese.   I always enjoy this place with great food overlook a pond along with live musician there.    Definitely a going back again!"]], "Bosphorus Cafe": [["John B.", "My wife and I think this is the best restaurant in Indy!  It's very authentic Turkish and the food is delicious!  DO NOT leave with out having the baklava!!  Very reasonably priced.  The owner is super friendly!"], ["Mike Y.", "Should definitely be avoided if you disliked fresh food that is perfectly seasoned. Will also be found to be tiresome if one has an aversion to friendly hosts in a warm environment that feels more like a home than a Dairy Queen."], ["Andrew M.", "Bosphorous is one of my three most favorite Mediterranean food restaurants in the Indy area. The service is out of this world awesome, and you can be assured to get the full dining experience when you're there.Four course meals. Awesome bread. Hummus is fresh and lightly flavored. They are great for medium sized groups to go and sit together to converse and enjoy each other's company, while in a relaxing, dimly lit and comfortable setting, with cultural artwork and decor on the walls. The wait staff is made up partially of the owners and family. While we were there with a group of 6, our waiter taught us to order in Turkish. He had a great sense of humor and made sure we all had a great time. He also gave us a deal to get 4 enormous plates of appetizers, so that we could try them all, and only charged us for the special lunch price apiece. This allowed everyone to try four different appetizers instead of just one. Five of six diners ordered Doner (gyro meat) while I had the chicken kebab. The chicken was seasoned perfectly - not too spicy but with flavor. Everyone loved the buttery veggies and gobbled down the bread. I wish I could have had more rice - it was yummy, but I only got about one cup. We really had a great time out to lunch together at Bosphorous."], ["Les G.", "Very authentic ambiance, excellent service and great food.  The appetizer, entree and desert were all phenomenal.  A definitely stop on an trip to Indianapolis.  I highly recommend."], ["Alicia C.", "I found this spot years ago, after a trip to Turkey. Located behind the Lilly headquarters in a house, turned restaurant, it is the perfect place to enjoy a perfect Turkish meal. The restaurant itself, still maintains that \"homey\" feeling. Nazar's charms hang through out the restaurant, warding off any \"evil eyes\" that maybe present, along with woven tapestry, and Mediterranean paintings. You will more than likely be greeted by the owner himself, a warm, friendly gentleman who will ensure that your visit is pleasant.The  Beyti Kebab is my favorite dish, a mix of  ground lamb and beef mixed with spices, rolled in bread and topped with tomato sauce . If you can't decide what to get, go all out and order the The Bosphorus Special that comes with chicken kebab, kofte, doner, shish kebab, Adana kebab and chicken Adana kebab. No matter what you order, you must leave room for the baklava, seriously it is the greatest thing ever!"], ["Amy V.", "Let me just start by saying that I date a very critical German male who has visited Turkey & ate more Turkish food than anyone I know x5.And for this place, we both agree: Very good food, staff, and atmosphere!! We go the appetizer combo for two. My boyfriend is a meat eater & I'm a vegetarian. This dish worked great for the both of us. He had a doner and I had a veggie bowl. Both delicious & Plenty of choices for us both. We will definitely be back!"], ["Alex D.", "This place has amazingly cozy dining areas.  We got the window view overlooking S East St.  What was great was that it  felt like you were eating at your own dining table.  The vegetarian dolmates were so good, we ordered another.  The service was impeccable with his patience and explanation of the dishes as if it were written from a great novelist.   The portion sizes were perfect."], ["Madhavi B.", "There's nothing like having a meal at a warm family's home that's well decorated, amazing food, and has gracious hosts. Except the home is a restaurant. And the hosts are the owners. This place is a hole-in-the-wall place; if you're not searching for it, you won't find it. And that's such a loss! The Turkish flavor is not lost, and it really tastes like a sweet family has invited you to their home for dinner, and the momma KNOWS how to cook. SO TASTY!You get a basket of warm, fluffy, basket of cloud-like pita, ready to dig into. I ordered the Borkna (Shoot that's not the right word, but it's similar!) which was a crispy phyllo wrapping feta and spinach. Ohhh yum! I also got the Bosphorous salad, which was crisp and refreshing; not a big fan of grape leaves though. For the main course, I got the Turkish Delight! And the best--everything comes with hummus!! So those warm pitas come with a dunking friend.But before you leave, you HAVE TO GET BAKLAVAS. Trust me. Just do it!"], ["Katie M.", "We live right around the corner and we couldn't ask for a better neighborhood restaurant! The food is always fresh and delicious! Highly recommend this place!"], ["Brent L.", "SHORT REVIEW:  A taste of a place you're not currently in.  Bosphorus brings Turkey to you.  They offer delightful decor and cozy cultural cuisine that you'll likely come back for again.LONG REVIEW:  Bosphorus is off the beaten path for dining destinations, for many--read: the average--American.  Once you step outside of your conventional cuisine box, this place will challenge your tastebuds to apply for their own passport.- LOCATION/FACILITY: With their own parking lot in a less dense area of downtown and right off the highway, Bosphorus is in a downright awesome location.  It's super easy to get to and you'll have no problem parking here.  Walk right in and from the steps to the door, you'll your impressions will begin to reformat themselves to the colors and patterns of a foreign, far off land.  There are dozens of beautiful, handcrafted Turkish rugs, photographs, and decorations all about the restaurant to assist in moving your mind from the Indianapolis you're used to. The dining area is a comfortable size and inviting, as it is clear that you're in a converted house, which preserves a good deal of the cultural authenticity one may expect from such a place.- FOOD/DRINKS: This place unexpectedly shines.  The menu, while a bit expensive for some, falls within the $$-$$$ range for entreés and presents Turkish cuisine that will blow you away.  My beliefs were that food from this region would not be a flavorful or spiced as others around the world; boy was I wrong.  THIS FOOD IS DELICIOUS.  Their lamb chops were extraordinarily tender and cooked and seasoned to perfection.  I would position these higher than some of the best steaks I've ever had.  Though they bring out a basket of warmed pita bread prior to your meal, I wasn't quite sure how to eat it since it didn't come with any dipping sauces or oils.  Color me confused.  The other dish I tried was made with chicken and spinach topped with a spiced yogurt.  It was heavenly.  The only complaint I would have is that I wish the serving sizes were bigger (but that's the American in me talking).- SERVICE: This is the area that could improve, thus 4 stars and not 5.  Admittedly, part of the slight issue I found here was a small language barrier, which is largely uncontrollable.  The other half of this issue is controllable and they could be much more attentive to tables during a diner's experience.  - OVERALL: Bosphorus is an outstanding place to eat if or even if not you're craving something out of the norm.  It's just very good and should become an international food spot added to your mental list of places to eat.  Do it."], ["Jessica B.", "Stopped by for some appetizers. The food and service was lovely. We had the sampler. It was fresh and the Naan bread was warm. We enjoyed some tea with our meal. We will definitely head back."], ["Sabrina S.", "The service was fine, and the food was okay. Maybe it's just the style of food that I find uninspiring and boring. They brought out a complimentary pita bread appetizer, and it was good pita bread. We hadn't been there before, and didn't think to order a dip to go with it. We ordered some type of larger sampler dish to share that way we could try a few different things. It came with a few different meats, veggies, and rice. Everything was fine, but not great. Some of the meats were dry, the rice was boring, and the veggies were pretty good.I didn't really care for the ambiance. It was really quiet, with Turkish music in the background. There weren't too many tables around, and I felt like the wait staff hovered so close that it was hard to have good conversation.I think this would be a good restaurant for someone that is not terribly adventurous with food, but still wants to try something different. We probably won't be back, but if you are a lover of Mediterranean food, this may be the place for you."], ["Mi Sook K.", "Not quite as good as I remembered it the first time...We were seated relatively quickly so off to a good start. However, it took some time for our waitress to bring our waters, then straws, and lastly beer and wine. The dining area was maybe half full on a Monday night so I didn't quite understand the slower than expected pace. I will say the owner, or I can only presume, was making his rounds to each table gabbing with the patrons and extending a warm greeting to all except ours. Now I don't need someone to schmooze up to me but I can't help feeling like we didn't matter as much as the other guests. If our waitress was attentive, it wouldn't have mattered at all but we were skipped as I observed him sitting at a table with a diner and crouched down next to other tables chatting away. Quite the contrast from our waitress who was a woman of very few words. Well, onto the food. I had the chicken kebab and my sister had the vegetarian guvec. My dish was good overall but some bites were moist and others dry. I sampled some of hers and thought it was flavorful. She remarked it was a bit on the greasy side but it didn't stop her from finishing her dish. Pleased there were at least four or so vegetarian entrees for her to choose from. I did have to flag down the waitress for some pita bread as my sister wondered why everyone else had a basket of pita except us. To sum it up, food was good but not enough to compensate for the service."], ["Torrey R.", "I have been here a few times and each time the food is good.  I always order hummus and love their warm, soft pita bread.  I have been to the Middle East and this hummus is the real deal.  It is fantastic!  For my entree I ordered the Doner and was a bit disappointing as the meat was on the dry side.  Maybe they were having an off night since in the past it has been good.  The side salad is tasty and so are the veggies.  This might be a good place to go to order a bunch of appetizers because it is worth filling up on their hummus."], ["Simon T.", "It's like a great twiston Mediterraneanyou've already had!"], ["James C.", "Love it.  Doner kabob, Beyti kabob are wonderful, flavorful is an understatement regarding Bosphorus.  I've been here twice in one week and each time the food was amazing.The interior is homey, very warm and cozy, beautifully decorated. The service is kind and warm as well.  It may take a few minutes for your meal to come out but enjoy the 'dining' experience and don't be in a rush.  Desserts, baklava!  Of course!!"], ["Cara S.", "I have been here about four times now, and it's consistently great!  I'm not usually fond of baba ganoush because the texture can be slimy, and eggplant is easy to mess up.  Definitely not the case here!  The baba ganoush at Bosphorus has a nice texture and a wonderful smoky flavor - it's the best I've ever had anywhere!  Everything else in the appetizer sampler is also great, especially the hummus, the grape leaves, and the spicy pepper dip (I forget the name).  The Bosphorus Salad was also very nice, and it came with a couple of grape leaves.  :)  Plus, I enjoyed a lovely dry red Turkish wine with my meal. I love the fact that the restaurant is in an old house.  It offers such atmosphere and character.  There is nothing really to walk around and see around there, so it's a little off my beaten path, but it's worth it.  We've introduced three sets of friends to this place, and they all loved it and have returned."], ["Mark C.", "I didn't like hummus until I went to Bosphorus.  Now I can't get enough!This is a local gem in Indianapolis.  Great food & friendly staff.  It's a great date night & a great place to go to dinner with friends.  I've had almost everything on the menu and it's all awesome.  The Baklava is the best I've ever had."], ["Amanda T.", "Simply amazing! We got the appetizer combo, Iskender and stuffed cabbage. I would recommend all of them! The hummus and dolma on the app combo are wonderful. The Iskender is also perfectly seasoned, the meat melts in your mouth, and the bread soaks up the sauce and sour cream in a way that will have me craving it for years. The atmosphere is perfect for a date or casual dinner, and the staff is very pleasant! Don't miss this place if you're visiting Indie!!"], ["Ben R.", "I've been a frequent flyer at the Bosphorus for many years, so here's my first \"Yelp\" about it.Just awesome...the end.No but really, I love this place. I've read some reviews that are kind of on the money about the service being hit or miss, but that's the case with ANY joint you go to. And I've been here on the \"miss\" nights as well, but I'm reviewing my \"hit\" night.The GF and I went to celebrate our...something something....anyways, it was a Thursday night, and the place was about half full, so nice and cozy. It is indeed a old house turned into a restaurant, so if that's not your schtik, and you like the warehouse feel, sorry. But we love it. Nice and cozy. We were seated fairly quickly, the main room was like I said, pretty full, so we were sat in the next room, where there was only one other couple. It was perfect.Our server came and asked if we wanted to order, or if we wanted to relax with some drinks first, of course drinks, so we ordered a bottle of the Turkish red wine, and I had an Effes (Turkish beer) for good measure. Effes is one of my faves, but the Turkish red wine REALLY won us over. Just fantastic.We then ordered some apps, which were the stand by for me in Borek, and also the Feta cheese plate. Both were delicious. The Borek has kind of gotten a bit smaller thru the years, but that's US economy for ya. Still, very tasty.After we were done chillin' and appin, we ordered dinner.I had the Adana kabob, and she had the Lamb Mediterranean. Both were freaking phenomenal. The spices they use in the kabob, combined with the beef and the lamb just are amazing. The Lamb dish combined with the vegetables was perfect as well. No desert, but we opted for the obligatory Turkish coffee. Who woulda thought a Turkish joint has good coffee??? Sarcasm at it's finest, trust me this Turkish is second only to mine. Just perfect! The reason? NO CARDAMOM!!! EVERY freakin' Middle Eastern joint I get Turkish at puts that crap in there for some reason, Not here. Black as Hell, stronger than death, but sweeter than love. Don't leave without getting one! or two!In summary, fantastic service, combined with outta this world food gets the 4 out of 5 star review."]], "King Gyros": [["Hannah R.", "I've only had the Gyros from here and man am I impressed."], ["Robert B.", "Great great food. Try the gyros. The tips dinner is really good. Top notch italian beef. Probably dont wanna waste the money on a ribs dinner. There just isnt much meet there.JRJ in these reviews has no idea. They have over 15 different kinds of items to build entres around."], ["Mike R.", "Had an early afternoon appointment on the Wild South Side (we don't get down here much), so \"Yelped\" lunch places near Madison Ave and King's Gyros looked like a good bet.  The restaurant seems to be in a former chain fast food building, and is roomy and has comfortable booths, as well as a busy drive-through clientele.Quite a large menu for this kind of place, with a variety of different types of \"lunchie\" food, but we went for the Gyros.  $6.19 gets one a hefty load of meat, onions, tomatoes and sauce on a nice tender pita, a very large helping of hot crispy fries and a drink.  She had a gyro and Greek salad combo, but the combination of the two was really too much to do justice to, although the salad was fresh and tasty.If and when I am in the neighborhood again I will be sure to give some of the other menu items a try - the cheeseburger or hot dogs sound pretty good and the prices are very reasonable."], ["Jason O.", "This place is in our regular weekly lunch rotation.  We like the Gyro and salad combo and some of the other guys get the burger and fries combo.  Quick and friendly service this will continue to be a staple in our quick go to places."], ["SBeezy B.", "Simply put: best lunch you can get for $10 and have left overs!! Delicious!! I'll never stop going there. :-)"], ["Scott P.", "A previous reviewer mentioned limited menu...  I am thinking that they have the wrong place.  Obviously, the gyros are great, but even the tenderloin is awesome.  I have had many items off of this menu, and they are all very good.  It helps that I'm close by too!"], ["Bruce H.", "I like this place for an alternative to the fast food chain's. I don't go their for the gyro's, although I've heard they are good. Their \"big baby\" is a double cheeseburger with fries and a drink for $5.00 you cant beat it. The burger is better than the chain's and more filling. The only complaint I have on this place is they never have their A/C on and always have an excuse. Fix the A/C. Overall a good place to get a good burger that's cheap and tasty."], ["Edward J.", "Dependable gyros - generous amount of meat and the fixings are fresh. Thick fries cooked to order. Lots of other menu choices. I used to order the fish sandwich, but after two visits where the fish was overcooked and chewy, I decided to stick with the gyros."], ["Joshua C.", "I've found King Gyros to be one of the best places in town to get a gyro.  Many of the gyro joints get their meat and supplies from Kronos, so to me it's mostly about preparation and how much meat they give you. King Gyros give you quite the filling portion of gyro meat on a tasty pita, Tzatziki sauce, tomatoes, and onions. Sometimes they do cut the tomatoes way too thick, but I don't mind."], ["JC L.", "They do have the best Gyro in Indy!  My only gripe was that we went one day in the summer for lunch and the AC wasn't working.  My advice is to take your order to go or go on a cooler day.  Their burgers looks good and will be ordering that next time."], ["Kristin S.", "Good stuff and quick. I love they have drive-thru!! Huge portions and excellent gyros!!  Getcha some!"], ["JR J.", "Not all that great.  I was truly hoping for much better.  The food was just average and the menu seemed very limited.  I would suggest finding somewhere else for a Gyro."], ["Meagan S.", "This place is fantastic. It's delicious and fast. I can't say enough about this place."]], "Pita Pit": [], "The Greek Islands Restaurant": [["Juliet F.", "I was in Indy on business and decided to try this place based on the Yelp rating, and I was not disappointed. The food was spectacular, confirmed by the colleague who is Greek (so more of an expert than I am). The environment was typical of a family owned joint - nothing fancy,  and could probably have done with some renovations,  but extremely welcoming and exactly what I was looking for.  And the staff was extremely friendly. The owner chatted us up for quite some time and really made us feel at home.  My Greek colleague and I both had the spanikopita. Absolutely delicious.  Our other guest had the salmon and said it was great.  And I'm a sucker for good bread and that was in abundance. If I'm ever back in Indy I'll be back here."], ["Loren K.", "This restaurant is a nice family owned Greek joint. It's charming, the staff is friendly and they give you huge portions. There is a seperate gluten free menu, ask for it if you need it. I got the gluten free sganaki as an appetizer, which was delicious. I also had a chicken dish that was tasty (but sparse on veggies, aside from the side of green beans that came with it), and it was enjoyable. My husband had a kebab, which he thought was strange didnt come with rice, but liked nonetheless. The entrees came with tasty Greek salads,  but if you dont like a lot of dressing ask for it on the side because they really drown it. It was clean, plenty of seating and a nice atmosphere. I would go to this restaurant again next time I'm in town, I liked it a lot."], ["Angeleka D.", "Unlike some of the other not 5-star reviews, I love greek food and for me, the more traditional the better. I've gone here 4 times (once for a corporate function so food was pre-ordered) each time I have yet to find something I can fully appreciate. That is not to say Santorini is terrible, it just falls short. I've had all of the appetizers, the lamb, tilapia, and two kinds of gyro. For me, I think the food here lacks the robust flavor of the Mediterranean. The interior doesn't give the open airy feel of summer overlooking an ocean, or an intimate setting gazing in the eyes of an exotic fisherman...it's cramped darkened space doesn't allow you to dive into your imagination of Greece. It may be borderline cozy on a good day, and just sardine packed on any other. I will give it to them, through some hard times they have held on. And, are at least, trying to preserve a spirit of culture here in little Indy. What to try: Saganaki! Have at it! How to make The Greek Island Restaurant Healthy: Stick to the basics here, Greek dining is mostly healthy as it is. Just enjoy in moderation!"], ["Jaime C.", "I decided to try out this restaurant per the great reviews. I was not disappointed. Service and food was great! One thing I was disappointed in was the live entertainment or lack there of. I didn't know what time it was since everything I read just said \"live entertainment Friday and Saturday night\". Assuming that meant dinner time we went at 530.. Well folks, just FYI, the entertainment doesn't start until 7pm. I will be going back and this time I'll go later so I can enjoy the show!"], ["Jason M.", "A great, cozy, friendly atmosphere. The service was fast and food was well prepared. I had the stuffed flounder which was decent. My friends had the lamb chops and moussaka which were outstanding. And the belly dancing gets an extra 1/2 star!!"], ["Jessica S.", "Well, Once again we took a group to GI, and no one was disappointed. I took a party of 12 in for my Birthday dinner. Most of them had never had greek food, and they all loved what they had. We had great Service from Candy, and George Jr 'made' us stand up and have the whole restaurant sing Happy birthday to us. Our friends loved the belly dancer and the sganaki  and the Rice Pudding. Had a blast and the made the night special for me and they secured their place in our hearts..."], ["Scott N.", "There are very few places that can scratch my authentic greek cuisine itch, but the great, gregarious, and amazing people at Greek Islands can definitely do that.  There isn't anywhere in Indy that I would rather go to get a pita overflowing with lamb loaf goodness and tzatziki sauce. Please do yourself a favor and go spend an hour with your greek family and get some amazing gyros.P.S. The baklava is OUTSTANDING! Can't beat it."], ["Amy D.", "I have a tendency to find a Greek restaurant I like and then not try a new one for 5 years.  I finally ventured out of my comfort zone the other weekend & tried The Greek Islands for the first time. [-1 star for a bit of an environmental-noise issue, as referenced at the end of the review]Oh my goodness, I might have a new favorite for Greek food in town!  We went on a gorgeous Friday evening and we expected the place to be packed (it was a busy night downtown). Shockingly, it was not.  We opted for indoor seating, but their patio looked like a pleasant place to have a meal as well.Service was great. We started with an appetizer of saganaki...because you can't go wrong with oozy cheese on fire. Opa! The pita that was served with the saganaki was delicious & fresh with the perfect level of chew.My husband had the gyros dinner and it was more food than he could eat.  I tried a piece of the gyro meat, and it was great.  It wasn't dried out & it had great flavor.  I had an appetizer of the Spanakotiropita & the Avgolemono soup as my dinner (I didn't want all the sides that came with the dinner option, plus I have a pesky bell pepper & tomato allergy). The Avgolemono soup was some of the best I have ever had.  The orzo was a bit too mushy for my taste, but the flavor profile was perfection. The Spanakotiropita Were Outstanding.  It was also a huge portion, and I ended up having 2 pieces to bring back home.  They reheated in the oven perfectly, and were outstanding served with the brunch I made us the next day.  I had also requested a side of feta to eat with my dinner, but it never came. That was a bummer, but I was stuffed, so it wasn't a huge deal (we did notify the server & had it scrubbed from our bill though).  The food was served with a hot, crusty loaf of bread...which was good, but TOTALLY unnecessary. Next time, and there WILL be a next time, my goal would be to not overly stuff myself like I did on our first visit.  I really wanted to try the Baklava.The only downside is that while I think the \"belly dancing\" aspect is a fun touch...it was TOO MUCH on the night we were there.  They pump up the music really loudly during the dance.  But if it goes on for more than one song...it's just too much.  It's impossible to have a conversation during the dances. Fine for one song, awkward for more than 1 song.  It was really bad on the night we were there, because the dancer knew a big family that was sitting at a table by us.  After her 2-song dance, she brought out extra castanets to the plethora of kids sitting at the table (who had been done with their meal for more than 20 minutes, but the parents were visiting with staff), so they could try using them. That's a cute idea in theory, for a couple of minutes...but over 10 minutes of children banging tiny cymbals without rhyme, reason, or rhythm...it brings out my angry side.  That would be a great activity for OUTSIDE the restaurant...not inside to the detriment of other diners' ears.  But, if you don't mind Club-Music-sound-levels & cacophonous mayhem...then indoor dining will be right up your alley.  I left with a pleasantly full belly...but a rip-roaring headache from the castanets. If visiting on a weekend again, we would gladly choose outdoor dining instead of indoor if weather was agreeable...simply because it seemed quiet outside."], ["Joanna B.", "I am ebarassed to see that I have not written a review for this wonderful restaurant. When I first moved to indianapolis, The Greek Islands was one of the first restaurants I ate at. We met the owner's at an event and they were so wonderful I knew we had to give it a try. Almost 5 years later and I still love coming to this place. The wonderful food draws you in but the friendly employees keep you coming back. When you are at The Greek Islands you are family!"], ["Don S.", "Simply the best. Big George and all his family running the place, coming by and telling stories. Sitting outside in good weather for some great cigars. The food is absolutely the best. Start the dinner with some saganaki and then take your pick.  Everything on the menu is fantastic. Greek Island steaks are the best kept secret in town. It may be the best steak I've had In a restaurant and I've been to the \"Saints\", the \"Morts\" and all the rest. Their employees are top notch so there's never any worry there. Try The Greek Island, you will not be sorry."], ["Angelus K.", "I had a group event here and I have to say that Greek Islands did a fantastic job!  Big George is a consummate host and this is everything you'd want in a  Greek restaurant.To be sure, this is an old school Greek restaurant---It's Tselementes based cooking, so you know what you're getting.   We had excellent fish with rice and briami style vegetables (sautéed in tomato sauce).   I also have to say that the saganaki made by Big George at the Yelp event was top-notch.   I fully intend to come in the near future and try more of the menu--I would have been long before were Greek Islands not on the south side of downtown...    I do wish they would fix up their parking lot though!"], ["Phil B.", "Great food and great service. The owner is always super friendly and inviting. What else can be said. OPA!"], ["Joseph P.", "We chose this restaurant for dinner following outdoor activities on a summer afternoon.  It was our first visit.  Traffic wasn't bad even though it was early evening.  We parked close to the building at no cost.  Acoustics in the dinning room made conversation enjoyable. We each ordered a small salad, I ordered chicken orzo soup with lemon and my wife chose grilled salmon.  Our server recommended MacMurray Russian River Valley Pinot Gris.  We were impressed with how well it paired with the food.  Our salads were fresh, crisp and flavorful.  My soup was rich and savory, and my wife liked the way her fish was prepared but thought the portions were a bit large.  Our server was knowledgeable and attentive, we enjoyed the meal, and the cost was reasonable.  We hope to return and try other things on the menu."], ["Chrissy H.", "Authentic, Greek cuisine in an intimate setting. Food was terrific; I ordered the special which was red snapper, asparagus, and mushrooms...yum! Make a reservation if going after 5 or 6. Expect to wait a little on the food, but it is worth it."], ["Hugh D.", "Why haven't we heard of GI before!  Took a friend from DC and loved it.  I lived in Greece for 6 months and have now settled on my true Indy Greek fix."], ["Yenly C.", "Great Amazin authentic food,  the best service so far, the belly dancer was good added bonus."], ["Jason J.", "Very impressive little place. I had the Kota, and it was phenomenal. The service, the atmosphere, and c the attention to detail were all top shelf. Hope to visit this place again sometime."], ["Sunah K.", "I had a pregnancy-induced hankering for gyros and had never been here so I dragged my husband and toddler here for a Friday night dinner.  He admittedly doesn't love Greek food. I'd give the food 4 stars but overall 3 stars.  We started with the 4 dip appetizer cuz we love Middle Eastern style hummus and baba ghanoush, but their hummus and eggplant dip were Greek takes on them and they were not what we expected. Both were very garlicky but somehow a bit bland.  I ended up liking the taramosalata best (caviar paste dip which the server described as a \"fish dip\").  Husband and kid ordered gyros, which they both liked--entree portion was huge.  I ended up ordering the Souvlaki, since i figured i'd get some some bites of gyros from the rest of the table.  My entree was also huge and the pork was tender. The problem was the service. We felt nearly ignored by our very slow server.  Empty drink glasses and extra plates were crowding our tabletop and I was never able to catch her attention in the small dining room. Request for extra pita bread took a looong time. It did get more crowded as we sat but the dining room was pretty empty when we first go there. The decor was definitely dated and it didn't feel very \"clean\" anywhere. There was a belly dancer that night and her music was WAY too loud.  We probably won't be back. Although a friend suggested this place over Santorini's, I have to disagree."], ["Anastasia C.", "Was in Indy for nascar and stopped here for dinner. We ordered the saganaki that was amazing! The avgomeno soup was great. Was different than what I am used to because it was served with orzo instead of rice. We all ordered the Greek islands combo. It included salad and 7 menu items for a great price! Actually enough food for 2 people if you would like to split the order. Absolutely loved the consistent drink refills. Great service. Wasn't expecting the entertainment offered by a belly dancer. Thought that was cool. She kept it very tasteful in keeping with the family atmosphere."], ["Adria S.", "We were in town for a concert for my birthday and I haven't had good authentic Greek food in years so I was excited to try this little place.  It was off the beaten path yet close by downtown which made it a short taxi ride for us, but if you're driving parking shouldn't be an issue.The decor is a little out dated. But it's clean and those dark, \"trendy\" restaurants start to all look the same. Anyway, this place has a homey, mom & pop feel. I had already scoped out the menu on Yelp and knew what I wanted: EVERYTHING! So of course I ordered the Greek islands special and my husband had the Korinthians dinner.So much food! I ate as much as I could but still left half my food behind. Everything was delicious but special mention goes to the Gyros meat which was so savory and well seasoned and the moussaka was the best I have ever had! My husband enjoyed his lamb chops. This was his first real Greek experience and he is now a fan. I am subtracting half a star because his chops were slightly over done, but he wasn't asked how he'd like them.  They were still juicy and delicious!  I wish we had room for dessert but the belly dancer would qualify for a good after dinner  treat. She was lovely! I hope we return to Indianapolis soon because I don't think I can go long without wanting to visit this place again!"], ["ANTHONY C.", "I cant wait to go here tonight!  The food is always great and authentic!  My family has been friends with the owners for 30 years, and they are great people!  There is a great selection of greek wines and imports, and the atmosphere is fun and upbeat.  We do our Christmas dinners here every year.  Your guaranteed to have a memorable experience!  Opa!!"], ["C D.", "It's a nice, family business and we generally have a good meal here. Their orzo soup (with the lemon) is very good.  Typically, we stick to the very basic dishes (souvlaki, pasticchio), but this time I decided to try something new - the fish kebab special, served on a salad.  We stopped in for dinner on a Thursday night, since we were downtown for a later afternoon concert.  Our group ordered the chicken souvlaki dinner, pasticchio, fish kebab salad, and orzo soup.  The dinners were served with a white bread, rather than pita.  Both the chicken and pasticchio disappeared quickly.  The salad under my kebab was dressed very nicely in a creamy dressing.  The kebab was a bit oily and I only ate a few bites.Overall, it was a pleasant experience. I would come again for the soup."], ["Michele S.", "The best Gyro I've had! We came in from Kentucky and the Blue Building stands out from the interstate. The owner and Staff are very friendly."], ["Lauren R.", "Delicious food!  Service is superb!  Flaming cheese app. is a must!  I had the combo meal that included a bit of everything and I couldn't have been more pleased.  The soups that are offered are delectable.  The spacious dining room can accommodate large parties, but can also be cozy for a table for two.The flaming cheese appetizer is a show stopper for sure.  A parking lot all their own is nothing but a plus!"], ["Matthew B.", "Best Greek restaurant I've ever been to!  Easily tops anything in Chicago's greek town, which is no small task.  The red pepper stuffed with feta is delicious and the spanakopita was the best I've ever had.  The server was delightful and the place is very family oriented.  I will be back soon!"], ["J B.", "Maybe it was just a bad night for this restaurant. We sat down promptly, but no server came by for a long time. This was a precursor to painfully slow service throughout the meal. Meanwhile two women who appeared to be managers stood around watching, but not helping the overwhelmed waiters.The food was standard Greek fare, although the hummus had no flavor.The belly dancer was very personable and talented!Santorini's blows this place away for service and ambiance."], ["Kay B.", "The location is on Meridian just barely past downtown, which means parking is plentiful. The restaurant is small and cute. I enjoy the intimacy of the space. I love that this is a family run business. You can definitely feel the love in that place. The servers are also excellent!The food on its own, without comparison is good. But it (overall) just does not hold up to Santorini. We have been going to Greek Islands for years and just recently visited Santorini. It blew Greek Islands out of the water in every regard. The Saganaki was better and over double the portion size. The salad and bread and significantly better.  The gyros at Santorini were served in a pita (as expected) and the meat was much juicer and less dry than at Greek Islands. The green beans and potatoes were also more succulent and flavorful. And oh my god, the baklava. It's much more juicy and flavorful at Santorini. It was no contest. Santorini slayed Greek Islands with each food item we ordered. I love, love, love the service and people at Greek Islands. I will still go there if I need to get Greek closer to downtown. But otherwise I'm making the extra drive to Santorini from now on. At the end of the day, the food itself is number one when choosing a restaurant. I hope that Greek Islands can covertly take a field trip to Santorini and spy to see what I mean. I would love to see them improve their food to be on par with Santorini because I do think Greek Islands has a better atmosphere."], ["Michael C.", "We found this place from 4square while on a trip to Indy. Very close to downtown. Huge portions, and very friendly staff. They do a little fire show when you order one of the cheese appetizers and that inevitably grabs the attention of all patrons. The kids menu is typical greek and the main menu is extensive. One bit of advice. Don't order a greek salad as an entree. Get the a main dish instead, as the side greek salad that comes on the sides of the platters are GIANT.If I was a local I'd eat here often. Glad to have found such an authentic ethnic place during my travels."], ["Charles S.", "Great greek food and peopleGet the greek sample for a taste of nearly everythingThe humus is very good to"], ["Bobby N.", "The decor is a little dated but the food is great. The servers had a couple of large groups in since it was a Sunday afternoon. But they tag teamed us to be certain we had everything we wanted. We had an appetizer plate and I enjoyed every bit of it. The hummus was a little coarse and my date said she preferred it more creamy. I really liked the spice choice in the hummus. I am not sure I have ever had melitzanosalata but I defintely prefer it over baba ghanoush and I really like baba ghanoush. I had Gyros which were really good but just slightly over salted.My date had Souvlakia and shared a bite with me. Fantastic.Great wine choices but limited on beer. Next time I plan to try a greek beer.Yep, next time. I am definitely going back."], ["Stacy P.", "I decided to treat the 'rents to a nice meal downtown and expand their palates, and Greek Islands fit the bill. Once an old butcher shop, Greek Islands, has been transformed into a cozy locally owned and operated authentic Greek restaurant.  One of the biggest pluses is that they have a separate Gluten Free menu and the staff went to extra lengths to make sure there was as little chance of cross contamination as possible.As with any restaurants, you have to have one of their popular dishes, and the Saganaki was it. Plus, it provided a mini show.  The Chicken Souvlaki was good. It was almost two much food. The Gyros and the lamb chops looked excellent. I only wish that they didn't have flour and I could enjoy the taste of the dishes.I would recommend making reservations on Saturday night. This isn't your large chain restaurant, so they don't have as many tables as say a Bob Even's. I would also double check if the Colts are in town because of their proximity to Lucas Oil Stadium, traffic could be an issue."], ["Justin S.", "There's a whole lotta lovin' going on here.  The building, to me, looks like a home that's been opened to share what mamma has to offer.  Were we to visit our friends in Greece I'm sure their welcoming dinner would taste just like this.  Baked lemony potatoes and stewed beans would be in abundance.  Flaming cheese? Crispy and tart with lemon and ouzo. Cut a piece and wrap in pita. Don't forget to schmear in the drippings on the plate. Avgolemono? Yep. We've had different variations around the country.  This is a smooth broth eggy broth with orzo.  Don't forget to hit it with an extra squeeze from the lemons. Devour platter? Mousaka, Pastichio, gyros, stewed beans, lemony potatoes, and cheese filled phyllo.  Both of the casseroles, mousaka and pastichio, are comforting and easy to slide into.  - Note on the staff.  They are a well oiled machine. Greek comfort food at it's best, that we've found in Indianapolis."], ["Rachael L.", "Opa!! Sorry, I cant help myself from feeling the Greek spirit when I am in here.It doesnt have the newest carpet on the floors or the flashiest art on the walls, but I wouldn't change a thing. It is what a family restaurant should be like. If my grandma were Greek, I can imagine this is what her food would taste like. The Greek Islands Restaurant serves true Greek comfort food. You can tell love goes into each dish.Get the whole experience on Friday and Saturday nights. Belly dancers show off their moves and if your lucky, grandpa will break plates on the floor and yell Opa! Its like nothing else and its right here in Indianapolis!"], ["Brigid S.", "Great, authentic, tasty food and wonderful people. Always worth the visit."], ["Karl M.", "Food is good so far. Just watched a cook walk up to the front and pour himself a glass of wine... Not professional. If I drank on the job Id be fired. More to come..."], ["Rachel H.", "I LOVE EATING HERE!! I can't say enough about The Greek Islands Restaurant. First, the wonderful family that run it are warm and inviting. They welcome you in and then feed you some of the yummiest Greek food outside of Athens.Second is the food. Tonight I had hummus, saganaki, salad and soup.  Light and refreshing. My husband and oldest son shared a chicken souvlaki. The perfect blend of spices and tenderness.Truly, if I could recommend one place to eat, it would be The Greek Islands! OPA!!!!!!"], ["Twinkle V.", "Tyler and I have found a sweet spot for wine tasting. On the Southside of the Circle in Indy, you'll find the loud and crazy yet simultaneously warm, cozy and comfortably cramped Greek Islands. Once you step over the threshold and into the restaurant, you become part of the family.Although we'd been to Greek Islands before - and loved it - the atmosphere of the wine dinner was fitting for us. Family-style seating, with a group of 15-20 other folks, including cousins, employees, miscellaneous relatives and some foodie-types, this dinner was quite the experience.  We left in an amazing mood, smiling and not worried in the slightest about the possibility of a hangover on a Tuesday morning. And because there was so much food tasted with the wine, that outcome was practically impossible. From bubbly to bubbly, from soup to salad to shish kabob, I felt perfectly at home.Each course was paired precisely with Greek Islands' food offerings, woody Chardonnay with lemony soup, South American reds with grilled chicken and meat pies.The chef wrapped up the meal with a trio of petite phyllo sweets, filled with mint, cherry and chocolate.  You can't just get up and walk out the door, either. A tight, full-bodied hug from Angela S. seals the deal, making sure you know you aren't some stranger, and you are welcome in their \"home\" anytime. Though I *love* the spontaneously-blazing Saganaki, and the chorus of \"Opa!\" filling the room, it's that precise feeling of comfort and acceptance the owners and employees exude, paired with a top-notch authentic Greek meal, that will keep bringing me back."], ["Alex W.", "Came here with friends with a reservation we made the night before. Two of them (thankfully) showed up early & we scored a table. I'd be scared of the wait had we not RSVP'd ahead of time.Service was SLOW. Don't know what the reasons were, but we waited ~20 minutes for the Greek salads / my friend's appetizers, and probably an additional 25-30min for our entrees. Had that not been an issue, I would give them a better rating. They at least kept up with drink refills. Everything was delicious once we eventually got it, and the belly dancer was a nice distraction."], ["Randy B.", "Meh! I'm not a huge fan of Greek food other than Gyros, but I do like a few things on their menu here. Since I'm not a huge fan, I don't think it's fair for me to review their food...But...The restaurant itself is a different story.  The place is small, and in desperate need of an update/renovation! The staff seem friendly and they even have belly dancers to entertain you while you're eating!  Also kind of surprised with the pricing of their menu items.  Seems to be a bit over priced for that part Indy and for Greek food in general.  This is by no means an upscale eating establishment.  Overall, It's not bad, but it's not my favorite place to have Greek food."], ["TJ M.", "Great Service. Gyro was on Point! Would recommend to anyone looking for good food at a reasonable price!"], ["Colin R.", "I have been going with my family since 1987.  It is my favorite restaurant in all the world.  Whenever anyone comes to town I take them or suggest they give it a try.  The current owner is George who took over from his folks when they retired.  He has kept 100% of the charm I remember from my childhood.  The calamari and saganaki are to die for! For added ambiance, go on a Friday or Saturday night when they have a belly dancer."], ["Jeremy K.", "Wow... Well done!!! I wouldn't change a thing. That is saying a lot coming from this foodie!"], ["Frankie S.", "I had a wonderful experience. Our server was great! Our food was great! The atmosphere was great. I loved it. The parking lot is made if dirt so watch your shoes in a rainy day. Great for family dining!"], ["Erica C.", "We came into Greek Islands later in the evening on a Sunday and were blown away by the great service. The staff was personable and kind and the food was amazing. As we were in Indianapolis for a memorial event for a loved one, we were touched by how the team made an effort to ask about our event (we were wearing event t-shirts), offer to get involved in the year to come, and give us dessert on the house! Great ambiance, service, and food. Five stars all around!"], ["Brittany S.", "If Greek Islands Restaurant were a movie, it'd be My Big Fat Greek Wedding - - to a 'T' (shocker, right?)The food is great, but it's the environment and people that have me coming back for more!Greek Islands \"To Do List\":1.) First and foremost, get to know the Stergiopoulos family (brother and sister - George & Angela). 2.) Take a shot of ouzo and join in on the Friday and Saturday night belly dancing3.) Cross your fingers they do the dish-breaking thing4.) Order Saganaki (flaming cheese) for an appetizer because it makes all of the neighboring tables curious/jealous5.) No matter what happens, finish with some baklava love.Opa!"], ["Tiffany B.", "Solid Greek restaurant, friendly staff, parking, downtown convenient. Small, quaint and typically crowded. Great lunch specials. Family owned and operated and food tastes authentic."], ["Jon C.", "The food is always fresh.. No frozen green beans here. The ribeye is the best in town, easily beating out the big name and well known steakhouses. The chicken souvlaki is marinated to perfection with just the right seasonings, and the pieces of chicken breast are as tender as can be. Most dishes range between $15-$20 an are easily big enough for leftovers."], ["Amie L.", "The family hit up Greek Islands for dinner last night. I've been eating at Greek Islands for years, but have never written a review. Here it is...The service and food are consistently awesome. Of course we started with the flaming cheese and hummus/pita bread. I have had better pita bread (Santarini's), but theirs is still delicious. The salad dressing is better at Greek Islands than at Santarini's so it all works out!I tried to keep it a little lighter so went with the domaldes. Their green beans are worth a little special recognition...so damn tasty... Everything was very good and quite filling. I was actually only able to eat half my dinner. Yay for leftovers!My dinner companions had the gyros and the meat pie (they did not try to keep it light). Everyone enjoyed their dishes.Greek Islands is a great family owned business/Indy institution. Give it a try!! OPA!!!"], ["Sally S.", "Always friendly. Always treated like family.   Best Greek food in town without a doubt."], ["Michael V.", "Had great food every time I've been here. Can't go wrong with any selection. Not sure if it is an every day occurrence, but they had a belly dancer tonight. Got dinner and a show. That was just a bonus."], ["Kellyo O.", "I don't get it. I was so expecting to be wowed with Greek food and I was just not. All the great reviews that I made my husband drive across town for...disappointed and underwhelmed.  I will say that the service was very good by our waiter and I loved that the owner was sitting out front on the patio. Let me start by saying that I have had all of these dishes before, the flaming cheese, the Greek soup, the hummus, etc but at the Greek Islands they were all just Meh. Best flaming cheese is Pegasus in Chicago, best Greek soup is Pegasus Taverna in Greektown Detriot, and best hummus is Burning Bush Grille in Louisville. Now don't get me wrong, I was not expecting this place to beat them all out but I was seriously thinking I would get a good mix! The soup was not edible. Both of us tried spoonfulls and left it alone - that bad. The hummus - a mediteranian staple, tasted like ground chickpeas. Exactly like ground chickpeas. I didn't get the flavor of garlic, lemon, tahini, cumin, etc. The tzatziki was ok but very plain yogurty - not much cucumber. Hubby had the gyro plate and said it was fine. The one thing we both thought was really good and saved this review along with the great service  was the Taramosalata. So I don't know what happened the night we went but it was definitely not 5 star food by any stretch. (And I am not taking off for the women's restroom being out of order and having to use the men's and then having to take the top off to flush the (dirty from the employee who just walked out prior to my going in!) toilet because of the broken chain. But I sure hope they have that situation fixed!)"], ["Kelsee H.", "This review is simple. I took a young friend of mine here for our Christmas/New Year's dinner, she's 16 and the PICKIEST eater who is unwilling to try anything new. Needless to say, I think I've created a new fan of Greek food!The Basics:Food = Awesome!Service = Awesome!Friday night belly dancer = Awesome!My suggestions:1) ALWAYS get the Saganaki/Flaming cheese! It's really awesome to see people's reactions to it!2) Whatever the salmon dish is called, get it. So flavorful!3) If the belly dancer asks you to dance with her, do it and take photos. 4) Don't forget dessert, a little piece of baklava is the literal \"cherry on top\" for the big awesome meal you've just devoured. Also worth note, I made a reservation (ONLINE! YAY!) thinking the place might be super packed, but alas, we arrived early and were sat right away! I love it when that happens! I'll definitely be back, there's so much more I want to try!"], ["Marc R.", "Had a great experience here! Excellent baklava and tzaitzi sauce. Additionally, the employees are great fun to talk with and the crowd is often made up of fun and talkative people.Will be going back soon."], ["Tony J.", "Had dinner here last Friday for the 1st time. The place seem smaller than I expected. As or the food, it was good. I had the pork on skewers and the wife had some puff pastry filled  with meat topped with some red sauce on top which was really nice, I actually liked her dish more than I did mine. Surprisingly, though skeptical to order it at first, I enjoyed their chicken orzo soup with just a hint of lemon quite a bit. That I can probably eat regularly. Didnt like the baklava though, I thought the sweet filling was a little on the tough side, plus the portion was a bit tiny. I've had this in other places were the  filling was much softer. Service was good,  the flaming cheese when served presentation is or can be exciting (reminds me of the japanese habachi grill cooking fire show), and the belly dancer was also quite entertaining."], ["Tammy M.", "Opening in 1987 this Greek family run restaurant gives their customers not only the best of truly authentic gourmet Greek cuisines but so much more! They make absolutely certain that their customers are served the best of ingredients that go in their cuisines. While truly everything on their menu is delicious, I am rather partial of the Meat Pie, Calamari, Saganaki, Mama Fofo's famous potatoes & the Spanakotiropita. They review & carefully hand pick the top Greek wines that match with a dish or customer taste. They also offer their customers the ability to indulge in fine beers made & bottled locally from Oaken Barrel and Sun King. Like Root Beer? You must try the locally made & bottled Triple XXX Root Beer! For the tea enthusiast they have their own signature tea that is exclusively from TeaPots 'n Treasures! They also do catering for small to large gatherings; get excited & love to help on fundraisers for worthy causes; and, they even have a belly dancer on Friday & Saturday evenings from 7:30-9:00pm! Some of their customers are so hooked they come in daily; some even lay claim to their own table choice.  I didn't know 4 years ago just how that first visit, that first bite, would turn into my loving not just this amazing restaurant but more than that - the whole family. They are not just a local authentic Greek restaurant; they are a blessing to our community!"], ["Jennifer E.", "On a recommendation from a friend my fiancee and I decided to make a reservation for Friday night. The restaurant was very busy when we arrived, but our table was ready and we were sat immediately. Our server was very friendly and knowledgeable. I also enjoyed that everyone seemed to work together as a team - anyone who walked by the table was happy to refill drinks, grab boxes, or just ask how we were doing. You can definitely tell that everyone works very hard and enjoys what they do. The food was absolutely fantastic. We ordered the saganaki as an appetizer. The saganaki was tangy and delicious. For dinner I had the chicken souvlaki and my fiancee had the pork souvlaki. Both dishes were excellent. My chicken really was out of this world. The seasoning was spot on and the chicken was very tender. Both entrees came with a Greek salad, green beans, rice, tzatziki sauce, and potatoes. There was more than enough and we were able to take some home to enjoy later. I would absolutely recommend this restaurant! You can tell that they value the community - the owners said hello to almost everyone and they knew everyone's name. The food was excellent but it was the friendliness and warmth of those who work here that really made the Greek Islands stand out. You should definitely give it a try!"], ["Greg M.", "After walking by this place several times during Colts games, we decided to give this place a try after a game. The place was not very crowded and there were several tables available. Told hostess we needed a table for 2. She wanted to seat us at a table that was right against a steel support column. I asked her for a better table - there were 2-3 empty tables by the front window so I asked for one of those. She informed us that those tables were for party's of 4 and there might be some party's of 4 coming in. (So was the table wrapped around the support column ??)  Seriously ?? Told her we were  2 for sure customers ready to spend our money here! After her refusal to give us one of those tables (or any others) we left and went down the street to another restaurant. After eating we walked by Greek Island again and there were those tables at the front window; only one table was occupied and guess what --- By a party of 2 !!!Never Again !!!"], ["Stephanie W.", "We went to Greek Islands for their monthly Wine Dinner and it was superb! We really had a chance to get to know our table because there was such a large turnout, we were elbow to elbow. Our table was great, though. We all shared food and stories. The wines were wonderful, for the most part. There was only 1 I didn't care for at the end of our meal. We will definitely do this again. I love the Stergiopoulos family is wonderful and Angela is incredibly welcoming!"], ["Bada B.", "Great food and family dining experience. This is the only place in Indy that will make you feel like family. From the time you arrive til you leave, it is a Greek Experience and I am Italian. The belly dancing is very interactive and family friendly with a very knowledgable staff. Sunday for Colts game is a great time as well and a good place to park for colts game. They have some deal where you pay for parking and get some discount if you eat inside. Also you can get beer to go for waliking to the game and it is not overpriced.OPA"], ["Julie M.", "Been eating here for years and still my favorite Greek restaurant.  My husband and I always order the huge sampler platter, and they even substitute some of the items that we don't like."]], "Adel's Gyros": [["Mike M.", "When you approach the door, you're about 20 feet and $8 away from the best gyro you've had this year. Probably your life.I'm making sure to give them 5-stars to counteract my fellow Yelpers' smoothness that this place is a dump or a dive.It's no frills but very well maintained.The crinkle fries were really good too. Cooked to crispier than average perfection, just like I like them!I'll be back to try their falafel!"], ["Dan M.", "Adel's Gyros is a place most might drive by when you see the outside. Or you may turn around and leave when you walk in. It may not be much to look at but it does serve good gyros and hummus. I had the spicy hummus with pita. The hummus is somewhat runny but has good flavor especially with the chili paste on top. Not really middle eastern but still tasty. The gyros are huge and easily make two meals. Spit roasted, not cooked on a flat top. The tatziki has large chunks of cucumber and is very good. Could use more garlic though. Give it a shot, maybe Adel will use the extra income to renovate the restaurant."], ["Deirdre G.", "Whoa.I decided to come here because it was on the 2015 Yelp Top 50 Indiana Restaurants list and I figured I'd put another notch in my belt for trying to eat at every restaurant on the list. The fact that it was closer to my new office helped out a bit, too. Adel's Gyros is in one of those hybrid strip centers/medical buildings that are designed to look like houses with pillars out front and windows on the roof that don't seem to lead anywhere. I knew once I pulled into the center that the place was going to be a dive, and I was right. You could almost call it a dump, but I feel really mean for saying that. Regardless, the tiles haven't been replaced in eons, the walls are marred with nicks from the chairs, and Greek Orthodox iconography are awkwardly placed throughout.I just looked at the list, and this place is #17. Naturally, the second thing that ran through my head was, \"Then, this food better be a life-changing experience for me.\"Only one man was working; I went in after the lunch rush, maybe 1:30p or so. Two parties were sitting outside and another were inside. I had a difficult time trying to choose what I wanted to eat because everything sounded so good. Remind me the next time I go to try their spanakopita, dolamities, baklava-- oh, screw it, I'm going to make it a point to try everything on their menu!I ultimately decided to go with the falafel and it was really amazing, served on a bed of pita bread, tomatos, onions, and cukes with hummus and tzatsiki on the side. I'm pretty sure it was supposed to be eaten as a sandwich, but no matter how hard I try, I can never keep all of my fillings in my tacos, so I ate them all individually.The falafel itself was piping hot, so I managed to get through one of them before deciding to eat my veggies. In that time, they were still warm, but bearable to the touch. The falafel were crispy on the outside, but not super crunchy like some are, and the pita, hummus, and tzatsiki were clearly homemade.So the four stars is attributed to its shoddy decor and ambience, but honestly I think their food more than makes up for it. I most certainly will be going back and will more than likely try everything on their menu."], ["Huong T.", "Huge portions and the owner is so charming. Small local business, it took awhile for our food,  he needs kitchen help, other than that,  pretty decent!"], ["Jill O.", "Best falafel, gyro, spanakopita, baklava we've had!  Adel is so kind and generous.  Not much in the way of atmosphere, but great for takeout or a quick bite.  The spicy gyro is the best!"], ["MJ W.", "Adel's Gyros are legit.  Adel is a great guy and very welcoming, he tried to talk me into the spicy Gyro, but I wasn't ready to take the dive.  I thoroughly enjoyed the Gyro and the tzatziki sauce was the best part!  It was fresh and had a unique taste.  There is plenty of meat so you will go back to work satisified.  I'll be back soon."], ["Ian H.", "On my second trip here, I had the gyros sandwich - spicy. It is by far the best gyros one can get in the Indianapolis-Carmel metro area. Highly recommended. On my first trip about a year ago, I had the falafel and hummus, also spicy, which were both delicious, though not the best I've had (coming from a Jewish family, our homemade is hard to beat!). I would definitely say that the ambience and overall look of the restaurant is run down, but I think this might benefit it due to the low prices, quick and friendly service and traditional look of a Greek dive restaurant (there are Greek flags and Greek heritage photos throughout the store). My only problem is that I felt the store might not be clean due to the fact that it is indeed run down. 4 stars."], ["Katy K.", "This tiny little hole in the wall is my new favorite.  Service goes a long way, and Adel is the sweetest little Greek man you'll ever meet.  He was kind enough to let us sample the lamb meat and later treated us to baklava (holla!).  I can confidently recommend both of them.  You won't be coming for the decor, but you'll be staying for the food and the service."], ["Christina T.", "I have traveled all around the US eating Gyros every now and again,ADEL'S has the best Gyro sandwich....Can't wait to try their other dishes."], ["Saher H.", "This place is delicious. Has never disappointed and everything is fresh to order. Brought my brother here for his first time and he loved it, too... Trust me when I say, you will not leave hungry!  Highly recommend!"], ["J D.", "You can't go wrong with a gyro from here, pretty much family run. Lunch time has been really busy lately, article in the paper. So call your order in it go at off times if your not in a rush... Well worth it!"], ["Jennifer G.", "So I live in Ohio, and found this place thru Yelp while  visiting Indiana, now I must stop here every time I'm in the city!! Delicious spicy gyros, fresh pita, and the service directly from Adel is awesome. Tho I'm not a fan of the fries, the gyros and service more than make up for it! Locally owned, small and authentic, I highly recommend!!"], ["Zs B.", "This is one of my favorite locally owned little restaurants. Adel is very friendly, hard working (he basically runs this place by himself, working here six twelve hour days a week), always has a smile on his face, and is extremely generous with his food. Is it really so important to complain about the decor when good food is served by a friendly owner?"], ["JT C.", "Wow! Such a simple menu, but awesome. Best gyro ever and they give you ample food for such a reasonable price. I couldn't eat it all. This was over 5 hours ago and I'm still stuffed. Definitely recommend."], ["Lisa w.", "This is my first review on Yelp! I just got carryout from Adel tonight. It wasFabulous, best in Indy!! I'll be back and back again!"], ["Ron R.", "I love love love this place.  The owner is super nice and always loves to have a chat with you.  The portions you get are massive...easily splittable with 2 people and if you order hummus on the side, get ready to get a Costco helping.  The only concern I have here is the price.  For a gyro and a side of hummus...it was $15.  I understand the portions are huge, but maybe have a smaller portion option for a smaller cost?  I would be perfectly happy with half of what I get.The menu is a bit limited with Gyro, Shewarma, and falafel being the main options so don't go expecting variety other than the normal staples.Also, maybe work on some decor.  Great food can only get you so far and I can't very well give this place a full 5 stars until it is a more complete package.In the mean time, I will enjoy this place everytime I get a hankering for a Gyro."], ["Arturo T.", "You may pull up to the place and think to yourself here? And the answer is yes! I'm in Indi. For a couple of days working and had a craving for a gyro and this place did not disappoint. Packed the meat high, and was very flavorful.Now I'm not sure if the gentleman who helped me was Adel but he was very nice and had a great smile. Will come again if I ever make my way back to this area."], ["Anne D.", "I wondered over here after picking out my annual flowers at Rosie's Garden next door. So glad I did!The gyro was fantastic! I ordered it spicy-- it was perfectly delicious and large enough that the other half will be my dinner. Perhaps the best part is that the owner, Adel, took my order and is the nicest, most welcoming man.I'll definitely be back!"], ["Nolando T.", "I swear I wrote an update for this place and it's miraculously gone. Oh well...I get to write another one. I was upset my first visit here because they were closed at least an hour before they were supposed to be. But I decided to give them another chance and I'm glad I did. I ordered the spicy gyro and HOLY COW! I opened the Styrofoam container and there's was a buttload of meat in there. Seriously, nearly the entire tray was meat. And the meat was gooooooood. Pretty tasty stuff. And their tzatziki is good stuff, too. Don't expect a nicely decorated location, because you won't find that here. It actually sort of looks like they're in the middle or remodeling...but they're not. It's just really like that. This really is what I think of when I think mom & pop. But who cares! The food is good!  So go here to satisfy your Greek food fix. Just be sure to go a couple hours before closing...because otherwise, they might be closed."], ["CarrieAnne B.", "I tried the Spanakopita on my last visit & really enjoyed it!   I usually order the gyro & am absolutely stuffed after leaving (that is if I try to finish it all) but this was a nice change of pace & served with a nice large side salad.  I don't really care for lettuce but the dressing smelled good so I tried a bite.  I'm not sure if it was a standard Greek salad dressing but it made me wish I could tolerate lettuce.  My husband was more than happy to eat the salad & gave me some of the hummus that came with his meal (the regular shawema).  We also had some baklava to go....mmmmm baklava!!I'm wiling to bet that had I known about the salad & asked for a different side Adel would have been more than happy to substitute it for a bit of hummus...he's just THAT nice!  :-)"]], "Sero's": [["Mike K.", "its like going to grandmas for dinner"], ["Richard P.", "I'm sure you've heard of the concept of \"comfort foods.\" \"Sero's Restaurant\" in Cumberland, Indiana is a \"comfort restaurant,\" a Greek-American eatery with a wide variety of different food types and a strong feeling of \"small town diner.\" I was in the mood for a \"comfort restaurant\" this evening after a long week at work. While I knew I wouldn't be considered one of the \"regulars\" as I don't live in a small town and don't often find my general neighborhood in search of a meal, there's just something about a laid back small-town diner that makes me smile. I'd wanted to try this place since the days when I drove by it on my way out to seminary in Richmond, Indiana. As I pulled into the parking lot, I noticed that they had one defined accessible spot. It had the wheelchair symbol on the concrete, but not the actual sign (Which, in Indiana, means it's not legally enforceable). There's a ramp that leads up to the front door, though you should be aware it's not completely ADA compliant in terms of its grade. I didn't have any problems with it, but someone with strength issues might struggle a bit. The cashier/hostess area is right inside the front door and I was greeted promptly. To your right, there's a main dining area and there's a secondary dining area with a television further to the back. I was seated at the very first table, though it was a spot that made sense. The restaurant wasn't crowded yet as it was early in the dinner hour. Those who were present appeared to be largely an older group of folks that included both singles and couples. They appeared, for the most part, to be regulars and were obviously being treated as such. While I wasn't quite in the clique, I was still treated well and I enjoyed watching the relationships that staff had with the diners. I wrestled quite a bit with what to eat, but found myself inspired by good friend Rick Garrett, also known as the Tenderloin Connoisseur, a blogger who specializes in that great Hoosier delicacy. So, I ordered what was billed as the \"Giant Breaded Tenderloin.\" It came with either fries, chips, cole slaw or something else I've completely spaced. I added fries to it along with an unsweet iced tea. I have a feeling that The Tenderloin Connoisseur would find this to be a disappointing tenderloin. While it certainly is sizable, that's not exactly rare among tenderloins and I've definitely experienced bigger sandwiches. The sandwich was meaty, but there was just something about the taste that was a little off. I looked at the meat and it just didn't seem right. It wasn't a bad sandwich, but by the end of it I was more than happy to be done with it. The bun was slightly toasted, but it tasted like your generic bun and was a bit too crumbly. The french fries were standard American fries that, once again, were neither good nor bad. The sandwich and fries costs $9.99, which seems a tad high for this kind of place. That said, I did see a number of other sandwiches available from $5.99 - $8.99 or even full meals for decent prices. My server was attentive, but while she offered me dessert she never offered me a refill. As an iced tea addict, I found this a bit disappointing as at least one refill seems fairly standard. If I could, I'd probably rate Sero's smack dab in the middle with a 2.5 star rating. It was practically the definition of an average meal. That said, even with my disappointment with the tenderloin, I found myself feeling like this was a decent yet disappointing meal with friendly people as staff. That said, I live not far from another similarly themed local chain, Lincoln Square, and my experience at Sero's was certainly not good enough to become a destination spot. If I happen to be driving by it and am hungry, I'd definitely stop but I'd also definitely not order the tenderloin again."], ["Lee S.", "Very busy yet prompt service. Hostess was seating others so waitress jumped in and showed me to a table.  Wide range of menu options.  Lumberjack B'fast: eggs cooked perfectly as ordered; grits (substituted for potatoes) thick & creamy - also a nice portion; large portion of biscuits & gravy was nicely flavored & creamy with ample sausage pieces. 2 split biscuits were soft and toothsome. All in all a nice meal with no hiccups."], ["J.c. W.", "Stopped by for dinner as I was driving by, and I was not disappointed. I was surprised that they had so many daily specials. I chose the Sero's Fried Chicken with mashed potatoes and corn. This was exactly the comfort food I was looking for. The service was friendly, and I expect that if I lived closer, I'd visit often. It seems like most of the guests were locals that the staff knew by name. This is the kind of restaurant I like to hit. A local place that keeps America going. Only minor negative was that the glass of water didn't taste exceptionally good. Thank you for a great experience."], ["David B.", "Breakfast is on par. Prices are a little tall but the selections and portions are legit.  Good enough that we wanted to try dinner. We probably wouldn't do another dinner. Authentic Greek feel down to the bad eyeliner, QVC on the TV hocking gaudy jewelry, and guy in the first booth jabbering away on his phone. I had the Greek combo. A pile of onions tomatoes and a few cucumbers with some pita, feta, meat, and an overcooked chicken portion. For a starter I asked for a salad and soup. Salad dressing was so separated all I got was oil and the soup was supposed to be beef and cabbage.  With no beef in sight it was all cabbage and tomato skins. Our entree was about 30 seconds behind my soup and salad, and my kids' chicken tenders were served straight from the fryer at an unsafe temp. The server was nice but the food quality was on par with a school cafeteria. The prices leave more than enough margin to have some quality, but it wasn't there. Shop Greek at GFS or Sam's and save your money. On a positive note, the spanakopita was probably great when they made it Monday, but they served it to us on Friday and it was hardly suitable as a coaster for my drink."], ["Andrew M.", "My family and I went to Sero's for breakfast one Saturday morning, and it was packed, so we thought it must be good. All I could figure was that the crowd is mostly made up of regulars who just go to the same place all the time. The price was too high as compared to Lincoln Square Pancake House. The pancakes were chewy and tasted like they had dish soap in them. I couldn't finish mine. My kids liked their chocolate chip pancakes, though. The eggs and bacon were very greasy. Coffee was also oily / acidic. Service was below average, but they were very busy at the time. As Kevin said, the decor is way outdated, and the place felt dirty to me, like there is a coating of dust and fingerprint smudges over everything. I definitely do not recommend Sero's. Drive farther to the East and eat at Lincoln Square Pancake House. You won't be disappointed."], ["Audrey K.", "I used to work a couple doors down from here. I like to eat local and the girls in the office all raved about it, so I figured I'd give it a go. My roommate and I went in for breakfast. They had cartoons on the TV's going too loud and the service was terrible. The server messes up our drink orders and when the food came out of the kitchen it wasn't what we ordered. I don't mean like we got another table's food. I mean it was almost what we wanted, but not close enough to eat it anyway. The food was fairly lackluster.A few weeks went by and the boss decided to take us there for lunch. I couldn't even tell you what I ordered because it was so wrong. So very wrong. I sent it back and it came out wrong again. Finally I just resolved to not eat lunch that day."], ["Justin S.", "Good looking, inviting exterior.  Seros' building benefits from the upgrade to the Far East Side portion of East Washington street.   Yet, it has a funky entrance as there is only 1 door in and out.  The hostess and cashier is right at the front door and human log jams easily form.--Visits to Greek breakfast/lunch dining establishments trigger either a desire of corned beef hash with poached eggs or the mutated form of what Hoosiers call gyros.--Why do menus need to be so large?  It's perplexing and must be difficult to prepare all the dishes to a delicious standard.  Up to the task?  I hoped to say yes.  Yet, the hash was lacking flavor.  Why, oh why were 2 slices of fake swiss cheese on top of the hash and below the poached eggs?  All this on stale \"American fries\".  At least the eggs were cooked to standard.Bottom line, decent place to sit down if you're very hungry."], ["Kevin B.", "Sero's is just not good. The decor is old and dated, the layout is strange, and the lighting is too bright. The menu - too many items; the Friday night special list had 15 items! I had the special prime rib for 14.95 and my wife the gyro for 9.95. Prime rib was tough and not good: the gyro was a tad dry but ok.I drive by this place almost every Sunday morning so it must be good for Breakfast!"], ["Tom C.", "Excellent food and good service. It has a small town diner feel. Daily specials for lunch with good size portions .they specialize in greek food but they have a full menu and everything i have had is great."], ["Brandon D.", "I have given this place a few tries. I just don't care for it. Given the atmosphere inside the restaurant, I either expect prices to be lower or (considering the prices) the food to be much better. It has just seemed overpriced for what I've gotten there. I don't recommend it."], ["Ronee B.", "Family restaurant on the Eastside. I ordered a giant tenderloin and it was pretty freaking large. I have an endless pit of a stomach so it totally went into my belly! The food was hot and came out quick. The place isn't anything special. You can get this food at any local family restaurant.  I didn't hate it but I didn't love it, it is just 'eh'."], ["Katey R.", "I don't know how I feel about this place.. I have been here twice and i lived near here for ten years. With that being said something keeps them in business. Breakfast is okay but dinner isn't good at all. No bread they bring you a few packs of crackers that look as if they have been crumpled by every hand that's been in their. There is nothing special about their \"special\" fried chicken! Mash potatoes plopped on the plate shaped like a scoop of ice cream and mixed vegi from a can! Yuck! And over priced! Never again!!I liked the Boston cream cake that's why I gave them two stars, however not enough to keep me comming back.. sorry keep cruising down Washington st, better options await you!"], ["Jack T.", "I did not want to give this place a bad review but the food just is not that good!The service is hit or miss most of the time but the food is overly processed and bland at best.I ordered a big cheeseburger which tasted like one of those ready made patties at walmart that you microwave. The cheese tasted terrible like an Aldi's brand slice made with vegetable oil. My wife ordered a mushroom and swiss burger. OMG! The mushrooms were canned and slimy and the swiss cheese had no flavor.Some of you reading this might think I am being too harsh but If someone thinks that the food here is good, The food at home must be awful!I used to work for Gordon food service and I know that this place is a big customer. The food is short order,processed, and devoid of flavor and originality.I see lots of Cumberland police officers eating there. I feel sorry for them."], ["Robert G.", "I order from this place a lot. Their soups and sandwiches are great. Their  omelets are 'out of this world' awesome! Their portion sizes are very good and they have great customer service over the phone for carry out as well as dining in."], ["Heather H.", "I dig having a greek diner right around the corner from my house.  The first few times I came here, the service was sketchy - I felt that I received a different level of service because I wasn't a regular.  I can understand treating regulars like they are VIPs, I get that, but what I don't get down with is not even smiling at the people who are not.  It had actually been about a year since I had been here as the borderline rude service had scared me away, but I went there after visiting the Cumberland Farmer's Market on Saturday for breakfast and the service was awesome!  I don't know if they've had some staff turnover in the past year or what, but the server was friendly and the waitress was excellent.  Good service is particularly important to me at breakfast, where I am the reigning Beverage Queen and require a constant supply of coffee, water and orange juice.  This lady was on it with all three, and didn't give me a shitty look when I ordered this large array of liquids.  The food was also very good - I ordered eggs over medium, potatoes and toast.  The eggs were cooked perfectly, which is really important with over medium - I want a runny yolk with completely cooked whites.  I'm genuinely thrilled that the service has gone up so much here.  I'm a huge fan of going out to breakfast, and it was a bummer to drive by this place to go to another.  Maybe soon I can start being one of those regulars I mentioned!"], ["Patricia N.", "Extensive diner menu.  I came here with my family for lunch.  I thought it was pretty pricey for some mediocre food.  But the lunch specials taste great and are offered at a much better price.  I'm hoping to try out their breakfast menu next time."], ["Justin N.", "These 'Ma and Pa' type restaurants are great at Sero's fits the bill just fine. Going here the first time the service was excellent. The server was on top of things at all times. My second visit wasn't the case so much but certainly not the worst service I've received in a restaurant and the server was more on top of things once I got my food. The food itself is what you might expect at a place like this and the price is about average.  Alot of Greek entrees as well as a vast variety of American cuisine. Sometimes places like this have things on special for a cheap price. I didn't notice that here but maybe I missed that. The restaurant itself is clean. Overall I think this is a great place in the Cumberland area to fill up!"], ["Lance D.", "My wife and I come here for breakfast often. Good food, friendly staff. The Greek skillet is my favorite. Been there for Dinner a few times and I like the breakfast much better."]]}