{"India Bistro": [], "Shalimar": [["Shelby J.", "Yum. So pleasantly surprised.This is a solid restaurant. I had been missing Indian food since moving to Indiana, and this surely hit the spot. Their House Special Biryani, Chicken Tikka, Lamb Saag, and Saag Paneer are all tasty. Also the Paneer Kulcha Naan and the Garlic Naan hit the spot.This review is based on dinner service, as I have not been able to make it for the lunch buffet. The service is always pleasant, and timely. Even when in a rush. I will definitely be back."], ["Jay J.", "Food looks like indian but it doesn't taste indian . We ordered hot non veg thali but it was tasteless no salt.. Giving 1 rating becoz water is always full in glass"], ["Rick G.", "Shalimar is a good, solid restaurant that has earned my repeat business.  The service has always been outstanding, the price is far for the amount of food you receive, and the menu has a lot of choices.For the price conscious, the lunch buffet at 7.99....even on Sunday, is the way to go.  Always a nice selection of food.  Just keep in mind that it might get quite busy at lunch, but that way the food on the buffet turns over quite quickly."], ["Ariana G.", "Always love shalimar. The service, standards and quality of food is constantly high. If you like spicy they will actually make it spicy. Authentic as as far as a white person can tell. Can't say enough good things."], ["Joel M.", "Shalimar really dropped the ball on our first visit.  My wife and I LOVE Indian food and we thought we couldn't go wrong after hearing good things about this Broadripple spot.  I'll just say it out front if you don't want to read the full review - the service was absolutely horrendous and the food didn't come close to making up for it. We were immediately seated in the front, and about one minute later another couple was seated next to us.  We put in our full order after about five minutes, which was pretty basic - Tandoori Chicken, Vindaloo Curry, and some Naan.  The other couple put their order in about the same time. Over the next hour, we watched the other couple receive their food, eat their food, eat dessert, get their check, pay, and happily leave the restaurant and drive away BEFORE WE GOT OUR FOOD.  Keep in mind we have the same waiter and he walked by our table 15 times during this process (we didn't get drink refills during this time either).  He finally came by to ask us how things were going...um, not well.His excuse was that our order was made \"to-go\" instead of for dine-in, but either way he should have been checking on us and realized something was wrong after 5-10 minutes, not a full hour later when we we're both pretty pissed and hungry. I will say they adjusted our check (one free dish) and most of the other patrons seemed to be getting good service, but our service was unacceptable and I cannot recommend this place based on our experience."], ["Krista R.", "Meh.Still eating our first plate from the lunch buffet, we were informed to hurry and get our second and last plate before they closed. When we got up a few minutes later, another waiter gruffly told us the buffet was closed. I understand that they close at 2:30...but please wait to close down the buffet until your customers have all had their share. We were the only 2 there -- we weren't going to slow them down too much. Stop taking customers after 2:00 or so if you want to empty the restaurant by 2:30.Food was average. The paneer butter masala was below average, and the pakoras were incredibly salty."], ["Amie L.", "This is by far my favorite Indian restaurant in Indianapolis or the surrounding burbs. I  go for lunch (once a week)  and alternate between the buffet ($7.95) and the Indian \"chili\" AKA Paneer Masala ($9.95). They have (to die for) mint sauce and mango chutney. Slather it on some garlic naan and whoa...heaven. The staff is very friendly and consistently accommodating. I've had take out as well and thoroughly enjoyed my meal.Give it a try...you'll love it"], ["Emily C.", "This was our first time here and it was a really good experience. We will be back!Service 5/5We went on a Monday evening at 5:30 PM so the restaurant was nearly empty (there were a lot of take out orders going out though). Our server was very friendly and attentive. I'm not sure if this was because there wasn't much else to do since there was only one other couple dining there. We'll see how it is if it's busy next time we go.Atmosphere/Ambiance 3/5Clean and pleasant but nothing special.Food 4/5They started us off with a basket of tasty papadum. I then ordered a cup of their coconut soup which was good. I was expecting a slightly stronger coconut flavor but I still enjoyed it. The coconut was chopped very fine so it had a really nice texture. For dinner I ordered the Chicken Makhani and my husband ordered the Paneer Masala. The waiter asked if we wanted the spiciness level to be mild, medium, hot or very hot and we both chose medium. Everything came out piping hot and were very generous portions. We both liked our entrees, my husband liked mine a little bit more than his though. I would say mine was a bit more bold in flavor than his. The entrees were served with a spicy pepper chutney, although we are wondering if that was supposed to have come out with the chips at the beginning. In any case the chutney was amazing! The level of spiciness of the Makhani was good too, if I was in the mood for spicy food I could have gone for the hot.Overall 4/5 We also got a stamp card...1 stamp for lunch and 2 stamps for dinner. After 10 stamps you get a free entree (of $10 or less)!"], ["The Yelp-inator W.", "Pretty good Indian Buffet,Not the best....but definitely worth checking out Great Servicedelicious dishesOK selectionOK atmosphere."], ["Natasha C.", "Went there with some friends last night & loved it! Highly suggest the Chicken Tikka Masala! Service was great :-)."], ["Jessica W.", "I love Shalimar!  The food and service are fantastic.  Even my honey,  who despises curry, loves their food."], ["Meg E.", "Best Indian food in town. Their lunch buffet is great, especially if you're new to trying Indian food and not sure what you'd enjoy best. Their chicken tiki masala is delicious and buttery, great over rice. They have the best naan bread and for dessert, I'm not sure what they're called but they're like donut holes in a sweet honey sauce, mmmmmm. A must try!!"], ["Theresa K.", "Shalimar is pretty good. I'll make it that simple. My first choice is India Garden, but Shalimar is good, too, and with India Garden so close, I don't too often. We were going to go to India Garden, but after struggling to find a parking spot there, I suggested we just go to Shalimar. We were in the mood for some Indian, and we would for sure find a parking space in front of Shalimar on a week night. We did- right in front of the door. And there were maybe three tables occupied. I noticed after sitting there for awhile, they probably get just as much, if not more, carryout business than table service. At least that night, they did. It was a bit awkward because while there were only three tables occupied, the server was rushing around like mad, knocking things around in the backroom/kitchen area when he went back there. While he didn't talk a whole lot, he was seemingly friendly.I ordered the Chicken Korma, and when asked about my preferred spice level, I said hot. I don't know that I've had Chicken Korma. I really enjoy Tikka Masala (along with probably every other American, I assume) and the Chicken Vindaloo. I decided to go with the Korma. I had a couple pieces of chicken that were fairly gristly. The bigger chunks were much better. The spice; however, I can't say was even medium- It was more on the mild side. Shalimar does give a frequent diner card- Pretty cool."], ["Michayla S.", "Awesome Indian food. Their garlic naan (and regular naan,too) is so good. My favorite entree is their lamb curry. It's the perfect amount of spice. I would also recommend the mango lahssi. It's a really great non-alcoholic drink. The lunch buffet is a great value. It has all the entrees that I really like and tons of veggie sides, too. As long as you like Indian food in general, you'll find things you like there. They have milk balls for dessert that are incredibly good. Service is very good, and this place is great for carry out. We do it a lot, and the food holds up at home."], ["Kyle B.", "Food is great, price is fair, and staff is friendly. If you are in the broad ripple area for lunch, this place is worth checking out. Shalimar offers a stamp card that can be used at all 4 of its locations, which can be redeemed for a free lunch buffet after you have purchased nine. This goes by fast if you are dining with another!"], ["Kevin M.", "Awesome Indian food! Great vegetarian options. We ordered the nr. korma and the B. masala. Both were delicious. The garlic naan was decent but the service was very fast and friendly and my water glass never reached empty which was quit impressive considering the water glass were small. We will definitely return."], ["Brandon S.", "I would love nothing better than to write a spectacular review of Shalimar... but sadly this is not the case. Now I have not had the chance to try the buffet, which is supposed to be dazzling, but I did have dinner. Did I expect it to be better than India Diner on the Southside or India Sizzling on the Northside? No, I expected it to be on-par... but it was not :(First off - Garlic Naan... I love this stuff... but it was full of cilantro. What? Cilantro on naan? Yeah. Second - the Chicken Tikka Masala contained mostly mediocre but tender chicken with a taste bearing an extreme resemblance to chicken nugget... minus the breading. Third - biryani... my favorite Indian dish spiced HOT. There was just too much going on with the biryani. Green beans, corn, potatoes, various meats, lots of onions, oh and cilantro... it was good but not on par with the other biryani... hard to explain what exactly was wrong about it. Let me say this, I like my biryani to be uninhibited... this biryani was chock full of everything in the kitchen."], ["Ashleigh A.", "My favorite Indian restaurant in Indy, I always go for my birthday! The lunch buffet is fantastic. Chicken Tikka Masala is my favorite, the samosas, the rice, my boyfriend likes the lamb, it's all good. And one of the only places in Indy where the gulab jamun are served warm (I don't understand the places that serve them cold!). Prepare for a nap afterward."], ["Diane E.", "The thing that I love most about living in Broad Ripple is the plethora of restaurants in the area.  If you ever go hungry while living here or visiting here...it is your own darn fault :-)After my daughter and I spent 3 hours at Splash getting her hair done and my facial, we were starving...we started to discuss what we were in the mood for and we both said at the same time:  Indian food!!!We then called my daughter's husband and he was fully on board.  My daughter called up their menu on her iphone and we quickly decided on Chicken Curry (SIL), Shrimp Curry (Daughter), and Lamb Saag (Me) with an order of Garlic Naan.  The food was delicious...but beware...Hot is REALLY hot.  I usually get Medium until I've been to a place a couple of times to gauge the 'heat'.  I'm glad I did because my Lamb Saag was a perfect spice level.  The red chutney that came with the naan was very spicy.Paired with a bottle of French wine that we picked up from my house and the three of us had a very enjoyable meal together."], ["Mark V.", "Not much to say on Shalimar Restaurant.  Been around for a long time and does a great job with serving some of the best Indian food in Indianapolis.  So glad it has stayed in business all these years.  It seems to me we have had an influx of poor quality Indian food restaurants in the last few years.    Great job and some of the best garlic Naan I have ever tasted.  Service is always top notch."]], "The Clay Oven": [["Dawn M.", "Indian food and cricket are the two things that my British spouse misses most about the UK. You can imagine our surprise when we had lunch at The Clay Oven. Not only was the lunch, including heady cups of masala chai and mango lassi,  incredibly flavorful but the owners love of cricket equalled ours!There is a great lunch buffet on Sunday and many vegetarian and vegan options. My son says that the chicken Tikka masala is great and is the goat curry. I loved the aloo baingan  (potatoes and eggplants). The naan is cooked to order and comes out piping hot.Do yourself a favor, whether you are a seasoned foodie, or a first time novice,  try The Clay Oven to experience wonderful Indian food."], ["Jaime C.", "Ugh I always hate leaving reviews without photos but after the very long wait for my food I was very hungry and couldn't contain myself so apologies :)So, like I mentioned, very long wait. Long wait to be seated, long wait to order, long wait to get drinks/food... You get the picture. There was also gnats all over that was very unappetizing and the bathrooms were needing a lot of attention. Besides all of that, this place could had gotten a 4 or 5 star from me for the food because it was delicious And the prices were fair. I will be going back but possibly order take out next time :)"], ["Jen F.", "I hate buffets.  I just do.  It's not you, it's me.  I phoned before we stopped in for lunch to see if you could order off of the menu and, yes, that was available.  So we went in, but decided to take a look at the buffet before ordering.  I have to tell you, it was so fresh and looked so good, we got it.  The buffet was delicious.  The cold salad and chutneys were great.  The hot entrees were delicious and I was able to try a few different things.  The bread was brought fresh to the table.  Service was quiet, but fine."], ["Anthony A.", "Aaaaaamazing food chicken cauliflower dish tease almost like cheese broccoli soup. Also has the friendliest staff I've ever encountered at a restaurant. Remembered me and my family since the very first time."], ["Robert B.", "Maybe the best Indian food outside of Delhi. The butter chicken and lamb vindalu are spectacular. The buffet is only lunch on the weekdays."], ["Amber P.", "I've had a lot of Indian food in my life. In fact, I went to London and visited the Indian Mile there. I saved the business card from the place I visited there so I could return when I go back to London. The food was delicious. I'd not found anything even close to comparable back in the states since my return in 2011. Three years later - enter The Clay Oven. This place was amazing. We visited during lunch and got to sample a lot of the foods from the buffet. The flavors in ALL of their dishes were just phenomenal. The only thing I would say is that the rice on the buffet should be changed more frequently so it doesn't dry out."], ["Preeti M.", "Zero was not the option given else I would have rated this restaurant zero...no one behavior ( especially restaurant owner and his servent) good their seems like they vent out thier frustration on customers. ..and they eavesdrop the conversation too ..it was seriously annoying. .Now comes to food....its yukk there. .you feel like leaving everything behind..please do not go there to waste your money"], ["Amie L.", "Friendly owners, flavorful food, relaxed atmosphere...I love you Clay Oven. This is our newest go-to Indian restaurant. We've had around 20 different menu items. We've eaten in the restaurant and carried out. Everything we've had has been amazing. The standard Butter Chicken, Chicken Biryani, Chicken Vendaloo are all on point. I think my current favorite is the mango chicken. Slightly spicy with a sweet twang. Their samosas are really good too. Ask for mango chutney to go with them. You won't be disappointed. They make a tasty mango lassi and also serve Indian beers and wine. We've had the merlot a couple times and have really enjoyed it. I don't even like Merlot, but the one they serve is hard to pass up. The little sugar syrup donuts are soooo good. The rice pudding is also worth trying. Oh, and some of the best garlic naan we've ever had.We have not had a bad experience. This food actually has flavor and they will provide you with the right level of spice. So many places tone spice down for American pallets. Not here. You get what you ask for and I love that. The owners are always on-site and very personable. They only offer a buffet for lunch - no menu ordering. We tend to lean toward menu ordering so have only had the buffet once. It was good, but not as good as customizing your tastes on the menu.We have not been to another Indian restaurant since trying The Clay Oven. It's that good."], ["Vasu V.", "The worst food I had in Indianapolis..... Never ever try Goat biriyani... Don't know how they name a dish as biriyani which is not even 10% equal to normal biriyani.... I will definitely restrict my friends going here...."], ["Samuel H.", "Very happy with our choice of the Clay Oven. ..food was fast..and actually better than expected.and staff was very friendly ...will deff be going back ...!!"], ["Paul M.", "Normally my favorite Indian food around, today I came around 2 a little later than normal. I am not sure if the food tasted good or not because I could not bring myself to eat it. There was a nice firm crust formed over the sage and much of the other food looked unappealing as well as if it had been sitting there unchanged or un stirred for the past three hours. Pretty disappointed with today's quality."], ["F Dane W.", "The lunch buffet is pretty good. I would like to have seen more than 2 meat dishes but overall I was please. The carrot stuff (sorry I don't know the official name lol) was amazing."], ["Mark V.", "The Clay Oven was a let down!  They are a little on the expensive side, and the food is not worth it.  I went there for the weekly lunch buffet which is $8.99.  I was the only one there which should have told me something.   The good:  the inside is nice and fairly clean.  The Naan was good but everything else was just OK.  The main thing for the food is the seasoning.  This place is on the bland side.  The positive is that it will appeal to individuals that want their Indian on the bland side.  It is a fairly small selection of items, but should have a little something for everyone.  The wait staff was attentive.  A two for the food and price and a four for the service and décor.  This is the reason for my three star rating.If you are bored of chain restaurants and think for yourself and are not manipulated by millions of dollars in TV commercials to make yourself believe you have to eat average to below average overpriced food at some chain restaurant, I am one of you.  Let's all keep supporting the true food scene in Indiana."], ["Stephanie W.", "Words cannot express how much I love this place. Best Indian Food in Indy hands-down.  This place is a treasure. Great service, amazing food, clean, and priced nicely. The server made sure we did not need for anything. My husband and I always walk out happy. Chicken Tikka Masala is my favorite. My husband loves the fish tikka. We also frequently get the dinner for two, which I highly recommend for first-time diners."], ["Douglas W.", "I was around for the lunch buffet and was really pleased by the selection of vegetarian items.  Not just a bunch of channa and lentils either. Dishes with actual vegetables in them.  I thought the spice level was good throughout all the dishes.  They had the best gulab jamun that I have ever eaten anywhere."], ["Amanda B.", "Decent. I went for lunch and the buffet was good...mild, but that's normal for a buffet. I've definitely had better Indian food, but it's decent. If you've never had Indian before the buffet is a good introduction to a number of dishes. I was a little disappointed in the service. We stood by a hostess stand for several minutes with no one speaking to us, then finally just wondered up to a woman and asked if we just seat ourselves. She gestured towards a table and walked away. We finally just went up to the buffet and after bringing our plates back had to ask for water, napkins, and naan. It took a little while to get them and each were delivered one at a time-plus I actually had to ask for napkins twice. To be fair she seemed to be the only one doing anything, including taking phone orders....but I don't feel as if understaffing should be my problem, they should have enough people to properly serve customers. Thankfully it was a buffet where you mostly serve yourself. I would probably eat here again, but with all the other Indian options.....maybe not."], ["Amanda V.", "Our first time at an Indian restaurant and we loved it!!! The server was great!! Knowledgable and helpful!!! We loved the food!!!! And beer!!!! Worth a try!!"], ["Jacqueline V.", "2 of my co-workers & I went for lunch yesterday.  It was soooo delicious!  Going back for more today. Thank you to coming to Indianapolis with your wonderful cuisine!!!"], ["Adam G.", "If I'm eating Indian food, its from here. The owners treat you like a friend, and feed you like you're family."], ["Erin C.", "Hands down my favorite restaurant in Greenwood (well.... it's tied with Yats). The Indian food is too DIE for, it's spicy, scrumptious and all around heavenly. The staff is extra courteous, always eager to accomadte special needs or questions. The biggest draw is that they have a pretty huge vegand and vegetarian menu (which is a rarity in Johnson County).The location is small which makes it appear even cozier and perfect for date nights. I can't recommend this place enough.Also, the garlic naan. Eat it, eat all of it!!"]], "New India": [["Julie T.", "Food was tasty. There is a lot if selection. Even mutton curry. The dessert needed replenishing, but the service was excellent. There is a grocery store next door too!"], ["Allen M.", "Our favorite place to get Indian food. The dinner is only $9.99 and has a lot of tasty options!"], ["Sai K.", "I have tried their buffet and it is in no way close to being good. The rice is lumpy, the chicken tikka masala is tomato-ey at best. Their naan breads however, are made well. The only aspect which works in this place's favour is their low price point."], ["Aashish J.", "I did a delivery from here during a business trip. From what I ordered, I came away fairly disappointed. The only thing that was good was the samosas. I also ordered the palak pakora and they had been over fried. The biggest disappointment was the vegetable biryani - it was basically rice, vegetables in tomato gravy!"], ["Caitlyn R.", "I was extremely disappointed with my take out from last night. Even though it was prepared very quickly when I ordered around 8pm, I suspect it was because a large majority of it wasn't fresh and had probably been sitting for a while. When I went to pick it up, I should have taken the completely empty dining room as a sign to stay away. However, this restaurant is close to home and I had a craving for Indian food. My boyfriend indulged me and he ordered the chicken vindaloo and I had the non-vegetarian thali platter. We also split an order of garlic naan and veggie samosas. Indian food in general is one of my favorite, but I have to say I will never come back to this restaurant again. I was missing an item from my order (not the end of the world, but given we were the only customers at the time, disappointing they overlooked it). The samosas tasted old and dry, like they had sat out all day. The garlic naan was hard and chewy. Most of my dishes consisted of mostly runny sauces rather than any meats. Very disappointing for $35.However, that was only the beginning. The next morning my boyfriend and I both woke up extremely sick to our stomachs. That having been the only meal we shared together all day (and a rather suspicious one at that), it was undoubtedly the culprit. Let me tell you, it's really hard to get any work done when you can't travel more than 10 ft from the bathroom. Luckily there is wifi in here."], ["Christen P.", "The food is pretty good and it's a lot more affordable than other Indian places in indy. Plus they give u a cool membership card for a discount after 8 meals!"], ["Mi Sook K.", "Atmosphere: Kinda dark and drab. In a strip mall next to the liquor store (which could be seen as a plus to some). Lunch buffet: Meh. It was just okay and not memorable. The options were limited and just didn't look or taste very fresh. Perhaps it's because I came closer to end of lunch service. Nevertheless, it didn't measure up to my favorite Indian place farther north. I think this place has a slightly cheaper buffet but I'd rather pay more and drive farther for a better meal. and they gave me one of those punch cards to get a free meal after so many visits. I don't think I'll be going back to get a punch on the card. Just wasn't for me."], ["Krista R.", "Except for us and one other table, this place was totally dead. No take out orders coming and going, the phone never rang...The samosa chaat was a good price, and huge...but we suspected it was microwaved. The samosa was not crispy and hot (ie fresh) like I'm accustomed to, and the channa, onions, and tomatoes came out SMOKIN' HOT on top of the soggy samosa. The chaat lacked freshness and flavor. Bummer. Savory street food it was not.We split a panner tikka (dry roasted cheese) and a yellow dal (lentils). The paneer tikka pieces large and moist, but were overwhelmed with onions. Still, a nice attempt. The dal was inedible. It was mushy, again obviously microwaved, and uninspired.  The restaurant feels dated. It's dark and cold, and where we were seated, we overheard some appliance that was super loud (ice machine? broken heater?). It felt like the motto of New India was quantity over quality. No thanks."], ["Heather M.", "When we moved to Indy, we were sad about leaving our homey Indian restaurant behind. This is true comfort food for my family...not haute Indian cuisine, but the hearty, rich, plentiful dishes you keep eating because it just tastes amazing. New India has totally fit the bill in our new town! This is my second visit - on my first visit, I had THE most amazing Chicken Makhani with the MOST delicious naan, full of cashews and golden raisins to compliment.  Tonight I had a simple mushroom saag that was so delicate yet truly filing, with the most perfectly, thinly sliced mushrooms. I skipped the naan tonight so I could get Mango Pudding. That was not a mistake. Light, flavorful pudding with nicely sized pieces of mango. A great balance. Such a great treat to come here!!!"], ["Raj A.", "It's not bad but it's full price for food that just isn't fresh. Two miles southeast is solid British style Indian. One mile north you can find a creative chef with dishes spanning many Indian regions. With fresh, better options so close by I don't understand how this restaurant stays afloat. If the prices were one half to two thirds I'd be rating 3-4 stars. Currently, head north or south for better options."], ["Diane H.", "Excellent choice. Great variety. The chicken curry was good. The Chana Masala was my favorite."], ["Kevin A.", "I have heard great things and looked forward to the visit.  Yelp mentioned they are open 7 days a week, but alas, they are closed on Tuesdays/"], ["Rachel C.", "Excellent service, super friendly woman took my order.  Fresh lentil soup was very tasty!!"], ["Julie N.", "Went on a Sunday night. They had a great buffet assortment for only $10. In addition, they have coupons for $5 off the night buffet - so you can sacs yourself $5! If you aren't familiar with Indian food, I would suggest giving the buffet a try. It really helps you get to know the ins-and-outs of what Indian food has to offer.I can say I've tried their entrees - but again - they have coupons for them. I'll most def be back to try more. ;)"], ["Chris A.", "Our fav Indian in town.  Great food, friendly, attentive service."], ["Kari R.", "The flavors were good but I don't think very authentic. The vegetable mix had corn and lima beans plus all the other goodies of a frozen veggie mix in it."], ["Rachael H.", "The Indian food here is really good-- we always take out. The restaurant is worn down but it is always quiet and the tables look somewhat romantic. We usually get Chicken Tikka Masala and its awesome. Some of the best in town. We also split an appetiZer that comes with one of every app. It's enjoyable and fun to try everything! Overall, good food. I think they also usually have a coupon on coupons4indy."], ["The Yelp-inator W.", "Good food... Decent service....not bad....but there are 2 much better Indian buffets within 5 minutes of this place"], ["Neal P.", "Lunch buffet price is still a very good $7.99 with just ice-water (no drink) plus tax.  You can usually find a $1.00 off coupon in the Indy Star newspaper.Still pretty great overall, but they've let some small things slide just a bit since last I reviewed them.   The men's room needed some details: like putting the roll of paper towels in the dispenser, not just setting it on the toilet tank; putting soap in the wall-mounted dispenser, not just in the disposable dispenser sitting on the sink; re-caulking the space between the sink and the wall, replacing 2 burned out light bulbs, cleaning some of the long-term grime off the light switch on the wallThe front area was spotless clean though.  The food is still great.  Please try some of the goat curry and lamb curry.  The chicken tikka massala and the tandoori chicken were good.  I liked the saag paneer (cheese and spinach).The hot bread (naan) that they bring to your table is home made good.As usual, the salad is lacking, but they did have iceberg lettuce, cucumber slices, and tomato slices.  There's a creamy yogurt you can use as a dressing, but also try the pickled onion, pickled lemon, and mint chutney toppings. The desserts were great with several specialty Indian desserts that I forget the name of.  My favorites though are the (real) ice-cream and the mango pudding."], ["Sojourner E.", "Recently, I got some take out food from here. I wanted low salt. They gave me exactly what I wanted. I will gladly go back here.Why only for stars? I could just as well give them five. I only got two dishes. The low salt prevented the dishes from being truly enjoyable but this is not their problem."]], "Dhaba Indy Indian Food Truck": [["James N.", "Visited yesterday on the IUPUI campus and was pleasantly surprised. Really liked the tandoori chicken and chicken tikka masala. Exactly what I want from a food truck--unique, tasty food at a good price (lunch box was $8 with the above entree items, rice, and naan)."], ["Krista R.", "Solid 'dhaba' style Indian food. BIG, rotating menu. Cheap prices. Food truck!The day I ordered, options included: Tandoori Chicken, Channa Masala (chickpeas), Aloo Madras (potatoes), Dal (lentils), Chicken 65 and Chilly Chicken. They also have samosas and samosa chaats. They advertise that they can do kati rolls...but I haven't had them yet.They also occasionally do Indo-Chinese lunches: fried rice or noodles plus Gobi (cauliflower) Manchurian, Chilly Chicken, or Chilly Paneer for SIX DOLLARS! They also sometimes sell dosas, pooris, briyani. Awesome!I sampled the Madras Chicken Curry (spicy!), and Chicken Tikka Masala (great flavors). I also had the palak paneer (spinach and Indian cheese) curry. The Dhaba Lunch Box for $7 included two curries, rice, and naan. The curries were spiced just right, and the rice had great flavor. The naan was average and a bit too moist for me.I also ordered a mango lassi. While flavorful, it was pretty sweet. Watch out!Yay Indian in Indy!"], ["Yuk L.", "Get the samosa!  I noticed this food truck near the Sheraton in downtown Indianapolis.  Figured I would try it out for lunch before heading to the airport!  First off, I love the design of the truck! and dry erase board menu looked very inviting.  many vegan options available.  I went with their lunch box special which allows you to pick 2 entrees and comes with rice and naan.  The naan was more of a flatbread but warmed up nicely.  I chose saag paneer and their dhaba chicken curry.   The paneer was very yummy and the saag wasn't too thick so that you can mixed it well with the rice.  I've never had their flavor of chicken curry and it was yummy!  They had the standard chicken tikka masala but I was intrigued with the fact that they had chili chicken and tried it.  Pretty good coming from a truck!  I hope more people try this truck and yelp it with great reviews!"], ["Tara A.", "Indianapolis gained a true gem for lunch-time fare when Dhaba Indy's food truck hit the scene!  Wonderful, home-cooked food, quick and inexpensive.  I believe I have tried every menu item to date thus far and have loved it all.  He's even encouraged me to try things I was certain I wouldn't like, such as bhindi masala, which is now a favorite!  Great value and so yummy!"], ["Tara M.", "Look, I'm a kati roll expert and I'm not afraid to say it.I have had years of training.  I have had the real deal in India, and I know it's possible to get a quality kati roll in the U.S.  I've done my research.This is a cool-looking bright green truck with a giant Ganesha on it, but that's not going to cut it food-wise.The vegetarian kati rolls I got were nothing like real kati rolls... and were not good.  No flavor.  Instead of coming in a chappati or paratha, they come wrapped in a flavorless white flour tortilla.  The stuffing wasn't properly spiced... it tasted like they just squirted some bottled sauce on some grilled paneer and veggies.  The whole dish was a mess.I'm still pulling for them, but they have to seriously focus on the quality of their product."], ["Remi S.", "Tried this foodtruck at the iupui regatta downtown indy. Was really excited abt trying since I love Indian food. Unfortunately was very disappointed. The food seemed like typical low quality buffet food, made me feel heavy and bloated afterwards. I don't really go to indian buffets ,mainly because the food seems to always be so heavy and makes me feel gross afterwards, this was pretty much the same. I guess I will know better next time!"]], "India Garden": [["Cortland F.", "Perhaps not the most accurate representation of Indian food.  Absolutely a broad ripple original and great food to sleep with."], ["Colin G.", "India Garden is a fantastic little restaurant in the heart of broad ripple that may go unnoticed if you arent looking for it.  The non-descript interior of the place doesnt exactly lead you to believe you are in for a mouth watering meal but trust me, you are.All the food is delicious and if you like indian food in general you real cant go wrong.  Some of my favorites are the Chicken Tikka Masala, Chicken Korma, veggie samosas.  The lunch buffet is a steal at $5.75 and dinner is moderately priced as well.  Ive been to both and I have to say that dinner is much better although you really cant beat a buffet of all their specialties for under 6 bucks.  I would highly recommend it to anybody who likes indian food and to those who have not tried it as well"], ["Sarah R.", "Went for the lunch buffet-the best palak paneer I have ever had. It could have used more cheese, but the taste was buttery and made me go back for more."], ["John J.", "India Garden is as good as it gets!!been eating at the Broadripple location for many years and the quality of the food and the  service has always been superb.I had Lentel soup and a lamb dish.The lamb was tender and the soup was excellant. Best Indian in Indy!!"], ["Richard M.", "Consistently good, quick, and friendly."], ["Kylee W.", "Always great. I've been to each location several times, never once did I eat something I didn't enjoy. I love Indian food so much, so that makes it easy."], ["Reece M.", "I've eaten in indian restaurants all over the country. New York, LA, Portland, Chicago, Alabama, Seattle, DC, etc, etc, etc. India Garden is hands-down the best Indian restaurant I've ever had the pleasure to experience. I make it back to Indy about once a year, and India Garden is always a must-stop. I think that Indian restaurants can be divided into two categories: those with tamarind chutney, and those without. and IG's tamarind chutney is to die for. This place is worth going out of your way for. I'm going to disagree with the other reviewers and say that I highly prefer the original, Broad Ripple location, but the food is just as good at the Downtown spot. I'm craving it right now. mmmm."], ["Alison C.", "Actually the downtown location really sucks, just go to Broad Ripple!"], ["J A.", "It took 2 minutes to drive here and 20 min to find parking. Food wasn't bad, but I was forced to sit next to the door and take gusts of cold air every time guests came and went. Service was also a bit slow"], ["Jakey B.", "I must admit, this place was really good.  you yelpers are almost always spot on - in this case pointed me to an indy gem.But, where's all the people yo?  I was one of 4 in the place on a Tuesday at peak dinner time!  all you Hoosiers out there, take note: it's little places like this that are the cultural lifeblood of the city's culinary delites.  Go, try it.  If you've never had indian food, try it anyways and you will not be disappointed.First the decor - typical low rent indian restaurant stuff, cheesy glass/crystal chandeliers, dusty ceiling fans, vibrantly colored tablecloths and wall paper, lights turned down to a fuzzy orange glow.Staff was friendly and attentive, but with only 4 people to serve they had nothing better to do.The Food? well, I must say excellent.  I had the Meat Thali.  It was HUGE, came with 4 small naan, chicken curry, lamb curry, dahl mahkani, raita, 2x chicken pakora (wierd, and a little soggy get the veggie ones instead), 2x tandoori chicken, basmati rice, rice pudding for desert and a pappadam with 2 different chutneys to start.  Frankly, it was a meat attack!  I would have ordered the veggie thali, but one of the main dishes was saag paneer which is not one of my favorites.  I think they cranked up the meat for the midwest pallete.The lamb was really good.  Tender, just fatty enough and cooked in a lovely tomato based curry.  the chicken curry? also excellent, with a yoghurt based curry.  They make it to your preffered hotness level.  I ordered 7 (out of 10) and it was well below tolerable limits, but I warn you - small places like this are notoriously inconsistent with heat levels so be careful.  Although not Indian myself, I learned to cook it and appreciate it from my friends parents who were recent immigrants.  I can say with confidence this food is good.The neighbourhood is cool.  A hip place with tons of bars/restaurants.  Parking was tough - there was a Melvins concert down the street and there was a traffic jam just to find parking.I overheard one other table commenting this location has WAY better food than the downtown one.  I made the drive from downtown and was happy to hear that I picked the right place.Indy-ers - GO GO GO, don't let a place like this die.  I'd go back, but alas I found this place while on a business trip.  If I ever find me in Indy again, you _will_ see me there."], ["AB F.", "Authentic Indian food! Love the beer selection and vegetable Mali kafta."], ["Giggli T.", "AMAZING!!!!!!!!I get Chicken Tikka Masala with Veggie Samosa as an appetizer. The staff is helpful and really, it's just delicious food..You do need to go there, fan of Indian food or not.. (:Go for dinner not lunch buffet. Dinner is much better."], ["Josh S.", "Whenever I come back home to indy, I roll through a few places and this is always one of them.  I prefer the downtown IG, but B-Ripple works too.  I highly recommend the buffet rather than ala carte though.  Its usually cheaper than ala carte, the food is always fresh off the line and you can sample everything.  You can also expect great service every time.  If you're down...try the mango lassi to drink.  Mmmmmm."], ["stephanie t.", "I like India Garden.  I usually go the downtown one.The food and service is very good. I love their chai tea. I always like to go there when I am stressed out because it makes me calmer. I think the Indian music calms me down. Maybe in my last life I lived in India. I think I did. They have a large variety of food but i recommend mild tell them that because they rate from mild to hot from 1-10, 10 being the hottest. If you go for 7 your mouth will have flames coming out of it! It is inexpensive too. Check this one out."], ["Lydia W.", "India Garden is THE place to go for Indian food in Broad Ripple (and maybe Downtown). After having been a long time frequenter of the other Indian restaurant in Broad Ripple, one taste of India Garden's garlic naan has me hooked for life, or, as along as I'm in Broad Ripple."]], "India Palace Restaurant": [["Beth B.", "I have been to the lunch buffet several times and it certainly plentiful!  I like the food but the service is lacking.  We had a wait to be seated both visit and had to ask for our drinks to be refilled.  Would have given it four stars if not for the empty glasses!"], ["Annie M.", "Outstanding food, outstanding service. We arrived at 4:40, 20 minutes before they opened and they let us in, sat us and we were eating at 5 o'clock. Prices were very reasonable and we have a pocket full of coupons for next time."], ["Kara G.", "I love, love, LOVE India Palace!!! It's by far the best Indian restaurant I've ever been too. I've gone there several times over the past several years for dine-in, carry-out, and the buffet. And whenever I go, there are always several Indian people also eating there. I think this is a sign that the food is authentic.First of all, the lunch buffet is very impressive. Not only is everything delicious, the selection is HUGE - 2 or 3 times bigger than other Indian buffets I've been too. It includes some of their best dishes, in my opinion. Also of note, I find the buffet to be very mildly spicy, which is great for those of us who can't take too much spiciness. I like just being able to savor the flavors.The menu also has a huge array of dishes. I almost always get my favorite - the lamb or vegetable korma, and I LOVE the mango milkshakes! I've also had both the vegetarian and non-vegetarian samplers, which are give you about 10 excellent dishes and are a great deal. I think prices overall are very reasonable.The atmosphere is very elegant, comfortable and soothing. The waitstaff is friendly - actually, the service is almost too good. Someone will come by to fill your water glass - even if you've only taken a sip - every 2 minutes. It gets a bit invasive. But I'd rather have overly-attentive waiters than inattentive ones. Overall, this restaurant is a gem!"], ["Chris M.", "I love Indian Buffets, and India Palace has never failed to deliver. Other Indian Buffets in town just can't compete. Tons of vegetarian options too. I pretty much love everything they have on the buffet except the desserts. I'm always too full anyway. The curries are always impressive as is the tikka masala. The veggie dishes are usually the ones I end up eating the most of.  There is a wide variety and seemingly always something new to me.  I recommend going hungry and trying a bit of everything. Definitely scoop up a bunch of the onion chutney. Its the best I've had. So good and nose-runningly spicy. Also, don't skip the vegetable pakoras. The crunchy fried fritters go perfectly with the rest of the \"saucier\" dishes. I've been here for dinner on a few occasions too, but enjoy going for lunch so i can take advantage of the large variety."], ["Leo L.", "As Indian buffets go, this is a great one. Well worth the heartburn and heavy stomach feeling!"], ["Mario G.", "By far my favorites Indian restaurant. I used to go here once a month in college. Now its like once a year, but its still just as good."], ["Jen N.", "I love to go here for lunch. I've not traveled to India (yet) so I can't speak to the authenticity of the food. But I do see diners who appear to be of Indian descent, which is a positive sign. The lunch buffet is huge, and nearly everyone can find something they enjoy. My favorites are the chicken tikka masala, mushroom saag, and saag paneer. I've actually tried to create a few of their dishes at home, with varying levels of success. The waiters can be a bit slow on refilling drinks, but otherwise are generally friendly."], ["Samiran G.", "An advice before you read this. Go to this place only for the buffet.I've had the chance to sample both their buffet and order food. Let me first get the latter out of the way first. It is underwhelming and I'd prefer to cook myself rather than spend $$ to eat that fare here (I'm a pretty decent cook myself). I've heard similar experiences from others as well so I'll rather find some other place for order food.Now for the buffet. It is pretty good for the price you pay. The selections are good and even vegetarians can have an excellent evening out here. Pretty much all of their curries taste different, which I consider is an achievement for a buffet. Though it will fill you up pretty quickly because as like other buffets they use a   lot of cream, what what the heck buffet are \"zero calories\" :) Navratan korma is a must here!!They carry a decent goat curry which somehow a lot Indian restaurants mess up badly. Theirs is quite good and I'd recommend it.Nice desert selections. I've not seen so many Indian sweets at Indian buffet of this price range. Would have given 4 star if their order food was as good as their buffet food.I haven't been to this place since last \"end of summer\", so I don't really know how things have been lately though."], ["Kjirsten K.", "I've done it again....I've completely stuffed myself at the India Palace lunch buffet.  What's a girl to do, the minute you walk into the restaurant there is an assault on your senses.  The exotic smells of Indian food, the bold colors of my favorite dishes; the bright orange tikka masala, green spinach and cheese, and other brightly colored curries.  I've been to the India Palace for dinner, but it's very rare.  It's hard to pick just one dish off the menu when you're used to the variety offered on the buffet.  You can always rely on the favorites, chicken tikka masala, rich curry (chicken and goat dishes), clay baked chicken, naan, and chana masala.  Today I noticed a couple new additions, a spicy dish with chicken and bell peppers as well as a dish with large pieces of Indian cheese (paneer) with onions and peppers in a yummy orange curry/chili sauce.  The chana masala was prepared a little different with the fried potato fritters surrounding the border of the dish and it was topped with red onion and lots of cilantro (a flavor I don't usually associate with Indian food).  The buffet costs approximately $8, which is definitely worth it.  I would recommend the buffet if you are new to Indian food.  It's a great way to sample several dishes and get accustomed to the many flavors of Indian cuisine.  How do you say Bon Appetit in Indian?"], ["Tara E.", "This is the place I first tried Indian food 7 years ago and it is where I compare all of my other Indian experiences.  Their lunch buffet is huge including a desert buffet.  They even have a Sunday night dinner buffet which is a great end to the weekend.  I always get their Chicken Tikka Masala and the Saag Paneer which are staples for me but I also try some of their other dishes as well but always go back to CTM & SP.  My mouth is watering just writing about this!  Looks like Sunday night we are going back to the buffet!  It's worth the 30 minute drive for us every time."], ["Brandon S.", "Had the chicken biryani & although it was good, it was not the best I've had around Indy. The rice contained way too many onions & the combination of the spices & herbs was lacking in taste & smell."], ["Jimmy W.", "India Palace is awesome! The lunch buffet (which is all I've ever had), is excellent with fresh food, a lot of options, and delicious desserts. There is a coupon available online, too, for $1 off lunch buffet which makes the price not too bad for the amount of food that you get. I've never had to wait for a table, they always keep your water glass full, and being a vegetarian, there are tons of options... even more vegetarian options than things with meat in them!"], ["Linh N.", "OMG!!!!  I would've never expected to see this place on the list or hear of this place ever again!  So it just happens one night, out of the blue my cousin wanted to eat Indian food and this place just happens to be across the street.  I refused to go at first because having catched the whiff of Indian food was such a turn off for me.  Took some convincing, but I gave in.  (Noted:  This was my FIRST and only time I have ever tried Indian food.  Not to be narrow minded nad what not, I'm sure some of you out there love their cusine.  It's just after this experience, for me.... totally scarred me for life and I have never ate Indian cusine ever again). Anyhow, walking through the door... the smell of heavy curry permeated the air and caused me the nauseous feeling of wanting to throw up.  The smell is sooooo unlike other asian curry, that I couldn't help but try to only breath through my nose.  So we ordered  beef curry, lamb curry, and chicken curry..... now, the flatbread they gave us as the housebread was pretty awesome.  So I figured the entrees come out and it owuld be decent..... only.... no utensils were given.  We had to dig our food with our bare hands.  Encrusting our nails with this foul tasting curry, and may I note that my chicken was bleeding when I ripped it apart?  So my cousin told me to try his beef curry, that he has yet to dig into.... using me as an experiment, I took one bite.. and I'm spewing it back into a napkin.  That was ENOUGH, as we paid our bill and left our barely touched entrees and ran out the door for some frsh air.  Thus, I can tell you.... I haven't since tried Indian curry since.  Sorry to disappoint, but that was my experience."], ["Ravi Teja K.", "Worst food I have ever had in an Indian restaurant. The food over here seems to be a nightmare for vegetarians. I strongly suggest to skip this."], ["Nick L.", "This is the best Indian Buffet in town hands down in my opinion.   Very clean, elegant atmosphere and professional wait staff for a buffet.   The food is superb and served hot.   The desserts are very good.  I have been eating the lunch buffet here for years and have never had a bad experience.  I have eaten dinner here once and it was good, but I highly recommend the lunch buffet."], ["Marc K.", "India Palace is my favorite Indian food of all time.  Their paneer masala is some of the best I've ever had.  The nav ratan shashi korma is also quite tasty!  Also, don't miss a perfect vegetable pakora with delightfully spicy onion chutney.They have a really great lunch buffet with several good vegetarian choices.  This is a great place to come and try Indian food for the first time.  During Dinner hours, there's a small basket of papadam on the table to start things off.  These are always perfectly cooked without being greasy.  Dinner is nice with very generous portions.  We usually get one entree per person, and have lunch the next day as well."], ["Robin P.", "I really don't agree with the other reviews that seem to think this place is horrible. I think it's actually pretty good Indian food. I've never been for the buffet - just standard dinner service several times and have never been disappointed. It is owned by the same people who own Shalimar in Broad Ripple. I'd recommend the Chicken Makhani (chicken in a red sauce with cashews) and their samosas are quite good too. We tend to order Malai Kofta at most Indian restaurants that we go to, and I really don't like the sauce in their version. But everything else on the menu has been great. I've never understood why many Indian restaurants (this one included) charge you if you want more rice. Nevertheless this place is worth a visit if you are on the West side and craving Indian."], ["Mark W.", "Best Indian in Indianapolis"], ["Amar B.", "Great cheap desi food which can be catered to all spice levels. Came in on a Tuesday evening on my way to Chicago, was surprised at the remoteness of the location and then furthermore surprised by the crowd inside. I had the chicken vindaloo - a non traditional dish but very spicy and not too oily. The bhindi (okra) was average. Rice was good. I am kicking myself for not going for the biriyani. All in all good for Indy if you are near I65."], ["cecille p.", "just reviewing places I have enjoyed in my visit...this is yummy, with enough variety of dishes to choose!! Thanks to M.W. to be someone just so special to take me to places...my great moments!!!"]], "India Gate": [], "Haveli Indian Cuisine": [], "Spice Box": [], "Aab India Restaurant": [["Dawn M.", "I love Indian food. AAB is ok, not great. The service is a bit up and down but what really worries me is their standards of presentation. The dinner buffet looks like they didn't change pans from the lunch buffet.The food itself is fine. I ordered baingan Bartha, and it was good. My son and husband braved said buffet and said it was fine. I just wish they would step up their game so that more folks would come for dinner."], ["Ayana C.", "Whoever that guy is that answers the phone is super nice ! Called him and told him we will be coming and usually they are strict with getting there before they close at 9:30 but this guy said its ok to come :) So nice of him We traveled from miles and miles to be here !"], ["Angi B.", "Excellent food, below average service. It's Saturday night (6:30-7:30) and we were the only 2 people in the restaurant the whole hour we were there. Saw only one employee and he did an adequate job getting our order.Lentil soup was highly recommended.Aloo gobhi also quite good; had a lot of onions in case you don't like them.Hubby had a chicken & onion appy covered in mint chutney that he was quite happy with, and lamb jalphrezi.They're serious about the spice levels; you may want to order a notch less spicy than other places.Overall glad we stopped in and hope they stay in business."], ["Amanda B.", "The service is non-existent, but the buffet is decent. Standard Indian buffet options. The Nav Rattan was pretty good if that's your thing, and the goat curry was tender and tasty. All in all, for $9, it's a good lunch. It is a little confusing when you show up for the lunch buffet, because nobody greets you at the door, the register is in the back, and you're not sure if you should just sit down or what. We actually just started heading for a table and someone came out from the back. I asked if we should sit down and she nodded, then poured water for us. That was literally all the interaction I had with a server.Will probably return."], ["Franklin D.", "Eh, okay not great, but +1 star just for existing and being an option in the area. Had the lunch buffet. Food was hot, enough of a selection, just not amazing in the flavor department. All the usual things you might expect like tandoori chicken, naan, etc. Again, this place will have to do in a pinch just because of a lack of options."], ["Julie M.", "I was excited to see the owners had changed from India Diner because the place always look a little dirty and made me question their cleanliness. I went last year once when they first opened and wasn't impressed. I also recently checked their latest health department inspections, and roaches were found several times, along with many other critical violations. What a bummer because the south side needs more culture. I will stick with Clay Oven on US 31 and Southport (Walmart plaza).  They have great food and good health department inspections."], ["Luke G.", "I loved the spicy chicken curry but make sure to get the naan! D-lish!!!Our waitress was super nice and the food came out quickly! They have very hearty portions!Will definitely be coming back!"], ["Jessica B.", "When I ate here 1 year ago, I loved it! It was delicious! Today, not so much. I was put off by my very 1st bite because my fork had some chemical taste on it that hadn't been rinsed off. Gross! I grabbed a new fork, and it was ok. The food was just blah compared to a year ago. I only had 1 plate of food, yet paid for the buffet. What a waste! An inspector from the health department walked in after we were already eating. I hope it was just a routine inspection, but it made me lose my appetite. The curtains are dirty/have large cobwebs right over the door! My husband said the floor in the bathroom was so sticky, he felt like he was walking on fly paper. As much as I have to pee, I'm going to hold it till we get out of here! The rugs in front of the buffet feel sticky also. Maybe I SHOULD lick the chemical spoon again to bleach my tongue so I don't get sick from eating here. Definitely won't be back."], ["Nina G.", "Food was ok, the desserts were a little bland. But the restaurant was very dirty. From dirty water glasses to dirty walls and plates. Gross!! I would not go back!"], ["Bryan H.", "Lunch Buffet ReviewPrice $8.71 (excluding tip, and no drink)This may have been one of the worst Indian buffets I have been too.TasteFirst off, many of the dishes were cold. The Chicken Tikka Masala was something decent but nothing deserving anything above 2 stars. Most of the times can eat just about anything on the buffet line but here many of the dishes just were not good. The sauces were average. The deserts that I had were decent but nothing exceptional. 1.5 StarsServiceThis had to have been the worst service I have had a an Indian buffet. After getting two plates at first (sampling everything) I went back up to get a 3rd plate (one of my plates I pushed forward so he would know I was finished and it was clean). After finishing my 3rd plate, I tried to make room to fit my now 3 empty plates while I went up to grab a 4th. After finally finishing my 4th plate he decided to come grab my plates. I normally do not complain about service in the least bit because I am there for food over anything. But to compare Indian buffets, this was shown to be one of the worst in this category.0 Stars.ValueI payed $8.71 after all was said and done and I would easily say that this was not worth $8.71. I would maybe pay $4-5 for this place but it is by no means worth what I would pay for any other Indian buffet.1 Star"], ["Jason B.", "My daughter has been asking me to take her to get some Indian for lunch. We like trying to new places and exploring so this time we decided to stop in to Aab India Restaurant since we were on that side of the south side. Since my daughter is exploring more international cuisine, it's great to find places that offer buffets so you can try various things and see if you like them. The food and selection on the buffet here is good, but overall not quite as flavorful as some of the other Indian restaurants we've been to around the city. They don't have naan out on the buffet, but they bring you your choice of regular or garlic naan to your table in a basket. The naan was good. There was nothing here that really stood out, but the food was good, service was good and price wasn't bad. $20 for two buffets with drinks after tip."], ["Aaron J.", "Got aab India last night for dinner as take away.  Ordered the tikka masala, tandoori chicken, samosa and a chicken biryani. The tikka masala was solid with good flavor and spice.  The tandoori chicken was moist and had good flavor although could have been a little spicier. The kids loved the biryani and it looked excellent.   The samosas had an excellent pastry but the potato pieces were a little large for me. The rice was cooked perfectly and the naan were spot on"], ["Tsnstn N.", "The quality of their food and service has degraded so much after the owners changed. Never going back."], ["Arthur W.", "When it comes to Indian food I usually stick to my favorite, butter chicken, but I decided to take a chance at AAB and I was not disappointed. I had some sort of lamb curry dish and each bite was packed full of flavor; and of course I dabbled in my brothers butter chicken and that too was above average butter chicken. The mango lassi was just right. Loved everything about AAB."], ["Mark F.", "Ehhh.  Stopped here on a Friday for the first time while visiting the area.  Buffet night, which gave us a chance to test several dishes.  Food was ok tasting, maybe a 3.  Most of it was lukewarm, which I hate.  I love Indian food and eat it often.  If you do too, I'd keep looking."], ["Joseph C.", "Just had lunch here today with my brother. The food seems quite a bit more spicy and there's a larger variety on the buffet table then when the last owners had it I think the places mostly improved it's pretty cool. But unfortunately the old curse about Indian food is still true I've pooped four times today and each time my anus is burning with the fury of 1000 suns!"], ["Stephen J.", "Food was excellent.   Service was great as well.  Server explained about the food and origins.  Quite delightful.   The Pisawi naan is amazing.   Great vegetarian selection"], ["Ben R.", "Tasty and affordable. The pakora appetizer was amazing. The baingan bhartha and paneer jal ffrezi were great."], ["Paul P.", "I tried their lunch buffet. Started with some appetizers, l like their vegetable pakodas (Spanish and potato both). Then waiter ask me for Naan breads and i ordered Garlic one as i love them. Then I tried saag and gravy panner. Only thing I didn't like about panner is, the gravy wasn't thick as I like little thick gravy. otherwise taste was good. Garlic naans were good too. For deserts i tried mango pudding, it was good as well. Overall good place for having lunch."], ["Akshay B.", "I went to the restaurant on Monday 21 March, 2014 at 2 PM for their daily lunch buffet. On entry the waiter asked me if I would like to eat a naan or a tandoori roti. I replied tandoori roti. I also pointed out to the waiter that two buffet items were over and needed refill - tandoori chicken and chicken tikka masala. I waited for 15 minutes and was not served any tandoori roti. I also checked but neither the tandoori chicken or the chicken tikka masala were refilled. I also noticed that another item rasmalai was empty. When I pointed this to the manager, he said that they cannot do anything. At 2:25, after 25 minutes of wait I still did not have any tandoori roti to eat. As a result I told the manager that I am not able to eat any food since indian food needs to eaten with the roti. The manager started arguing rudely and said they cannot serve anything after 2 PM. He also used derogatory words saying that this is your bad mentality. When I said I would not like to pay for the buffet since I did not get to eat most of the items, he refused. Finally, I had to pay for a really bad service."]], "Omelet Shoppe": [], "Delhi Palace": [], "Chapati": [["Colin D.", "Really friendly service and excellent food!  I have been to few Middle Eastern restaurants in my life, but this is one of the best ones.  You get a lot of food for an affordable price.  I definitely recommend it to anyone who is looking to try new exotic cuisines."], ["Vivek B.", "Awesome decor, amazing food. Faluda was so yummy. Owner even gave me complimentary Kashmiri chai which was fantabulous. Worth going there. Thats the only place i will eat food whenever i will come to this city"], ["Laura R.", "Great food! This place has a cool twist on some of my favorite Indian dishes.  I had the goat beets and it had just the right amount of spice! And definitely get the \"street food\" in a cup.  It's sweet and tangy and hot and cold and amazing in your mouth.  The guy at the counter is very helpful and can help guide you to something to fit your pallet while his mama is the master chef in the kitchen.  Worth a trip!!"], ["Megan G.", "Wow, what a delightful find. I discovered Pakistani food a couple years ago, and while visiting my brother used yelp to find this place. The mango lassi's CANNOT be missed. Possibly the best I've ever had. I had the butter chicken, which was super flavorful and tender and I could've eaten it for days. I also got the 2-meat combo with the steak behari I think it was called, and the chicken tikka. The flavor on the chicken was great, but mine had a layer of fat on each piece that I didn't find appealing. The beef however...... Was mouthwatering and fell apart in my mouth. Don't miss out on it!!"], ["Cammie W.", "Their entrées are split into 2 main categories: gourmet dishes and spiced meats. There are combo options for the spiced meats; one of them allows you to get 2 of the gourmet dishes if you're looking to try different ones. The spiced meats have an option to come as a wrap, which is nice if you're looking for something on the lighter side.I got my order to go but the service during my short time there was fantastic. The cashier explained the menu board to me after hearing that it was my first visit. He asked me how I heard about Chapati and encouraged me to leave a review even if I didn't like the food.I was told that the Beef Behari is the most difficult dish/meat that they have here. I opted for the wrap version when I came here for lunch. It was good but I wasn't that impressed. All the meat was on one end of the wrap instead of being spread throughout. I happened to start on the non-meat end and kept wondering if they had left out the meat or if I got the wrong order. I think it would have sucked if I started on the meat end..The meat itself was very good and flavorful. However, because it's already so flavorful, I felt that the pickles that came inside the wrap did not complement it. I was also a bit disappointed that I got onions even when I specifically asked for no onions.Overall, it was decent. I would definitely want to come back and try their other dishes. I probably would not get a wrap again, though."], ["Adam L.", "We stumbled upon this place while traveling through Indy on the way to Chicago. What a pleasant surprise! They described it as Indian/Pakistani/Mediterranean fusion. We had goat beets, a chicken dish, and a steak dish. The rice was beautiful and delicious. The interior of the restaurant was very well done and pleasant. Bravo!!"], ["Mitch M.", "Loved this place!   A small new family owned and operated restaurant.   The food is fantastic, the service is great, and the decor is great!   The front is run by a super helpful guy who is great at introducing all of the dishes.   The menu is made up of all of his mom's recipes, and she is the head chef.   Lots of food options including vegetarian, chicken dishes, beef dishes, etc.   I can personally vouch for the butter chicken and beef dishes, incredible!!  I had to stop myself from eating it too fast because it was just sooo good!!Portions were great, food was full of flavor and delicious.   Leftovers stored great and tasted just as good the next day!   Love this place!  Totally worth the drive out to Lafayette road! It is right off of 65, so it's super easy to get here from any part of Indianapolis.  I will definitely be going back out soon!!Can't recommend this place any more highly, it's great, and I genuinely hope that more people come to love this place as much as we do!"], ["Teresa M.", "Awesome!  So friendly and helpful. Food was fantastic, inexpensive, and delish. Great place in Indy to grab a meal or hang out with friends. Round tables for groups and sharing. Couches. Good music. Recommend."], ["Zsofia N.", "Highly recommend this place. Amazing, fresh, high quality food and hip ambiance. It definitely exceeded my expectations even after reading all the positive reviews. Will return!"], ["Kelsey P.", "I just stopped in for lunch at Chapati and had a great experience. It wasn't busy, and the gentleman at the counter walked us through the entire menu and made recommendations for me when I asked. The food was extremely fresh and tasty, and there was definitely enough for leftovers. Great service, great atmosphere, great food!"], ["Jay P.", "Very delicious food and extremely friendly service.  Its a great family owned restaurant. A must-try!"], ["Andy B.", "Incredible delicious Indian food at very reasonable prices, along with friendly fast service.  I wish there was a location in Chicago because I would eat here all the time.  I can still taste the savory butter chicken and flavorful spice of the beef.Thank you"], ["Kurush S.", "Cool vibe, great food, awesome customer service. Hidden gem for sure. We tried the biryani, the beef behari, and butter chicken. The behari was perfectly cooked. The butter chicken was really flavorful and balanced. The biryani was classic. They explained the whole menu and took time to answer questions. Made me feel welcomed since I didn't know most of the stuff on the menu."], ["Jason D.", "Everything in Indianapolis is rated way too high compared to how other cities rate.This was good Pakistani food, but not what I'd expect from a 4.5 star restaurant. Seems like 4.5 stars in Indianapolis is equivalent to 3.5 stars in other cities."], ["Sam K.", "Tried the chicken boti and the beef kebab! The meat was very tender and tasted very good! Other than the good food, there's games like caroms to entertain you while you wait for the food"], ["Scherrie L.", "My second time eating here and still incredibly impressed! Delicious food and modern inviting atmosphere. The service/staff is incredible and very knowledgeable about every dish on the menu. I had the eggplant masala and daal, very delicious and flavorful with the taste of a home cooked meal. Love, love, love this place! Hope to see more locations soon closer to IUPUI campus and broad ripple."], ["Jessie S.", "Go here. Now. First, this place is like something you'd find on Mass Ave - trendy, modern and really good! After you get past the surprise of the modern decor and sleek design in Lafayette Square, you're faced with menu decisions. Prepare to Google or ask a lot of questions. I learned what Chaat is and that it is now my favorite food. South Asian street food with lots of spices. Basically a crazy mix of yogurt sauce, garbanzo beans, veggies and crunchy stuff. It's cheap, filling and packed with so much flavor. First bite leaves you chewing, tasting and wondering what's going on in there. I tried bites of some of the other dishes, also delicious. Should be noted that the \"gourmet\" lunch items take a while to prepare. Chaat was fast and tasty (did I mention that?!)."], ["Jessica W.", "This place is amazing!  A hidden gem.  If you are tired of the same ole boring food you must try Chapati.  There are so many colors, spices and textures that will excite your palate.   The staff are super friendly and helpful if you're new to Middle Eastern cuisine.  You can tell they take pride in their craft and are excited to introduce people to new things. Their suggestions were right on the money.  I suggest getting the traditional dishes - choice of 2 entrees, rice and bread.  Take friends so you can share.  The chili chicken and eggplant were my favorite!  Oh and try the samosas with mint and tamarind sauces.  Omg!"], ["Sunny R.", "Unmatched ambiance with detailed understanding to service. As soon as you walk in you are embraced like you are going to have the experience of your life! The best part is all the excitement never let's out. I was traveling in Indianapolis and was referred by a foodie coworker. His review was so rare for a Pakistani and Indian restaurant that  I was genuinely entrigued. After getting some good advice from the front counter I picked the chicken boti, aloo chaat, and mango lasi. I was blown away! I think about how well they executed every element. The plating to the taste to the level of perfect blends of spices... I'm in love. Everyone must visit Chapati!"], ["Katrina C.", "I'm so excited for this place in West Indy! We needed a delicious, modern, and healthy restaurant on this side of town. The meat is organic/free range and the dishes are made fresh! We will definitely be visiting this place regularly."]], "India Sizzling II": [["Anirudh M.", "sensational food!semma saapaad!!jhakhaas khaana!!!lai bhari jewani!!!!sakkath oota!!!!!"], ["Aninda S.", "I keep coming back quite often. However after my last visit which was in 2014 I didn't come back since during that visit I had a live cockroach crawling on my table. So much for authentic experience ;). Apart from Mumbai grille in greenwood this is the other place which offers authentic Indian food. So today I came back again!Note that all buffet items were not ready at 12:06. However they had enough items to complete a meal nonetheless. Some highlights of today's visit:1. Sambar was awesome2. Medu vada good 3. Server promptly came and took order of masala dosa. Unlike most of the time the server was actually seen socializing with others and offering suggestions. The biriyani and mutton rogan josh were good as usual. Will come here again."], ["Sri Harsha P.", "I have been craving for really good South Indian food . As soon as I moved to Indianapolis, I looked for the restaurants in the evening and this was the only place which offer dinner buffet. I dropped in this place for dinner with my friend and needless to say, the restaurant was smelling all curry and I loved the aroma. They were still setting up the dishes for the dinner buffet but they told us to grab the plates and hog on! We were like Hell Yeah !! Let's do it !The items on the buffet were great. I think it was a huge spread but it's quite common if you drop into an Indian restaurant for buffet. There was two kinds of soup - chicken soup and tomato soup which I didn't try. I always recommend people to stay away from soups at Indian restaurants. Moving on.. There was my favorite South Indian food - Vada [ pro tip: they look like small donuts but they are not sweet] , and they were awesome, I had almost 10 of them. There were four kinds of chutneys, every chutney was perfect. They had delicious sambar too.  [pro tip : you generally have Vada's with chutney and sambar. Especially coconut chutney] They had Potato fry [aloo fry], egg plant curry, panner makhani [paneer butter masala], veg Manchurian and couple more vegetarian dishes. They all were fantastic.Coming to the non- vegetarian section, they have chicken makhani [chicken butter masala], lamb curry, tandoori chicken, chicken dum biryani. I didn't try the lamb curry but the chicken dum biryani was great. [pro tip: add some chicken makhani to your chicken biryani rice and have it, it's so yummy]. The tandoori chicken was not so great. I don't understand why several Indian restaurants get this dish wrong. They add plenty of food color which spoils the taste of the dish and make it look red and dark pink in color. It's ridiculous. Please get this right!! They had carrot halwa, couple of ice creams and fresh cut fruits in the desserts section. They serve any kind of naan and roti and Dosa's at your table if you tell the server. [pro tip: Dosa is a South Indian dish and they look little like pan cakes and some people even refer them as Indian pan cakes. And again they are not sweet like pan cakes. You eat them with chutneys and sambar or with potato curry ] I really had a very good time having the food at this place. I do recommend this restaurant. I will definitely go there again."], ["Jessie S.", "I'm a big Indian buffet fan, and I've tried the usual places around town, but I especially loved this place! The naan comes fresh to your table, and we were even offered apon? - a thin rice bread that came with coconut milk to dip (it's wonderful!). The signage on the buffet was very descriptive and helpful, complete with vegan identification. Each item had distinct flavor and there were many unique choices. All very authentic. The service was prompt and you could easily be in and out over a lunch hour."], ["Naser A.", "Went there for the lunch buffet. It was packed, and there was a good number of variety to choose from.However, the biryani is usually alway has little lamb/chicken, and they are slow in updating their dishes in the buffet standThey do not have a samosa in the buffet so you got to order that as an extra charge.Overall, its not bad. Nothing special about, but if you're nearby they stop by."], ["Fiona B.", "This is my favorite Indian place in town! A great selection of dishes, favorites that many folks will recognize and the wonderful addition of many (really tasty) dishes that the typical Indian buffet in America doesn't serve. Service here has always be great. And be sure to ask for Dosa at your table, in addition to or as an alternative to the standard naan. My particular favorite is Mysore Masala Dosa (spicy potato stuffed dosa)."], ["Anne L.", "We were there for the buffet on Friday night.  The food on the buffet was fresh and flavorful and there was a nice variety.  There were more chutney choices than one generally sees at an Indian buffet, and the idlis were something I'd never experienced before.  The food hadn't been dumbed down for American tastes, so be aware that when they say mutton, they mean mutton, not lamb, and the mutton -- as well as the chicken in the biryani -- is bone in.  That's not a critique, because it gives a better flavor!  Every dish was a great flavor experience.What was really outstanding, though, was the service.  I'm not used to getting great service at a buffet.  Our waiter brought us our fresh, hot naan, but he also brought us fresh dosas and appas, neither of which I'd ever had before, and was full of helpful suggestions of what went best with what.  It was just a fantastic dining experience and I look forward to the next time!"], ["Gyamfua G.", "I've been desiring a indian dinner buffet and finally it's here. It's a small buffet but tasty!! Some of the stews were pretty spicy..."], ["Beidyuth G.", "To start I have been here a few times and India sizzling keeps me returning. The north Indian food is standard with a small selection of south Indian food available. The masala dosas are delicious and come highly recommended. A nice, neat restaurant comes with the family vibe. Would recommend it for someone wanting to experience the differences in Indian cuisine while on a budget.Thumbs up in my book!"], ["Anthony T.", "I was craving Indian food and this place was nearby.  I was pleasantly surprised to find they offered a dinner buffet (Friday-Sunday I think).  Most Indian places only offer a buffet at lunch.  The staff was very friendly and made sure my glass was never empty and continually checked to see if I needed anything.  I liked that they had more than just the usual popular options in the buffet.   Sometimes Indian buffets get a little boring and generally only offer the popular dishes like tikka masala, butter chicken, etc.  They had both of those options but many other \"off the beaten path\" options as well so I was able to try some new things that I would never think of ordering.  If it's your first time having Indian food, I'd personally recommend that you go with someone that has been here before because there isn't much direction or \"handholding\" from the staff.  For example if you want something that's not at the buffet (naan, etc) you have to know to ask for it."], ["Aditya B.", "The best quality of food Indian restaurant hands down. Very very good South Indian food but catered to a multicultural audience. Chicken 65 (appetizer), naan (especially garlic naan), vegetable biryani (best in town), chicken biryani are very good. Service and ambience are ok. Going by just taste of the food, hands down the best Indian restaurant in Indianapolis."], ["Jeremy O.", "1st time eating here. I am soo happy to find another Indian restaurant so close too where I live.It is located in a strip mall. Once you walk into the place, your eyes will relax and your heart take a sigh of relief.  The decor is great as you look around you will find more things too look at. Btw the men's restroom is huge.Now the food. We had the buffet. Which I have too say was top notch. There is a 6 meat option and tons of veg options. The rice pudding is nice and thick, I love it that way."], ["Mike F.", "As a lifelong fan of Indian cuisine, India Sizzling (II) came very highly recommended to me by a true expert. The expert, who is actually from India, advised me that the food at India Sizzling was the most authentic he has had in the Indianapolis area, and was totally \"un-Americanized.\"  Since I have never been to India, I decided to take his word for it--and since I could think of little else other than sumptuous, authentic, un-Americanized, Indian food, I had to make my first visit immediate. Needless to say, I was 5-star impressed.My visit to India Sizzling (II) came on a Saturday night.  I was politely greeted and shown immediately to my seat.  On the weekends, the restaurant does not offer their main menu, but has a full dinner buffet.  I had hoped to actually order off of the menu--as I like to make sure that my food has adequate spice.  From my experience, much of the Indian food in the United States has considerably less spice than its authentic counterparts (especially when buffets are concerned).  If one truly wishes to experience Indian food, then he should experience it properly.  Kinda-sorta doesn't cut it for me--it's like buying a Harley-Davidson Sportster.  Yes, it's a Harley; yes, it's wimpy.  To my surprise, the food on the buffet at India Sizzling had a nice, spicy kick to it.  In the end, I was glad to have been able to sample various items on the menu.The buffet at India Sizzling far exceeds those of other area Indian restaurants.  It is much larger, the food is better prepared, and as already stated, is spicier.  They offer a full selection of meat dishes, and they serve plenty of vegetarian options.  As I was in the mood for meat, I meandered through the various chicken and goat curries.  India Sizzling also had a large selection of Chaat, with the Pani Puri being my favorite.  Even though I was completely stuffed, I saved room for the many dessert samplings.  The restaurant staff was extremely friendly, and the service was impeccable.  If the service was this outstanding during buffet hours, I can only imagine what it must be like when they are only serving from the menu. I was further delighted to have been greeted by the general manager, who was able to give valuable information regarding the foods that his establishment served.India Sizzling will establish your tongue in Nirvana.  The only thing left to worry about is your soul."], ["Andrea J.", "Hands down the most authentic Indian in Indy. The buffet come with the option of fresh roti or dosa. This is a south based Indian restaurant so the food is spicy! Brace yourself. The mutton and the tandoori were pretty good and the biryani was scrumptious. Also found here are some off beat things like eggplant , lemon rice, chaat. The place is no frills , eat and leave. Has a full service bar tho all I had was chilled beer. Definitely will be frequenting this place more."], ["Jay S.", "Nothing sizzling about India Sizzling II. A bored and indifferent waiter gestured where we were to sit. There was a large sign stating that they would serve \"Palappams, Dosas, and Naans upon request\". We ordered 2 Palappams and 2 Dosas. After 15 minutes, the waiter shuffles out and says that there were no Palappams. So we ordered 2 more Dosas. The Dosas came cold and limp. The potato filling was tasteless. We couldn't finish it, so we concentrated on the buffet. The first dish was the Vegetable Machurian, their sole Indo-Chinese offering. It was fried, retried, and rerefried, and it was jaw-breaking hard to the point that I thought I was chewing on a bone. Next to it was an eggplant dish swimming in oil. It tasted of...oil. No salt, no spices, no taste. There was a large closed container with a description of its contents - garlic naan and butter naan. When I opened it, it was empty. They had run out of naans as well. My daughter asked for a mango lassi (they were out ), pop (they were out).They were out of samosas as well. The chaat that they brag about was a too sweet-too salty over cooked fruit chaat, totally inedible. Finally, after a below average meal, I went up to pay. It cost above $50. I had an online coupon for $5 off $30 fare. The bored manager said that they needed a paper coupon, so they refused it. Not coming back. Ever. This was Sunday lunch at around 12 noon. If they can't feed the masses on a Sunday, imagine what kind of fare they'd have on a weekday lunch. Bleeh."], ["Iftiar C.", "Best Indian food in the city. I am actually Bengali and our cuisine is similar to Indian food but usually spicer, more meat based, and the sauce tends to be thinner as it's water based (instead of cream/milk) and we don't really utilize ghee. This place warms my stomach and thus my heart in that way. They stay true to the dishes, not dousing every Buffett dish with cream to quickly fill patrons up. The Buffett is diverse and expansive with an aloo chaat, pani puri section. Each dish is treated well, cooked well with a delectable spice combination. The buffet is also kept fairly fresh. The workers are attentive but allow you space to enjoy your meal in peace. Also when your done eating and decide to make some Indian food yourself, just hop over next door to Patel Brothers. Great place to eat Indian food, I wouldn't recommend any other place in the city."], ["Michelle Q.", "Lunch buffet is quiet and clean. The dishes aren't as varied as a few others around town but the lack of variety is made up for by the quality and uniqueness of the dishes. While I miss the Saag Paneer it was off set by the option of different rice dishes. The coconut rice was delicious. A dish I can see ordering again on its own. Hard to find as it is located 'behind' the front set of strip mall shops if you turn in early."], ["Claude A.", "I walked in based on the other reviews.  Place was dead quiet. Noone there.   The carpet was very dirty.  I figured if the carpet looks like this and there is Noone even there, how does the kitchen look?  So I left.  Maybe it is a good restaurant but they certainly should clean especially when they have nothing else to do. Then went directly across the street.  That place was busy!   Wonder why!"], ["Paul P.", "I have been thinking about trying their dinner weekend buffet for so long and I did finally. Firstly it wasn't crowded as I expected for xmas weekend. Veggie Manchurian was very hard, didn't like it, pakoras were good. Then I tried some Panner masala, it was just ok. Then I tried some Navratan Korma, it taste good. Garlic naan were awesome. Also they bring fresh Masala Dosa to your table as well. That was good too. Gulabjamun was too sweet that I could not finish.  I guess when you order from menu, that's when you get their best food. I guess my expectation was too high from the experience I had  last time. I am only going to try from menu now as buffets are just ok."], ["Sowmya R.", "The ambience is neat and clean. Food is tasty and delicious.. Plenty of options for both vegetarian and non-vegetarian... I highly recommend this restaurant!!! - Sowmii"]], "Village Restaurant": [["Naser A.", "Alright, I finally found a place I can trust when it comes to quality! And quantity!I went there for dinner with my friendsLocation: somehow shaddySeating: plenty of seats (and it is not too stuffy like the other Indian resturants in town)Food: 5 stars! Chicken tastes like chicken, and lamb it is actually meat, not a piece of rubber you are chewing onPrice: Affordable Recommendation: lamb biryani, chicken tikka masala, goat kormah, and make sure to start up with a beef samosa"], ["Mahrukh K.", "Really good Pakistani food! The meat dishes are fresh and flavorful and cooked perfectly. Nothing is bland or too salty. The naan is always warm and soft. Their mango lassi is my favorite drink. We went for their Iftar/dinner buffet and it was really good. Their goat karahi is soo good. Their pakoras are very good also. I wish they had more desserts and that it wasn't in the middle of nowhere."], ["Marvi B.", "4 stars because this is the only Pakistani restaurant in Indianapolis. Most of my friends don't know the difference between Indian and Pakistani cuisine so here's a bit about that. Pakistani cuisine is more meat based so this place serves very authentic tasting recipes like haleem, nihari and karahi. They prepare fresh Food unlike using a pre prepared Masala for everything. I do like everything here but I'm avoid being regular here because of the excessive oil in everything. The place seems to be in the middle of nowhere but is clean inside. I would recommend everyone to try beef nihari,  chicken karahi and matka gosht here. They truly are good and very close to any restaurant back in Pakistan. The price is reasonable, I actually got food for three for less than $30. They are good for take out as well, usually prepare your food in 30 minutes. I had the buffet, I'm not a big fan of buffets to begin with. It was average."], ["Lee S.", "The Village has a full menu as well as a buffet on weekends.  Opting for the buffet, my dining partner and I tried many things.  He's a vegetarian so enjoyed the non meat items which comprised fully half of the selections.  I had many of these same options as well as sampling the meats in flavorful sauces.  3 choices of rice from plain to mixed with veggies and browned to mixed with chicken.  Every one was very good.  I especially liked the goat pot roast (or stew) which was tender and flavorful - not strong tasting.   The goat liver was diced pieces of well cooked and strong tasting organ meat. Unique and good, not great, though I did have a second small helping.  The various chicken mixes ranged from 'okay' to 'pretty darned good'.  I would have liked more spicy heat, but didn't ask for options, so I'll own that responsibility.  We both had hot tea which was served with cream.  Many choices but a bit steep for lunch ($17.50 each including tip). It's better than a '3' but probably not quite a '4'."], ["Geetika B.", "I wish I had an option to give something even less den a Single star... Ahh !! We 2 couples with a 4 yr kid, walked in to this place on Friday Evening which was completely ruined by the quality of food served, Services...We entered and were attended after a long wait.. To Start with we ordered 1 appetizer with 3 soft drinks and placed Main course menu also so as to avoid long wait for attention.. To our surprise we were told we will be served appetizers along with main course only ... WHO IN THE WORLD DOES THAT !! Give me a break !! We had to literally request this person to at least bring appetizer 10 mins before main course. .. After a long 30 mins wait we were given chicken appetizer when asked for such delay we gt a rude response saying \"It takes time you guys have to wait.. we dont keep stuff ready for you all the time\".I wish I was served amazing food after such a wait but to my horror my Knife and fork literally had to struggle to cut boneless chicken piece !!! WORST PREPARATION .... On several reminders we were given 3 Soft Drinks with just 2 DISPOSABLE GLASSES !!! Grrrr !! Finally we were served main course.. we had specially requested Butter Chicken to be mild ..very mild as we had kid with us ..but I guess we expected WAY TOO MUCH ... !!!The person attending us didn't even have the courtesy to inform us about kitchen closure or ask for last bread orders... !!! HORRIBLE EXPERIENCE.. !! BAD FOOD !!! WORST MANAGEMENT !!!"], ["A S.", "I wish I could give half a star. We were in the area for dinner at a different restaurant that unbeknownst to us closed so we ended up stopping in for dinner here. The only good thing about the place was the smell initially walking in. After that it was just downhill. The wait staff were awkward and horrible. We did not want the buffet and opted to order off the menu instead, which they found weird for some reason. So we ordered a couple dishes, one of our favorites when we dine Indian and a new dish we hadn't tried before. First off, when our appetizer came we had to walk up and get our own silverware and napkins. Then we had to continuously ask for water refills. When our dishes came out, they were surprised when we asked where our rice was (since when does rice not come with a dish at an Indian restaurant!) The best (read: worst) part was in the middle of the meal when two men walking through the front door were carrying freshly slaughtered goats right through the dining area! Give me a break!All in all we would probably hesitate to even eat here again if the food was free. The food was not good. It was over salted and bland, the service was worse and the dead goats being walked through the dining room were the last straw. Stay away from this place. CB and RC"], ["Nirmal Kumar K.", "One of my friend came to my place after a long time. We all went to this place again for a lunch buffet. Again, their food had the same quality, no difference in the taste. Briyani is my favorite here... Keep it up VILLAGE RESTAURANT"], ["Bebo A.", "Food is zabiha halal. My husband and I travel a lot so we are often disappointed after trying places that have such high reviews. However, this place did meet their high reviews. We ordered chicken biryani, chicken karayi, garlic naan, regular naan, mango lassi and mango juice. Total was $30. Besides mango juice, everything was really tasty and would highly recommend this place to anyone. Quantity was good as well. Do try it out!"], ["Marcia S.", "I loved it!The food was very well prepared, seasoned to perfection and served promptly. The server was very nice and attentive, he made sure we were satisfied with our food.I am definitely going back there again."], ["Brittany L.", "Food was really really good. Ambiance was very lacking. It looks like they're in the middle of a remodel, and there are booths and chairs shoved together and stacked up, no art on the walls. There is a fast-food style trash can in the dining room, but the restaurant was clean. If you like Indian food, you should enjoy this restaurant. The food of Pakistan is not all that different from the food of India, but with the addition of beef. We went for a dinner buffet which had:Spinach pakora, chili pakora (both deep-fried appetizers), baigan bartha (eggplant in brown sauce), palak paneer (creamed spinach with cubes of firm cheese), chana masala (chickpeas in sauce), and gobi manchurian (spicy breaded cauliflower) for vegetarian options. Lamb or goat biryani (seasoned rice with meat), tender delicious beef in spicy sauce, goat in sauce, lamb in sauce, and very spicy chili chicken for carnivores. Naan flat bread was available as well as gulab jamun (pastry-cheese balls in honey syrup) for dessert, and raita (yogurt sauce) along with tamarind or mint chutney. My favorites were the beef dish and the palak paneer. The mint chutney was especially good. Everything was hot, fresh, and yummy. I had to talk myself out of going back to get a 2nd heaping plate of food. There are also kebabs on the menu, which I would like to return to try. They sell Thumbs-Up Cola...make sure to get a straw because (I was told by an Indian friend) they are very \"authentic\". The bottles have dirt and rust around where the cap was. He said \"Just like my childhood in India!\" A note about finding this place: it's almost impossible your first time! You'll turn off Georgetown Rd. onto Century Plaza (which is the road between Georgetown Market and IU Health building)...drive back, pass through the \"woods\"...have faith...and you will go around a bend and see a small strip mall which has several restaurants and a church in it on your left."], ["Sonya A.", "Darn I wanted to love it. But the food was standard, the service was completely lacking and the place was completely deserted. Dining out is not just about the food. It's mostly about the food but convenience and ambiance and service does play apart in it and this place was lacking. But maybe you'll have better just just taking it to go? The food was flavorful and the biriyani was more on the authentic side than most Americanized Indian places.Food: 4/5Service: 1/5Location: 1/5"], ["Salim P.", "Great tasting food, service could be better. Good variety on the Buffet, I would prefer the bread brought to the table versus in a pan on the buffet"], ["Abdulrahman A.", "The buffet is not bad and not expensive. You will have lots of selections. The place isn't that fancy but ok. The food is always fresh."], ["Maaz B.", "Try the Sunday lunch buffet. Best thing ever! Also, this is your go-to place for all your halal meats as well."], ["Corrine P.", "The food is pretty good. This place is hidden behind Lafayette Square Mall. It's a bit hard to find. I had the buffet which had a nice selection. My favorite was the dish that had chickpeas in it. I have no idea what it was but that dish went fast! I thought that the buffet was a bit pricey. It's was about $15 total including drinks."], ["Princess R.", "I was shocked we were the only customers  for dinner buffet.The  food was delicious fresh and hot just the way i like my food.  Their location is bad  it is hidden i guess people don't know about it."], ["jessica g.", "i can't believe we were the only customers  for the 1.5 almost 2 hour span of our lunch! the ambiance is nice, comfortable, and gives a diner the sense that the decor is traditional. we requested the floor seating and were granted our request promptly. its not especially fancy; the space is large and not cramped.the food was delicious--it was fresh, hot, flavorful and tasted homemade. we had the chicken seekh kebob and the lamb biryani and it was awesome. we loved the mint chutney that came with the samosas.  (if i were more of a foodie i would be able to go into detail about the spices and why it was so delicious--alas, i am not.)all this being said, the service and experience was completely different each of the two times we visited. the first time was exceptional. on the second visit, we were greeted with, \"yes?\" and dirty tables. not sure where the inconsistencies come from, but they certainly exist. the main reason we were excited about this restaurant is for its halal meat and initially for the service, but we are unsure if we will return due to the previously mentioned inconsistencies and curtness of our last experience."], ["Wasim F.", "This restaurant is own by new owner now, it seems like they are trying make the place look good and the food quality has improved a lot, I ordered chicken biryani, it was delicious and aromatic the portion was bigger than other places."], ["Wendy S.", "I wish I could give an incomplete score here, but I had to put a rating, so this is for \"they didn't feed me, boo.\"I stopped in here on a spur of the moment, heading for India Palace for my usual Sunday Indian buffet postmortem. (some people brunch, I get down with the tikka masala.) There used to be an ice-cream shop I adored in this plaza (moment of silence for Strawberry Hill!) so I zoomed back here for nostalgia for my 80's childhood, when Lafayette Square was still a mall that people shopped at. I noticed the restaurant and saw lots of cars in the lot and (I thought) it was the only business open, and the sign outside advertised a Sunday buffet that seemed reasonably priced, so I got happy and jumped out my car. The door was open, but there wasn't a soul to be seen once I got inside. Two men wandered in from the back, and seemed annoyed that I was there. The promised buffet wasn't opened, but looked to be one steam table of maybe 4 selections. Once I asked about eating, one of the guys finally gestured for me to take a seat and handed me a photocopied menu. I'm not a menu snob, because some of the best food I've eaten has come from the strangest places ever, but it seemed like he skipped over an actual menu. I thumbed through it, looking for some Pakistani food, but it seemed to be standard Indian fare. I settled on veggie samosas, chicken tikka masala and a mango lassi, and after the man finally took my order, told me he didn't have samosas or any lassi. I started to get up and he said, \"I can fix the tikka masala!\" Understandable, but everyone knows that samosas cure all ailments. I bid them farewell and went back to my car, and noticed that the daycare at the end of the strip mall was open 24/7, and that most of the cars probably belonged to their staff. Hey, the food could've been rocking here, but I guess I'll have to come back to find out. Not saying you can't ever be out of stock on items, but I'd still like to know what happened to the Pakistani food if apparently not all the Indian menu items were available."], ["Abe M.", "We went to the Iftar buffet last night only to be waiting for another 15 minutes in line to grab something to eat which by the time had already finished since they only put food out for 5 people when there were about 30 in line. They took forever to refill the small bowls that had food since the actual Food Warmers were being used for a party next door. They had only about 5 dishes for the buffet including the appetizer which was a hard piece of rock that they called \"pakora\". The dessert which was a couple of pieces of gulab jamuns was being put out at 9:45pm (closing time 10pm) after people started paying and walking out. We even had to ask for water twice since they didn't keep enough out. It was a disaster and I will never return again."]], "Amber Indian Restaurant": [["Ashlee A.", "This. Is. My. Place. Let me say that first and foremost. Since starting a new job in June, I've probably been here a minimum of twice a month for lunch, though it's likely more than that. The staff are friendly, the restaurant is clean, and their food is fantastic. I really enjoy the chicken tikka masala, and their garlic naan is out of this world--easily the best I've ever had. My boyfriend is a little less enthusiastic about the lunch buffet, but enjoys their dinner menu. However, he does concede the tidbit about their naan. Speaking of dinner, there have been a few times we've eaten in here, as well as takeout, since Amber has the privilege of being the closest Indian restaurant to our house. Our last time ordering dinner takeout, we went to pick up our food and went along our way. Halfway home, we received a call that they'd given us the wrong order and asked us to come back. Upon return, they gave us our food, a complimentary dessert, and ten dollars of our ($35) order back. We kindly refused the money, but were astounded at the gesture. These guys really mean to make loyal customers, and they've certainly done so with me."], ["Ayham H.", "I'm updating my review as I recently faced the same elderly man in my lunch visit. I visited the place with a friend, my friend has never been here and I invited him over to Amber restaurant to try the place out. We arrived at 2:30 and we were done eating at 3:00. The food was good but an awful service by the elderly man, I need to ask for his name...When I say that we were done eating at 3:00 PM, we stayed a little to chit chat. We are used to sit for few minutes, have some conversations after a meal. I hope this is not a crime, many people are used to do that! People go to restaurants as a social event, not just to eat. At 3:10 PM, we were literally yelled at by that elderly worker to leave as the lunch hours in the restaurant end at 3 PM !!If your lunch hours end at 3pm, then what happens to a customer that enters and starts the lunch at 2:55pm?Do you kick him out after 5 minutes? Do you have a time limit for each customer?My friend had a surprised face with wide open mouth and I told him that this normal here in this restaurant: awful customer service."], ["Allie W.", "My fiancé and I decided to have Amber Indian at the last minute tonight. It was not only a nice and tidy restaurant, but the service was superb as well. Timely, professional and extremely polite. The waiter asked us if we were ready for our dinner as we finished the appetizer which was a nice touch to the service. Our glasses were never empty and the staff was very attentive. The food was phenomenal also! We had the chicken curry, garlic naan, and onion pakora. All items were delicious! We will definitely be back!"], ["Brett H.", "Placed a carry out order today for my wife to pick up.  She came home with the wrong order.  I called to let them know and I was told that the problem was that my wife had picked up the wrong order.  I guess there were two orders with the same name.  Not once did the person on the phone say sorry or apologize.  Somehow this was our fault that we got the wrong order.  I miss Taj of India...."], ["Anna L.", "I'm glad the creators of Amber decided to make an Amber II sequel. While it may not be as spectacular as the original with smaller buffet options, the prime location saves us a 20 minute drive to the messed up Carmel construction projects further up north. While this place may be less busy, I find that the food is fresher and service is friendlier here. They actually had cool bowls for the ice cold tropical fruit dessert in mango puree. That was from our first buffet visit. This time, we actually stopped in to grab an order of goat biryani for a night in. I didn't feel like chicken or lamb, since we were having lamb the next day. The cashier/waiter even struck up some chit-chat on how we were going to prepare the lamb. Ten minutes later, the order was ready. $17 and some change, it was more than enough for 2. Took it home, opened it up - ta da - a mountain of golden spiced basmati mixed with peppers, cashews, cloves, and bone-in goat chunks. A wedge of lemon and side of yogurt sauce included really helped to cool down the hotness.I think I\"ll come to the Castleton location for the time being while Carmel sorts out their 8-abouts and detours. Took us awhile to even find a way into Amber I the last time we went."], ["Robert C.", "A friend and I went here for dinner. The food was Awesome. I had the Aloo Gobi and they had a slight twist on my favorite dish. They had sautéed the onions before adding them to the rest of the vegetables. It added a slightly sweet taste that brought out many of the other flavors. The only down side to the restaurant and I am not sure if they were just so intent on providing god service or what but, they cleared each plate almost before we were done with them . In fact, they tried to take my friends plate before he was done eating. The check was delivered immediately and my card ran in  a matter of seconds. We then felt \"Should we leave or are we able to sit and relax?\"I wouldn't let that overshadow the great taste in the food."], ["Amy K.", "We popped in off the highway looking for a quick vegetarian meal. The caraway in the Baignan Bartha was so good, the aloo gobi was tasty, and the garlic naan blew us away. Fast and easy with nice service and a smile. $32 including the tip!"], ["Aaron D.", "This was my first time visiting Amber Indian.  I absolutely love Indian food and really enjoyed my meal here.  I ordered Paneer Tikka Masala and would easily recommend it to anyone who's interested in a vegetarian dish, or someone who just plain loves paneer (like myself!).  Also, I must say, their Garlic Naan is pretty darn good too.The service was awesome.  I went with a group of friends and the staff was extremely attentive and very friendly to everyone.  I would recommend Amber Indian to anyone who loves Indian food.  I will definitely be returning!"], ["Mi Sook K.", "Solid lunch buffet. First time venturing to the smaller Castleton location, so I was pleasantly surprised that the food quality and service was just as good as the original Carmel location. There did appear to be fewer options than what I recall, but there are still plenty to choose from. My go-to is chicken tikka masala so I tend to stick with eating mostly this, and sampling the other options. Chicken was moist and sauce delicious. I'm hungry just thinking about it. All the dishes I tried were fairly mild (typical for buffer), so if you prefer spicy like I do, adjust the heat level with the red chili pepper sauce and raw jalapeno slices. Also, can't go wrong with the garlic naan! Fresh, crispy, and not too garlicky.Appreciated the attentive staff for keeping my glass full. I felt like I was drinking water by the gallon that day."], ["Amber E.", "The reason I fell in love with Indian food.I had tried Indian food in the past but wasn't thrilled. I didn't see what all the fuss was about. Now I know. I ordered the chicken tika masala as suggested by my (Indian) co-worker. OMG! Flavor explosion! Amazing. Even thinking about the chicken tika masala nestled in a warm soft and crusty piece of naan bread makes me salivate as I write this review. If Amber Indian wasn't such a drive for me I would probably eat there every week. I gave them 4 stars because I didn't care for the dry...whatever it is that is brought to the table at the beginning of the meal. I wish I knew what it was called but even checking the menu now I don't see it. It's like a dry flavorless wafer tortilla thing with 3 sauces... Spectacular food, service, and atmosphere.EDIT: I came back to my review and changed my original 4 stars to 5. After consideration I felt it wasn't fair of me to take a star off for the FREE appetizer. Amber Indian deserves 5 stars."], ["Bill Y.", "My wife and I were looking to try something different from the usual neighborhood pub, and we decided to give Amber Indian a try. Boy, am I glad we did! We normally don't eat Indian cuisine, so it seemed somewhat exotic to our Hoosier palates. This strip-mall restaurant across the street from Castleton Square Mall has been there as long as I can remember. I don't know why we never tried it before. It wasn't at all busy for a Saturday night, so no waiting. The staff (one of which was presumably the owner) was quick, attentive, and very courteous.The meal started with papadum and chutney, a nice way to start and whet our appetites. For our entrees, I had the Chicken Korma, chicken cubes in a buttery cream sauce with almonds, and my wife had the lamb Seekh Kabab. Both dishes were very flavorful. We ordered them medium spicy, and they had just the right amount of heat. My dish came with basmati rice, and both of our dishes came with naan, a grilled flatbread.The portions were just the right size for us to share with each other, and we were both spooning some of the creamy Korma sauce onto our rice and sopping it up with our naan. It was quite filling, so much so that we did not try any of the desserts. Rest assured, when we make a return visit, we will leave room.The great thing (for me, at least) is that their second location is in Carmel, just a three minute drive from my office. If they offer a lunch buffet, I will have to check it out."], ["Jenni K.", "Excellent food! Excellent service! Clean facility. Chicken tikka masala was absolutely delicious! Rogan josh was amazing as well. Well worth the price."], ["Laura T.", "This was my second time visiting and it was just as delicious! We ordered the veggie Samosas and they were great! The sauces you get with them are very delicious...especially the red pepper one. My main dish was Chana Masala and my boyfriend asked about Tarka Daal, it wasn't on the menu but they were able to make it! The server was knowledgeable and accommodating. We also shared a Mango Lassi...highly recommend!I read reviewers said the portions were too small but we each had an entire meal as leftovers. The naan was tasty but had a little too much butter on it. Next time I think I will order it without butter. I can't wait to try their lunch buffet!"], ["Trena T.", "A-OK. Exactly.I've been here for the lunch buffet. I've had better and worse, but it's fine.I've been here for dinner. I've had better and worse, but it's fine. Their mattar paneer (my most common order) is good, but it's kind of hard to mess up peas and cheese. *Don't let my sophisticated palate intimidate you. I'm mostly a child.*It's never going to measure up to Spice Nation, okay? But, then again, nothing is. It's a decent option if you're in the Castleton area."], ["Mike F.", "I am a man of many pleasures, and one of which is Indian food.  In fact, there's nothing that gets me more gastronomically excited than seeing a big plate of chicken tikka masala or lamb vindaloo, complete with basmati rice, dosa, and naan, sitting right before my eyes.  Amber Indian is often regarded as being among the best Indian restaurants in Indianapolis.I've dined at Amber Indian several times, both on a dine-in and takeout basis.  Each time, I've ordered something different, and have had the opportunity to sample a large portion of their menu.  Their naan is just naan; their chicken tikka masala is just chicken tikka masala; their lamb vindaloo is pretty good, but if I were a wayfaring traveler, I wouldn't write home about it.   The mixed grill, however, is truly great. Amber Indian's onion chutney, on the other hand,  is fairly awful.  If you're craving a great heart-attack-on-a-plate appetizer, look no further than the onion pakora.I've never had a negative experience with Amber Indian's service.  Actually, their takeout service is great, with food being freshly prepared and still hot when you pick up the order.  Amber Indian's prices are commensurate with other area Indian restaurants.If I ask someone in Indianapolis if he or she likes Indian food, the typical reply is, \"Oh yeah!  Have you tried Amber Indian?\"  I usually retort, \"Yeah, it's perfectly fine, but I don't understand the hype.\""], ["K B.", "My son and his wife treated my wife and I for a birthday treat. We love Indian food and have eaten at many fine restaurants throughout the world. Amber is certainly up there with other fine eating establishments. The food and service was top notch. We all had different dishes, all were delicious. The serving of poppadum's on being seated and the inclusion of naan bread with the main courses made for a very satisfying eating experience. We certainly will be back."], ["Clara K.", "Curry is one of those difficult dishes to perfect. Amber Indian makes authentic delicious tasting dishes. We've tried the tikka masala ( my absolute favorite and in the picture) we've tried chicken curry, and the lentil one, I forgot the name for that one but they were all so good. The naan is perfectly fluffy and buttery. It's crispy where it needs to be and soft and fluffy too. If you need Indian food this is the place to go. Also, the staff is so nice and friendly! Love this place!"], ["Kyle B.", "Food here is great! There's always a good selection to choose from and the flavoring is spot on. I'm a big fan of the made-to-order naan bread as well. You won't find it in some of the other Indian buffet chains in town. Cashier was very friendly as well."], ["Gregg M.", "The wife and I took my mom out shopping on a Friday afternoon.  It was lunchtime and we were hungry.  After consulting our handy dandy Yelp app, Amber Indian Restaurant looked to be our best bet since it had received good reviews, we love Indian food, it offered an AYCE lunch buffet, and it was nearby.  From its exterior, Amber Indian Restaurant wasn't much to look at, occupying a spot in an unremarkable strip mall.  Its interior was similarly no-frills, just square tables with chairs arranged in an orderly fashion around the small dining and the buffet line against wall.  However, I'm not one to judge a restaurant by its appearance; it's the food that comes out of the kitchen that matters.Amber was already fairly busy when we arrived a little before noon, but we were seated immediately.  Our server took our drink order (waters all around) and asked what kind of naan we'd like (garlic, of course!).  To my taste, the naan was pleasantly garlicky, but could've used a few more minutes in the oven.  It was Amber's lunch buffet was comparable in size and selection to others I've had.  It had the requisite selection of chutneys and raita.  While flavorful, I found the mint chutney and raita to be too thin and watery.  As for the hot dishes, the standard offerings such as pakora, rice, palak paneer, tandoori chicken, chicken curry, and daal makhani were found.  There was plenty to satisfy both meat eaters and vegetarians.  All of the dishes seemed freshly prepared, a positive sign that there was good turnover of food on the line, and possessed bold Indian spices and flavors that didn't seem \"dumbed down\" for non-Indian palates.   The only mildly disappointing dish was the daal.  While the flavor was good, it, seemed a bit thin and soupy from what I expected.  One dish stood out in my mind, the Goat Vindaloo.  This was a first for me to see goat on an Indian buffet...and I loved it!  I'm a big fan of vindaloo and I appreciated Amber for putting some tender flavorful goat on the line.  Service throughout our meal was solid.  Water glasses were kept full, fresh naan was brought out quickly upon request, and dirty plates were removed quickly.Amber Indian Restaurant and its lunch buffet was a very pleasant surprise, especially in terms of price and value received.  After tax, before tip, it worked out to roughly $9/person for its solid AYCE buffet.  We definitely left satisfied."], ["Anthony T.", "Exactly what I was looking for.  I recently moved to Indianapolis from Salt Lake City and have been dying to find an Indian restaurant to satisfy my Indian food cravings.  This place hit the spot.  Stellar service, amazing food, and casual atmosphere.  Didn't have to wait too long for our food and you could tell that the staff keeps customer experience/service at the forefront of their minds at all times.  We had the garlic naan, tikka masala, chicken vindaloo, and chicken korma.  All were magnificent!  I will definitely be going back again soon."], ["Liz S.", "This place is deeeeeelicious!! And I went for the Sunday lunch buffet!! Love a place that doesn't overcharge me for my foreign food indulgence on weekends!You walk in, and you are just hit with the lovely smells and approached with your choice of fresh garlic or plain naan--GO FOR THE GARLIC!They had a delectable potato dish, but I'm weak for anything with potatos and turmeric. You can never go wrong with the Chicken Tikka Masala, Tandoori Chicken and oh yes their OH-SO-TENDER goat curry--yum!!!Desserts: LOVE the mango custard. At most other locations, it's just a pudding, and it's rather thin and plain. Their mango custard is super thick and rich, it puts other mango desserts at the other Indian restaurants to shame, I believe!But the ultimate factor of not getting 5 stars (I honestly would deduct only a half a star, but we don't half-star anything around here on Yelp!) is the Gulab Jamun. Very soggy, very plain. Just very disappointed, for such a great show during the meal!"], ["Raj P.", "Typical Indian restaurant with bad service.I walked out as they were unwilling to seat me at decent table when more than half of restaurant was empty."], ["Grant I.", "We have been going to this location for a few years. Not sure if there are different owners now, but the lamb saag is not as good as it use to be.  Lintel soup is still good, but will be looking for a new lamb saag somewhere else."], ["Brian K.", "Awesome flavors on all dishes on the buffet. Vegi cutlets were awesome, chicken karahi great, chicken curry fantastic. I would come back again."], ["Gyamfua G.", "The family and I came here for dinner the night before the Armageddon of snow!! We started with the fried cheese which was ok..tasted better with the sauces. Then we ordered shrimp curry and goat kahari both medium and garlic naan. The garlic naan was awesome!! The shrimp curry was good but the shrimp was small...and in a small bowl. The goat was tender and flavorful. Definitely worth going again..."], ["Kevin A.", "I wish I could give it more stars than 5.There is no way a review could state how incredible this place is.  An absolute all around incredible Indian experience.  The chicken tika masala was one of the best dishes I have ever had.  I ordered it \"as hot as you can make it\" and it was superb.Stop reading the reviews and head on in there...you will not be disappointed."], ["Chaney I.", "I came here for the lunch buffet and it was excellent! There was a nice variety of dishes and I personally loved the butter chicken and the Punjabi curry. The naan was excellent also- always a plus! I'd definitely recommend checking it out."], ["Remy R.", "Been coming here for years, food is great but the greatest compliment is their amazing staff! Highly recommend this wonderful restaurant!!!"], ["Deirdre G.", "I typically come in on Fridays for their Lunch buffet. I'm also a big fan of the garlic naan. I only wish they'd change up what they had in their buffet (or perhaps I've only been going when Friday's platters are out?). Regardless, fantastic Indian food for those on a budget."], ["Tyler R.", "Phenomenal!! The lunch buffet is outstanding!The decor is classy and clean. I fully expected a sort of Golden Corral experience but this blew it out of the water in every way."], ["Dano B.", "We came on a Friday night. I had the Lamb Kahari and it was awesome! I will definitely come back."], ["Phi N.", "This buffet receives a 4 star from me based off the buttered chicken and garlic naan alone... all the other items were probably 3 star, but those first two items would have me coming back... if I didn't live in Maryland, haha. There was another type of chicken that was pretty good, but I don't remember the name now. Sorry. The lamb, chick peas, potatoes, and other vegetables were just okay. Didn't try any of the sweets."], ["Katie Z.", "I love coming here, I just wish it was closer.  The food is always delicious and the service is great. The tikka masala, tandoori chicken, and karahi are the best, but I always find myself dreaming about the chicken makhani."], ["Azhagesan P.", "One of the good North Indian restaurantsProsChilli chicken, channa batura and onion pakora are good. Tomato soup is awesome. This is the first spicy soup I had in years. The ambience is really good and the waiters are very nice. There is next to no crowd, so the service was really really fast.ConsGoat biriyani tasted like tomato rice and don't ask me about the Indian masala tea."], ["Paul P.", "I tried this place yesterday for lunch buffet. I try some vegetable pakorars, they were good. Then I try some vegetarian curries, I like both korma and saag. Fresh garlic naans were great too. Then at the end I enjoyed gulab jamun as well. Overall good place for lunch."], ["Robin L.", "I've been here twice in the past 2 months and my experiences have varied greatly. The first visit was stellar! Nice service and friendly staff. The chicken tikka was delish and the chicken vindaloo was fantastic! Both were ordered medium and easily palatable. The second visit was not particularly friendly. We ordered the chicken vindaloo again since it was so good the first time. I'm not sure what I wa served but it was not vindaloo. I felt rather taken advantage of, as if I wasn't going to notice? The lamb kabob, ordered medium, was so spicy we couldn't eat it--at all. It was a huge disappointment compared to the first visit. I'll give it one more try to decide if my bad experience was a fluke."], ["Sonam K.", "Food didn't have salt. Very bland. Naan was good but dal chicken was bad. Bhindi veggies were OK. Waste of money"], ["Rob M.", "Great Northern Indian cuisine. They also offer Southern Indian dishes. Good choice for vegans and vegetarians. Voted best in Indy and I'd have to agree."], ["Suzie T.", "-had lunch w/D here yesterday.  They open at 11:00 & we went at 11:30 to see what was fresh on the buffet.  This is an off-shoot of one of my fav. Indian restaurants with the same name located on Meridian St in Carmel.We had a delightful lunch, but of course I'm going to critque.  I think their lunch buffet is quite a bit smaller than Meridian Street, but not the price. (go figure)  (I'm going to call them \"lil sista' \", like I do w/Harry & Izzy's related to St. Elmos)  There is less of each, such as salads, veggie dishes & entrees.  They did have some of my fav's, such as Tika Masala, Tandoori Chic, veggie rice, Pakora (fried veggies), naan, tamarind sauce, & gulab jamun (honey balls).  The Daal Curry was missing the daal (lentils), I missed the spinach paneer, & I really missed the entree of either goat or lamb.  They had neither.  All in all we enjoyed everything and will be going back.  Location to your living quarters says alot!"], ["Melissa R.", "I was happy to see they opened right at 11am, in time for my lunch break. I just had enough time to get a  to go meal from the buffet. However, when I have more time I'd like to dine in. Tables were elegant yet casual, very comfortable. The staff was courteous and prompt with my to-go naan. Buffet was clean, and all the food looked  fresh. My lunch was very yummy! I will be back to try more food."]], "India Garden Restaurant": [], "Spice Nation": [["Rohit M.", "Good food, Great service and vegan friendly. Hope to come back here whenever we are in town!"], ["Mike F.", "Indianapolis is beginning to stand out as a city that has wonderful Indian restaurants.  Spice Nation, one of the city's newer additions, certainly serves that reputation well.  I first heard of the restaurant when they hosted a Yelp Elite event that I was not able to attend.  While I eat at Spice Nation's neighboring Indian restaurants several times per month, I simply seemed to ignore it.  Ignorance isn't always bliss.I may have subconsciously avoided Spice Nation because they do not serve meat.  I'm the quintessential omnivore.  I like meat; I like vegetables, and I especially like a mixture of the two.  Spice Nation is a vegetarian establishment with a large selection of vegan options.  I thought that I would be dissatisfied with a meatless meal; I was worried that I would be craving protein, and I figured that I would still be hungry once I finished eating.  Wrong, wrong, and wrong.  The buffet at Spice Nation is plentiful, and there was certainly no shortage of food.  My worries about not being full?  Nixed.  Sure, there isn't any meat, but there are plenty of protein-packed lentils, chickpeas, and paneer.  Another worry abrogated.  At the end of my meal, I was sinfully stuffed.Spice Nation is a buffet with an interesting twist: they change their daily offerings based on different Indian themes.  On my visit, I sampled Southern Indian dishes.  However, the night previous to my visit, the restaurant featured Indochinese cuisine.  The night following my visit was an Indian street-food theme.  With this kind of variety, one could eat at this restaurant daily--and their wallets wouldn't suffer.  Spice Nation is very reasonably priced.I adored nearly everything I tasted at Spice Nation.  However, although simple, the cabbage and mixed vegetable poriyal was my favorite.  It was light, full of taste, and quite healthy.  The channa saag was excellent and was properly spiced.  Once of my other favorite dishes was the pongal, which is a mixture of lentils and rice.  It looks like mashed potatoes, but tastes even better.  The garlic naan and the dosa that arrive freshly prepared on your table were phenomenal!  Don't be a wuss.  Order the dosa Indian hot.  When dining at Spice Nation, be sure to save room for dessert; there is plenty of it.  My personal favorites were the mohantaag and the rice kheer.  As a big fan of these desserts, I declare that Spice Nation's versions are the best that I have yet to try.The service at Spice Nation was fantastic.  We were seated immediately, and had two waiters who catered to our every need.  I was also pleased that the staff was enthusiastic about explaining the menu and the methods their chefs use in preparing the food.Well done, Spice Nation.  Very, very, very well done."], ["Prashanth R.", "Excellent food and service. Been there twice. Once for lunch and other time for dinner. Highly recommend this place for some yummy authentic indian vegetarian food. I am in Bloomington and will definitely visit the next time I go to the city."], ["Ayla W.", "I like the restaurant. It's not the best I've ever had... However it's ok. When trying to find it, it seems strange because it's a little strip mall inside."], ["Rebekah P.", "Great price for great food.  I lived in South India for a year, so eating here brought back good memories.Pros-good dosas, chat bar, and good entrees in the buffet..Cons-Idyls were a little dense and the tea was weak.  I expected sweet milky coffee from a South Indian place."], ["Brittany S.", "As I sit here thinking about the Spice Nation lunch I am about to eat in the next hour, I felt I must remind you how much I adore this place.5 Reasons that stand out today regarding my SN adoration:-coconut rice: be it on the buffet or not - order it.-unlimited chai-friendly staff-hot and fresh galub jamon-little corn fried and spiced as an appetizer (must try!)"], ["Fakke N.", "This place is the best. I had been curious about Spice Nation for a while, but had not tried it until a couple months ago because my husband thinks he can't survive without eating meat every day. My brothers vegan girlfriend came to visit, so I figured I finally had my chance. The guy asked if we were vegan and immediately brought out every vegan thing they had for my brothers lady. She was so impressed she wanted to go back before she left. The guy remembered us and brought out all the vegan food for her again. Spice Nation is now my husbands favorite restaurant!!"], ["Johnny L.", "Thanks for the directions. Its straight forward as they are at the end of the hallway on the rightOnce i got over the language issue as the waitress doesn't seem to speak much english the rest was easyA Thali platter which came with rice, 3 curries, potatoes, chana masala, and a litlle Gulab Jalum ball for dessert and your choice of naan, roti r chapata bread  $10I also had the spicy cauliflower appetizer $4A Mango lassi is a must to tame the heat $3It was a delicious meal. I would have expected the potatoes to have been more crispierService was a bit odd, as those who came after me got their Thali's before I did. After the third table got served, I was like WTF , have I been forgotten?So great food but they need to be more attentive to service.The Chef Hintin has been cooking Indian food in restaurants for over 15 years so he knows how to run a restaurant.I would look to come back to try the buffet.From what I understand this may be the only Indian vegetarian restaurant in INDY"], ["Brittany L.", "I used to go to this restaurant for lunch once a week or once every 2 weeks as it's pretty close to my office. The food was always amazing and the service was just as good. However, something has changed. I went for carryout back in...mid-October, I believe. Whenever I get Indian carry-out I order the Palak Paneer or Saag Paneer...creamy spicy spinach with cubes of cheese in it. The staff was being weird. I ordered and he said \"Palak paneer is chickpeas...are you sure that's what you want?\" Well, palak paneer is NOT chickpeas. Chickpeas are channa. He made me order my food in English \"Spinach with cheese cubes\" and then said, \"Ooooooh. I didn't think you really wanted chickpeas. Do you want naan?\" I said I didn't. \"Are you sure? Naan is bread. Everyone wants bread.\" No...I do not want bread. So weird! I brought the food back to the house, it smelled fantastic, and opened the container. What I had was unlike ANY palak/saag paneer I've ever seen:Thin dark green sauce, about the consistency of water, with about a dozen clear squares of onion floating on top. When I stirred it, the cheese cubes came up from the bottom. There was no spinach! I've eaten this dish, from this restaurant, probably close to 2 dozen times. It has never, ever looked like this. Usually I can eat it from the box, with a fork, and skip the rice if I want to. This was seriously like spicy spinach-flavored water. I was so hungry and was like SAD that I was going to be eating rice and cheese cubes without any creamy yummy spinach...and that I'd paid $10 for this! I went back to the buffet one more time after the carry-out fiasco and found the options lacking and the food not quite where it should have been temperature-wise. The chutneys were also thin and watery on this visit, the tea was out the entire time, and I never received my dosa. Hopefully these 2 experiences were anomalies and they get back on the ball soon."], ["Angie L.", "The food is great, not extraordinary but definitely great Indian.  What puts this place over the top for me?  Hands down, the best customer service I've experienced at any restaurant in Indianapolis!"], ["Andy S.", "This place is awesome. I LOVE meat and i did not miss it during this lunch.  Unlike other Indian lunch buffets I've been to, the dishes aren't \"dumbed down\" for mass consumption.  Plenty of spice, which was great.  Naan is made to order and was really good.  There's nothing better on a cold day  than sipping on some chai regretting how much I just ate :)"], ["Krista R.", "Definitely a refreshing take on Indian food for Indy, and lunch buffet with unlimited chai is a steal at $6.99. Temperature of buffet items should have been a bit hotter, spice levels for many foods could have been increased, and amount of fried items seemed exorbitant... But nonetheless we enjoyed our lunch a lot!Spice Nation specializes in South Indian vegetarian foods, mostly featuring Tamilian foods. (The cooks are from the Indian state of Tamil Nadu). Foods we sampled in the lunch buffet and also brought to table upon request included oothappam, chapatti, idly, dosa, rice, dal tadka, rasam, sambhar, eggplant curry, kidney bean and chickpea curry, vada, pickles, various chutneys, curd, mushroom manchurian, vegetable korma, bitter gourd curry, vegetable fried rice, and naan. The server said the lunch buffet changes daily. Some vegetarian items I would have loved to see included on the buffet: papads, more dosas, samosas, parotas, poori, a paneer dish or 2, a bhindi/okra curry, mango lassi. Also, I'd love to see some Indian foods from other southern regions!! Keralan vegetarian options, Goan vegetarian foods and some Chettinad vegetarian choices  would be tasty. Spice Nation you can do it!!The server told us that the Friday night dinner buffet has more South Indian foods, Saturday night they do Indo-Chinese foods (gobi and mushroom manchurian, etc), and Sunday they feature chaats (snacks) like bhel puri, panni puri, etc.Service was great - we asked if we could skip naan and get chapati instead and the server went to check. Recommend SN for those who seek vegetarian and vegan Indian food not generally found in Indy's India Garden/Shalimar type restaurants."], ["Shoshana K.", "The music selection is particularly over bearing this evening....the restaurant was 98% empty of dining in customers (some people were stopping by for carry out).  However for those of us choosing to indulge in our dinners in-house, the music was too loud and annoying.  If no one is in the restaurant, blast whatever the heck you want!  Otherwise, it would be prudent to be more sensitive to your diverse customer's ear drums and tastes in music and play something less bollywood club-o-phonic decibel pumping tunes.....The food took FOR EVER to get to our table.  There were only two other tables in the restaurant w/customers dining in while we were there so I don't know what they were doing back there in the kitchen!  Once the food came out it was delicious, freshly made, and perfect.  It seemed the items we chose had been prepared when we ordered them and not fished out of a vat of previously made food for a large buffet crowd.  Don't get me wrong - the first time we tried this place out we had their buffet (on \"indian street food night; Sunday) and it was fabulous!  So, it was comforting to taste that the dishes we picked this evening seemed to be made when we picked them and not prior....The mango lassi is great.Prices are reasonable; for two (and one of the two of us is a bottomless pit...) we ordered stuffed naan (onion), paneer tikka, and aloo gobi.  We cleaned the platters and were stuffed.  Had we ordered anything else we would have taken a doggy bag with us (not such a bad thing, but just pointing out that three items fed us plenty).  It was less than $30 w/tip - score!"], ["Lisal F.", "Oh Spice Nation, how I adore you.  This entirely vegetarian Indian restaurant is hidden away near Lafayette Square and has the BEST buffet I've ever experienced.  Indian food in general is quite vegetarian-friendly, but Spice Nation takes amazing vegetarian cuisine to a whole new level.  There is always something new and delicious and their Chai tea (which is included in the buffet price, along with unlimited naan and dosas) is to die for.  I've never felt the need to order off the menu simply because the buffet is so bountiful and delicious.Other perks:  plenty of parking, great service, and there is a lovely Indian market in the same building that sells basmati rice in bulk, spices, and a mix of other eclectic items."], ["Nessie V.", "Excellent buffet in a little cluster of subcontinental businesses in Indian-apolis.  All veg, and the vegan items are labeled as such.  I also appreciated the abundance of nonstandard dishes available, though they did have a few favorites up there.  Will go again."], ["Trena T.", "Favorite favorite favorite.This is far and away our favorite spot to grab lunch during the week.  It's tucked away in a strip mall and can easily be confused with the Indian restaurant next door.  They both have signs sitting out on the sidewalk.  It can also be confusing because you don't walk directly into the restaurant.  You go in the front door, down a hallway, past a salon (??? I've never really paid attention, but I'm pretty sure that's what is there), and almost into a small grocery store before you get to Spice Nation's entrance.The price is great (for lunch OR dinner) and the food is awesome.  It's all vegetarian, with some vegan options.  There are always a variety of spice levels, which is nice.  Different days feature different regional cuisines.  Neither my husband nor I are vegetarian, but we both LOVE this place and never walk away feeling dissatisfied.  The service here is excellent, friendly and prompt.  Make sure you get the tea while you're there."], ["David P.", "Amazing amazing. All the naan (3kinds) and dosa (like 6 kinds) you can eat with buffet. And they make fresh for your table. They ask if your vegan when you sit down. Buffet was great about 15 entrees. 4 desserts all great. Liked better than Devon street."], ["Chad B.", "As a lover of Indian food I thought I had the local go to best in Indy location until I tried Spice Nation. They have completely ruined not just other Indian restaurants but basically all dining experiences I have ever enjoyed. From the menu options to the buffet choices, you can't go wrong. They have the best samosas I have ever put in my mouth, and there have been quite a number of them in my past but from here on out I don't see any being able to compare. Even with everything being vegetarian and myself being a proud eater of animals of all types, I truly don't miss the meat at all. The staff are amazing and by far the best service I have ever had while dining out in Indy or any place for that matter. I have never had a place offer to make me something that was not being offered on the menu let alone not even take the money for such item because they just wanted to make sure they made my meal the best experience they could. Truly the creme DE LA creme of dinning experiences in the indy area."], ["Lacey U.", "Come for the lunch buffet.  It's worth it!This is probably the best Indian Food I've found in Indiana.  It's completely vegetarian which is what I usually prefer when eating Indian food.  The dishes were spiced perfectly!  I like a little bit of heat and the few of them were spiced as such but it wasn't too much that I couldn't enjoy the spices.  There were several dishes and each one was completely different than the next.  The service was great, they were prompt and kept my water glass full and the table clear of dishes.I usually shy away from buffets because the food is always sitting and gets that weird shine on the top - NOT HERE.  They were very attentive to the dishes and were kept fresh.  This is definitely worth every penny and I can't wait to go back!Check out the grocery next door as well!"], ["Little R.", "Went to this place based on the highly positive reviews-- big mistake! My husband and I love Indian food but this is the worst we have had. First of all, we asked for the menu instead of having the buffet, the owner insisted that we have the buffet--weird. We stayed despite the uncomfortable feeling. The food in the buffet is NOT FRESH at all, almost like they were about to go bad and then were made into deep dried stuff and curry. Two dishes we had (deep fried potatoes and cauliflowers) were COLD. We decided to leave immediately and go to another place. Although we barely ate anything, not to mention having any service at all, the manager charged us the full fare and automatically added a high percentage of tip. If it is an option, I would give NO STAR based on the very poor food quality, unreasonable price for this kind of food, and bad service."]]}